{"_id": "573a139cf29313caabcf714d", "awards": {"nominations": 27, "text": "Nominated for 1 Oscar. Another 4 wins & 27 nominations.", "wins": 5}, "cast": ["Brenda Blethyn", "Jane Horrocks", "Ewan McGregor", "Philip Jackson"], "countries": ["UK"], "directors": ["Mark Herman"], "fullplot": "The pathetically shy LV lives the life of a recluse listening to her late father's old records in her room and in the process driving her abusive, loud-mouthed mother, Mari Hoff, to distraction. At night, however, when her father's ghost visits, LV sings the songs of the great divas such as Judy Garland, Marilyn Monroe and Shirley Bassey. One evening LV is overheard by one of her mother's loathsome boyfriends, the disastrous dead-end talent scout Ray Say, who recognizes her innate talent and realizes this is his last big chance for the glittering prizes. Gambling everything Ray Say forces LV to appear at a local run-down, seedy night club run by Mr. Boo. As preparations for the big event proceed apace LV meets the equally shy Billy, a pigeon-racing telephone engineer and they form a tentative, gentle friendship. The big night finally arrives and everything is in readiness, the band, the club and even a big agent from London, but what about LV?", "genres": ["Comedy", "Drama", "Music"], "imdb": {"id": 147004, "rating": 7, "votes": 13430}, "languages": ["English"], "lastupdated": "2015-08-25 00:00:28.853000000", "metacritic": 68, "plot": "The pathetically shy LV lives the life of a recluse listening to her late father's old records in her room and in the process driving her abusive, loud-mouthed mother, Mari Hoff, to ...", "poster": "https://m.media-amazon.com/images/M/MV5BN2Y0YjdmODMtODNlOS00MDE0LWE0ZGUtZjRkMjMyMTU4MzhhXkEyXkFqcGdeQXVyMTA0MjU0Ng@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 912729600000, "runtime": 97, "title": "Little Voice", "tomatoes": {"critic": {"meter": 79, "numReviews": 48, "rating": 7.1}, "dvd": 931824000000, "fresh": 38, "lastUpdated": 1441046027000, "production": "Miramax", "rotten": 10, "viewer": {"meter": 75, "numReviews": 12614, "rating": 3.4}}, "type": "movie", "writers": ["Jim Cartwright (play)", "Mark Herman (screenplay)"], "year": 1998}