{"_id": "573a13bbf29313caabd53717", "awards": {"nominations": 1, "text": "4 wins & 1 nomination.", "wins": 4}, "cast": ["Joel Edgerton", "Michael Dorman", "Sebastian Gregory", "Hanna Mangan Lawrence"], "countries": ["Australia"], "directors": ["Jon Hewitt"], "fullplot": "James Tresswick and Mark Vincent are victims of a brutal bully Gary Parker who has maltreated both boys, marking their bodies and spoiling their young lives. In their last year of high school, James and Mark find a way to stop being victims. They're going to kill Gary; Wandering alone around an isolated forest - the suspected site of the disappearance of a local girl - 17 year old Mark strays upon an adult male filling in a trench. It's suspicious and tantalizing. Mark returns with his friend James and Chasley Keys and they bring shovels to exhume what will probably be rotting garbage or someone's dead pet - or so they tell themselves. They find the ghostly white body of a woman. She's a tourist - a Canadian backpacker. The \"trench\" is a grave. The \"adult male\" is her killer. And they've got him by the balls. Responding to Mark's intimations James floats an idea to seek out \"the sicko\". It'll be a bit of fun. He's confident the guy lives in their suburb; Mark saw his car parked on a trail; Mark knows what the car looks like; Mark knows what he looks like. It can be done. Chasely goes along with it. No surprise. James has done all her thinking since they started a relationship. Mark agrees because he's got a thing for Chasely and he'd like to appear a bit more like her boyfriend, but mostly Mark agrees because he carries a culpable secret. They find the car and the killer 24 hours later. He's got the same house as everyone else and a kid and a wife. Jeez, it's anticlimactic. Then, in Chasely's bedroom, as the girl cleans up the latest damage done to Mark's face by an animal called Gary Parker, James floats another idea; What if the killer were contacted and told the name of a guy that they'd like to see dropped in a hole of his own? He's their secret, isn't he? They kind of own him, don't they? If he thinks they might let him go he'd do anything, wouldn't he? What could go wrong? James, Mark and Chasley are about to cross a line of no return as serial killer Ian Wright lures the vulnerable teenagers into his violent world.", "genres": ["Crime", "Drama", "Horror"], "imdb": {"id": 902952, "rating": 5.6, "votes": 1773}, "languages": ["English"], "lastupdated": "2015-08-31 00:23:21.293000000", "plot": "Three teenagers blackmail a serial killer.", "poster": "https://m.media-amazon.com/images/M/MV5BMTU1OTYzMTk1M15BMl5BanBnXkFtZTcwOTQ4MDIxMw@@._V1_SY1000_SX677_AL_.jpg", "released": 1237939200000, "runtime": 91, "title": "Acolytes", "tomatoes": {"critic": {"meter": 75, "numReviews": 8, "rating": 6.2}, "dvd": 1248739200000, "fresh": 6, "lastUpdated": 1440959151000, "production": "IFC Midnight", "rotten": 2, "viewer": {"meter": 42, "numReviews": 709, "rating": 3}, "website": "http://www.ifcfilms.com/films/acolytes"}, "type": "movie", "writers": ["Shane Krause", "Shayne Armstrong", "Jon Hewitt", "James M. Vernon (additional writing)"], "year": 2008}