{"_id": "573a13bef29313caabd5d674", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Amber Perkins", "Rachel Quinn", "Dean Waite", "Jael Elizabeth Steinmeyer"], "countries": ["USA"], "directors": ["Michael Goi"], "fullplot": "Megan Stewart, 14, and her best friend Amy Herman, 13, though opposites in personality, are best friends. Megan carries the front of being the most popular girl in school, but this masks a lifestyle of hard partying, drugs, alcohol and indiscriminate sex. Amy, unpopular and socially awkward, clings to her relationship with Megan as a lifeline to social acceptance. Together, these two young girls forge a deep friendship based on their mutual needs. The two girls regularly communicate by web chat cameras or cell phone, and even meet boys online. As Megan seeks friends who are different from her usual posse of hanger-ons, she is introduced by a friend online to a 17 year-old boy named Josh in a chat room. Megan and Josh bond quickly, leaving Amy feeling a bit left out. One day, Megan goes to meet Josh in person, and she is never seen again. Amy launches into a concentrated effort to find her friend. As the media swirls around the story of Megan's disappearance, Amy discovers the horrifying truth about what happened to her friend. Based on research into seven actual cases of child abduction, MEGAN IS MISSING is an uncompromising, gut-wrenching view of the world children live in today. Harrowing in its realism, the film uses only fact-based incidences to depict the lives of ordinary kids walking in the midst of extraordinary evil.", "genres": ["Drama", "Horror", "Thriller"], "imdb": {"id": 1087461, "rating": 5, "votes": 5413}, "languages": ["English"], "lastupdated": "2015-09-10 17:40:57.567000000", "num_mflix_comments": 1, "plot": "Fictional drama based on actual events, about 2 teen-age girls who encounter an internet predator.", "poster": "https://m.media-amazon.com/images/M/MV5BMTU0NzYxNjIzM15BMl5BanBnXkFtZTcwOTU0NDM1Mw@@._V1_SY1000_SX677_AL_.jpg", "released": 1304208000000, "runtime": 85, "title": "Megan Is Missing", "tomatoes": {"dvd": 1304380800000, "lastUpdated": 1440099193000, "production": "STARZ MEDIA LLC.", "viewer": {"meter": 38, "numReviews": 1073, "rating": 2.7}, "website": "http://www.meganismissing.com/"}, "type": "movie", "writers": ["Michael Goi"], "year": 2011}