{"_id": "573a13b6f29313caabd47810", "awards": {"nominations": 3, "text": "3 nominations.", "wins": 0}, "cast": ["Adam Sandler", "Don Cheadle", "Jada Pinkett Smith", "Liv Tyler"], "countries": ["USA"], "directors": ["Mike Binder"], "fullplot": "Alan Johnson has everything he needs to get through life: a good job, a beautiful and loving wife, and their wonderful children. Yet he feels isolated because he finds having a hard-working job and managing a family too much to handle and has no one to talk to about it. Charlie Fineman, on the other hand, doesn't have a job or a family. He used to have both until a terrible loss, and the grief caused him to quit his job and isolate himself from everyone around him. As it turns out, Alan and Charlie were roommates in college, and a chance encounter one night rekindles the friendship they shared. But when Charlie's problems become too much to deal with, Alan is determined to help Charlie come out of his emotional abyss.", "genres": ["Drama"], "imdb": {"id": 490204, "rating": 7.5, "votes": 81023}, "languages": ["English"], "lastupdated": "2015-09-02 00:33:31.443000000", "metacritic": 61, "plot": "A man who lost his family in the September 11 attack on New York City runs into his old college roommate. Rekindling the friendship is the one thing that appears able to help the man recover from his grief.", "poster": "https://m.media-amazon.com/images/M/MV5BOTYyMTExNTgwNF5BMl5BanBnXkFtZTcwMDY4MTEzMw@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1174608000000, "runtime": 124, "title": "Reign Over Me", "tomatoes": {"boxOffice": "$19.7M", "consensus": "Reign Over Me is a charming, affecting tale of friendship and loss, with solid performances from Adam Sandler as a broken, grief-stricken man and Don Cheadle as his old friend and savior.", "critic": {"meter": 64, "numReviews": 151, "rating": 6.3}, "dvd": 1191888000000, "fresh": 96, "lastUpdated": 1442250532000, "production": "Sony Pictures", "rotten": 55, "viewer": {"meter": 81, "numReviews": 150011, "rating": 3.7}, "website": "http://www.sonypictures.com/movies/reignoverme/index.html"}, "type": "movie", "writers": ["Mike Binder"], "year": 2007}