{"_id": "573a139ff29313caabd01509", "awards": {"nominations": 3, "text": "3 nominations.", "wins": 0}, "cast": ["Kirk Cameron", "Brad Johnson", "Janaya Stephens", "Clarence Gilyard Jr."], "countries": ["Canada"], "directors": ["Vic Sarin"], "fullplot": "Rayford Steele is an airline pilot whose relationship with his wife has gone sour;he ponders having an affair with an attractive flight attendant, Hattie Durham. In the midst of a flight to London, a number of their passengers mysteriously disappear, and chaos takes hold as a number of vehicles on the ground and in the air are suddenly unmanned. Meanwhile, Buck Williams, a television journalist, is pondering the rash of sudden disappearances as he works on a report about Dr. Chaim Rosenzweig, an Israeli scientist who has devised a formula that would make any soil on earth easy to cultivate. However, Buck wonders if there's more to Rosenzweig than he first imagined when he discovers the doctor is in cahoots with two multi-millionaires who plan to broker the invention to promote their own agenda of international domination.", "genres": ["Action", "Drama", "Fantasy"], "imdb": {"id": 190524, "rating": 4.6, "votes": 7438}, "languages": ["English"], "lastupdated": "2015-08-16 00:12:24.963000000", "metacritic": 22, "num_mflix_comments": 1, "plot": "The Biblical prophecy of Armegeddon begins when the Rapture instantly takes all believers in Christ from the Earth. A reporter left behind learns that the Anti-Christ will soon take power.", "poster": "https://m.media-amazon.com/images/M/MV5BMTUwNzQ5MTg5MF5BMl5BanBnXkFtZTcwNDMwMDcyMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 981072000000, "runtime": 96, "title": "Left Behind: The Movie", "tomatoes": {"consensus": "Poor production values, slow pacing, and an implausible story makes Left Behind a movie only for the faithful.", "critic": {"meter": 16, "numReviews": 45, "rating": 3.2}, "dvd": 972950400000, "fresh": 7, "lastUpdated": 1442086854000, "production": "Cloud Ten Pictures", "rotten": 38, "viewer": {"meter": 56, "numReviews": 19882, "rating": 3.2}, "website": "http://www.leftbehind-themovie.com"}, "type": "movie", "writers": ["Alan B. McElroy", "Paul Lalonde", "Joe Goodman"], "year": 2000}