{"_id": "573a13b8f29313caabd4bd18", "awards": {"nominations": 34, "text": "Nominated for 2 Oscars. Another 21 wins & 34 nominations.", "wins": 23}, "cast": ["Ben Foster", "Jena Malone", "Eamonn Walker", "Woody Harrelson"], "countries": ["USA"], "directors": ["Oren Moverman"], "fullplot": "While on a recent deployment to Iraq, US Army Staff Sergeant Will Montgomery is injured when an improvised explosive device goes off within close proximity to him. He is back in the States recovering from the more serious of those injuries, including one to his eye and leg. He has resumed a sexual relationship with his long time girlfriend Kelly, despite the fact that she is now engaged to another man who Will knows. With the few months Will has left in his enlistment, the army assigns him to the Casualty Notification Team in his area. Not having a background in counseling, psychology or grief management, he is unsure if he is well suited to this job. He is partnered with a career soldier, Captain Tony Stone, who teaches Will the precise protocol involved in the job. Tony tells Will, who quickly learns by on the job experience, that this job has its own dangers. As Will learns to adapt to the range of emotions of the next of kin, he is unprepared for the reaction of Olivia Pitterson, whose husband was killed in Iraq. His initial encounter with Olivia leads to him wanting to get to know her better, which may not be in either her or his best interest. Despite being a recovering alcoholic, the more experienced Tony tries to guide Will as best he can under their collective circumstances.", "genres": ["Drama", "Romance", "War"], "imdb": {"id": 790712, "rating": 7.2, "votes": 28170}, "languages": ["English", "Spanish"], "lastupdated": "2015-09-06 00:05:48.323000000", "metacritic": 77, "plot": "An American soldier struggles with an ethical dilemma when he becomes involved with a widow of a fallen officer.", "poster": "https://m.media-amazon.com/images/M/MV5BMTQyMzQ2Nzc5Ml5BMl5BanBnXkFtZTcwNDk4NjAyMw@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1259884800000, "runtime": 113, "title": "The Messenger", "tomatoes": {"boxOffice": "$1.0M", "consensus": "A dark but timely subject is handled deftly by writer/directer Owen Moverman and superbly acted by Woody Harrleson and Ben Foster.", "critic": {"meter": 90, "numReviews": 155, "rating": 7.5}, "dvd": 1274140800000, "fresh": 139, "lastUpdated": 1442167211000, "production": "Oscilloscope Pictures", "rotten": 16, "viewer": {"meter": 75, "numReviews": 21186, "rating": 3.6}, "website": "http://www.themessengermovie.com/"}, "type": "movie", "writers": ["Alessandro Camon", "Oren Moverman"], "year": 2009}