{"_id": "573a1397f29313caabce61a5", "awards": {"nominations": 2, "text": "Nominated for 2 Oscars. Another 7 wins & 2 nominations.", "wins": 9}, "cast": ["Michael York", "Richard Jordan", "Jenny Agutter", "Roscoe Lee Browne"], "countries": ["USA"], "directors": ["Michael Anderson"], "fullplot": "It's 2274 and on the surface, it all seems to be an idyllic society. Living in a city within an enclosed dome, there is little or no work for humans to perform and inhabitants are free to pursue all of the pleasures of life. There is one catch however: your life is limited and when you reach 30, it is terminated in a quasi-religious ceremony known as Carousel. Some, known as runners, do try to escape their fate when the time comes and it's the job of Sandmen to track them down and kill them. Logan is such a man and with several years before his own termination date, thinks nothing of the job he does. Soon after meeting a young woman, Jessica-6, he is ordered to become a runner himself and infiltrate a community outside the dome known as Sanctuary and to destroy it. Pursued by his friend Francis, also a Sandman, Logan and Jessica find their way to the outside. There they discover a beautiful, virtually uninhabited world. Logan realizes that he must return to the dome to tell them what he's found and be set free.", "genres": ["Action", "Adventure", "Romance"], "imdb": {"id": 74812, "rating": 6.8, "votes": 36796}, "languages": ["English"], "lastupdated": "2015-08-19 00:22:32.750000000", "plot": "An idyllic sci-fi future has one major drawback: life must end at 30.", "poster": "https://m.media-amazon.com/images/M/MV5BMjA2NTI4NDY1MF5BMl5BanBnXkFtZTgwMTg0NjAxMDE@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 204336000000, "runtime": 119, "title": "Logan's Run", "tomatoes": {"critic": {"meter": 68, "numReviews": 28, "rating": 6.1}, "dvd": 907027200000, "fresh": 19, "lastUpdated": 1439838639000, "production": "MGM", "rotten": 9, "viewer": {"meter": 67, "numReviews": 44254, "rating": 3.3}}, "type": "movie", "writers": ["David Zelag Goodman (screenplay)", "William F. Nolan (novel)", "George Clayton Johnson (novel)"], "year": 1976}