{"_id": "573a13d3f29313caabd9515c", "awards": {"nominations": 3, "text": "3 nominations.", "wins": 0}, "cast": ["David Hayman", "Samuel Feeney", "Gavin Mitchell", "William Houston"], "countries": ["UK"], "directors": ["Ricky Wood"], "fullplot": "Sawney, a religious psychopathic killer (played by David Hayman) drives a devilish Black Cab (taxi), stalking the towns and cities, abducting unholy souls for his communion of sacrifices. His insane family of inbred killers Judd and Jake, use their agility to wreak slaughter and havoc among their victims, who are then dragged to Sawney's lair in the hills, where they are raped, tortured and cannibalised. Sawney with his skillful surgical blade removes the appetizing pieces of human flesh for dinner before feeding the remains to a chained BEAST in the cellar. The Missing Persons list is beginning to rise! Investigative crime journalist Hamish MacDonald (Samuel Feeney) writes sensational and damming headlines against the police, due to their incompetence in handling the case. Frustrated police inspector Bill Munro (Gavin Mitchell) is under great pressure to catch the serial killers but is hindered by Hamish who is constantly giving him bad press. He decides to feed Hamish with privileged information rather than fight against him, just to get results for his superiors. But Hamish decides to investigate the heinous crimes on his own, with disastrous results. Unknowingly, his fiancèe Wendy McIntyre (Elizabeth Brown) is drawn into the intriguing plot, she becomes a target for the psychopathic KILLERS! This dramatic horror film reaches its climax when the BEAST is let loose from its cellar to seek retribution.", "genres": ["Horror", "Thriller"], "imdb": {"id": 1887748, "rating": 4.5, "votes": 933}, "languages": ["English"], "lastupdated": "2015-09-06 00:00:13.633000000", "num_mflix_comments": 5, "plot": "Scottish cannibal Sawney Bean and his murderous, inbred family are responsible for over a thousand murders over the centuries.", "poster": "https://m.media-amazon.com/images/M/MV5BMTQxOTU1NjY0NV5BMl5BanBnXkFtZTcwODM1MDMyOQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1361577600000, "runtime": 90, "title": "Lord of Darkness", "tomatoes": {"dvd": 1372118400000, "lastUpdated": 1439835767000, "production": "Grindstone Entertainment", "viewer": {"meter": 19, "numReviews": 79, "rating": 2.4}}, "type": "movie", "writers": ["Rick Wood"], "year": 2012}