{"_id": "573a139af29313caabcf0a33", "awards": {"nominations": 3, "text": "3 nominations.", "wins": 0}, "cast": ["Tim Allen", "Martin Short", "JoBeth Williams", "Lolita Davidovich"], "countries": ["USA", "France"], "directors": ["John Pasquin"], "fullplot": "A New York commodities broker who was married several years ago has been separated from his wife. Now he wants to marry his new girlfriend, so he has to divorce her first. So he goes to Venezuela, and is brought deep into the jungle and told that when they separated she was pregnant and chose not to tell him since he stated he was not really interested in becoming a father. Today, the boy has reached the age where he has to go on a quest, in New York, so his father reluctantly brings him along, and a culture clash follows. The boy has spent all of his life with the tribe he grew up with, and his father has a bit of problem so he can't spent as much as time with his son as his son likes.", "genres": ["Comedy", "Family"], "imdb": {"id": 119432, "rating": 5, "votes": 16800}, "languages": ["English"], "lastupdated": "2015-08-08 01:21:35.617000000", "num_mflix_comments": 2, "plot": "A New Yorker suddenly learns he has a thirteen-year-old son who's been raised in the jungle. He brings the boy to New York city, and that's where the fun starts.", "poster": "https://m.media-amazon.com/images/M/MV5BM2Q4MjNjNmYtOGYyZS00OGUzLWI4OTQtZjI0NmFiZTUyZDAwXkEyXkFqcGdeQXVyNTUyMzE4Mzg@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 857692800000, "runtime": 105, "title": "Jungle 2 Jungle", "tomatoes": {"critic": {"meter": 20, "numReviews": 41, "rating": 4}, "dvd": 1034035200000, "fresh": 8, "lastUpdated": 1441221752000, "production": "Walt Disney Productions", "rotten": 33, "viewer": {"meter": 33, "numReviews": 193850, "rating": 2.6}}, "type": "movie", "writers": ["Hervè Palud (earlier screenplay Un indien dans la ville)", "Thierry Lhermitte (earlier screenplay Un indien dans la ville)", "Igor Aptekman (earlier screenplay Un indien dans la ville)", "Philippe Bruneau (earlier screenplay Un indien dans la ville)", "Bruce A. Evans (screenplay)", "Raynold Gideon (screenplay)"], "year": 1997}