{"_id": "573a13a6f29313caabd168f7", "awards": {"nominations": 12, "text": "Nominated for 2 Golden Globes. Another 7 wins & 12 nominations.", "wins": 9}, "cast": ["Kieran Culkin", "Claire Danes", "Jeff Goldblum", "Jared Harris"], "countries": ["USA"], "directors": ["Burr Steers"], "fullplot": "Seventeen year old Jason Slocumb, Jr. - Igby to most that know him - comes from east coast old money, the second son of self-absorbed and controlling Mimi Slocumb and medically-diagnosed schizophrenic Jason Slocum, Sr., the latter who has for several years been institutionalized in a Maryland psychiatric facility. While Igby's economics-studying Columbia-attending older brother Ollie Slocum has embraced and aspires to continue their wealthy life, Igby has rebelled against it, considering his brother a fascist (although he could soften that label to Republican). Because of Jason's situation, Mimi has largely left the role of male role model for Ollie and Igby to their godfather, D.H. Banes. Igby's rebellion has led to him being kicked out of one prep school after another, the latest, a military academy, from which Igby escapes before he can graduate. As such, Mimi and D.H. arrange for Igby to live in New York with Ollie for the summer while working for D.H. renovating some of his properties, before Mimi arranges for yet another strict school for the fall so that Igby can at least graduate. Igby is largely able to hide out for most of the summer with the help of Rachel, D.H.'s younger heroin addict mistress, and Sookie, a slightly older waitress with who he falls in love. An issue with Sookie and the aftermath of a joint mission with Ollie leads to Igby having a clearer picture of what his immediate future will look like.", "genres": ["Comedy", "Drama"], "imdb": {"id": 280760, "rating": 7, "votes": 28178}, "languages": ["English"], "lastupdated": "2015-09-11 00:47:48.850000000", "metacritic": 72, "num_mflix_comments": 1, "plot": "A young man's peculiar upbringing renders him unable to competently cope with the struggle of growing up.", "poster": "https://m.media-amazon.com/images/M/MV5BMTUwNTk2NjY0NF5BMl5BanBnXkFtZTcwMjQ3MTI0NA@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1033689600000, "runtime": 98, "title": "Igby Goes Down", "tomatoes": {"boxOffice": "$4.6M", "consensus": "In the vein of The Catcher in the Rye, Igby Goes Down is scathingly witty and sharply observant.", "critic": {"meter": 76, "numReviews": 128, "rating": 6.9}, "dvd": 1044316800000, "fresh": 97, "lastUpdated": 1441135903000, "production": "United Artists Pictures", "rotten": 31, "viewer": {"meter": 80, "numReviews": 44122, "rating": 3.4}, "website": "http://www.igbygoesdown.com/"}, "type": "movie", "writers": ["Burr Steers"], "year": 2002}