{"_id": "573a13b8f29313caabd4d8a3", "awards": {"nominations": 9, "text": "Nominated for 1 Oscar. Another 7 wins & 9 nominations.", "wins": 8}, "cast": ["Adam", "Jeff Anderson", "Pope Benedict XVI", "Monsignor Cain"], "countries": ["USA"], "directors": ["Amy Berg"], "fullplot": "Moving from one parish to another in Northern California during the 1970s, Father Oliver O'Grady quickly won each congregation's trust and respect. Unbeknownst to them, O'Grady was a dangerously active pedophile that Church hierarchy, aware of his predilection, had harbored for over 30 years, allowing him to abuse countless children. Juxtaposing an extended, deeply unsettling interview with O'Grady himself with the tragic stories of his victims, filmmaker Amy Berg bravely exposes the deep corruption of the Catholic Church and the troubled mind of the man they sheltered.", "genres": ["Documentary", "Crime"], "imdb": {"id": 814075, "rating": 8, "votes": 7596}, "languages": ["English"], "lastupdated": "2015-09-16 11:38:24.637000000", "metacritic": 86, "num_mflix_comments": 3, "plot": "Documentary about Father Oliver O'Grady, a Catholic priest who was relocated to various parishes around the United States during the 1970s in an attempt by the Catholic Church to cover up his rape of dozens of children.", "poster": "https://m.media-amazon.com/images/M/MV5BMTM1NTM5MDQ3Ml5BMl5BanBnXkFtZTcwMjMzMjgzMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 1172102400000, "runtime": 101, "title": "Deliver Us from Evil", "tomatoes": {"consensus": "Deliver Us From Evil is a superb documentary and a searing look at an institution protecting its leaders at the expense of its followers. A profoundly disturbing chronicle of a wolf in sheep's clothing, the film builds a clear-eyed case against pedophile priest Oliver O'Grady, and the Catholic bureaucracy that protected him. The recollections of O'Grady's victims are nothing short of shocking and heartbreaking.", "critic": {"meter": 100, "numReviews": 72, "rating": 8.4}, "dvd": 1178582400000, "fresh": 72, "lastUpdated": 1441131243000, "production": "Lionsgate Films", "rotten": 0, "viewer": {"meter": 89, "numReviews": 18920, "rating": 3.8}, "website": "http://www.deliverusfromevilthemovie.com/"}, "type": "movie", "writers": ["Amy Berg"], "year": 2006}