{"_id": "573a13c8f29313caabd78ac3", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Gil Bellows", "Tracy Spiridakos", "Camille Sullivan", "Donnelly Rhodes"], "countries": ["Canada"], "directors": ["Jeffery Scott Lando"], "fullplot": "On 31 October 1831, in the Hollow Glen village, the locals sacrifice what they consider \"unclean\" in a bonfire to protect their village. When they throw a deformed baby in the bonfire, his mother, who is a witch, curses the babies of the dwellers and creates an evil creature from the bones of her son to take their souls in the Halloween. The story of the Goblin becomes a legend. In the present days, Neil Perkins travels with his second wife Kate; his rebel teenage daughter Nikki; his baby son Nathan and Nikki's best friend Cammy to an isolated cabin in Hollow Glen expecting to start a business with his partner Owen. The family is warned to leave the village before the Halloween by the drunkard Charlie, but they do not give credit to his words. On 31 October, Neil, Kate and Owen have a meeting with Sheriff Milgreen and they leave Nathan with Nikki and Cammy. The two girls are visited by three friends and Nikki leaves Nathan alone for less than one minute. When she returns, the baby is missing and the Goblin is killing her friends.", "genres": ["Fantasy", "Horror", "Sci-Fi"], "imdb": {"id": 1512310, "rating": 4.1, "votes": 970}, "languages": ["English"], "lastupdated": "2015-08-27 00:46:01.540000000", "num_mflix_comments": 1, "plot": "Every Halloween, a small hamlet in the deep woods is visited by a fierce goblin, intent on capturing infants and brutally murdering anyone in its path.", "poster": "https://m.media-amazon.com/images/M/MV5BMTMxMDIzMjQ1Nl5BMl5BanBnXkFtZTcwMjM2OTEzNQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "TV-14", "released": 1279324800000, "runtime": 92, "title": "Goblin", "tomatoes": {"dvd": 1311638400000, "lastUpdated": 1440353728000, "viewer": {"meter": 15, "numReviews": 115, "rating": 2.2}}, "type": "movie", "writers": ["Raul Inglis"], "year": 2010}