{"_id": "573a139ef29313caabcfde6f", "awards": {"nominations": 6, "text": "2 wins & 6 nominations.", "wins": 2}, "cast": ["Damièn Delgado", "Josè Carlos Rodrèguez", "Elpidia Carrillo", "Ièaki Aierra"], "countries": ["Mexico"], "directors": ["Salvador Carrasco"], "fullplot": "It is May 1520 in the vast Aztec Empire one year after the Spanish Conqueror Hernèn Cortès' arrival in Mexico. \"The Other Conquest\" opens with the infamous massacre of the Aztecs at the Great Temple of Tenochtitlan [what is now called Mexico City]. The sacred grounds are covered with the countless bodies of priests and nobility slaughtered by the Spanish Armies under Cortès' command. The lone Aztec survivor of the massacre is a young Indian scribe named Topiltzin [Damièn Delgado]. Topiltzin, who is the illegitimate son of the Aztec Emperor Moctezuma, survives the onslaught by burying himself under a stack of bodies. As if awakening from a dream, the young man rises from among the dead to find his mother murdered, the Spanish in power and the dawn of a new era in his native land. A New World with new leaders, language, customs... and God. Representing the New Order is the Spanish Friar Diego [Josè Carlos Rodrèguez]. His mission is to convert the \"savage\" natives into civilised Christians; to replace their human sacrifices and feathered deities with public Christenings and fealty to the Blessed Virgin Mary. With Topiltzin, Friar Diego faces his most difficult spiritual and personal challenge, for when Topiltzin is captured by Spanish troops and presented to Cortès [Ièaki Aierra], the Spanish Conqueror places Topiltzin's conversion under Friar Diego's care. Old world confronts the New as Topiltzin struggles to preserve his own beliefs, whilst Friar Diego attempts to impose his own. Moreover, all the while, the question remains: Who is converting whom?", "genres": ["Drama", "History"], "imdb": {"id": 175996, "rating": 6.8, "votes": 1019}, "languages": ["Spanish"], "lastupdated": "2015-08-14 01:29:03.067000000", "plot": "It is May 1520 in the vast Aztec Empire one year after the Spanish Conqueror Hernèn Cortès' arrival in Mexico. \"The Other Conquest\" opens with the infamous massacre of the Aztecs at the ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTIwMTQwOTczMF5BMl5BanBnXkFtZTcwNjgwMjc0MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 956275200000, "runtime": 105, "title": "La otra conquista", "tomatoes": {"critic": {"meter": 82, "numReviews": 17, "rating": 7.2}, "dvd": 1192492800000, "fresh": 14, "lastUpdated": 1442084547000, "production": "Union Station Media", "rotten": 3, "viewer": {"meter": 64, "numReviews": 1945, "rating": 3.4}, "website": "http://www.theotherconquest.com/"}, "type": "movie", "writers": ["Salvador Carrasco"], "year": 1998}