{"_id": "573a13bcf29313caabd568ea", "awards": {"nominations": 9, "text": "8 wins & 9 nominations.", "wins": 8}, "cast": ["Zac Efron", "Vanessa Hudgens", "Ashley Tisdale", "Lucas Grabeel"], "countries": ["USA"], "directors": ["Kenny Ortega"], "fullplot": "Troy and the gang of East High School are going through their senior year, facing graduating and going their separate ways. Coming to terms with the reality of it all, Troy wants to attend the nearby University of Albuquerque next year on a basketball scholarship, but Gabriella wants to attend Stanford University in California. Meanwhile, Sharpay, the school's shallow and spoiled rich girl, plots to go all out planning the school's final musical show with the idea to add music to her hopes and fears about the future. While Sharpay takes an up-and-coming British exchange student under her wing, her flamboyant fraternal twin brother, Ryan, has his sights set on something different after school. In addition, Troy's best friend and basketball teammate Chad, and Garbiella's best friend Taylor, all have their sights set on their plans after high school and come to terms with the reality of the real world.", "genres": ["Comedy", "Drama", "Family"], "imdb": {"id": 962726, "rating": 4.4, "votes": 40102}, "languages": ["English"], "lastupdated": "2015-08-24 00:09:05.023000000", "metacritic": 57, "num_mflix_comments": 1, "plot": "As seniors in high school, Troy and Gabriella struggle with the idea of being separated from one another as college approaches. Along with the rest of the Wildcats, they stage a spring musical to address their experiences, hopes and fears about their future.", "poster": "https://m.media-amazon.com/images/M/MV5BNDE1NjU2NTMyNV5BMl5BanBnXkFtZTcwMTg3NDA3MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "G", "released": 1224806400000, "runtime": 112, "title": "High School Musical 3: Senior Year", "tomatoes": {"boxOffice": "$90.5M", "consensus": "It won't win many converts, but High School Musical 3 is bright, energetic, and well-crafted.", "critic": {"meter": 65, "numReviews": 127, "rating": 5.9}, "dvd": 1234828800000, "fresh": 82, "lastUpdated": 1440009448000, "production": "Walt Disney Pictures", "rotten": 45, "viewer": {"meter": 71, "numReviews": 353174, "rating": 3.5}, "website": "http://disney.go.com/disneypictures/highschoolmusical3/"}, "type": "movie", "writers": ["Peter Barsocchini", "Peter Barsocchini (characters)"], "year": 2008}