{"_id": "573a13b8f29313caabd4c758", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Eric Geleynse", "Chris Brown", "Susan Ginwalla", "Caroline Pressley"], "countries": ["UK", "USA"], "directors": ["Eric Steel"], "fullplot": "People suffer largely unnoticed while the rest of the world goes about its business. This is a documentary exploration of the mythic beauty of the Golden Gate Bridge, the most popular suicide destination in the world, and those drawn by its call. Steel and his crew filmed the bridge during daylight hours from two separate locations for all of 2004, recording most of the two dozen deaths in that year (and preventing several others). They also taped interviews with friends, families and witnesses, who recount in sorrowful detail stories of struggles with depression, substance abuse and mental illness. Raises questions about suicide, mental illness and civic responsibility as well as the filmmaker's relationship to his fraught and complicated material.", "genres": ["Documentary", "Drama"], "imdb": {"id": 799954, "rating": 7.3, "votes": 8620}, "languages": ["English"], "lastupdated": "2015-09-14 05:38:17.543000000", "metacritic": 58, "plot": "People suffer largely unnoticed while the rest of the world goes about its business. This is a documentary exploration of the mythic beauty of the Golden Gate Bridge, the most popular ...", "poster": "https://m.media-amazon.com/images/M/MV5BMDJhNTlkYmItZGYzMC00Zjg5LWEzMWUtMmMwNDcyNTRiZGEwXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1171584000000, "runtime": 94, "title": "The Bridge", "tomatoes": {"boxOffice": "$49.3k", "consensus": "Tactlessly morbid or remarkably sensitive? Deeply disturbing or viscerally fascinating? Critics are divided on Eric Steele's unique documentary on the Golden Gate Bridge, wonder of the modern world and notorious suicide destination.", "critic": {"meter": 67, "numReviews": 57, "rating": 6.4}, "dvd": 1171584000000, "fresh": 38, "lastUpdated": 1441131259000, "production": "First Stripe Productions", "rotten": 19, "viewer": {"meter": 73, "numReviews": 7864, "rating": 3.7}, "website": "http://www.thebridge-themovie.com/new/index.html"}, "type": "movie", "writers": ["Tad Friend (inspired by article \"Jumpers\")"], "year": 2006}