{"_id": "573a1394f29313caabcdfe01", "awards": {"nominations": 1, "text": "Nominated for 1 Oscar. Another 2 wins & 1 nomination.", "wins": 3}, "cast": ["Olivia de Havilland", "Robert Mitchum", "Frank Sinatra", "Gloria Grahame"], "countries": ["USA"], "directors": ["Stanley Kramer"], "fullplot": "Lucas Marsh, an intern bent upon becoming a first-class doctor, not merely a successful one. He courts and marries the warm-hearted Kristina, not out of love but because she is highly knowledgeable in the skills of the operating room and because she has frugally put aside her savings through the years. She will be, as he shrewdly knows, a supportive wife in every way. She helps make him the success he wants to be and cheerfully moves with him to the small town in which he starts his practice. But as much as he tries to be a good husband to the undemanding Kristina, Marsh easily falls into the arms of a local siren and the patience of the long-sorrowing Kristina wears thin. She reasons he no longer needs her and asks for a divorce. A calamity now brings Marsh to his senses. Dr. Runkleman, Marsh's gruff and wise employer, is stricken with a heart attack and requires emergency surgery. Marsh is forced to operate.", "genres": ["Drama", "Film-Noir", "Romance"], "imdb": {"id": 48432, "rating": 6.8, "votes": 1224}, "languages": ["English"], "lastupdated": "2015-08-05 00:12:31.083000000", "num_mflix_comments": 2, "plot": "An ego-driven, aspiring physician, intolerant of the weaknesses of others, especially those closest to him, comes to grips with his own imperfections.", "poster": "https://m.media-amazon.com/images/M/MV5BNTYyMTM0MjUtN2M5MC00ODE0LTljMmQtZmZjZDY2MmVjNzU5XkEyXkFqcGdeQXVyMjUxODE0MDY@._V1_SY1000_SX677_AL_.jpg", "released": -457747200000, "runtime": 135, "title": "Not as a Stranger", "tomatoes": {"critic": {"meter": 0, "numReviews": 7, "rating": 3.8}, "dvd": 1301356800000, "fresh": 0, "lastUpdated": 1440530878000, "production": "United Artists", "rotten": 7, "viewer": {"meter": 58, "numReviews": 249, "rating": 3.4}}, "type": "movie", "writers": ["Edna Anhalt (written for the screen by)", "Edward Anhalt (written for the screen by)", "Morton Thompson (novel)"], "year": 1955}