{"_id": "573a13bef29313caabd5b62d", "awards": {"nominations": 2, "text": "2 nominations.", "wins": 0}, "cast": ["Jude Law", "Forest Whitaker", "Alice Braga", "Liev Schreiber"], "countries": ["USA", "Canada"], "directors": ["Miguel Sapochnik"], "fullplot": "In the future humans have extended and improved our lives through highly sophisticated and expensive mechanical organs created by a company called \"The Union\". The dark side of these medical breakthroughs is that if you don't pay your bill, \"The Union\" sends its highly skilled repo men to take back its property... with no concern for your comfort or survival. Former soldier Remy is one of the best organ repo men in the business. But when he suffers a cardiac failure on the job, he awakens to find himself fitted with the company's top-of-the-line heart-replacement... as well as a hefty debt. But a side effect of the procedure is that his heart's no longer in the job. When he can't make the payments, The Union sends its toughest enforcer, Remy's former partner Jake, to track him down.", "genres": ["Action", "Crime", "Sci-Fi"], "imdb": {"id": 1053424, "rating": 6.3, "votes": 83526}, "languages": ["English", "Spanish"], "lastupdated": "2015-09-05 00:51:50.713000000", "metacritic": 32, "num_mflix_comments": 1, "plot": "Set in the near future when artificial organs can be bought on credit, it revolves around a man who struggles to make the payments on a heart he has purchased. He must therefore go on the run before said ticker is repossessed.", "poster": "https://m.media-amazon.com/images/M/MV5BMjA4MTUxODM0MV5BMl5BanBnXkFtZTcwMDg3MTgwMw@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1268956800000, "runtime": 111, "title": "Repo Men", "tomatoes": {"boxOffice": "$13.2M", "consensus": "Repo Men has an intriguing premise, as well as a likable pair of leads, but they're wasted on a rote screenplay, indifferent direction, and mind-numbing gore.", "critic": {"meter": 22, "numReviews": 146, "rating": 4.2}, "dvd": 1280188800000, "fresh": 32, "lastUpdated": 1442082649000, "production": "Universal Studios", "rotten": 114, "viewer": {"meter": 41, "numReviews": 100312, "rating": 3}, "website": "http://www.repomenarecoming.com/"}, "type": "movie", "writers": ["Eric Garcia (screenplay)", "Garrett Lerner (screenplay)", "Eric Garcia (novel)"], "year": 2010}