{"_id": "573a13c1f29313caabd63442", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Abhay Deol", "Satish Kaushik", "Tannishtha Chatterjee", "Mohammed Faisal"], "countries": ["India", "USA"], "directors": ["Dev Benegal"], "fullplot": "VISHNU, a restless young man, itches to escape his father's faltering hair oil business. An old truck beckons, which Vishnu sees as his ticket to freedom. He offers to drive the antique Chevy across the desert to the sea, where it has been sold to a local museum. As he sets off across the harsh terrain, he discovers he's not merely transporting a battered vehicle, but an old touring cinema. Along the way, Vishnu reluctantly picks up a young runaway, a wandering old entertainer and a striking gypsy woman. Together they roam the barren land, searching for water and an elusive fair. The journey turns dire when they are waylaid by corrupt cops and a notorious waterlord. The key to their freedom is the eccentric collection of films and the two forty-year-old film projectors in the back of the truck. As in 1001 Nights, if the films are good, they live and move on. If the films are boring, they face death in the outback. The journey proves transformative for each of the travelers, but especially for Vishnu who discovers life, love and laughter on the Indian highway.", "genres": ["Adventure", "Comedy", "Crime"], "imdb": {"id": 1190894, "rating": 6.9, "votes": 1411}, "languages": ["Hindi", "English", "Rajasthani"], "lastupdated": "2015-08-29 00:21:56.297000000", "num_mflix_comments": 2, "plot": "A young man's journey across the mythic Indian landscape becomes a life changing odyssey.", "poster": "https://m.media-amazon.com/images/M/MV5BYWI4YjI5MmEtNThhOC00ODllLWFiYzItZDE3ZmQ2OTM4ZDViXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY1000_SX677_AL_.jpg", "released": 1273017600000, "runtime": 95, "title": "Road, Movie", "tomatoes": {"dvd": 1251158400000, "lastUpdated": 1437157887000, "viewer": {"meter": 20, "numReviews": 115, "rating": 2.6}}, "type": "movie", "writers": ["Dev Benegal"], "year": 2009}