{"_id": "573a13d3f29313caabd947a8", "awards": {"nominations": 38, "text": "Nominated for 1 Oscar. Another 9 wins & 38 nominations.", "wins": 10}, "cast": ["Hugh Jackman", "James McAvoy", "Michael Fassbender", "Jennifer Lawrence"], "countries": ["USA", "UK", "Canada"], "directors": ["Bryan Singer"], "fullplot": "Sentinels, robots that were created for the purpose of hunting down mutants were released in 1973. 50 years later the Sentinels would also hunt humans who aid mutants. Charles Xavier and his X-Men try their best to deal with the Sentinels but they are able to adapt and deal with all mutant abilities. Charles decides to go back in time and change things. He asks Kitty Pryde who can send a person's consciousness into the person's past to send him but she can only send someone back a few weeks because if she sends someone back further it could harm them. So Logan decides to go back himself because he might be able to withstand it. So Charles tells him that it's Mystique who's responsible because when she learned about the Sentinels she sought out Bolivar Trask the man who created them and killed him. She would be caught and studied and her ability to change was somehow added to the Sentinels which is why they can adapt. Logan must go to the younger Charles and ask him to help; problem is that he was despondent at that time and without his powers because he took a drug which allows him to walk but takes away his powers. Logan is also told to find Magneto.", "genres": ["Action", "Adventure", "Sci-Fi"], "imdb": {"id": 1877832, "rating": 8.1, "votes": 436254}, "languages": ["English", "Vietnamese", "French"], "lastupdated": "2015-08-31 00:09:15.700000000", "metacritic": 74, "plot": "The X-Men send Wolverine to the past in a desperate effort to change history and prevent an event that results in doom for both humans and mutants.", "poster": "https://m.media-amazon.com/images/M/MV5BZGIzNWYzN2YtMjcwYS00YjQ3LWI2NjMtOTNiYTUyYjE2MGNkXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1400803200000, "runtime": 132, "title": "X-Men: Days of Future Past", "tomatoes": {"boxOffice": "$233.9M", "consensus": "X-Men: Days of Future Past combines the best elements of the series to produce a satisfyingly fast-paced outing that ranks among the franchise's finest installments.", "critic": {"meter": 91, "numReviews": 270, "rating": 7.6}, "dvd": 1413244800000, "fresh": 245, "lastUpdated": 1440266813000, "production": "20th Century Fox", "rotten": 25, "viewer": {"meter": 92, "numReviews": 270716, "rating": 4.3}, "website": "http://www.x-menmovies.com/"}, "type": "movie", "writers": ["Simon Kinberg (screenplay)", "Jane Goldman (story)", "Simon Kinberg (story)", "Matthew Vaughn (story)"], "year": 2014}