{"_id": "573a1394f29313caabce0ae7", "awards": {"nominations": 6, "text": "Nominated for 3 Golden Globes. Another 3 nominations.", "wins": 0}, "cast": ["Cary Grant", "Ingrid Bergman", "Cecil Parker", "Phyllis Calvert"], "countries": ["UK", "USA"], "directors": ["Stanley Donen"], "fullplot": "Anna Kalman is a London based actress. She has been unable to find love in her life. The reason why she came home early from a vacation to Majorca fits into that theme, as the man she met there and was initially attracted to ended up not being who she thought he was as a man. Upon her arrival home, she meets the suave Philip Adams, a financier who is a work acquaintance of her brother-in-law, diplomat Alfred Munson. Philip initially states that there is no Mrs. Adams in his life. But when Anna later asks him out, he clarifies that statement in that there is no Mrs. Adams in London, as she is at home in San Francisco. Regardless, Anna decides still to ask him on the date she had intended to the ballet. He accepts, letting her know that whatever happens between the two of them that he will never be able to leave his wife. As time goes on, the two fall in love, their happiness which can only be sustained as long as Philip has his Paris-based contract with NATO. So when Philip announces that he is being transferred to New York for five months, Anna comes to the realization that she truly cannot live without him and wants to marry him. Shortly thereafter, Anna learns something about Philip's background, which not only threatens their relationship, but leads to a night that Anna wants to give him that he will never forget, and not in a good way. But the best laid plans may have a bumpy road to being executed effectively...", "genres": ["Comedy", "Romance"], "imdb": {"id": 51773, "rating": 6.9, "votes": 5284}, "languages": ["English"], "lastupdated": "2015-09-05 00:37:17.910000000", "num_mflix_comments": 1, "plot": "Anna Kalman is a London based actress. She has been unable to find love in her life. The reason why she came home early from a vacation to Majorca fits into that theme, as the man she met ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTYwNjAzOTQ2N15BMl5BanBnXkFtZTgwNDk3NDE3MjE@._V1_SY1000_SX677_AL_.jpg", "rated": "APPROVED", "released": -366681600000, "runtime": 100, "title": "Indiscreet", "tomatoes": {"critic": {"meter": 100, "numReviews": 17, "rating": 7.3}, "dvd": 1000771200000, "fresh": 17, "lastUpdated": 1439062070000, "rotten": 0, "viewer": {"meter": 71, "numReviews": 5887, "rating": 3.6}}, "type": "movie", "writers": ["Norman Krasna (screenplay)", "Norman Krasna (play)"], "year": 1958}