{"_id": "573a13bcf29313caabd55980", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Vincent Lindon", "Patrick Timsit", "Philippe Nahon", "Amanda Lear"], "countries": ["France", "Luxembourg", "Germany"], "directors": ["Guillaume Ivernel", "Arthur Qwak"], "fullplot": "The world has become a vast conglomerate of islands of varying size and shape. This babbling universe is mainly populated with ruthless rogues, surly peasants and illiterate, petty lords. Their main concerns revolve around two fundamental rules: Eat and don't get eaten. For this new world has become infested with a terrible plague: omnipresent, monstrously famished, mutant creatures, are wreaking havoc - They are known as the Dragons. Gwizdo and Lian-Chu are two dragon hunters, but are a long way from being among the best. Their only real talents: the size of the hulking brute with the heart of gold, Lian-Chu, and Gwizdo's talent for scams of all and any shape or form. Their sole ambition: to buy a little farm where they can relax and raise mussels, a creature that is a lot less unpleasant and difficult to hunt down than dragons. A few islands away rises the fortress of Lord Arnold. Arnold has a problem: he's living in terror at the thought of the return of World Eater, that horrible dragon that returns every thirty seasons to spread terror and destruction. Nobody has been able to conquer him. In fact nobody's ever returned alive to spread the news of how the fight went. Zoe, the grand-niece of the lord, has decided to take matters in hand, and has met Gwizdo and Lian-Chu. Persuaded that she has found the heroes of her dreams, she is going to drag them into the maddest of adventures.", "genres": ["Animation", "Adventure", "Family"], "imdb": {"id": 944834, "rating": 6.6, "votes": 10369}, "languages": ["French"], "lastupdated": "2015-09-05 01:05:21.260000000", "num_mflix_comments": 2, "plot": "A fantastic tale telling the adventures of two dragon hunters!", "poster": "https://m.media-amazon.com/images/M/MV5BOTc4M2EwNjQtNjY5Yi00OTVhLWI2NDItYWI2OGZlOTdkNDhiXkEyXkFqcGdeQXVyNDgyODgxNjE@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 1206489600000, "runtime": 80, "title": "Dragon Hunters", "tomatoes": {"critic": {"meter": 67, "numReviews": 9, "rating": 5.8}, "dvd": 1245715200000, "fresh": 6, "lastUpdated": 1440008590000, "production": "Peace Arch Entertainment", "rotten": 3, "viewer": {"meter": 61, "numReviews": 3048, "rating": 3.5}, "website": "http://www.dragonhunters-themovie.com/"}, "type": "movie", "writers": ["Frèdèric Lenoir", "Arthur Qwak"], "year": 2008}