{"_id": "573a1394f29313caabcde7cc", "awards": {"nominations": 2, "text": "Nominated for 1 Oscar. Another 3 wins & 2 nominations.", "wins": 4}, "cast": ["Marlon Brando", "Teresa Wright", "Everett Sloane", "Jack Webb"], "countries": ["USA"], "directors": ["Fred Zinnemann"], "fullplot": "Ex-GI Ken who as a result of a war wound is paralyzed below the waist. In the hospital back home, he passes through an initial period of depression with the help of a sympathetic Dr. Brock and his faithful fiancèe Ellen. Ken's bitter isolation is also overcome with the help of his fellow patients, especially the intelligent young cynic Norm, the witty Leo and serious young Angel. Soon Ken throws himself into the work rehabilitation and after a long period of physical therapy even suspects he may regain the use of his limbs. With the approval and help of the doctor, he and Ellen marry, but on their wedding night both have misgivings about the marriage: the full realization of Ellen's new responsibilities frighten her and makes her more uncertain than ever, and Ken reverts to self-pity. There is a violent argument, and he goes back to the hospital. But his blazing anger finds no sympathy from his buddies, and after a surprising conversation with Dr. Brock, Ken realizes that he must return to his wife, with whom he must try to build his new life, in spite of all the attendant difficulties.", "genres": ["Drama"], "imdb": {"id": 42727, "rating": 7.2, "votes": 3082}, "languages": ["English", "Spanish"], "lastupdated": "2015-09-02 00:13:03.710000000", "num_mflix_comments": 1, "plot": "Paralized war vet tries to adjust to the world without the use of his limbs.", "poster": "https://m.media-amazon.com/images/M/MV5BNGM1NDI3MGUtMWMxYS00OTQ4LWFiNWMtMTgxY2E4MTUzYTQ4XkEyXkFqcGdeQXVyNjUwNzk3NDc@._V1_SY1000_SX677_AL_.jpg", "rated": "PASSED", "released": -610156800000, "runtime": 85, "title": "The Men", "tomatoes": {"critic": {"meter": 70, "numReviews": 10, "rating": 7}, "dvd": 1071532800000, "fresh": 7, "lastUpdated": 1442266427000, "production": "Columbia Pictures", "rotten": 3, "viewer": {"meter": 75, "numReviews": 1405, "rating": 3.6}}, "type": "movie", "writers": ["Carl Foreman (story)", "Carl Foreman (screenplay)"], "year": 1950}