{"_id": "573a13a6f29313caabd1714d", "awards": {"nominations": 3, "text": "4 wins & 3 nominations.", "wins": 4}, "cast": ["Vincent Gallo", "Maria de Medeiros", "Joaquim de Almeida", "Marèa Lidèn"], "countries": ["Spain"], "directors": ["Marèa Lidèn"], "fullplot": "A seven-man crew of international specialists formed by Commander Andre Vishniac; engineer Luca Baglioni; doctor Jenny Johnson; astrobiologist Fidel Rodrigo; pilot Susana Sènchez; geologist Herbert Sagan; and pilot Lowell travels to Mars to explore the planet. On the arrival, Lowell stays in orbit in the mothership while the crew lands on Mars. However their spacecraft crashes on the planet and Vishniac breaks his neck. They learn that they are stranded in Mars and Lowell returns to Earth to bring a rescue team. Soon Luca calculates the oxygen, water and supplies and concludes that there are enough for only two of them survive until an eventual rescue team comes to Mars twenty six months later. They decide that the engineer Luca and doctor Jenny should be the ones to stay in the spacecraft due to their specialties. Susan, Rodrigo and Sagan wear their spacesuits to explore the planet and die. But while there is life, there is hope.", "genres": ["Drama", "Sci-Fi"], "imdb": {"id": 283015, "rating": 5.4, "votes": 2147}, "languages": ["English"], "lastupdated": "2015-09-06 00:44:32.040000000", "num_mflix_comments": 2, "plot": "A seven-man crew of international specialists formed by Commander Andre Vishniac; engineer Luca Baglioni; doctor Jenny Johnson; astrobiologist Fidel Rodrigo; pilot Susana Sènchez; geologist...", "poster": "https://m.media-amazon.com/images/M/MV5BMTMxMTA5MDI4Nl5BMl5BanBnXkFtZTcwMDkzMjcyMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1018569600000, "runtime": 95, "title": "Stranded", "tomatoes": {"dvd": 1058832000000, "lastUpdated": 1441305430000, "viewer": {"meter": 25, "numReviews": 1394, "rating": 2.5}}, "type": "movie", "writers": ["Juan Miguel Aguilera (screenplay)"], "year": 2001}