{"_id": "573a13a5f29313caabd13cf8", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Robert De Niro", "Frances McDormand", "James Franco", "Eliza Dushku"], "countries": ["USA"], "directors": ["Michael Caton-Jones"], "fullplot": "New York City homicide detective Vincent LaMarca has forged a long and distinguished career in law enforcement, making a name for himself as a man intensely committed to his work. But on his latest case, the stakes are higher for Vincent--the suspect he's investigating is his own son. He and Joey have been painfully estranged ever since Vincent divorced his wife and left the decaying boardwalks of Long Beach, Long Island for the anonymity of Manhattan and a successful career with the NYPD. He lives his life in solitude, keeping his girlfriend at arm's length; the closest relationship he maintains is with his partner, Reg--and Vincent makes sure that stops at the precinct door. As long as Vincent lives in the protection of the present, he doesn't have to deal with the pain of his past--or his sorrow over his broken relationship with Joey. But this murder investigation is drawing Vincent home to Long Beach, the self-proclaimed City by the Sea, where the past has been waiting for him to return. The agonizing memory that has tortured him all his life--the death of his father, a convicted murderer who was executed when Vincent was just a boy--still plagues him. In the course of the investigation, he discovers that his own unresolved pain and failures as a father have deeply influenced Joey's life, and now his 18-month-old grandson may be fated to follow their self-destructive paths.", "genres": ["Crime", "Drama", "Mystery"], "imdb": {"id": 269095, "rating": 6.2, "votes": 20612}, "languages": ["English"], "lastupdated": "2015-09-16 12:49:56.260000000", "metacritic": 50, "num_mflix_comments": 1, "plot": "Vincent Lamarca, whose father was executed for a 1950s kidnapping of a child, grew up to become a police officer, only to see his own son become a murderer.", "poster": "https://m.media-amazon.com/images/M/MV5BMTIwMjc1MzI3MF5BMl5BanBnXkFtZTYwMjUwMjY3._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1031270400000, "runtime": 108, "title": "City by the Sea", "tomatoes": {"boxOffice": "$22.4M", "consensus": "Even though the movie is well acted, it sinks under an abundance of melodrama and cliches.", "critic": {"meter": 48, "numReviews": 143, "rating": 5.8}, "dvd": 1045526400000, "fresh": 68, "lastUpdated": 1441045284000, "production": "Warner Bros. Pictures", "rotten": 75, "viewer": {"meter": 41, "numReviews": 15981, "rating": 2.9}, "website": "http://citybythesea.warnerbros.com"}, "type": "movie", "writers": ["Mike McAlary (article)", "Ken Hixon (screenplay)"], "year": 2002}