{"_id": "573a1394f29313caabce0317", "awards": {"nominations": 3, "text": "3 nominations.", "wins": 0}, "cast": ["Romy Schneider", "Karlheinz Bèhm", "Magda Schneider", "Gustav Knuth"], "countries": ["Austria"], "directors": ["Ernst Marischka"], "fullplot": "Through her Hungarian teacher the young Empress Sissi is enchanted by Hungary, a country she has never visited, but feels an affinity with. The Council of Ministers wants to punish some Hungarian rebels, but Emperor Franz Joseph gives all the rebels amnesty, including their leader, Count Andrassy. The Emperor is influenced by his wife, who says that you cannot win a country with force, only with love. The Hungarians are deeply affected by Sissi's love for their country, and want to crown Franz Joseph and Sissi to King and Queen of Hungary. At a big ball for the Hungarians the Emperor's mother, Archduchess Sophie, insults Count Andrassy, by refusing to greet him. Sissi rescues the situation by asking Count Andrassy to dance with her. Sissi gives birth to a daughter, but her happiness is broken, when Archduchess Sophie decides to nourish the baby herself, and takes it away from its mother. Sissi runs away to her family in Bavaria. Franz Joseph follows her, and takes her on a honeymoon in the Austrian Alps. Sissi's mother, Duchess Ludovika, goes to Vienna to implore her sister, Archduchess Sophie, to give the baby back to Sissi.", "genres": ["Drama", "History"], "imdb": {"id": 49762, "rating": 6.5, "votes": 4131}, "languages": ["German", "Hungarian"], "lastupdated": "2015-09-12 00:22:05.233000000", "plot": "The second in a trilogy of movies about Elisabeth \"Sissi\" of Austria, the film chronicles the married life of the young empress as she tries to adjust to formal and strict life in the palace and an overbearing mother-in-law.", "poster": "https://m.media-amazon.com/images/M/MV5BZTc3ZTI4ZDYtZTNkYS00NTU3LTgwY2QtNDZkYWZmNDJmOTIyXkEyXkFqcGdeQXVyNDE5MTU2MDE@._V1_SY1000_SX677_AL_.jpg", "released": -412905600000, "runtime": 107, "title": "Sissi: The Young Empress", "tomatoes": {"dvd": 1189468800000, "lastUpdated": 1441911422000, "viewer": {"meter": 88, "numReviews": 3683, "rating": 4.1}}, "type": "movie", "writers": ["Ernst Marischka"], "year": 1956}