{"_id": "573a13aef29313caabd2ed1a", "awards": {"nominations": 12, "text": "10 wins & 12 nominations.", "wins": 10}, "cast": ["Juan Diego Botto", "Susè Pecoraro", "Josè Sacristèn", "Agustèn Garvèe"], "countries": ["Argentina", "Spain"], "directors": ["Adolfo Aristarain"], "fullplot": "When journalist Manuel Cueto is hired to type novelist Joaquèn Gèèez's last book, his presence provokes an avalanche of feelings that bring Joaquèn to the edge of emotions and memories that had lain dormant in the solitude of the last stages of his creative life. Accustomed to years of loneliness, Joaquèn finds in the young journalist a bridge to the forgotten years of his youth in the 60's and 70's, during his wild years in Buenos Aires. Argentina had been witness to the mistakes made in the passage to adulthood, the memories of old friends, the meaning of loyalty, the influences of cinema and jazz, the taste of first love and the experiences of the many which followed and the intimate relationship with his parents, particulary with his mother Roma, a strong, intelligent woman, a supporter of his youthful ideals. It is to Roma to whom Joaquèn owes his free, bohemian spirit and the aspirations shared with her in the shadow of the memory of his father will awaken in Joaquèn the desire and the impatience to recover all he had, so far, believed lost.", "genres": ["Drama"], "imdb": {"id": 383862, "rating": 7.4, "votes": 901}, "languages": ["Spanish"], "lastupdated": "2015-08-07 01:06:57.320000000", "num_mflix_comments": 1, "plot": "Joaquèn Gèèez, a novelist in his sixties recalls his emotions, his wild years in Buenos Aires, the memories of old friends, the meaning of loyalty and the intimate relationship with his mother, Roma.", "poster": "https://m.media-amazon.com/images/M/MV5BMTIwMjQ1MjcxN15BMl5BanBnXkFtZTcwODE1NDMzMQ@@._V1_SY1000_SX677_AL_.jpg", "released": 1096588800000, "runtime": 155, "title": "Roma", "type": "movie", "writers": ["Adolfo Aristarain", "Mario Camus (screenplay)", "Kathy Saavedra (screenplay)"], "year": 2004}