{"_id": "573a13a0f29313caabd06068", "awards": {"nominations": 3, "text": "9 wins & 3 nominations.", "wins": 9}, "cast": ["Vaughan Sheffield", "Christian Patterson", "Lisa Perry", "Sam Worthington"], "countries": ["USA", "Australia"], "directors": ["Dein Perry"], "fullplot": "Born charmer Sean Okden gave up tap-dancing when he started working in the steel mill, but as that's going down the hill he grabs his chance being the only candidate in his coastal Australian home town Newcastle selected for a Sidney show. Being sacked soon just for a row with the arrogant lead dancer, he returns to find his girlfriend in bed with his brother Mitchell, and decides to start his own tap-dance group wearing hardhats, which he soon gives an original edge when the steel mill inspires him to weld metal on their shoes and dance on industrial steel, so it the metallic acoustics fit well with a local rock group. Financing their local debut is so expensive, even when the mill allows them free us of its premises -opening some acrobatic perspectives- while even his father won't allow him to touch his mother's inheritance for the project, that the 'Bootmen' need to steal the cheerleaders' podium in a televised sports match to get media attention. Sean generously helps his brother when attacked, at the price of their motorbikes, only to learn his assailant Huey and Mitch rival as car (part) thieves, but still allows him into the group - only to see his fatal fall during an attack by Huey's goons. Even when the mill announces phasing out Sean continues, now as a benefit for the sacked workers' retraining.", "genres": ["Comedy", "Drama", "Romance"], "imdb": {"id": 210584, "rating": 6.2, "votes": 1894}, "languages": ["English"], "lastupdated": "2015-08-24 00:36:34.947000000", "metacritic": 45, "plot": "Charismatic tap dancing Sean tries to find a way out of working at the steel mill. When failure brings him home he starts his own dance group wearing hardhats. He must then find inspiration in the steel mill he once tried to escape.", "poster": "https://m.media-amazon.com/images/M/MV5BMTgxMzc5OTg3OV5BMl5BanBnXkFtZTcwNjIzMjYyMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 970704000000, "runtime": 95, "title": "Bootmen", "tomatoes": {"critic": {"meter": 35, "numReviews": 17, "rating": 4.9}, "dvd": 1094515200000, "fresh": 6, "lastUpdated": 1441995907000, "production": "Twentieth Century Fox Home Entertainment", "rotten": 11, "viewer": {"meter": 70, "numReviews": 8137, "rating": 3.3}}, "type": "movie", "writers": ["Steve Worland (story)", "Hilary Linstead (story)", "Dein Perry (story)", "Steve Worland (screenplay)"], "year": 2000}