{"_id": "573a13aef29313caabd2c3af", "awards": {"nominations": 0, "text": "6 wins.", "wins": 6}, "cast": ["Rebekah Kochan", "Scott Lunsford", "Jim Verraros", "Natalie Burge"], "countries": ["USA"], "directors": ["Q. Allan Brocka"], "fullplot": "When Caleb's gay roommate Kyle reveals that quite a lot of straight woman bed with gay men (ostensibly to convert them), nice guy Caleb considers going gay to improve his unsatisfactory heterosexual sex life. He shortly thereafter falls for Gwen, whom he meets at a party, but she's got her own sexual frustrations going. She's only attracted to gay men while instantly dismissive of any straight guy approaching her, such as Caleb. Kyle quickly moves on the Caleb-is-gay campaign to benefit them, but his motives aren't entirely altruistic. He longs for Marc, a desirable hottie who's Gwen's gay roommate. Unfortunately for Kyle, Marc only has eyes for Caleb. Kyle's plan: Get Caleb to date Marc so it'll bring Caleb closer to Gwen while putting himself (Kyle) in proximity with Marc (their true targets). But as Gwen starts putting the moves on her roommate's new boyfriend, and as Kyle becomes increasingly jealous of Caleb's time spent with Marc, and as Marc persists in laying the foundations for a long-term relationship with Caleb, it becomes a question of how long the deception can continue before something gives?", "genres": ["Comedy", "Drama", "Romance"], "imdb": {"id": 372884, "rating": 6, "votes": 4620}, "languages": ["English"], "lastupdated": "2015-08-21 00:40:13.783000000", "metacritic": 28, "num_mflix_comments": 1, "plot": "After getting dumped by his slutty girlfriend, Caleb falls in love with Gwen. However, thanks to Caleb's roommate, Gwen thinks he's gay and sets him up with her roommate, Marc.", "poster": "https://m.media-amazon.com/images/M/MV5BMTY2NDI3MjMzMl5BMl5BanBnXkFtZTcwOTEwMjAzMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "UNRATED", "released": 1330041600000, "runtime": 90, "title": "Eating Out", "type": "movie", "writers": ["Q. Allan Brocka"], "year": 2004}