{"_id": "573a1395f29313caabce2d30", "awards": {"nominations": 1, "text": "3 wins & 1 nomination.", "wins": 3}, "cast": ["Uttam Kumar", "Sharmila Tagore", "Bireswar Sen", "Somen Bose"], "countries": ["India"], "directors": ["Satyajit Ray"], "fullplot": "A matinee idol Arindam Mukherjee (Uttam Kumar) is going by train to collect an acting award. On the train, he is confronted by a journalist Aditi (Sharmila Tagore) who somewhat unwillingly starts to take his interview. Arindam, won over by Aditi's naivete, starts to disclose his past, his fears and his secrets. On a parallel track, a number of sub-plots unfold (involving an advertising executive and his wife, a businessman and his family, a silent swami and a cranky old man) to reveal the hypocrisies and frailties of the society. The film reaches a climax when Arindam, overcome by his guilt, contemplates suicide and is dissuaded by Aditi. The next morning, Aditi who had surreptitiously taken notes of their conversation destroys them - not wanting to reveal Arindam's darkest secrets. When the train reaches its destination, Arindam alights and is surrounded by his fans and is back to his normal star self where there is no place for guilt, confessions and Aditi.", "genres": ["Drama"], "imdb": {"id": 60742, "rating": 8.2, "votes": 1456}, "languages": ["Bengali"], "lastupdated": "2015-09-02 00:49:34.397000000", "plot": "En route to Delhi to receive an award, a Bengali film star reevaluates his success through his fellow passengers, dreams and past experiences.", "poster": "https://m.media-amazon.com/images/M/MV5BYjg3YWU0ZjktMzFlMS00N2MzLThiMzgtOTMyZjg2ZmRkMzA5XkEyXkFqcGdeQXVyMTQ4NDY5OTc@._V1_SY1000_SX677_AL_.jpg", "released": 766195200000, "runtime": 120, "title": "Nayak: The Hero", "tomatoes": {"dvd": 1170720000000, "lastUpdated": 1439143243000, "production": "Trans World Attractions", "viewer": {"meter": 92, "numReviews": 313, "rating": 4.1}}, "type": "movie", "writers": ["Satyajit Ray (story)", "Satyajit Ray (screenplay)"], "year": 1966}