{"_id": "573a13acf29313caabd28510", "awards": {"nominations": 2, "text": "1 win & 2 nominations.", "wins": 1}, "cast": ["Bjèrn Floberg", "Kristoffer Joner", "Eva Rèse", "Sampda Sharma"], "countries": ["Norway"], "directors": ["Pèl èie"], "fullplot": "The crew of the TV show \"Real TV\" with controlling boss Gunnar on the front line will soon begin production of a reality show for which participants are selected to survive in the wilderness. Gunnar has gathered a production team of four people: The friends Lasse and Per , the Swedish girl Elin and the new girl Sara. To test his new employees, Gunnar takes them to a log cabin where he used to spend summers as a kid. The cabin is located far away from civilisation, hidden in the dark, mysterious woods. The team has to make it through a weekend, finding food that nature has to offer, and neither cellular phones nor cigarettes are allowed. When Lasse and Per find a dead body in a lake near the cottage, the group is being tested. Gunnar is suggesting that they should continue the weekend without mentioning anything to Sara and Elin about what they found. But soon the team experiences some escalating incidents which lead to paranoia, accusations and mistrust.", "genres": ["Adventure", "Horror", "Mystery"], "imdb": {"id": 356176, "rating": 6.4, "votes": 3802}, "languages": ["Norwegian", "Swedish"], "lastupdated": "2015-09-13 00:13:14.463000000", "plot": "The crew of the TV show \"Real TV\" with controlling boss Gunnar on the front line will soon begin production of a reality show for which participants are selected to survive in the ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTg2MDY1NzQ0NF5BMl5BanBnXkFtZTcwNjM0MjA0MQ@@._V1_SY1000_SX677_AL_.jpg", "released": 1045785600000, "runtime": 85, "title": "Dark Woods", "tomatoes": {"lastUpdated": 1439145922000, "viewer": {"meter": 63, "numReviews": 921, "rating": 3.4}}, "type": "movie", "writers": ["Christopher Grèndahl (screenplay)", "Pèl èie (story)"], "year": 2003}