{"_id": "573a13baf29313caabd50105", "awards": {"nominations": 7, "text": "1 win & 7 nominations.", "wins": 1}, "cast": ["Garret Dillahunt", "Michael Bowen", "Josh Coxx", "Riki Lindhome"], "countries": ["USA"], "directors": ["Dennis Iliadis"], "fullplot": "While being transported by two detectives in a car, the dangerous criminal Krug is rescued by his brother Francis and his girlfriend Sadie, and they brutally kill the detectives. Meanwhile Emma, her husband Dr. John and their seventeen year-old daughter Mari Collingwood head on vacation to their house nearby the lake. Mari borrows the family car to meet her friend Paige that is working in a store in the town. They befriend the teenager Justin in the store and he offers some marijuana to the pothead Paige in the motel where he is lodged. While they are smoking grass in Justin's room, Krug, who is Justin's father, Francis and Sadie arrive and abducts the girls. Krug drives Mari's car and she provokes a crash on a tree. Krug stabs Paige and rapes Mari; however Mari manages to escape, swimming in the lake, but Krug shoots her in the back. They walk through the isolated road in the woods and they reach Collingwood's house telling that they have just had a car accident. Emma and John welcome the strangers until they discover what has happened to their beloved daughter.", "genres": ["Horror", "Thriller"], "imdb": {"id": 844708, "rating": 6.6, "votes": 61958}, "languages": ["English"], "lastupdated": "2015-09-02 00:09:14.240000000", "metacritic": 42, "num_mflix_comments": 412, "plot": "After kidnapping and brutally assaulting two young women, a gang unknowingly finds refuge at a vacation home belonging to the parents of one of the victims: a mother and father who devise an increasingly gruesome series of revenge tactics.", "poster": "https://m.media-amazon.com/images/M/MV5BMjExMTM4MDAwOF5BMl5BanBnXkFtZTcwODcyMDIzMg@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1236902400000, "runtime": 110, "title": "The Last House on the Left", "tomatoes": {"boxOffice": "$32.7M", "consensus": "Excessive and gory, this remake lacks the intellectual punch of the 1972 original.", "critic": {"meter": 41, "numReviews": 148, "rating": 4.8}, "dvd": 1250553600000, "fresh": 61, "lastUpdated": 1442082101000, "production": "Rogue Pictures", "rotten": 87, "viewer": {"meter": 52, "numReviews": 1003154, "rating": 2.7}, "website": "http://www.thelasthouseontheleft.com/"}, "type": "movie", "writers": ["Adam Alleca (screenplay)", "Carl Ellsworth (screenplay)", "Wes Craven (earlier film)"], "year": 2009}