{"_id": "573a13def29313caabdb58af", "awards": {"nominations": 4, "text": "4 nominations.", "wins": 0}, "cast": ["Saoirse Ronan", "Cynthia Nixon", "Jason Isaacs", "David Warshofsky"], "countries": ["USA"], "directors": ["Nikole Beckwith"], "fullplot": "Seventeen years after she was abducted by a stranger named Benjamin McKay, twenty-three year old Leanne Dargon, who has been in his captivity all this time, is discovered, and eventually reunited with her biological parents, Marcy and Glen Dargon, while Ben is now in prison charged with her kidnap. Ben was able to hide her locked in his basement all this time, telling her that he saved her from world destruction, which she would have no reason not to believe. Leanne has no true recollection of her time before Ben, who renamed her Leia, and thus is the only family she has ever known. Over those seventeen years, Marcy and Glen dealt with the abduction in different ways, Marcy whose primary focus was and still is Leanne, to the point of never having returned to work. Marcy, Glen and Leia enter into their reunion with this history. So while Marcy and Glen have a memory of their six year old daughter who they want back in a young adult form, Leia only sees in front of her two strangers. Their parent/offspring relationship is thus formal and strained at best. But it takes a turn when Marcy discovers just how much of an attachment Leia still has to Ben, who Marcy only sees as the man who destroyed their family. Marcy goes to extreme measures to get back the \"Leanne\" she so desperately wants, at the possible expense of everything else in her life.", "genres": ["Drama", "Thriller"], "imdb": {"id": 2481512, "rating": 6.2, "votes": 486}, "languages": ["English"], "lastupdated": "2015-08-28 01:16:05.533000000", "metacritic": 47, "plot": "A young woman, kidnapped when she was a child, returns home to the family she barely remembers and struggles to feel at home.", "poster": "https://m.media-amazon.com/images/M/MV5BYWI4Yzc5NWUtZDkwYS00MjE4LWIyNjktZmI1OTUzMzFlMGY3XkEyXkFqcGdeQXVyNDQ4NjEwNTg@._V1_SY1000_SX677_AL_.jpg", "released": 1430524800000, "runtime": 99, "title": "Stockholm, Pennsylvania", "tomatoes": {"critic": {"meter": 30, "numReviews": 10, "rating": 4.8}, "fresh": 3, "lastUpdated": 1441904725000, "production": "Fido Features", "rotten": 7, "viewer": {"numReviews": 68, "rating": 3.2}}, "type": "movie", "writers": ["Nikole Beckwith"], "year": 2015}