{"_id": "573a13baf29313caabd50fe7", "awards": {"nominations": 27, "text": "Nominated for 1 Oscar. Another 21 wins & 27 nominations.", "wins": 22}, "cast": ["Richard Jenkins", "Haaz Sleiman", "Danai Gurira", "Hiam Abbass"], "countries": ["USA"], "directors": ["Tom McCarthy"], "fullplot": "In Connecticut, lonely widowed Professor Walter Vale has a boring life. He teaches only one class at the local college and is trying to learn how to play the piano, despite not having the necessary musical talent. Walter is assigned to attend a conference about Global Policy and Development at New York University, where he is to give a lecture about a paper on which he is co-author. When he arrives at his apartment in New York, he finds Tarek Khalil, a Syrian musician, and Zainab, a Senegalese street vendor, living there. He sympathizes with the situation of the illegal immigrants and invites the couple to stay with him. Tarek invites him to go to his gig at Jules Live Jazz. Walter is fascinated with his African drum and Tarek offers to teach Walter to play the drum. However, after an incident in the subway, Tarek is arrested by the police and sent to a detention center for illegal immigrants. Walter has just hired a lawyer to defend Tarek when, out of the blue, Tarek's mother Mouna arrives at the apartment from Michigan. He invites her to stay in Tarek's room and while trying to get Tarek released, Walter and Mouna get close to each other and he finds reasons to feel life can be exciting and worth living again.", "genres": ["Drama"], "imdb": {"id": 857191, "rating": 7.7, "votes": 35682}, "languages": ["English", "French", "Arabic", "Romanian"], "lastupdated": "2015-09-16 02:01:49.667000000", "metacritic": 79, "plot": "A college professor travels to New York City to attend a conference and finds a young couple living in his apartment.", "poster": "https://m.media-amazon.com/images/M/MV5BMTIzNTg3NzkzNV5BMl5BanBnXkFtZTcwNzMwMjU2MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1211500800000, "runtime": 104, "title": "The Visitor", "tomatoes": {"boxOffice": "$9.2M", "consensus": "The Visitor is a heartfelt, humanistic drama that deftly explores identity, immigration, and other major post-9/11 issues.", "critic": {"meter": 89, "numReviews": 116, "rating": 7.6}, "dvd": 1233014400000, "fresh": 103, "lastUpdated": 1440613558000, "production": "Overture Films", "rotten": 13, "viewer": {"meter": 84, "numReviews": 126730, "rating": 3.6}, "website": "http://www.thevisitorfilm.com/"}, "type": "movie", "writers": ["Tom McCarthy"], "year": 2007}