{"_id": "573a139af29313caabcefecf", "awards": {"nominations": 10, "text": "1 win & 10 nominations.", "wins": 1}, "cast": ["Michael J. Fox", "Trini Alvarado", "Peter Dobson", "John Astin"], "countries": ["New Zealand", "USA"], "directors": ["Peter Jackson"], "fullplot": "After a car accident in which his wife, Debra, was killed and he was injured, Frank Bannister develops psychic abilities allowing him to see, hear, and communicate with ghosts. After losing his wife, he then gave up his job as an architect, letting his unfinished \"dream house\" sit incomplete for years, and put these skills to use by befriending a few ghosts and getting them to haunt houses in the area to drum up work for his ghostbusting business; Then Frank proceeds to \"exorcise\" the houses for a fee. But when he discovers that an entity resembling the Grim Reaper is killing people, marking numbers on their forehead beforehand, Frank tries to help the people whom the Reaper is after!", "genres": ["Comedy", "Horror"], "imdb": {"id": 116365, "rating": 7.2, "votes": 64604}, "languages": ["English"], "lastupdated": "2015-08-21 00:13:13.483000000", "plot": "After a tragic car accident that killed his wife, a man discovers he can communicate with the dead to con people but when a demonic spirit appears, he may be the only one who can stop it from killing the living and the dead.", "poster": "https://m.media-amazon.com/images/M/MV5BNGZlN2Q2NmYtODdjNi00NjJlLWI5NzYtN2Y5NjIzYWUxOWU5XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 837734400000, "runtime": 110, "title": "The Frighteners", "tomatoes": {"consensus": "Boasting top-notch special effects and exuberant direction from Peter Jackson, The Frighteners is visually striking but tonally uneven.", "critic": {"meter": 64, "numReviews": 36, "rating": 6.2}, "dvd": 903398400000, "fresh": 23, "lastUpdated": 1439835337000, "production": "Universal", "rotten": 13, "viewer": {"meter": 71, "numReviews": 62554, "rating": 3.4}}, "type": "movie", "writers": ["Fran Walsh", "Peter Jackson"], "year": 1996}