{"_id": "573a13a5f29313caabd1564b", "awards": {"nominations": 25, "text": "Nominated for 1 Oscar. Another 10 wins & 25 nominations.", "wins": 11}, "cast": ["Daveigh Chase", "Chris Sanders", "Tia Carrere", "David Ogden Stiers"], "countries": ["USA"], "directors": ["Dean DeBlois", "Chris Sanders"], "fullplot": "In a place far, far away, illegal genetic experiment #626 is detected: Ruthless scientist Dr. Jumba Jookiba has created a strong, intelligent, nearly indestructible and aggressive being with only one known weakness: The high density of his body makes it impossible for the experiment to swim in water. The scientist is sentenced to jail by the Grand Council of the Galactic Federation. The experiment is supposed to be transported to a prison asteroid, yet manages to escape Captain Gantu, who was supposed to deliver him there. With a stolen police cruiser (the red one), the destructive being races towards a little and already doomed planet: Earth. Stranded on Hawaii, experiment #626 can't actually do much harm: water all around, no big cities and two well-equipped representatives of the Galactic Federation already following close behind to catch him again. But Dr. Jookiba and the Earth expert Pleakley never could have guessed that earth girl Lilo adopts the experiment as dog, gives him the name Stitch and actually causes an emotional development in the little beast. Her dysfunctional family, consisting only of Lilo and her sister Nani, is about to be ripped apart by social worker Cobra Bubbles. Stitch as the new family member brings quite some action into all their lifes, and after a while, not even Pleakley and Dr. Jookiba can recognize their former target. But how shall they bring the news of failure to the Grand Councilwoman without being punished?", "genres": ["Animation", "Adventure", "Comedy"], "imdb": {"id": 275847, "rating": 7.2, "votes": 102564}, "languages": ["English", "Hawaiian"], "lastupdated": "2015-09-10 17:59:40.957000000", "metacritic": 73, "num_mflix_comments": 1, "plot": "A Hawaiian girl adopts an unusual pet who is actually a notorious extra-terrestrial fugitive from the law.", "poster": "https://m.media-amazon.com/images/M/MV5BMTkwOTU5MTA2M15BMl5BanBnXkFtZTYwMjYyNTc3._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 1024617600000, "runtime": 85, "title": "Lilo & Stitch", "tomatoes": {"boxOffice": "$145.8M", "consensus": "Edgier than traditional Disney fare, Lilo and Stitch explores issues of family while providing a fun and charming story.", "critic": {"meter": 86, "numReviews": 145, "rating": 7.3}, "dvd": 1038873600000, "fresh": 124, "lastUpdated": 1442511397000, "production": "Buena Vista Distribution Compa", "rotten": 21, "viewer": {"meter": 76, "numReviews": 465039, "rating": 3.3}, "website": "http://disney.go.com/disneypictures/liloandstitch"}, "type": "movie", "writers": ["Chris Sanders (idea)", "Chris Sanders", "Dean DeBlois"], "year": 2002}