{"_id": "573a139cf29313caabcf6ecd", "awards": {"nominations": 1, "text": "1 win & 1 nomination.", "wins": 1}, "cast": ["Jared Leto", "Alicia Witt", "Rebecca Gayheart", "Michael Rosenbaum"], "countries": ["USA", "France"], "directors": ["Jamie Blanks"], "fullplot": "After a bravura opening sequence featuring Natasha Gregson Wagner getting slaughtered by the killer with an ax hiding in the backseat of her car, Urban Legend tells the story of a group of pretty college students at a remote New England university. The focus of the story is Natalie, a beautiful, academically-gifted student at the fictional Pendleton University. Natalie and her friends are all involved in the Folklore class being taught by Professor Wexler. Wexler regales his class with urban legends, which include Pendleton's own urban legend about a Psych professor who murdered six students at Stanley Hall 25 years ago. Natalie is the first one to suspect there's a killer on campus, especially after she has ties to all of the victims. First, it's her high school friend, a guy she's in the woods with at night, her roommate... No one, including her friends, Wexler, Dean Adams and security guard, of course, believes her until it's too late and everyone begins to die according to famous urban legends, and Natalie believes it's all tied to a dark and horrible secret from her past. Now she finds that she and her friends are part of the killer's ultimate urban legend--the story of their own horrific deaths...", "genres": ["Horror", "Mystery", "Thriller"], "imdb": {"id": 146336, "rating": 5.5, "votes": 45062}, "languages": ["English"], "lastupdated": "2015-09-07 00:01:24.753000000", "metacritic": 35, "num_mflix_comments": 2, "plot": "A college student suspects a series of bizarre deaths are connected to certain urban legends.", "poster": "https://m.media-amazon.com/images/M/MV5BYWRlNDRiNWMtMjU4Yy00NDc5LWI1YTUtODNmN2ViOTMzN2EwXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 906681600000, "runtime": 99, "title": "Urban Legend", "tomatoes": {"consensus": "Elements of Scream reappear in a vastly inferior vehicle.", "critic": {"meter": 20, "numReviews": 51, "rating": 4.3}, "dvd": 990489600000, "fresh": 10, "lastUpdated": 1442343786000, "production": "TriStar Pictures", "rotten": 41, "viewer": {"meter": 37, "numReviews": 164057, "rating": 2.7}, "website": "http://www.spe.sony.com/movies/urbanlegend"}, "type": "movie", "writers": ["Silvio Horta"], "year": 1998}