{"_id": "573a13d4f29313caabd97a39", "awards": {"nominations": 0, "text": "2 wins.", "wins": 2}, "cast": ["Stephen Lang", "Brittany Curran", "Gage Golightly", "Brett Dier"], "countries": ["USA"], "directors": ["Marcus Nispel"], "fullplot": "From the director of Friday the 13th and The Texas Chainsaw Massacre and the producers of Paranormal Activity and Insidious comes new Horror. During an all-night, drug-fueled party at an abandoned asylum known for the horrific treatment of its patients, a group of ordinary teens decide to experiment with the occult, mysteriously leading to a violent possession. In an effort to find help, the group rushes to escape, only to find themselves locked inside with no means of communication. Tempers flare, trusts are broken and in attempt to save one of their friends possessed by the demon, the amateurs try to perform an exorcism. Instead of solving the problem, and unbeknownst to them, they unleash an even more powerful and vengeful spirit, one with a distinct motive and which wants them all dead. The teen's only chance of survival is to uncover the asylum's deep mysteries and find a way out before it's too late. Their search for answers uncovers the asylum's dark past and the terrible secrets that are harbored within its walls. What started as a harmless paranormal experiment turns into a fast paced bloody paranormal nightmare with unexpected consequences.", "genres": ["Horror", "Thriller"], "imdb": {"id": 1945044, "rating": 4.6, "votes": 1735}, "languages": ["English"], "lastupdated": "2015-09-01 00:15:30.490000000", "num_mflix_comments": 2, "plot": "A group of teenagers accidentally release an evil spirit that starts to possess them one by one.", "poster": "https://m.media-amazon.com/images/M/MV5BODA3NjAxMTIzN15BMl5BanBnXkFtZTgwODY0MDM1NTE@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1439337600000, "runtime": 91, "title": "Exeter", "tomatoes": {"lastUpdated": 1442079833000, "production": "Viva Pictures", "viewer": {"meter": 30, "numReviews": 291, "rating": 2.6}, "website": "http://https://www.facebook.com/ExeterMovie"}, "type": "movie", "writers": ["Kirsten McCallion", "Kirsten McCallion", "Marcus Nispel (story)"], "year": 2015}