{"_id": "573a13b6f29313caabd48912", "awards": {"nominations": 2, "text": "2 nominations.", "wins": 0}, "cast": ["Kay Panabaker", "Danielle Panabaker", "Alexandra Krosney", "Marquise C. Brown"], "countries": ["USA"], "directors": ["Paul Hoen"], "fullplot": "Freshman Jamie Bartlett is frustrated with high-school life. She wonders what it would be like to be popular, where Marco the hunk might notice her and snooty Sawyer would remember her name. To escape the pressures of school, Jamie retreats to her journal, weaving a tale about teen heroine Isabella (\"Is\"), who's beautiful, self-assured, and popular and can effortlessly zap any pesky person out of her way. When she accidentally turns in her journal as a homework project, Jamie wins a writing contest and finds her books on shelves nationwide. Suddenly she's caught up in the whirlwind of photo shoots and guest appearances and starts to lose touch with her friends and herself. Meanwhile, Is becomes a real presence for Jamie, though no one else can see her. As Jamie's stardom grows, her literary alter ego pops in and out of her life to influence every move she makes. Jamie eventually becomes disenchanted with her new life and in the end must decide whether popularity is worth sacrificing self-respect and true friendship.", "genres": ["Comedy", "Drama", "Family"], "imdb": {"id": 494716, "rating": 5.7, "votes": 3559}, "languages": ["English"], "lastupdated": "2015-08-19 00:18:57.360000000", "num_mflix_comments": 3, "plot": "A shy and retiring high school student develops a peculiar alter ego that changes her life forever.", "poster": "https://m.media-amazon.com/images/M/MV5BMTQxOTg4MDMwNF5BMl5BanBnXkFtZTgwOTE5OTkwMzE@._V1_SY1000_SX677_AL_.jpg", "rated": "TV-G", "released": 1153440000000, "runtime": 84, "title": "Read It and Weep", "tomatoes": {"dvd": 1168905600000, "lastUpdated": 1440009537000, "viewer": {"meter": 59, "numReviews": 21603, "rating": 3.4}}, "type": "movie", "writers": ["Patrick J. Clifton (teleplay)", "Beth Rigazio (teleplay)", "Julia DeVillers (book)"], "year": 2006}