{"_id": "573a13c1f29313caabd6362a", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Henry Phillips", "Ellen Ratner", "Wade Kelley", "Matthew Walker"], "countries": ["USA"], "directors": ["Gregori Viens"], "fullplot": "Winner of the Audience Award at the Slamdance Film Festival, this uproarious and smart new comedy tells the story of Henry Phillips, a hapless modern day troubadour who grinds his way through the heartland, living out of his car and singing his twisted satirical songs to anyone who will listen. After a booking mishap involving a Christian fundraiser, he decides he's hit rock bottom. Seeking to shake things up, he moves to L.A. where his luck changes overnight. Thanks less to his inept manager than to a wild case of mistaken identity, he falls backwards into a string of packed gigs, a record deal and even the promise of love. But he who lives by the whimsy of show business dies by it, and reality hits him like a fist in the face: an innocent miscommunication over a bagel brands him a neo-Nazi in the world of tabloid journalism. Luckily, somewhere between rock bottom and nowhere lies the perfect terrain for his dark and hilarious songs. Hailed by comedy icon Sarah Silverman as \"the best movie about comedy I've seen so far,\" this hilarious and evocative film is \"totally primed for a fervent cult following.\" -- A.V. Club", "genres": ["Comedy"], "imdb": {"id": 1192624, "rating": 7.2, "votes": 639}, "languages": ["English"], "lastupdated": "2015-08-21 01:02:41.437000000", "metacritic": 62, "num_mflix_comments": 2, "plot": "Winner of the Audience Award at the Slamdance Film Festival, this uproarious and smart new comedy tells the story of Henry Phillips, a hapless modern day troubadour who grinds his way ...", "poster": "https://m.media-amazon.com/images/M/MV5BNDE4OTI3MDg3MV5BMl5BanBnXkFtZTcwMTM5Mzk5Mw@@._V1_SY1000_SX677_AL_.jpg", "released": 1287705600000, "runtime": 91, "title": "Punching the Clown", "tomatoes": {"critic": {"meter": 86, "numReviews": 14, "rating": 6.2}, "dvd": 1295308800000, "fresh": 12, "lastUpdated": 1442254809000, "production": "Level 33 Entertainment", "rotten": 2, "viewer": {"meter": 86, "numReviews": 2941, "rating": 3.8}, "website": "http://www.punchingtheclownmovie.com/"}, "type": "movie", "writers": ["Henry Phillips", "Gregori Viens"], "year": 2009}