{"_id": "573a1396f29313caabce4ecc", "awards": {"nominations": 0, "text": "Nominated for 1 Oscar. Another 1 win.", "wins": 2}, "cast": ["Robert De Niro", "Michael Moriarty", "Vincent Gardenia", "Phil Foster"], "countries": ["USA"], "directors": ["John D. Hancock"], "fullplot": "Henry Wiggen (Author to his friends) and Bruce Pearson are members of the New York Mammoths major league baseball team - Author the star pitcher, Bruce the catcher who never quite lived up to his potential - friends, and roommates when they're on the road. During the off season, Bruce is diagnosed with a terminal case of Hodgkin's disease. Author is the only person on the team who knows of Bruce's illness, with neither planning on telling anyone. Author takes extraordinary measures to ensure that he is playing ball with Bruce during what will probably be Bruce's final season before he can no longer play. Author looks after Bruce in part because Bruce is mentally a simple man who can easily be taken advantage of, especially by his opportunistic girlfriend Katie. As the season progresses, the team isn't quite gelling, despite being the best team on paper. But as information comes to light, the dynamic on the team changes to make it a memorable end of the season especially for Bruce, who finishes on his own terms.", "genres": ["Drama", "Sport"], "imdb": {"id": 69765, "rating": 7, "votes": 4308}, "languages": ["English", "Spanish"], "lastupdated": "2015-08-26 00:53:13.807000000", "num_mflix_comments": 2, "plot": "The story of the friendship between a star pitcher, wise to the world, and a half-wit catcher, as they cope with the catcher's terminal illness through a baseball season.", "poster": "https://m.media-amazon.com/images/M/MV5BYzQ5ZTJkNzItYmY5OS00ZGU0LWIwNDgtYzU5YjI1YWJlMDM3XkEyXkFqcGdeQXVyMjI4MjA5MzA@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 263779200000, "runtime": 96, "title": "Bang the Drum Slowly", "tomatoes": {"consensus": "Bang the Drum Slowly is a touching melodrama that explores the inner workings of a baseball club and its players' personalities with remarkable depth.", "critic": {"meter": 88, "numReviews": 26, "rating": 7.4}, "dvd": 1046736000000, "fresh": 23, "lastUpdated": 1441132602000, "production": "Paramount Pictures", "rotten": 3, "viewer": {"meter": 62, "numReviews": 3718, "rating": 3.4}}, "type": "movie", "writers": ["Mark Harris (novel)", "Mark Harris (screenplay)"], "year": 1973}