{"_id": "573a1399f29313caabced630", "awards": {"nominations": 6, "text": "3 wins & 6 nominations.", "wins": 3}, "cast": ["Sheryl Lee", "Ray Wise", "Mèdchen Amick", "Dana Ashbrook"], "countries": ["France", "USA"], "directors": ["David Lynch"], "fullplot": "Essentially a prequel to David Lynch and Mark Frost's earlier TV series \"Twin Peaks\". The first half-hour or so concerns the investigation by FBI Agent Chet Desmond (Chris Isaak) and his partner Sam Stanley (Kiefer Sutherland) into the murder of night-shift waitress Teresa Banks in the small Washington state town of Deer Meadow. When Desmond finds a mysterious clue to the murder, he inexplicably disappears. The film then cuts to one year later in the nearby town of Twin Peaks and follows the events during the last week in the life of Laura Palmer (Sheryl Lee) a troubled teenage girl with two boyfriends; the hot-tempered rebel Bobby Briggs (Dana Ashbrook) and quiet biker James Hurley (James Marshall), her drug addiction, and her relationship with her difficult (and possible schizophrenic) father Leland (Ray Wise), a story in which her violent murder was later to motivate much of the TV series. Contains a considerable amount of sex, drugs, violence, very loud music and inexplicable imagery.", "genres": ["Horror", "Mystery", "Thriller"], "imdb": {"id": 105665, "rating": 7.2, "votes": 49587}, "languages": ["English"], "lastupdated": "2015-08-18 01:13:25.890000000", "metacritic": 28, "num_mflix_comments": 1, "plot": "A young FBI agent disappears while investigating a murder miles from Twin Peaks that may be related to the future murder of Laura Palmer; the last week of the life of Laura Palmer is chronicled.", "poster": "https://m.media-amazon.com/images/M/MV5BMzc5ODcyNTYtMDAwNy00MDhjLWFmOWUtNGVhMDRlYjE1YzNjXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 714960000000, "runtime": 135, "title": "Twin Peaks: Fire Walk with Me", "tomatoes": {"consensus": "For better or worse, Twin Peaks: Fire Walk With Me is every bit as strange and twisted as you'd expect from David Lynch.", "critic": {"meter": 62, "numReviews": 63, "rating": 6.4}, "dvd": 1014681600000, "fresh": 39, "lastUpdated": 1440011178000, "production": "New Line Cinema", "rotten": 24, "viewer": {"meter": 78, "numReviews": 41728, "rating": 3.6}}, "type": "movie", "writers": ["David Lynch", "Robert Engels", "Mark Frost (television series Twin Peaks)", "David Lynch (television series Twin Peaks)"], "year": 1992}