{"_id": "573a13a6f29313caabd17d6a", "awards": {"nominations": 24, "text": "Nominated for 2 Oscars. Another 23 wins & 24 nominations.", "wins": 25}, "cast": ["Bèatrice Bonifassi", "Lina Boudreau", "Michèle Caucheteux", "Jean-Claude Donda"], "countries": ["France", "Belgium", "Canada", "UK", "Latvia"], "directors": ["Sylvain Chomet"], "fullplot": "Madame Souza, an elderly woman, instills in her grandson Champion (for who she acts as his guardian) a love of cycling. As a young man, he does become a dedicated road racer with his grandmother as his trainer. During a mountainous leg of the Tour de France in which Champion is racing, he goes missing. Evidence points to him being kidnapped. Indeed, he and two of his competitors were kidnapped, the kidnappers who want to use the threesome's unique skills for nefarious purposes. With Champion's overweight and faithful pet dog Bruno at her side, Madame Souza goes looking for Champion. Their trek takes them overseas to the town of Belleville. Without any money, Madame Souza and Bruno are befriended and taken in by three eccentric elderly women, who were once the renowned jazz singing group The Triplets of Belleville. The triplets help Madame Souza and Bruno try to locate and rescue Champion.", "genres": ["Animation", "Comedy", "Drama"], "imdb": {"id": 286244, "rating": 7.8, "votes": 39521}, "languages": ["French", "Portuguese"], "lastupdated": "2015-08-15 00:59:25.677000000", "metacritic": 91, "num_mflix_comments": 2, "plot": "When her grandson is kidnapped during the Tour de France, Madame Souza and her beloved pooch Bruno team up with the Belleville Sisters--an aged song-and-dance team from the days of Fred Astaire--to rescue him.", "poster": "https://m.media-amazon.com/images/M/MV5BMjAzMzUxNzc5M15BMl5BanBnXkFtZTgwODc2NDE2MDE@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1076630400000, "runtime": 78, "title": "The Triplets of Belleville", "tomatoes": {"dvd": 1108425600000, "lastUpdated": 1440356915000, "viewer": {"numReviews": 52, "rating": 4.5}}, "type": "movie", "writers": ["Sylvain Chomet"], "year": 2003}