{"_id": "573a13b8f29313caabd4bd42", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["David Koechner", "Carl Weathers", "Melora Hardin", "Matthew Lawrence"], "countries": ["USA"], "directors": ["Tom Brady"], "fullplot": "Lambeau Fields lives a middle-class lifestyle in America along with his wife, Barb, and a gorgeous daughter, Michelle, who he has brought up as a son. Lambeau is a failure and has virtually given up on his career as a football coach. Then his friend, Freddie Wiseman, encourages him to re-enter this field, and he does so by re-locating to Plainfolk in Texas and joins the Heartland State University. It is here he will meet some of the most pathetic players, and quite disillusioned he goes about to find new-comers. He finds a kicker in Jasminder Featherfoot, provided of course, he keeps her involvement secret from the rest of her family. Then he finds Lance Truman, whose drag queen dad has brought him up more like a tom-girl. With these additions and others Lambeau sets forth to include his team in the next Super...Er...Toilet Bowl 2 series, and it is here that he will find that Lance fumbles a lot; Barb is not quite faithful as she seems; he will soon be in jail for Indecent Exposure; Michelle has a black boyfriend; and Freddie has a hidden agenda.", "genres": ["Comedy", "Sport"], "imdb": {"id": 790804, "rating": 4.1, "votes": 9698}, "languages": ["English"], "lastupdated": "2015-09-10 17:14:55.677000000", "metacritic": 25, "plot": "A comedy that spoofs the inspirational sports movies, The Comebacks tells the story of an out-of-luck coach, Lambeau Fields, who takes a rag-tag bunch of college misfits and drives them towards the football championships. In the process, this life-long loser discovers that he is a winner after all by redeeming himself, saving his relationship with his family and friends, and finding that there is...", "poster": "https://m.media-amazon.com/images/M/MV5BNDI5OTAxMjc2OV5BMl5BanBnXkFtZTcwMDMzMDU1MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1192752000000, "runtime": 84, "title": "The Comebacks", "tomatoes": {"boxOffice": "$13.3M", "consensus": "Full of groin-centric humor and tired sports clichès, The Comebacks is poor even by parody movie standards.", "critic": {"meter": 9, "numReviews": 34, "rating": 2.7}, "dvd": 1201564800000, "fresh": 3, "lastUpdated": 1440356196000, "production": "Fox Atomic", "rotten": 31, "viewer": {"meter": 33, "numReviews": 120326, "rating": 2.7}, "website": "http://www.foxatomic.com/comebacks"}, "type": "movie", "writers": ["Ed Yeager (screenplay)", "Joey Gutierrez (screenplay)", "John Aboud (story)", "Michael Colton (story)", "Adam Jay Epstein (story)", "Andrew Jacobson (story)"], "year": 2007}