{"_id": "573a1395f29313caabce1928", "awards": {"nominations": 6, "text": "Won 1 Oscar. Another 2 wins & 6 nominations.", "wins": 3}, "cast": ["Natalie Wood", "Pat Hingle", "Audrey Christie", "Barbara Loden"], "countries": ["USA"], "directors": ["Elia Kazan"], "fullplot": "It's 1928 in oil rich southeast Kansas. High school seniors Bud Stamper and Deanie Loomis are in love with each other. Bud, the popular football captain, and Deanie, the sensitive soul, are \"good\" kids who have only gone as far as kissing. Unspoken to each other, they expect to get married to each other one day. But both face pressures within the relationship, Bud who has the urges to go farther despite knowing in his heart that if they do that Deanie will end up with a reputation like his own sister, Ginny Stamper, known as the loose, immoral party girl, and Deanie who will do anything to hold onto Bud regardless of the consequences. They also face pressures from their parents who have their own expectation for their offspring. Bud's overbearing father, Ace Stamper, the local oil baron, does not believe Bud can do wrong and expects him to go to Yale after graduation, which does not fit within Bud's own expectations for himself. And the money and image conscious Mrs. Loomis just wants Deanie to get married as soon as possible to Bud so that Deanie will have a prosperous life in a rich family. When Bud makes a unilateral decision under these pressures, it leads to a path which affects both his and Deanie's future.", "genres": ["Drama", "Romance"], "imdb": {"id": 55471, "rating": 7.8, "votes": 12634}, "languages": ["English"], "lastupdated": "2015-08-26 00:49:38.307000000", "num_mflix_comments": 4, "plot": "A fragile Kansas girl's unrequited and forbidden love for a handsome young man from the town's most powerful family drives her to heartbreak and madness.", "poster": "https://m.media-amazon.com/images/M/MV5BM2Y4YzczMjItMjU0NC00N2ZjLWFmZTEtNTk0YmRkNzY2MTJkL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_SY1000_SX677_AL_.jpg", "rated": "UNRATED", "released": -259632000000, "runtime": 124, "title": "Splendor in the Grass", "tomatoes": {"critic": {"meter": 85, "numReviews": 13, "rating": 7.2}, "dvd": 950572800000, "fresh": 11, "lastUpdated": 1441912486000, "production": "Warner Home Video", "rotten": 2, "viewer": {"meter": 90, "numReviews": 8352, "rating": 4.1}}, "type": "movie", "writers": ["William Inge"], "year": 1961}