{"_id": "573a13a9f29313caabd1f6cb", "awards": {"nominations": 3, "text": "2 wins & 3 nominations.", "wins": 2}, "cast": ["Milla Jovovich", "Sienna Guillory", "Oded Fehr", "Thomas Kretschmann"], "countries": ["Germany", "France", "UK", "Canada", "USA"], "directors": ["Alexander Witt"], "fullplot": "Alice awakens from a terrible sleep to find her worst fears realized--the bloodthirsty Undead, which she and the now-annihilated squad of elite military fought to destroy, have been unleashed on the city that surrounds the secret facility of the Umbrella Corporation. Discovering she was an Umbrella experiment, Alice has been bio-genetically enhanced with new strengths, senses and dexterity--and she will need them. In the heart of the ravaged Raccoon City, a small group of uninfected people, including Jill Valentine, a recently demoted member of Umbrella Corp's elite Special Tactics and Rescue Services team, and S.T.A.R.S team leader Carlos Oliveira, fight for their lives against swarms of Undead and the deadlier and faster Lickers. Running out of luck and resources, the group is rescued by Alice, and they begin to wage an exhilarating battle to survive and escape before the Umbrella Corporation erases its experiment from the face of the earth. Their only hope lies somewhere within Raccoon City--Dr Charles Ashford, one of the leading scientists for the Umbrella Corporation, will help Alice and the others escape the city safely--if they find his daughter. Angie Ashford became separated from her father and now hides in fear. Alice, Jill and Carlos will have to fight their way through an army of Undead to save her. All the while, a secret weapon code-named Nemesis has been experimentally altered with greater modifications than Alice and has been programmed to track and destroy them. They will need all their strengths and skills to fight the battle of their lives against the mindless evil that has infected the city and the powerful forces that unleashed it on mankind.", "genres": ["Action", "Horror", "Sci-Fi"], "imdb": {"id": 318627, "rating": 6.2, "votes": 141858}, "languages": ["English"], "lastupdated": "2015-09-14 11:06:57.333000000", "metacritic": 35, "num_mflix_comments": 1, "plot": "Alice awakes in Raccoon City, only to find it has become infested with zombies and monsters. With the help of Jill Valentine and Carlos Olivera, Alice must find a way out of the city before it is destroyed by a nuclear missile.", "poster": "https://m.media-amazon.com/images/M/MV5BMTc1NTUxMzk0Nl5BMl5BanBnXkFtZTcwNDQ1MDIzMw@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1094774400000, "runtime": 94, "title": "Resident Evil: Apocalypse", "tomatoes": {"boxOffice": "$50.7M", "consensus": "Resident Evil: Apocalypse has lots of action, but not much in terms of plot or creativity.", "critic": {"meter": 21, "numReviews": 124, "rating": 3.9}, "dvd": 1188864000000, "fresh": 26, "lastUpdated": 1442079980000, "production": "Sony Pictures", "rotten": 98, "viewer": {"meter": 61, "numReviews": 406974, "rating": 3.3}, "website": "http://www.sonypictures.com/movies/residentevilapocalypse/"}, "type": "movie", "writers": ["Paul W.S. Anderson"], "year": 2004}