{"_id": "573a1394f29313caabcdf1ad", "awards": {"nominations": 1, "text": "Nominated for 1 Oscar. Another 3 wins & 1 nomination.", "wins": 4}, "cast": ["Carlo Battisti", "Maria Pia Casilio", "Lina Gennari", "Ileana Simova"], "countries": ["Italy"], "directors": ["Vittorio De Sica"], "fullplot": "Umberto Ferrari, aged government-pensioner, attends a street demonstration held by his fellow pensioners. The police dispense the crowd and Umberto returns to his cheap furnished room which he shares with his dog Flick. Umberto's lone friend is Maria, servant of the boarding house. She is a simple girl who is pregnant by one of two soldiers and neither will admit to being the father. When Umberto's landlady Antonia demands the rent owed her and threatens eviction if she is not paid, Umberto tries desperately to raise the money by selling his books and watch. He is too proud to beg in the streets and can not get a loan from any of his acquaintances. He contracts a sore throat, is admitted to a hospital and this puts a delay on his financial difficulty. Discharged, he finds that his dog is gone and, following a frantic search, locates him in the city dog pound. His room has been taken over by the landlady and the now-homeless Unberto determines to find a place for his beloved dog, and then kill himself. Unsuccessful, he resolves that his dog must die with him and he stands in the path of a train, with his dog in his arms.", "genres": ["Drama"], "imdb": {"id": 45274, "rating": 8.2, "votes": 15468}, "languages": ["Italian"], "lastupdated": "2015-09-13 00:05:23.450000000", "metacritic": 92, "num_mflix_comments": 2, "plot": "A elderly man and his dog struggle to survive on his government pension in Rome.", "poster": "https://m.media-amazon.com/images/M/MV5BMTk0ZjgwOTEtYjY1MC00NGQ1LWI2YjAtYmM1MWNlMGZkM2NmXkEyXkFqcGdeQXVyMTIyNzY1NzM@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": -446601600000, "runtime": 89, "title": "Umberto D.", "tomatoes": {"critic": {"meter": 96, "numReviews": 28, "rating": 8.9}, "dvd": 1058745600000, "fresh": 27, "lastUpdated": 1441303340000, "production": "Nelson Entertainment", "rotten": 1, "viewer": {"meter": 93, "numReviews": 6623, "rating": 4.3}}, "type": "movie", "writers": ["Cesare Zavattini (story)"], "year": 1952}