{"_id": "573a1394f29313caabcded8e", "awards": {"nominations": 2, "text": "Won 1 Oscar. Another 1 nomination.", "wins": 0}, "cast": ["Richard Derr", "Barbara Rush", "Peter Hansen", "John Hoyt"], "countries": ["USA"], "directors": ["Rudolph Matè"], "fullplot": "David Randall is a carefree ladies man and skilled pilot who finds he has been let in on the greatest and most terrible secret in the world when he is paid to deliver some mysterious pictures from one eminent astronomer to another. The recipient, Dr. Hendron, confirms the awful findings of the sender: the star Bellus will collide with Earth and wipe out all of humanity. Despite widespread disbelief, two philanthropists give Dr. Hendron some of the money he needs to build a rocket ship that will, at least theoretically, take them to Zyra, a planet which is orbiting Bellus which may or may not be habitable for humans. The rest of the money comes from Sydney Stanton, a wheelchair-bound old man, who insists he come along, despite the severe limitations on the number of passengers and amount of cargo. Meanwhile, as doomsday approaches, Randall is surprised to find himself in a love triangle with Dr. Hendron's daughter and her fiancè. Humanity is in peril, and only a modern-day Noah's ark, and the continued need of a man for a woman, can save it.", "genres": ["Family", "Sci-Fi"], "imdb": {"id": 44207, "rating": 6.8, "votes": 4799}, "languages": ["English", "French", "Portuguese", "Spanish"], "lastupdated": "2015-08-05 01:11:30.430000000", "num_mflix_comments": 1, "plot": "As a new star and planet hurtle toward a doomed Earth, a small group of survivalists frantically work to complete the rocket which will take them to their new home.", "poster": "https://m.media-amazon.com/images/M/MV5BNDE2MGEwZDMtNGU3OC00NTA5LWJkMmQtMTg0ODlkM2Y0YTFhL2ltYWdlXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "APPROVED", "released": -570844800000, "runtime": 83, "title": "When Worlds Collide", "tomatoes": {"critic": {"meter": 77, "numReviews": 22, "rating": 6}, "dvd": 1001376000000, "fresh": 17, "lastUpdated": 1441912565000, "production": "Paramount Pictures", "rotten": 5, "viewer": {"meter": 63, "numReviews": 3050, "rating": 3.4}}, "type": "movie", "writers": ["Sydney Boehm (screenplay)", "Edwin Balmer (novel)", "Philip Wylie (novel)"], "year": 1951}