{"_id": "573a13cff29313caabd893dc", "awards": {"nominations": 3, "text": "1 win & 3 nominations.", "wins": 1}, "cast": ["Sheri Moon Zombie", "Bruce Davison", "Jeff Daniel Phillips", "Judy Geeson"], "countries": ["UK", "Canada", "USA"], "directors": ["Rob Zombie"], "fullplot": "Heidi, a blond rock chick, DJs at a local radio station, and together with the two Hermans (Whitey and Munster) forms part of the \"Big H Radio Team.\" A mysterious wooden box containing a vinyl record arrives for Heidi, a gift of the Lords. She assumes it's a rock band on a mission to spread their word. As Heidi and Whitey play the Lords' record, it starts to play backwards, and Heidi experiences a flashback to a past trauma. Later, Whitey plays the Lords' record, dubbing them the Lords of Salem, and to his surprise, the record plays normally and is a massive hit with his listeners. The arrival of another wooden box from the Lords presents the Big H team with free tickets, posters and records to host a gig in Salem. Soon, Heidi and her cohorts are far from the rock spectacle they're expecting. The original Lords of Salem are returning and they're out for blood.", "genres": ["Horror", "Thriller"], "imdb": {"id": 1731697, "rating": 5.1, "votes": 18285}, "languages": ["English"], "lastupdated": "2015-08-31 00:27:42.890000000", "metacritic": 57, "plot": "Heidi, a radio DJ, is sent a box containing a record -- a \"gift from the Lords.\" The sounds within the grooves trigger flashbacks of her town's violent past. Is Heidi going mad, or are the Lords back to take revenge on Salem, Massachusetts?", "poster": "https://m.media-amazon.com/images/M/MV5BMjA2NTc5Njc4MV5BMl5BanBnXkFtZTcwNTYzMTcwOQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1366243200000, "runtime": 101, "title": "The Lords of Salem", "tomatoes": {"boxOffice": "$1.2M", "consensus": "The Lords of Salem has lots of atmospheric portent, but it's unfortunately short on scares.", "critic": {"meter": 45, "numReviews": 58, "rating": 5.3}, "dvd": 1378166400000, "fresh": 26, "lastUpdated": 1442164755000, "production": "Anchor Bay Films", "rotten": 32, "viewer": {"meter": 30, "numReviews": 13506, "rating": 2.5}, "website": "http://www.lordsofsalem.com/"}, "type": "movie", "writers": ["Rob Zombie"], "year": 2012}