{"_id": "573a1396f29313caabce5304", "awards": {"nominations": 7, "text": "Won 2 Oscars. Another 5 wins & 7 nominations.", "wins": 7}, "cast": ["Barbra Streisand", "Robert Redford", "Bradford Dillman", "Lois Chiles"], "countries": ["USA"], "directors": ["Sydney Pollack"], "fullplot": "The movie begins with the Katie (Barbra Streisand) running into Hubbell Gardner, an All-American popular jock she went to college with, some time after World War II. Though some other summaries claim it's been about 20 years, that is not really the case. It's probably been more like 10 years since college and Hubbell has written his first novel and later joined the navy while Katie continues to work hard and remains very much involved in the grassroots level of politics. Katie who had a crush on Hubbell back in college is still very attracted to him and soon the two start an \"on again off again\" relationship. Eventually Katie ends up giving up her voice and her interest in politics in order to hold on to Hubbell and they get married. However when Hubbell begins to compromise his literary talent by abandoning his novel writing for writing Screenplays for Hollywood their marriage begins its downfall. When the government begins its witch-hunt for communists among Hollywood writers and producers, Katie's politically active personality reemerges and causes even more problems between the lovers. Soon everything leads to Hubbell having an affair with his college-sweetheart who is also the ex-wife of his best friend, while his wife is pregnant with their child. At first Katie wants to work things out even though she knows about the affair. However she soon begins to see their relationship for what it always was: not meant to be. She realizes that they've always desired different things and that they can no longer continue to build a life on the lies they tell themselves. She asks Hubbell to stay with him until their baby is born and afterward, they go their separate ways. Years later, they run into one another in New York. Katie has remarried and her husband is a good father to her daughter with Hubbell, Rachel. Hubbell on the other hand has a typically pretty, simple girl with him, the kind of girl Katie never could be. They have a short conversation and briefly remember \"the way they were\". Katie (Barbra Streisand) says to Hubbell: \"Your girl is lovely, Hubbell\", and this is followed by one of the most romantic scenes in the movie, where you realize that Hubbell is still very much in love with Katie and he realizes what he has lost but he also knows he could never have lived up to her expectations of him. Once again they go their separate ways with a bittersweet goodbye; she, a confident and beautiful political activist, and Hubbell, a talented writer squandering his talent writing literarily devoid Television scripts.", "genres": ["Drama", "Romance"], "imdb": {"id": 70903, "rating": 7.1, "votes": 15024}, "languages": ["English", "French"], "lastupdated": "2015-08-24 00:53:36.353000000", "plot": "Two desperate people have a wonderful romance, but their political views and convictions drive them apart.", "poster": "https://m.media-amazon.com/images/M/MV5BMjFiM2IwN2MtNWQ3My00YmYwLTliMjYtMzZlMDQxZTdjNDA1L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 119836800000, "runtime": 118, "title": "The Way We Were", "tomatoes": {"critic": {"meter": 63, "numReviews": 19, "rating": 6}, "dvd": 990489600000, "fresh": 12, "lastUpdated": 1441305587000, "production": "Sony Pictures Home Entertainment", "rotten": 7, "viewer": {"meter": 82, "numReviews": 21228, "rating": 3.7}}, "type": "movie", "writers": ["Arthur Laurents"], "year": 1973}