{"_id": "573a13b3f29313caabd3d541", "awards": {"nominations": 3, "text": "9 wins & 3 nominations.", "wins": 9}, "cast": ["Essie Davis", "Sean Harris", "Marcel Iures", "Crispin Letts"], "countries": ["UK", "Ireland", "USA"], "directors": ["Billy O'Brien"], "fullplot": "The broken farmer Dan rents his farm for the scientist John from the Bovine Genetics Technology that is researching genetic modifications of cattle to increase its fertilization. The veterinarian Orla is bitten by the calf while helping the cow to deliver, and she feels that something went wrong with the experiment. During the night, the cow has a narrow passage for the calf, and Dan asks the young couple Jamie and Mary that is parked in a trailer in front of his farm's entrance to help him in the delivery. When the offspring is born, it bites Dan; Orla arrives later and realizes that it is a genetic anomaly and she sacrifices the calf. During the autopsy of the animal, she discovers that the fetus is pregnant and she destroys the freak hybrids. However, one of them escapes and attacks a cow first and Jamie later. When John arrives in the farm, he discovers that there is the danger of infection of human beings and decides to quarantine the spot. But one offspring is alive and need to be captured.", "genres": ["Horror", "Sci-Fi", "Thriller"], "imdb": {"id": 446719, "rating": 5.7, "votes": 5174}, "languages": ["English"], "lastupdated": "2015-08-31 00:10:36.030000000", "num_mflix_comments": 1, "plot": "On a remote Irish farm, five people become unwilling participants in an experiment that goes nightmarishly wrong.", "poster": "https://m.media-amazon.com/images/M/MV5BZjEzNTBiYjItMmFlZi00Njk5LTlhNTgtYmRkM2M2MzI4ODczXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1159488000000, "runtime": 95, "title": "Isolation", "tomatoes": {"critic": {"meter": 67, "numReviews": 9, "rating": 6.2}, "dvd": 1182816000000, "fresh": 6, "lastUpdated": 1441994260000, "production": "First Look Home Entertainment", "rotten": 3, "viewer": {"meter": 35, "numReviews": 2761, "rating": 2.8}}, "type": "movie", "writers": ["Billy O'Brien"], "year": 2005}