{"_id": "573a13baf29313caabd51d61", "awards": {"nominations": 8, "text": "3 wins & 8 nominations.", "wins": 3}, "cast": ["Gèsli èrn Garèarsson", "Nèna Dègg Filippusdèttir", "èlafur Darri èlafsson", "Andri Snèr Magnason"], "countries": ["Iceland"], "directors": ["Ragnar Bragason"], "fullplot": "Karitas is a single mother of four who desperately tries to make ends meet. Fighting a losing battle with her ex-husband for custody over her three daughters, she's oblivious to what's going on with her twelve year old son Gudmund, a victim of brutal bullying at school and whose life is on the fast track to destruction. Gudmund's only friend in the world is Marinè, a schizophrenic in his forties, who lives with his mother in the same apartment building. When Marinè realizes that his mother has secretly been dating a stranger, Marino starts to lose grip on reality. Gardar is an underworld enforcer who makes a mess at work and as a result his twin brother Georg is beaten up. Exiled both from the underworld and his family, Gardar has to make a fresh start in life. He decided to seek out his family, Gardar has to make a fresh start in life. He decided to seek out his son Gudmund whom he has never seen but the straight and narrow is a though path to follow", "genres": ["Drama"], "imdb": {"id": 872094, "rating": 7.6, "votes": 528}, "languages": ["Icelandic"], "lastupdated": "2015-08-12 00:56:36.237000000", "num_mflix_comments": 1, "plot": "Karitas is a single mother of four who desperately tries to make ends meet. Fighting a losing battle with her ex-husband for custody over her three daughters, she's oblivious to what's ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTIwNjM0ODUyM15BMl5BanBnXkFtZTcwNjI3OTc0MQ@@._V1_SY1000_SX677_AL_.jpg", "released": 1157760000000, "runtime": 93, "title": "Children", "tomatoes": {"lastUpdated": 1436814119000, "production": "Sam-felagid", "viewer": {"meter": 88, "numReviews": 16, "rating": 3.9}, "website": "http://www.children-movie.com/"}, "type": "movie", "writers": ["Ragnar Bragason", "Nèna Dègg Filippusdèttir", "Gèsli èrn Garèarsson", "èlafur Darri èlafsson"], "year": 2006}