{"_id": "573a13d9f29313caabdaa022", "awards": {"nominations": 13, "text": "6 wins & 13 nominations.", "wins": 6}, "cast": ["Cosmina Stratan", "Cristina Flutur", "Valeriu Andriuta", "Dana Tapalaga"], "countries": ["Romania", "France", "Belgium"], "directors": ["Cristian Mungiu"], "fullplot": "Alina and Voichita have been friends since their orphanage days. And they have been lovers since they became sexually mature. But despite their oath of mutual fidelity, Alina, who could not bear poverty any more, emigrated to Germany where she became a barmaid. Now she just could not take the estrangement from Voichita and today she is back to Romania with a view to taking Voichita along with her to Germany. The only trouble is that in the meantime her girlfriend has betrayed her in falling in love with... God! Voichita indeed now lives in a convent where she plans to make vows. The priest agrees, if somewhat reluctantly, to accommodate Alina before their (hypothetical) departure. He sees all too well that not only is the young woman materialistic but hostile and troublesome as well...", "genres": ["Drama"], "imdb": {"id": 2258281, "rating": 7.6, "votes": 7793}, "languages": ["Romanian"], "lastupdated": "2015-09-10 17:24:55.380000000", "metacritic": 79, "num_mflix_comments": 2, "plot": "The friendship between two young women who grew up in the same orphanage; one has found refuge at a convent in Romania and refuses to leave with her friend, who now lives in Germany.", "poster": "https://m.media-amazon.com/images/M/MV5BZDBhNjdjYWEtMmRjMi00Y2I4LTlkYmQtZjRhODI5YTM0NWU3XkEyXkFqcGdeQXVyNDkzNTM2ODg@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 1351209600000, "runtime": 150, "title": "Beyond the Hills", "tomatoes": {"boxOffice": "$0.1M", "consensus": "Although some viewers may mistake its deliberate pace for passionless filmmaking, Beyond the Hills offers an intelligent, powerfully acted examination of the tension between secular life and religious faith.", "critic": {"meter": 90, "numReviews": 90, "rating": 8.1}, "fresh": 81, "lastUpdated": 1440612412000, "production": "IFC Films", "rotten": 9, "viewer": {"meter": 80, "numReviews": 1995, "rating": 3.9}, "website": "http://www.dupadealuri.ro/home/"}, "type": "movie", "writers": ["Cristian Mungiu (screenplay)", "Tatiana Niculescu Bran (inspired by non-fiction novels of)"], "year": 2012}