{"_id": "573a1394f29313caabcdfd45", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Ralph Meeker", "Albert Dekker", "Paul Stewart", "Juano Hernandez"], "countries": ["USA"], "directors": ["Robert Aldrich"], "fullplot": "A frightened woman is running barefoot on a highway, trying desperately to flag a car. After several cars pass her by, the woman sees another car approaching, and to make sure either the car stops - or, she's killed, she stands in the path of an on-coming car. Private Investigator Mike Hammer is the one at the wheel, and after almost hitting the woman, he tells her to get in. The woman's name is Christina Bailey.. She is obviously on the run, being barefoot and wearing nothing but a trench coat, and the scent of fear. Whoever was after her eventually catches up with them. Christina has information they want, but dies while being questioned. The killers fake an accident by pushing Hammer's car off the road, but, he survives, waking up in hospital two weeks later. As Mike starts to investigate Christina's death, he's told by the police to stay out of it, but, the hard-nosed PI proceeds anyways. Little did he know that Christina's secret would lead to death and destruction.", "genres": ["Crime", "Film-Noir", "Mystery"], "imdb": {"id": 48261, "rating": 7.7, "votes": 13093}, "languages": ["English", "Italian", "Spanish"], "lastupdated": "2015-09-05 00:00:47.503000000", "num_mflix_comments": 1, "plot": "A doomed female hitchhiker pulls Mike Hammer into a deadly whirlpool of intrigue, revolving around a mysterious \"great whatsit.\"", "poster": "https://m.media-amazon.com/images/M/MV5BYzA3YTE4MjktN2VmMS00YTdkLTkyYzEtZGUwN2NiZThlZmM5XkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_SY1000_SX677_AL_.jpg", "rated": "APPROVED", "released": -461548800000, "runtime": 106, "title": "Kiss Me Deadly", "tomatoes": {"consensus": "An intriguing, wonderfully subversive blend of art and commerce, Kiss Me Deadly is an influential noir classic.", "critic": {"meter": 97, "numReviews": 37, "rating": 8.1}, "dvd": 992908800000, "fresh": 36, "lastUpdated": 1440527597000, "production": "MGM", "rotten": 1, "viewer": {"meter": 85, "numReviews": 6090, "rating": 3.9}, "website": "http://www.criterion.com/"}, "type": "movie", "writers": ["Mickey Spillane (novel)", "A.I. Bezzerides (screenplay)"], "year": 1955}