{"_id": "573a13aaf29313caabd214d5", "awards": {"nominations": 14, "text": "14 nominations.", "wins": 0}, "cast": ["Bobby Deol", "Akshaye Khanna", "Ameesha Patel", "Johnny Lever"], "countries": ["India"], "directors": ["Abbas Alibhai Burmawalla", "Mastan Alibhai Burmawalla"], "fullplot": "A wealthy industrialist and business man named Raj Singhania lives in Bombay, India. He reaches up with a music band in which Karan Malhotra is the leader and Priya is his right-hand and sweetheart. Karan finds that it is not easy to achieve one's merit. A contract made between the two for his band to sing on a crusade for Raj. He agrees to do so and later on conspire with his girlfriend Priya to take over Raj vast estate by setting up his girlfriend to marry Raj fakely. On a chance encounter one day Raj and Priya both meet, where by Raj fall head over heals in love with Priya. And later on they both got engaged. Raj carry Priya and introduce her to his entire family where a date for the marriage between the two is set. And later on finalized. On his wedding night Priya speaks to Raj about she must remain a virgin until one month and he agrees to do so, unknown to him that it is a conspiracy by Karan and Priya. After a few days Priya decides to break plans with Karan releasing what is husband and wife which leads to the destruction of both Raj and Priya by Karan. But, after learning the truth between Karan and Priya, Raj and Karan had a scuffle which leads to the death of Karan and unite the married couple for years to come.", "genres": ["Action", "Musical", "Romance"], "imdb": {"id": 326576, "rating": 6.4, "votes": 1755}, "languages": ["Hindi"], "lastupdated": "2015-08-19 00:12:17.733000000", "num_mflix_comments": 2, "plot": "Karan and Priya Share a secret Raj wants to know the secret.", "poster": "https://m.media-amazon.com/images/M/MV5BZDhiNzUyZGUtMTJiYS00OGI3LWFmYzctMDlkNTNhYzY5Nzk3XkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY1000_SX677_AL_.jpg", "released": 1027641600000, "runtime": 173, "title": "Humraaz", "tomatoes": {"dvd": 1083024000000, "lastUpdated": 1441909128000, "viewer": {"meter": 64, "numReviews": 588, "rating": 3.6}}, "type": "movie", "writers": ["Shiraz Ahmed (dialogue)", "Shiraz Ahmed (screenplay)", "Shiraz Ahmed (story)", "Shyam Goel (dialogue)", "Shyam Goel (screenplay)", "Shyam Goel (story)"], "year": 2002}