{"_id": "573a13e3f29313caabdc09b4", "awards": {"nominations": 6, "text": "2 wins & 6 nominations.", "wins": 2}, "cast": ["Kate Winslet", "Jai Courtney", "Mekhi Phifer", "Shailene Woodley"], "countries": ["USA"], "directors": ["Robert Schwentke"], "fullplot": "One choice can transform you-or it can destroy you. But every choice has consequences, and as unrest surges in the factions all around her, Tris Prior must continue trying to save those she loves--and herself--while grappling with haunting questions of grief and forgiveness, identity and loyalty, politics and love. Tris's initiation day should have been marked by celebration and victory with her chosen faction; instead, the day ended with unspeakable horrors. War now looms as conflict between the factions and their ideologies grows. And in times of war, sides must be chosen, secrets will emerge, and choices will become even more irrevocable--and even more powerful. Transformed by her own decisions but also by haunting grief and guilt, radical new discoveries, and shifting relationships. Tris must fully embrace her Divergence, even if she does not know what she may lose by doing so.", "genres": ["Adventure", "Sci-Fi", "Thriller"], "imdb": {"id": 2908446, "rating": 6.4, "votes": 93387}, "languages": ["English"], "lastupdated": "2015-09-05 00:31:56.753000000", "metacritic": 42, "num_mflix_comments": 1, "plot": "Beatrice Prior must confront her inner demons and continue her fight against a powerful alliance which threatens to tear her society apart with the help from others on her side.", "poster": "https://m.media-amazon.com/images/M/MV5BMTgxOTYxMTg3OF5BMl5BanBnXkFtZTgwMDgyMzA2NDE@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1426809600000, "runtime": 119, "title": "Insurgent", "tomatoes": {"boxOffice": "$130.1M", "consensus": "Shailene Woodley gives it her all, but Insurgent is still a resounding step back for a franchise struggling to distinguish itself from the dystopian YA crowd.", "critic": {"meter": 30, "numReviews": 165, "rating": 5.1}, "dvd": 1438646400000, "fresh": 49, "lastUpdated": 1441131069000, "production": "Lionsgate Films", "rotten": 116, "viewer": {"meter": 62, "numReviews": 72411, "rating": 3.6}, "website": "http://www.thedivergentseries.com/"}, "type": "movie", "writers": ["Brian Duffield (screenplay)", "Akiva Goldsman (screenplay)", "Mark Bomback (screenplay)", "Veronica Roth (novel)"], "year": 2015}