{"_id": "573a1395f29313caabce1c2a", "awards": {"nominations": 3, "text": "Nominated for 1 Golden Globe. Another 3 wins & 3 nominations.", "wins": 4}, "cast": ["James Stewart", "Maureen O'Hara", "Fabian", "Lauri Peters"], "countries": ["USA"], "directors": ["Henry Koster"], "fullplot": "St. Louis based banker Roger Hobbs is writing a letter to his wife, Peggy Hobbs, about his true feelings concerning their just returned from month long vacation, the letter to be opened only after his death, whenever that may be. Mr. Hobbs wanted the vacation to be a romantic getaway for two, but Peggy insisted that it be a family vacation to a central California beach-side house, given to them for the month by friends. The vacation included all their offspring, and their offspring's respective families where applicable. Hobbs hated the idea as he felt he didn't know his offspring - and their spouses even less - and that they, in turn, no longer needed him. They include: daughter Susan Carver, who, with her husband, Stan Carver, have a permissive parenting style as per the latest child psychology books; daughter Janie Grant, whose husband, college professor, Byron Grant, has an academic view of everything in life; fourteen year old daughter, Katey Hobbs, who is self conscious around boys if only because of her new braces, that self consciousness which boys see as standoffishness; and preteen son Danny Hobbs, whose sole focus in life is watching television. The house ended up being a rat trap which exasperated their cook Brenda the most. But beyond that issue, Mr. Hobbs ended up learning the true nature of his relationship to his offspring and to Peggy. In the process, he had to endure the extended visit by an odd couple named the Turners, and learned that some problems can be solved purely by yelling \"hey Joe\" into an unknown group of boys.", "genres": ["Comedy", "Family"], "imdb": {"id": 56255, "rating": 6.9, "votes": 3460}, "languages": ["English"], "lastupdated": "2015-08-29 00:13:38.063000000", "num_mflix_comments": 1, "plot": "Mr. Hobbs wants to spend a quiet holiday at the beach, but his wife has invited all their family to stay with them.", "poster": "https://m.media-amazon.com/images/M/MV5BNzA0MGJhY2EtYWQ2Ny00NjZhLWE3MzktMzg1MTIwYjE0ZTBjXkEyXkFqcGdeQXVyMjUxODE0MDY@._V1_SY1000_SX677_AL_.jpg", "rated": "APPROVED", "released": -238204800000, "runtime": 116, "title": "Mr. Hobbs Takes a Vacation", "tomatoes": {"critic": {"meter": 80, "numReviews": 15, "rating": 6}, "dvd": 1125964800000, "fresh": 12, "lastUpdated": 1440877021000, "production": "20th Century Fox", "rotten": 3, "viewer": {"meter": 71, "numReviews": 3147, "rating": 3.6}}, "type": "movie", "writers": ["Nunnally Johnson (screenplay)", "Edward Streeter (novel)"], "year": 1962}