{"_id": "573a13b5f29313caabd45020", "awards": {"nominations": 3, "text": "2 wins & 3 nominations.", "wins": 2}, "cast": ["Radha Mitchell", "Michael Vartan", "Sam Worthington", "Caroline Brazier"], "countries": ["Australia", "USA", "UK"], "directors": ["Greg McLean"], "fullplot": "An idyllic wildlife cruise disintegrates into terror when a party of tourists are stalked by a massive man-eating crocodile. Pete McKell, a cynical American travel writer, joins a disparate group of holiday-makers on a river cruise through the waters of Kakadu National Park. Initially Pete clashes with their tour captain, Kate, a feisty young woman who assumes he is just another 'city-slicker' in search of a quick thrill. After an uneventful day cruising the river, Kate is reluctantly persuaded to steer their boat into unexplored territory. They discover a secluded lake but terror strikes when their craft receives a powerful blow from beneath the murky depths and begins to sink. With little choice, she beaches the vessel on the closest dry land -a tiny mud island. With a rising tide and only half an hour of daylight left, fear grips the group as they realize they are trapped in the lair of a 'rogue' crocodile, governed only by its need to hunt and kill. Begrudgingly, Pete and Kate join forces to keep hysteria at bay and in the process start to see beyond their initial impressions. Their first attempt to escape fails, but then Pete has an idea - they must trap the crocodile to enable the group to flee to the other side of the island whilst Kate swims for help. Pete volunteers to stand guard, but without warning, the beast breaks free and targets Kate who fails to resurface. As darkness descends and the muddy waters rise, a terrifying struggle ensues with only one probable outcome death.", "genres": ["Action", "Adventure", "Horror"], "imdb": {"id": 479528, "rating": 6.2, "votes": 19860}, "languages": ["English"], "lastupdated": "2015-09-02 00:24:15.163000000", "num_mflix_comments": 1, "plot": "An American journalist on assignment in the Australian outback encounters a man-eating crocodile while trapped on a rapidly flooding mud island.", "poster": "https://m.media-amazon.com/images/M/MV5BMTYxNzAxNDU3Ml5BMl5BanBnXkFtZTcwMDU0ODg2MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1194480000000, "runtime": 99, "title": "Rogue", "tomatoes": {"critic": {"meter": 100, "numReviews": 11, "rating": 7.8}, "dvd": 1217894400000, "fresh": 11, "lastUpdated": 1440010357000, "production": "Third Rail Releasing", "rotten": 0, "viewer": {"meter": 54, "numReviews": 7692, "rating": 3.3}, "website": "http://www.roguecrocodile.com/"}, "type": "movie", "writers": ["Greg McLean"], "year": 2007}