{"_id": "573a1396f29313caabce4a09", "awards": {"nominations": 10, "text": "Nominated for 3 Oscars. Another 2 wins & 10 nominations.", "wins": 5}, "cast": ["Jon Voight", "Burt Reynolds", "Ned Beatty", "Ronny Cox"], "countries": ["USA"], "directors": ["John Boorman"], "fullplot": "The Cahulawassee River valley in Northern Georgia is one of the last natural pristine areas of the state, which will soon change with the imminent building of a dam on the river, which in turn will flood much of the surrounding land. As such, four Atlanta city slickers - alpha male Lewis Medlock, generally even-keeled Ed Gentry, slightly condescending Bobby Trippe, and wide-eyed Drew Ballinger - decide to take a multi-day canoe trip on the river, with only Lewis and Ed having experience in outdoor life. They know going in that the area is ethno-culturally homogeneous and isolated, but don't understand the full extent of such until they arrive and see what they believe is the result of generations of inbreeding. Their relatively peaceful trip takes a turn for the worse when half way through they encounter a couple of hillbilly moonshiners. That encounter not only makes the four battle their way out of the valley intact and alive, but threatens the relationships of the four as they do and are asked to do things they never thought possible within themselves.", "genres": ["Adventure", "Drama", "Thriller"], "imdb": {"id": 68473, "rating": 7.8, "votes": 72625}, "languages": ["English"], "lastupdated": "2015-08-21 00:06:45.547000000", "plot": "Intent on seeing the Cahulawassee River before it's turned into one huge lake, outdoor fanatic Lewis Medlock takes his friends on a river-rafting trip they'll never forget into the dangerous American back-country.", "poster": "https://m.media-amazon.com/images/M/MV5BZjBhYzU3NWItOWZjMy00NjI5LWFmYmItZmIyOWFlMDIxMWNiXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 81302400000, "runtime": 110, "title": "Deliverance", "tomatoes": {"critic": {"meter": 93, "numReviews": 54, "rating": 8.5}, "dvd": 1086048000000, "fresh": 50, "lastUpdated": 1440096839000, "production": "Warner Bros.", "rotten": 4, "viewer": {"meter": 82, "numReviews": 48361, "rating": 3.6}}, "type": "movie", "writers": ["James Dickey (screenplay)", "James Dickey (novel)"], "year": 1972}