{"_id": "573a13c4f29313caabd6bd7d", "awards": {"nominations": 6, "text": "6 nominations.", "wins": 0}, "cast": ["John C. Reilly", "Jonah Hill", "Marisa Tomei", "Catherine Keener"], "countries": ["USA"], "directors": ["Jay Duplass", "Mark Duplass"], "fullplot": "With John's social life at a standstill and his ex-wife about to get remarried, a down on his luck divorcè finally meets the woman of his dreams, only to discover she has another man in her life - her son. Still single seven years after the breakup of his marriage, John has all but given up on romance. But at the urging of his ex-wife and best friend Jamie, John grudgingly agrees to join her and her fiancè Tim at a party. To his and everyone else's surprise, he actually manages to meet someone: the gorgeous and spirited Molly. Their chemistry is immediate. The relationship takes off quickly but Molly is oddly reluctant to take the relationship beyond John's house. Perplexed, he follows her home and discovers the other man in Molly's life: her son, Cyrus. A 21-year-old new age musician, Cyrus is his mom's best friend and shares an unconventional relationship with her. Cyrus will go to any lengths to protect Molly and is definitely not ready to share her with anyone, especially John. Before long, the two are locked in a battle of wits for the woman they both love-and it appears only one man can be left standing when it's over.", "genres": ["Comedy", "Drama", "Romance"], "imdb": {"id": 1336617, "rating": 6.3, "votes": 28638}, "languages": ["English"], "lastupdated": "2015-08-16 01:00:13.837000000", "metacritic": 74, "plot": "John and Molly, a divorced middle aged man and a single mother meet at a friends party and start up a small relationship, all John has to do now is meet Molly's son... Cyrus", "poster": "https://m.media-amazon.com/images/M/MV5BMjA1MDU4NzUwMF5BMl5BanBnXkFtZTcwOTM4MDgzMw@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1279238400000, "runtime": 91, "title": "Cyrus", "tomatoes": {"boxOffice": "$7.5M", "consensus": "While it may strike some viewers as slight, Cyrus is a successful hybrid of mainstream production values and the mumblecore ideals of directors Jay and Mark Duplass.", "critic": {"meter": 80, "numReviews": 152, "rating": 6.9}, "dvd": 1292284800000, "fresh": 122, "lastUpdated": 1440010595000, "production": "Fox Searchlight", "rotten": 30, "viewer": {"meter": 53, "numReviews": 44291, "rating": 3.1}, "website": "http://www.foxsearchlight.com/cyrus/"}, "type": "movie", "writers": ["Mark Duplass", "Jay Duplass"], "year": 2010}