{"_id": "573a13daf29313caabdad675", "awards": {"nominations": 13, "text": "22 wins & 13 nominations.", "wins": 22}, "cast": ["Ayushmann Khurrana", "Yami Gautam", "Annu Kapoor", "Dolly Ahluwalia"], "countries": ["India"], "directors": ["Shoojit Sircar"], "fullplot": "Dr. Baldev Chaddha (Anu Kapoor), a well qualified fertility expert, runs a fertility clinic and a sperm bank in Dariyaganj, New Delhi, that guarantees a high quality and specialized sperm for the purpose. Unfortunately he has more failed cases to his credit than successes. A healthy, high performing donor is the need of the hour. Vicky Arora (Ayushmann Khurrana), a young, good-looking, Punjabi boy from Lajpat Nagar, is the only son and of no financial support to Dolly, a widow, who runs a small beauty parlor from home. As luck would have it, a small brawl in the colony brings Dr Chaddha and Vicky, face to face, where Chaddha, concludes that Vicky could be THAT donor he has been looking for. From here on, Chaddha's days and nights are spent in convincing Vicky to become a donor till he finally gives in. Vicky finds his love interest in Ashima Roy (Yami Gautam), a pretty Bengali girl, who works in a Bank. But soon there hunky dory world comes crashing down because of Vicky's past as a donor. With a brief emotional roller coaster ride, Vicky Donor is a light-hearted take on the subject of sperm donation.", "genres": ["Comedy", "Romance"], "imdb": {"id": 2317337, "rating": 7.8, "votes": 23437}, "languages": ["Hindi"], "lastupdated": "2015-08-23 01:16:03.647000000", "num_mflix_comments": 3, "plot": "A man is brought in by an infertility doctor to supply him with his sperm, where he becomes the biggest sperm donor for his clinic.", "poster": "https://m.media-amazon.com/images/M/MV5BYWNlODE1ZTEtOTQ5MS00N2QwLTllNjItZDQ2Y2UzMmU5YmI2XkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 1334880000000, "runtime": 126, "title": "Vicky Donor", "tomatoes": {"boxOffice": "$0.5M", "dvd": 1361750400000, "lastUpdated": 1438281185000, "production": "Eros Entertainment", "viewer": {"meter": 77, "numReviews": 768, "rating": 3.8}}, "type": "movie", "writers": ["Juhi Chaturvedi (dialogue)", "Juhi Chaturvedi (screenplay)", "Juhi Chaturvedi (story)"], "year": 2012}