{"_id": "573a1393f29313caabcde2f7", "awards": {"nominations": 1, "text": "1 win & 1 nomination.", "wins": 1}, "cast": ["Edward G. Robinson", "Susan Hayward", "Richard Conte", "Luther Adler"], "countries": ["USA"], "directors": ["Joseph L. Mankiewicz"], "fullplot": "In New York, after seven years in prison, the lawyer Max Monetti goes to the bank of his brothers Joe, Tony and Pietro Monetti and promises revenge to them. Then he visits his lover Irene Bennett that asks him to forget the past and start a new life. Max recalls the early 30s, when he is the favorite son of his father Gino Monetti, who has a bank in the East Side. Gino is a tyrannical and egocentric self-made man that raises his family in an environment of hatred and Max is a competent lawyer engaged with Maria Domenico. When Max meets the confident Irene, he has a troubled love affair with her. In 1933, with the new Banking Act reaches Gino for misapplication of funds. Max plots a plan to help his father but is betrayed by his brothers. Now Max will see his brothers that have also being raised under the motto \"Never Forgive, Never Forget\".", "genres": ["Crime", "Drama", "Film-Noir"], "imdb": {"id": 41487, "rating": 7.5, "votes": 1686}, "languages": ["English", "Italian"], "lastupdated": "2015-08-10 00:14:36.910000000", "plot": "In New York, after seven years in prison, the lawyer Max Monetti goes to the bank of his brothers Joe, Tony and Pietro Monetti and promises revenge to them. Then he visits his lover Irene ...", "poster": "https://m.media-amazon.com/images/M/MV5BZDJlYmUyNGEtMDNiMi00OTczLTg3NzQtZDQ5NjgzZmFlZmY4XkEyXkFqcGdeQXVyMjUxODE0MDY@._V1_SY1000_SX677_AL_.jpg", "rated": "APPROVED", "released": -647049600000, "runtime": 101, "title": "House of Strangers", "tomatoes": {"critic": {"meter": 80, "numReviews": 5, "rating": 6.2}, "dvd": 1149552000000, "fresh": 4, "lastUpdated": 1441052493000, "rotten": 1, "viewer": {"meter": 75, "numReviews": 354, "rating": 3.8}}, "type": "movie", "writers": ["Philip Yordan (screenplay)", "Jerome Weidman (novel)"], "year": 1949}