{"_id": "573a1396f29313caabce53e0", "awards": {"nominations": 9, "text": "Won 1 Oscar. Another 7 wins & 9 nominations.", "wins": 8}, "cast": ["Mia Bendixsen", "Ellen Burstyn", "Alfred Lutter III", "Billy Green Bush"], "countries": ["USA"], "directors": ["Martin Scorsese"], "fullplot": "Despite admitting that she was scared of him in her never-ending quest to please him, thirty-five year old housewife and mother Alice Hyatt is devastated when her husband Donald is killed in an on the job traffic accident. With few job skills except that as a singer, Alice, along with her precocious eleven year old son Tommy, decides to move from their current home in Socorro, New Mexico to her home town of Monterrey, California, the only place she has ever felt happy. She plans on getting singing gigs along the way to earn money to get back to Monterrey by the end of the summer and the start of Tommy's school year. Alice's quest for a job at each stop leaves Tommy often to fend for himself, which may make Tommy even more precocious. His behavior is fostered by Alice, as their relationship is often more as trouble-making friends than mother and son. Alice's plans often do not end up as she envisions, especially as she is forced to take a waitressing job at Mel and Ruby's Diner in Tucson, Arizona, which entails working with a disparate group, including Mel, the establishment's gruff owner/short order cook, and her fellow waitresses, the wisecracking, foul mouthed Flo, and the naive and shy Vera. Alice also falls into old habits, namely relying on men to make her feel fulfilled, specifically the much younger Ben, and farmer David. Those relationships may also provide her with a better perspective on her life and her bad choice of Donald as a husband.", "genres": ["Drama", "Romance"], "imdb": {"id": 71115, "rating": 7.4, "votes": 14297}, "languages": ["English"], "lastupdated": "2015-08-22 00:55:07.923000000", "plot": "A recently widowed woman is on the road with her precocious young son, determined to make a new life for herself as a singer.", "poster": "https://m.media-amazon.com/images/M/MV5BMTc0NzYzNDI5N15BMl5BanBnXkFtZTcwNzEyNTY1Mw@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 170640000000, "runtime": 112, "title": "Alice Doesn't Live Here Anymore", "tomatoes": {"critic": {"meter": 91, "numReviews": 23, "rating": 7.6}, "dvd": 1092700800000, "fresh": 21, "lastUpdated": 1441911143000, "production": "Warner Home Video", "rotten": 2, "viewer": {"meter": 82, "numReviews": 9540, "rating": 3.7}}, "type": "movie", "writers": ["Robert Getchell"], "year": 1974}