{"_id": "573a13b2f29313caabd399da", "awards": {"nominations": 3, "text": "7 wins & 3 nominations.", "wins": 7}, "cast": ["Stan Collymore", "Sharon Stone", "Neil Maskell", "David Thewlis"], "countries": ["UK", "Germany", "Spain", "USA"], "directors": ["Michael Caton-Jones"], "fullplot": "Crime novelist Catherine Tramell is living in London, and becomes the center of police investigation (yet again) when her football player boyfriend drowns in a car accident and it is revealed that he was already dead because of a drug overdose before Tramell drove the car into water. Police psychoanalyst Dr. Michael Glass is called for examining Tramell, and is intrigued by the seductive and manipulative woman. On the other hand , his friend Det. Roy Washburn is sure Tramell is guilty. Tramell asks Glass to treat her for her 'risk addiction' problem, and with each therapy session , Glass gets more and more suspicious about her intentions. As more and more murders are committed, including that of Glass's ex-wife, Glass becomes obsessed with proving Tramell's guilt even though the evidence is contradictory .", "genres": ["Drama", "Mystery", "Thriller"], "imdb": {"id": 430912, "rating": 4.2, "votes": 29253}, "languages": ["English"], "lastupdated": "2015-08-26 00:54:22.540000000", "metacritic": 26, "num_mflix_comments": 2, "plot": "Novelist Catherine Tramell is once again in trouble with the law, and Scotland Yard appoints psychiatrist Dr. Michael Glass to evaluate her. Though, like Detective Nick Curran before him, Glass is entranced by Tramell and lured into a seductive game.", "poster": "https://m.media-amazon.com/images/M/MV5BMTkzNzM3ODY3Nl5BMl5BanBnXkFtZTcwNzMyNDcyNA@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1143763200000, "runtime": 114, "title": "Basic Instinct 2", "tomatoes": {"boxOffice": "$5.9M", "consensus": "Unable to match the suspense and titilation of its predecessor, Basic Instinct 2 boasts a plot so ludicrous and predictable it borders on \"so-bad-it's-good.\"", "critic": {"meter": 7, "numReviews": 150, "rating": 3.1}, "dvd": 1152576000000, "fresh": 10, "lastUpdated": 1440612085000, "production": "Sony Pictures", "rotten": 140, "viewer": {"meter": 26, "numReviews": 88946, "rating": 2.5}, "website": "http://www.sonypictures.com/movies/basicinstinct2/index.html"}, "type": "movie", "writers": ["Leora Barish", "Henry Bean", "Joe Eszterhas (characters)"], "year": 2006}