{"_id": "573a13cdf29313caabd85cda", "awards": {"nominations": 6, "text": "8 wins & 6 nominations.", "wins": 8}, "cast": ["Adrien Brody", "Marcia Gay Harden", "James Caan", "Christina Hendricks"], "countries": ["USA"], "directors": ["Tony Kaye"], "fullplot": "Detachment is a chronicle of three weeks in the lives of several high school teachers, administrators and students through the eyes of a substitute teacher named Henry Barthes. Henry roams from school to school, imparting modes of knowledge, but never staying long enough to form any semblance of sentient attachment. A perfect profession for one seeking to hide out in the open. One day Henry arrives at his next assignment. Upon his entry into this particular school, a secret world of emotion is awakened within him by three women. A girl named Meredith in his first period. A fellow teacher Ms. Madison, and a street hooker named Erica, whom Henry has personally granted brief shelter from the streets. Each one of these women, like Henry, are in a life and death struggle to find beauty in a seemingly vicious and loveless world.", "genres": ["Drama"], "imdb": {"id": 1683526, "rating": 7.7, "votes": 50904}, "languages": ["English"], "lastupdated": "2015-09-05 00:35:17.613000000", "metacritic": 52, "plot": "A substitute teacher who drifts from classroom to classroom finds a connection to the students and teachers during his latest assignment.", "poster": "https://m.media-amazon.com/images/M/MV5BMTM3NzQzMDA5Ml5BMl5BanBnXkFtZTcwODA5NTcyNw@@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 1328054400000, "runtime": 98, "title": "Detachment", "tomatoes": {"boxOffice": "$70.9k", "consensus": "Detachment's heart is in the right place, but overall it doesn't offer any solutions to its passionate ranting.", "critic": {"meter": 57, "numReviews": 67, "rating": 5.8}, "dvd": 1347926400000, "fresh": 38, "lastUpdated": 1442078631000, "production": "Tribeca Films", "rotten": 29, "viewer": {"meter": 74, "numReviews": 6412, "rating": 3.8}, "website": "http://www.detachment-film.com"}, "type": "movie", "writers": ["Carl Lund"], "year": 2011}