{"_id": "573a13c3f29313caabd6a9e5", "awards": {"nominations": 39, "text": "Nominated for 1 Oscar. Another 39 wins & 39 nominations.", "wins": 40}, "cast": ["Colin Firth", "Julianne Moore", "Nicholas Hoult", "Matthew Goode"], "countries": ["USA"], "directors": ["Tom Ford"], "fullplot": "It's November 30, 1962. Native Brit George Falconer, an English professor at a Los Angeles area college, is finding it difficult to cope with life. Jim, his personal partner of sixteen years, died in a car accident eight months earlier when he was visiting with family. Jim's family were not going to tell George of the death or accident, let alone allow him to attend the funeral. This day, George has decided to get his affairs in order before he will commit suicide that evening. As he routinely and fastidiously prepares for the suicide and post suicide, George reminisces about his life with Jim. But George spends this day with various people, who see a man sadder than usual and who affect his own thoughts about what he is going to do. Those people include Carlos, a Spanish immigrant/aspiring actor/gigolo recently arrived in Los Angeles; Charley, his best friend who he knew from England, she who is a drama queen of a woman who romantically desires her best friend despite his sexual orientation; and Kenny Potter, one of his students, who seems to be curious about his professor beyond English class.", "genres": ["Drama"], "imdb": {"id": 1315981, "rating": 7.6, "votes": 77553}, "languages": ["English", "Spanish"], "lastupdated": "2015-09-06 00:55:14.620000000", "metacritic": 77, "num_mflix_comments": 2, "plot": "An English professor, one year after the sudden death of his boyfriend, is unable to cope with his typical days in 1960s Los Angeles.", "poster": "https://m.media-amazon.com/images/M/MV5BMzU5MTk4MjQ2M15BMl5BanBnXkFtZTcwNDU0MzEwMw@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1265328000000, "runtime": 99, "title": "A Single Man", "tomatoes": {"boxOffice": "$9.1M", "consensus": "Though the costumes are beautiful and the art direction impeccable, what stands out most from this debut by fashion designer Tom Ford is the leading performance by Colin Firth.", "critic": {"meter": 85, "numReviews": 178, "rating": 7.3}, "dvd": 1278374400000, "fresh": 152, "lastUpdated": 1442337311000, "production": "The Weinstein Company", "rotten": 26, "viewer": {"meter": 81, "numReviews": 56807, "rating": 3.8}, "website": "http://www.asingleman-movie.com/"}, "type": "movie", "writers": ["Christopher Isherwood (novel)", "Tom Ford (written for the screen by)", "David Scearce (written for the screen by)"], "year": 2009}