{"_id": "573a13a3f29313caabd0d264", "awards": {"nominations": 4, "text": "Nominated for 1 Oscar. Another 3 wins & 4 nominations.", "wins": 4}, "cast": ["Jaime Leigh Allen", "Jemma Braham", "Freeda Cat", "Scott Davidson"], "countries": ["UK", "USA"], "directors": ["Josh Aronson"], "fullplot": "If you could make your deaf child hear, would you? Academy Award-nominated Sound and Fury follows the intimate, heart-rending tale of the Artinians, an extended family with deaf and hearing members across three generations. Together they confront a technological device that can help the deaf to hear but may also threaten deaf culture - and their bonds with each other. For Peter Artinian and his wife, both of whom are deaf, a surgical ear implant for their five-year-old daughter Heather means a choice between two worlds - an unfamiliar hearing world and the deaf world, a robust culture in its own right united by a uniquely visual and artistic language. Heather Artinian - precocious, vivacious, and avidly curious about implant surgery - is caught between her deaf parents and her hearing grandparents, as they argue passionately about her future. The debate is sometimes silent, but by no means quiet. When all is done, Sound and Fury speaks volumes about the choices we make and the battles we fight in order to be heard..", "genres": ["Documentary"], "imdb": {"id": 240912, "rating": 8, "votes": 808}, "languages": ["English", "American Sign Language"], "lastupdated": "2015-08-17 00:46:45.313000000", "metacritic": 85, "plot": "If you could make your deaf child hear, would you? Academy Award-nominated Sound and Fury follows the intimate, heart-rending tale of the Artinians, an extended family with deaf and hearing...", "poster": "https://m.media-amazon.com/images/M/MV5BMTkxNTUzMTA5N15BMl5BanBnXkFtZTcwMDM0NjIyMQ@@._V1_SY1000_SX677_AL_.jpg", "released": 946684800000, "runtime": 80, "title": "Sound and Fury", "tomatoes": {"consensus": "This documentary presents its opposing views in an even-handed yet emotionally engaging manner. Critics say it will provoke much thought, as well as emotions, in the audience.", "critic": {"meter": 96, "numReviews": 27, "rating": 8.2}, "dvd": 1009843200000, "fresh": 26, "lastUpdated": 1441134741000, "production": "Artistic License Films", "rotten": 1, "viewer": {"meter": 88, "numReviews": 1066, "rating": 4}, "website": "http://www.nextwavefilms.com/sf"}, "type": "movie", "year": 2000}