{"_id": "573a13bbf29313caabd55673", "awards": {"nominations": 0, "text": "2 wins.", "wins": 2}, "cast": ["Brandon Baker", "Jake T. Austin", "Cary-Hiroyuki Tagawa", "Robyn Lively"], "countries": ["USA"], "directors": ["Eric Bross"], "fullplot": "In the movie, Johnny Kapahala, a teen snowboarding champion from Vermont, returns to Oahu, Hawaii, for the wedding of his hero -- his grandfather, local surf legend Johnny Tsunami -- and to catch a few famous Kauai waves. When Johnny arrives, he meets his new family including \"Uncle Chris\" (the 12-year-old son of his new step-grandmother) who resents the upcoming marriage. Chris's only interest is to join a mountain boarding crew led by a teenage bully. When Johnny's grandfather and his new wife open a surf shop that also caters to mountain boarders, they are soon embroiled in a turf war with a rival shop owner who wants to shut their business down. Chris's antics cause complications for the store opening and the wedding, but eventually he reaches out to Johnny who helps Chris find his place within the new family and settle a turf war between the dueling sports shops.", "genres": ["Comedy", "Drama", "Sport"], "imdb": {"id": 942378, "rating": 5.8, "votes": 1290}, "languages": ["English"], "lastupdated": "2015-09-05 00:28:51.660000000", "num_mflix_comments": 1, "plot": "In the movie, Johnny Kapahala, a teen snowboarding champion from Vermont, returns to Oahu, Hawaii, for the wedding of his hero -- his grandfather, local surf legend Johnny Tsunami -- and to...", "poster": "https://m.media-amazon.com/images/M/MV5BMjE1MzMyMTM5MV5BMl5BanBnXkFtZTcwOTk5NjA1MQ@@._V1_SY1000_SX677_AL_.jpg", "released": 1181260800000, "runtime": 90, "title": "Johnny Kapahala: Back on Board", "tomatoes": {"dvd": 1191888000000, "lastUpdated": 1441134793000, "production": "Buena Vista Home Entertainment", "viewer": {"meter": 69, "numReviews": 2154, "rating": 3.7}}, "type": "movie", "writers": ["Ann Knapp (teleplay)", "Douglas Sloan (teleplay)", "Max Enscoe (teleplay)", "Annie DeYoung (teleplay)"], "year": 2007}