{"_id": "573a1394f29313caabce0e8a", "awards": {"nominations": 4, "text": "Nominated for 1 BAFTA Film Award. Another 1 win & 4 nominations.", "wins": 2}, "cast": ["Orson Welles", "Diane Varsi", "Dean Stockwell", "Bradford Dillman"], "countries": ["USA"], "directors": ["Richard Fleischer"], "fullplot": "In 1924 Chicago, Artie Strauss and Judd Steiner are friends and fellow law students who both come from wealthy backgrounds. They have few true friends as they believe all their contemporaries are intellectually inferior. Within their relationship, Artie is the dominant and Judd the submissive who says he will do whatever Artie tells him. Although Judd acts intellectually arrogant to others, he also shows signs of weakness and reticence most evident to Artie. Part of their goal in life is to experience how it feels to do everything. As such, they plot to commit what they consider the perfect crime - a kidnapping and murder - not only so that they can experience the sense of killing for killing's sake, but also taunt the law with the knowledge of it and their superiority after the fact. They believe their crime is above the law. Their murder of young Paulie Kessler is not so perfect, with evidence at the scene uncovered by one of their law school colleagues, Sid Brooks, who also works for the Globe newspaper. As Artie and Judd try to manipulate their way out of how the evidence may implicate them, their manipulation ultimately backfires and they are charged with the murder. The most famed trial lawyer in town, Jonathan Wilk, is hired to defend the pair despite his atheism being against the families' sensibilities. Jonathan, renowned for his ability to manipulate juries, has to decide how best to defend his clients in the overwhelming face of evidence against them. The testimony of Ruth Evans, Sid's girlfriend, may have some impact on the trial's outcome.", "genres": ["Biography", "Crime", "Drama"], "imdb": {"id": 52700, "rating": 7.5, "votes": 3493}, "languages": ["English"], "lastupdated": "2015-08-24 01:08:27.837000000", "plot": "Two wealthy law-school students go on trial for murder in this version of the Leopold-Loeb case.", "poster": "https://m.media-amazon.com/images/M/MV5BOTgzOWY5YjYtMDJhNS00YTc4LTkxMzAtZjFjNTlkNWFjNzNiXkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "APPROVED", "released": -336528000000, "runtime": 103, "title": "Compulsion", "tomatoes": {"critic": {"meter": 100, "numReviews": 8, "rating": 7.8}, "dvd": 1148342400000, "fresh": 8, "lastUpdated": 1442166100000, "production": "Fox", "rotten": 0, "viewer": {"meter": 84, "numReviews": 1269, "rating": 3.7}}, "type": "movie", "writers": ["Richard Murphy (screenplay)", "Meyer Levin (based on the novel by)"], "year": 1959}