{"_id": "573a13aaf29313caabd21596", "awards": {"nominations": 1, "text": "1 win & 1 nomination.", "wins": 1}, "cast": ["Mikako Ichikawa", "Manami Konishi", "Asami Imajuku", "Jun Murakami"], "countries": ["Japan"], "directors": ["Hiroshi Ando"], "fullplot": "Quiet and introspective Kayako routinely has lunch on a rooftop with three of her friends that attend an all girls high school with her in a seaside town. One day she invites Masami Endo to join the group. As her friendship with Masami grows, she loses contact more and more with the others. She is impressed with Endo's greater knowledge of music and art, and although Endo proclaims that she is insignificant with no aim in life, Kayako says that she wishes that she could be like her new friend. Their feelings deepen beyond friendship and she proclaims her love for Endo on a lonely beach. The two become physically intimate but when summer comes Masami disappears and Kayako learns that she has gone to Tokyo to meet a married man with whom she had an affair the year before. An abortion had led to her being suspended from school. Feeling betrayed when Masami returns and lies about where she has been, Kayako keeps to herself and starts painting a still life, emulating Cezanne paintings in one of Masami's books. Although they reconcile and Kayako speaks of them going way to study together, her love of painting leads to her leaving for Tokyo alone to study art, while Masami remains behind. Masami sends a videotape showing a shot of the beach, and then the blue sea, proclaiming that unlike Kayako, this is all that she can do in an artistic sense.", "genres": ["Drama", "Romance"], "imdb": {"id": 326773, "rating": 6.5, "votes": 200}, "languages": ["Japanese"], "lastupdated": "2015-08-08 00:57:47.380000000", "num_mflix_comments": 1, "plot": "An introverted schoolgirl falls in love and starts a relationship with one of her classmates. Set in a small seaside town in Japan, the love of her life eventually leaves her for her boyfriend in Tokyo.", "released": 1048896000000, "runtime": 116, "title": "Blue", "tomatoes": {"dvd": 1116288000000, "lastUpdated": 1432147707000, "production": "Tempe Home Entertainment", "viewer": {"meter": 0, "numReviews": 118, "rating": 2.4}}, "type": "movie", "writers": ["Kiriko Nananan (comic)", "Yuka Honcho (screenplay)"], "year": 2002}