{"_id": "573a13b2f29313caabd38ad0", "awards": {"nominations": 10, "text": "Nominated for 1 Oscar. Another 4 wins & 10 nominations.", "wins": 5}, "cast": ["Freddie Highmore", "Keri Russell", "Jonathan Rhys Meyers", "Terrence Howard"], "countries": ["USA"], "directors": ["Kirsten Sheridan"], "fullplot": "This is a story of a music prodigy. Lyla is a renowned and beautiful cellist and Louis is a guitar player and vocalist at a club. Lyla and Louis fall in love once they meet each other following the music. Since they have different lives, they have to separate without seeing each other again. However, Lyla has had their baby - Evan, a prodigy born to music. Lyla has an accident and bears the baby but Lyla's father gives the baby to an orphanage without telling her, for fear of affecting her career. After that, both Louis and Lyla give up their music careers. Eleven years later, poor little Evan believes that his parents are waiting for him and goes to New York to find them. In New York, his musical gift leads him to success but also gives him some trouble. A monger uses Evan to make money and prevents him from achieving success. He escapes and runs into a church and people there are surprised by his gift and send him to the best music school, Juilliard. There he receives an education where his genius is recognized, and he creates his composition - August Rhapsody in C major. At the same time, Lyla and Louis both begin to play music again and Louis returns to New York. Because of his perfect performance, Evan is granted an opportunity to play his music in Central Park in front of thousands of people. There are three composers featured, of which he is the last; his mother is the cellist in the preceding performance. As Evan is conducting the orchestra in his rhapsody, Lyla and Louis come to the concert following the music again. The family finally get together!", "genres": ["Drama", "Music"], "imdb": {"id": 426931, "rating": 7.5, "votes": 82130}, "languages": ["English"], "lastupdated": "2015-09-04 00:06:51.740000000", "metacritic": 38, "num_mflix_comments": 3, "plot": "A drama with fairy tale elements, where an orphaned musical prodigy uses his gift as a clue to finding his birth parents.", "poster": "https://m.media-amazon.com/images/M/MV5BNDIwNjE3NjU2NV5BMl5BanBnXkFtZTcwNTQ2NjQzMw@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 1195603200000, "runtime": 114, "title": "August Rush", "tomatoes": {"boxOffice": "$31.5M", "consensus": "Though featuring a talented cast, August Rush cannot overcome the flimsy direction and schmaltzy plot.", "critic": {"meter": 37, "numReviews": 123, "rating": 4.8}, "dvd": 1205193600000, "fresh": 45, "lastUpdated": 1439922807000, "production": "Warner Bros. Pictures", "rotten": 78, "viewer": {"meter": 82, "numReviews": 228694, "rating": 3.9}, "website": "http://augustrushmovie.warnerbros.com/"}, "type": "movie", "writers": ["Nick Castle (screenplay)", "James V. Hart (screenplay)", "Paul Castro (story)", "Nick Castle (story)"], "year": 2007}