{"_id": "573a13d2f29313caabd92096", "awards": {"nominations": 9, "text": "4 wins & 9 nominations.", "wins": 4}, "cast": ["Edward Hogg", "Alexandra Maria Lara", "Melchior Derouet", "Francis Frappat"], "countries": ["Poland", "Portugal", "France", "UK"], "directors": ["Andrzej Jakimowski"], "fullplot": "Set in Lisbon, Portugal at an institute for the blind where children are taught to live with their disability, to not take risks, and to be comfortable at all times. Ian a non-conformist teacher who is also blind is hired at the school and introduces revolutionary methods: Rejecting the use of a cane, Ian teaches the children to achieve spatial orientation by using all of their senses including moving by the resonance of sound vibrations (echolocation), instinct, and the creative use of their imagination. Confident and even slightly over-aggressive, Ian charms the children and gives them a reason to hope, though they are always testing and questioning him to prove that he is one of them and never seem quite convinced of his sincerity. Ian's sessions take place right under the window of Eva (Alexandra Maria Lara), an adult patient who never leaves her room and does not speak to anybody. Surprisingly, she becomes one of his most responsive students and there is even a hint of romance. The two bond as they begin to trust each other. Together they visit a cafè (where she flirts with a young man), walk along the harbor and cross busy streets without any aids other than their ability to listen for the sounds of vehicles, footsteps, or other obstacles in their path. They are followed by Serrano, a young blind boy whom Ian asks to use his imagination to \"see\" a ship in the harbor. The new teacher is challenged by the school doctor and head teacher of the school (Francis Frappat) who is concerned that he is giving the children the illusion of hope...", "genres": ["Drama"], "imdb": {"id": 1846492, "rating": 7.4, "votes": 1323}, "languages": ["English", "French", "Portuguese", "German"], "lastupdated": "2015-07-03 00:19:24.973000000", "num_mflix_comments": 1, "plot": "A blind teacher breaks the rules to help a female student rediscover the pleasures of life.", "poster": "https://m.media-amazon.com/images/M/MV5BMTgzMjMyMDkwMV5BMl5BanBnXkFtZTcwMDM0NjAyOQ@@._V1_SY1000_SX677_AL_.jpg", "released": 1365724800000, "runtime": 105, "title": "Imagine", "tomatoes": {"lastUpdated": 1441303991000, "viewer": {"numReviews": 65, "rating": 3.7}, "website": "http://www.imaginethefilm.org/"}, "type": "movie", "writers": ["Andrzej Jakimowski (screenplay)"], "year": 2012}