{"_id": "573a13a4f29313caabd10588", "awards": {"nominations": 30, "text": "25 wins & 30 nominations.", "wins": 25}, "cast": ["Rekha", "Hrithik Roshan", "Preity Zinta", "Rakesh Roshan"], "countries": ["India"], "directors": ["Rakesh Roshan"], "fullplot": "Scientist Sanjay Mehra devises a computer that is capable of contacting aliens. His happiness is cut short when the scientists at a space-research center scoff at him and refuse to believe his claims. While returning home with his pregnant wife, he glimpses an alien spaceship, and, in the resulting confusion, he cannot control his car, leading to a crash. His wife survives but their unborn child suffers brain damage. Years later, their son Rohit Mehra has grown up but has thinking capacity of a child. He befriends the town Mayor's daughter Nisha, which angers Nisha's suitor Raj, a spoiled brat. One day, Rohit and Nisha find Rohit's father's computer in his shed and follow the instructions provided. That very evening, their town is paid a visit by an alien spaceship that lands someplace nearby and takes off shortly afterward. But when the police inspect the footprints, they discover that one of the aliens has been left behind. Then Rohit and Nisha find the alien, name him Jadoo, and watch as their lives slide into virtual chaos.", "genres": ["Drama", "Fantasy", "Romance"], "imdb": {"id": 254481, "rating": 7.1, "votes": 10307}, "languages": ["Hindi", "English"], "lastupdated": "2015-08-29 01:07:53.623000000", "plot": "A developmentally disabled young man tries to continue the work his father did in communicating with extra-terrestrials from outer space, which leads to something miraculous and wonderful.", "poster": "https://m.media-amazon.com/images/M/MV5BOGM4ZjFkZjktMTEwMS00NWNmLWI1NTAtYTAwYWNhNzAxMjA2XkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY1000_SX677_AL_.jpg", "released": 1060300800000, "runtime": 171, "title": "Koi... Mil Gaya", "tomatoes": {"boxOffice": "$0.3M", "critic": {"meter": 75, "numReviews": 8, "rating": 5.4}, "dvd": 1070928000000, "fresh": 6, "lastUpdated": 1441218953000, "production": "Yash Raj Films", "rotten": 2, "viewer": {"meter": 76, "numReviews": 7139, "rating": 3.9}, "website": "http://www.koimilgayathefilm.com"}, "type": "movie", "writers": ["Robin Bhatt (screenplay)", "Sachin Bhowmick (screenplay)", "Honey Irani (screenplay)", "Rakesh Roshan (screenplay)", "Rakesh Roshan (story)", "Javed Siddiqui (dialogue)"], "year": 2003}