{"_id": "573a13d1f29313caabd8de75", "awards": {"nominations": 6, "text": "Nominated for 1 BAFTA Film Award. Another 1 win & 6 nominations.", "wins": 2}, "cast": ["Charlie Creed-Miles", "Will Poulter", "Sammy Williams", "Iwan Rheon"], "countries": ["UK"], "directors": ["Dexter Fletcher"], "fullplot": "Out on parole after 8 years inside Bill Hayward returns home to find his now 11 and 15 year old sons abandoned by their mother and fending for themselves. Unwilling to play Dad, an uncaring Bill is determined to move on. Although Dean the older boy has found a job and is doing his best to be a father to his younger brother Jimmy, the arrival of Bill has brought them to the attention of social services. With the danger of being put into care looming, Dean forces his feckless Dad to stay by threatening to grass him up for dealing. If there's one thing Bill doesn't want it's to go back to prison. He reluctantly agrees to stay for a week o help fool social services that the boys are being cared for. Having never really grown up himself Bill quickly connects with Jimmy and through this new bond starts to realize what he's been missing. He has a family, a place in the world. He is a father. However, their happy family set up is short lived when Jimmy gets into trouble with Bill's dangerous old cohorts. To sort it out would breach the terms of his license and risk sending him back to Jail. Bill's next steps will show what sort of a Dad he wants to be. A good one or a free one.", "genres": ["Drama"], "imdb": {"id": 1795702, "rating": 7.2, "votes": 9753}, "languages": ["English"], "lastupdated": "2015-09-16 11:04:49.600000000", "plot": "Out on parole after 8 years inside Bill Hayward returns home to find his now 11 and 15 year old sons abandoned by their mother and fending for themselves. Unwilling to play Dad, an uncaring...", "poster": "https://m.media-amazon.com/images/M/MV5BMTg5NzQ1Mzg5N15BMl5BanBnXkFtZTcwMzM5OTc0Nw@@._V1_SY1000_SX677_AL_.jpg", "released": 1332460800000, "runtime": 98, "title": "Wild Bill", "tomatoes": {"critic": {"meter": 100, "numReviews": 25, "rating": 7.4}, "dvd": 1373932800000, "fresh": 25, "lastUpdated": 1442510984000, "production": "Cinedigm", "rotten": 0, "viewer": {"meter": 82, "numReviews": 6584, "rating": 3.9}, "website": "http://https://www.facebook.com/WildBillFilm"}, "type": "movie", "writers": ["Danny King", "Dexter Fletcher"], "year": 2011}