{"_id": "573a1396f29313caabce3582", "awards": {"nominations": 7, "text": "Nominated for 2 Oscars. Another 1 win & 7 nominations.", "wins": 3}, "cast": ["Fred Astaire", "Petula Clark", "Tommy Steele", "Don Francks"], "countries": ["USA"], "directors": ["Francis Ford Coppola"], "fullplot": "Of Glocca Morra, Ireland, Finian McLongeran, who has his own unique belief system of Irish legends, uproots himself and his adult daughter, Sharon McLonergan, and heads for the mythical land of Rainbow Valley, Missitucky, USA where he believes he will become rich. One of those beliefs is that burying a crock of gold in Rainbow Valley will make it multiply, due to the power of rainbows and the Valley's close proximity to Fort Knox. Finian considers that he \"borrowed\" the crock of gold he has from the leprechauns of Glocca Morra, which he plans to return once he makes his fortune. Little does he know that in taking the gold, the leprechauns can no longer make wishes come true and are slowly turning mortal. One of those leprechauns, Og, has come to retrieve the crock of gold to save himself and his fellow leprechauns. Finian and Sharon's arrival in Rainbow Valley coincides with the return of the Valley's prodigal son, Woody Mahoney, who has come to repay back taxes before his land is auctioned off. Woody's sister, Susan Mahoney, is referred to by most Susan the Silent, as she has never spoken and communicates primarily through dance. In helping the Mahoneys repay those taxes, Finian only asks for a small parcel of that land for him and Sharon, and mostly for a place to bury the crock of gold. With the rest of the land, Woody and his friend, Howard, a research botanist, plan to revolutionize the tobacco industry by growing the first ever mentholated tobacco plants, which is a little more difficult to accomplish than they initially believe. Much like Finian, Woody plans on getting rich the easy way, in Woody's case off the hard work of Howard. Regardless of Sharon's dislike of what Woody is doing by being what she considers a schemer, the two fall in love. Finian's assistance of Woody in keeping the land irks bigoted Senator Billboard Rawkins, who has been trying to buy up as much land in the Valley as possible. Complications ensue for all involved because of the crock of gold, even though most have not seen it or even know it exists for real.", "genres": ["Family", "Fantasy", "Musical"], "imdb": {"id": 62974, "rating": 6.2, "votes": 2390}, "languages": ["English", "French"], "lastupdated": "2015-09-10 17:11:03.153000000", "plot": "Of Glocca Morra, Ireland, Finian McLongeran, who has his own unique belief system of Irish legends, uproots himself and his adult daughter, Sharon McLonergan, and heads for the mythical ...", "poster": "https://m.media-amazon.com/images/M/MV5BMGRjNDAxOTItMzIxYy00NzA4LWFlNTEtOWIzMmZhOWI4M2M4XkEyXkFqcGdeQXVyNDQzMDg4Nzk@._V1_SY1000_SX677_AL_.jpg", "rated": "G", "released": -38793600000, "runtime": 141, "title": "Finian's Rainbow", "tomatoes": {"critic": {"meter": 54, "numReviews": 13, "rating": 5.4}, "dvd": 1110844800000, "fresh": 7, "lastUpdated": 1440614670000, "production": "Warner Home Video", "rotten": 6, "viewer": {"meter": 57, "numReviews": 3520, "rating": 3.3}}, "type": "movie", "writers": ["E.Y. Harburg (book)", "Fred Saidy (book)", "E.Y. Harburg (screenplay)", "Fred Saidy (screenplay)"], "year": 1968}