{"_id": "573a13d5f29313caabd9d91b", "awards": {"nominations": 3, "text": "20 wins & 3 nominations.", "wins": 20}, "cast": ["Lisa Fèvero", "Sonia Guedes", "Ricardo Merkin", "Luiz Serra"], "countries": ["Brazil", "Argentina", "France"], "directors": ["Jèlia Murat"], "fullplot": "Each citizen of Jotuomba plays an integral role in village life. Madalena is responsible for baking bread; each morning she stacks her rolls as Antonio prepares the coffee. The two share a morning ritual of arguments and insults, followed by an amicable cup of coffee on the bench outside Antonio's shop. At midday the church bells ring, summoning the villagers to mass. In the early evening, they all share a meal together. And so life proceeds in Jotuomba, the days languidly drifting into one another. The only variations seem to be in the weather. One day Rita arrives looking for a place to stay. She came upon the village while traveling through the valley, following the unused railroad tracks. She is a photographer, intent on capturing the village's special allure. Initially reticent, the townsfolk gradually open up to her, sharing their stories and allowing themselves to be photographed. Rita is comfortable with technologies old and new, and Madalena teaches her to knead dough by the light of an oil lamp. Only the village priest continues to find Rita's presence worrisome, especially when she begins asking about the locked cemetery.", "genres": ["Drama"], "imdb": {"id": 2043879, "rating": 7.1, "votes": 527}, "languages": ["Portuguese"], "lastupdated": "2015-08-10 01:07:31.957000000", "metacritic": 74, "plot": "Each citizen of Jotuomba plays an integral role in village life. Madalena is responsible for baking bread; each morning she stacks her rolls as Antonio prepares the coffee. The two share a ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTg5ODk4NDUzNF5BMl5BanBnXkFtZTgwNDQxMDY0MDE@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 1338508800000, "runtime": 98, "title": "Found Memories", "tomatoes": {"boxOffice": "$7.5k", "critic": {"meter": 90, "numReviews": 10, "rating": 7.8}, "dvd": 1423094400000, "fresh": 9, "lastUpdated": 1442337747000, "production": "Film Movement", "rotten": 1, "viewer": {"meter": 74, "numReviews": 294, "rating": 3.9}, "website": "http://taigafilmes.com/historias"}, "type": "movie", "writers": ["Maria Clara Escobar", "Jèlia Murat", "Felipe Sholl"], "year": 2011}