{"_id": "573a13bbf29313caabd53f1a", "awards": {"nominations": 1, "text": "3 wins & 1 nomination.", "wins": 3}, "cast": ["Abigail Mason", "Lisa Pepper", "Elliott Gould", "Yolanda Wood"], "countries": ["USA"], "directors": ["Michael Landon Jr."], "fullplot": "When Sarah Cain, a self-involved big-city newspaper columnist, travels to Pennsylvania for the funeral of her Amish sister, she soon discovers that she is the legal guardian of her five Amish nieces and nephews. Rather than choose to move to Lancaster County to finish raising them there herself, or let them be separated by the foster care system, Sarah decides to take them with her back to Portland where she believes she can make a new life for them. However, she soon realizes that the modern world has forced them to compromise who they are, and that she has moved them there for all the wrong reasons - a motive which is soon exposed - because secrets can really never be kept secret. In order to find her own redemption, she knows she must make a choice to give them back their lives in Amish Country. And whether she remains part of their lives will have a lot to do with how much she has grown to love them.", "genres": ["Drama"], "imdb": {"id": 918557, "rating": 6, "votes": 1184}, "languages": ["English"], "lastupdated": "2015-09-10 17:17:55.840000000", "plot": "When Sarah Cain, a self-involved big-city newspaper columnist, travels to Pennsylvania for the funeral of her Amish sister, she soon discovers that she is the legal guardian of her five ...", "poster": "https://m.media-amazon.com/images/M/MV5BMjIzMDc2NDcxM15BMl5BanBnXkFtZTgwNjI1NTcwMzE@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 1187481600000, "runtime": 103, "title": "Saving Sarah Cain", "tomatoes": {"dvd": 1200355200000, "lastUpdated": 1438543874000, "production": "BiggerEpic", "viewer": {"meter": 73, "numReviews": 9924, "rating": 3.5}}, "type": "movie", "writers": ["Brian Bird (screenplay)", "Cindy Kelley (screenplay)", "Beverly Lewis (novel)"], "year": 2007}