{"_id": "573a1394f29313caabcdf81b", "awards": {"nominations": 2, "text": "Nominated for 1 BAFTA Film Award. Another 3 wins & 2 nominations.", "wins": 4}, "cast": ["Ray Milland", "Grace Kelly", "Robert Cummings", "John Williams"], "countries": ["USA"], "directors": ["Alfred Hitchcock"], "fullplot": "In London, wealthy Margot Mary Wendice had a brief love affair with the American writer Mark Halliday while her husband and professional tennis player Tony Wendice was on a tennis tour. Tony quits playing to dedicate to his wife and finds a regular job. She decides to give him a second chance for their marriage. When Mark arrives from America to visit the couple, Margot tells him that she had destroyed all his letters but one that was stolen. Subsequently she was blackmailed, but she had never retrieved the stolen letter. Tony arrives home, claims that he needs to work and asks Margot to go with Mark to the theater. Meanwhile Tony calls Captain Lesgate (aka Charles Alexander Swann who studied with him at college) and blackmails him to murder his wife, so that he can inherit her fortune. But there is no perfect crime, and things do not work as planned.", "genres": ["Crime", "Thriller"], "imdb": {"id": 46912, "rating": 8.2, "votes": 93546}, "languages": ["English"], "lastupdated": "2015-09-04 00:36:36.117000000", "plot": "An ex-tennis pro carries out a plot to murder his wife. When things go wrong, he improvises a brilliant plan B.", "poster": "https://m.media-amazon.com/images/M/MV5BOWIwODIxYWItZDI4MS00YzhhLWE3MmYtMzlhZDIwOTMzZmE5L2ltYWdlXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": -492134400000, "runtime": 105, "title": "Dial M for Murder", "tomatoes": {"consensus": "Dial M for Murder may be slightly off-peak Hitchcock, but by any other standard, it's a sophisticated, chillingly sinister thriller -- and one that boasts an unforgettable performance from Grace Kelly to boot.", "critic": {"meter": 88, "numReviews": 42, "rating": 7.2}, "dvd": 1094515200000, "fresh": 37, "lastUpdated": 1442264152000, "production": "Warner Bros. Pictures", "rotten": 5, "viewer": {"meter": 92, "numReviews": 37269, "rating": 3.9}}, "type": "movie", "writers": ["Frederick Knott (screen play)", "Frederick Knott (adapted from his play)"], "year": 1954}