{"_id": "573a1397f29313caabce87ae", "awards": {"nominations": 10, "text": "2 wins & 10 nominations.", "wins": 2}, "cast": ["Dominique Sanda", "Danielle Darrieux", "Richard Berry", "Michel Piccoli"], "countries": ["Italy", "France"], "directors": ["Jacques Demy"], "fullplot": "A film musical in which every line is sung. The frame is about workers during a strike. They also prepare and perform a demonstration. Two personal relations develop against this background. Franèois abandons his pregnant girlfriend Violette. She feels treated even more unjust when he tries to defend and excuse his behaviour. He had met a very beautiful over-class girl, Edith, and both were immediately overwhelmed by genuine and reciprocal passion. Edith lived in a very unsatisfactory marriage. She was the daughter of the widow from which Franèois rented his room. Nevertheless, he met her in the street, where she just opened her fur coat and was starch naked under it. They will be together in great passion for just one night and day. At the demonstration Franèois is shot by the police and dies in Edith's arms. - The music is closer to opera than in any other film musical by Jacques Demy. But the greatest difference is that he has devoted much more effort to the task of instructing the singers to reveal the psychic emotions of the text and events.", "genres": ["Drama", "Musical"], "imdb": {"id": 84843, "rating": 7.1, "votes": 514}, "languages": ["French"], "lastupdated": "2015-08-15 00:15:21.317000000", "num_mflix_comments": 1, "plot": "A film musical in which every line is sung. The frame is about workers during a strike. They also prepare and perform a demonstration. Two personal relations develop against this background...", "poster": "https://m.media-amazon.com/images/M/MV5BZThiODM2NGQtZWUwYy00Mjc0LTg0YTMtNDIwZTBhYzc2OWI5XkEyXkFqcGdeQXVyNjE5MjUyOTM@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 404524800000, "runtime": 90, "title": "Une chambre en ville", "tomatoes": {"lastUpdated": 1430335097000, "viewer": {"meter": 39, "numReviews": 517, "rating": 2.9}}, "type": "movie", "writers": ["Jacques Demy"], "year": 1982}