{"_id": "573a13b8f29313caabd4bcb5", "awards": {"nominations": 60, "text": "Won 3 Oscars. Another 90 wins & 60 nominations.", "wins": 93}, "cast": ["Matthew McConaughey", "Jennifer Garner", "Jared Leto", "Denis O'Hare"], "countries": ["USA"], "directors": ["Jean-Marc Vallèe"], "fullplot": "Dallas 1985. Electrician and sometimes rodeo bull rider Ron Woodroof lives hard, which includes heavy smoking, drinking, drug use (primarily cocaine) and casual sex. He is racist and homophobic. While in the hospital on a work related injury, the doctors discover and inform him that he is HIV+, and that he will most-likely die within thirty days. Ron is initially in angry denial that he would have a disease that only \"faggots\" have, but upon quick reflection comes to the realization that the diagnosis is probably true. He begins to read whatever research is available about the disease, which at this time seems to be most effectively treated by the drug AZT. AZT, however, is only in the clinical trials stage within the US. Incredulous that he, as a dying man, cannot pay for any drug which may save or at least prolong his life, he goes searching for it by whatever means possible. It eventually leads him to Mexico and a \"Dr.\" Vass, an American physician whose license was revoked in the US because of his AIDS related work against US regulations. Dr. Vass leads Ron to a cocktail of other drugs, some vitamins, he believes are more effective in treating the symptoms, since the virus, as Ron learns, will always be in the system of those who have been exposed to it. Ron begins to smuggle these drugs not approved by the FDA into the US, not only for his own use but for sale to other HIV+ persons. In this venture, he goes into an unlikely partnership with a HIV+ transgender woman named Rayon, who he met in the hospital and who has greater contact with AIDS patients through the gay community. As they try to work both above ground to get the meds to those that need them and underground to avoid detection by especially the FDA, Ron comes up with an idea to circumvent the fact of selling the drugs - which are not considered drugs yet since they are not FDA approved - directly to the HIV+ population, which then should should not be against the law. Richard Barkley and Dr. Sevard, the FDA's lead man on the file and one of Ron's doctors respectively, the latter who sees clinical trials as the only way to determine the efficacy of drugs despite the fact that Ron and others would have probably died already without these drugs, try to stop Ron and Rayon at every turn. Caught in the middle is Dr. Eve Saks, another of Ron's doctors, who understands why policies are place, but who can sympathize with Ron, Rayon and others - all her patients, directly or indirectly - in their situation.", "genres": ["Biography", "Drama"], "imdb": {"id": 790636, "rating": 8, "votes": 284332}, "languages": ["English", "Japanese"], "lastupdated": "2015-09-15 04:48:53.337000000", "metacritic": 84, "plot": "In 1985 Dallas, electrician and hustler Ron Woodroof works around the system to help AIDS patients get the medication they need after he is diagnosed with the disease.", "poster": "https://m.media-amazon.com/images/M/MV5BMTYwMTA4MzgyNF5BMl5BanBnXkFtZTgwMjEyMjE0MDE@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1385078400000, "runtime": 117, "title": "Dallas Buyers Club", "tomatoes": {"boxOffice": "$27.3M", "consensus": "Dallas Buyers Club rests squarely on Matthew McConaughey's scrawny shoulders, and he carries the burden gracefully with what might be a career-best performance.", "critic": {"meter": 94, "numReviews": 231, "rating": 7.8}, "dvd": 1391472000000, "fresh": 216, "lastUpdated": 1440525861000, "production": "Focus Features", "rotten": 15, "viewer": {"meter": 91, "numReviews": 89045, "rating": 4.2}, "website": "http://www.focusfeatures.com/dallas_buyers_club"}, "type": "movie", "writers": ["Craig Borten", "Melisa Wallack"], "year": 2013}