{"_id": "573a13b0f29313caabd33953", "awards": {"nominations": 9, "text": "1 win & 9 nominations.", "wins": 1}, "cast": ["Gael Garcèa Bernal", "Diego Luna", "Guillermo Francella", "Dolores Heredia"], "countries": ["Mexico", "USA"], "directors": ["Carlos Cuarèn"], "fullplot": "Mexican half brothers Beto and Tato - who will eventually be appropriately nicknamed Rudo (rough) and Cursi (corny), respectively - have a typical love/hate relationship with each other. They both work on a banana plantation and live with their extended family consisting of their mother, abusive stepfather, sister Nadia, and Beto's wife Toèa and their children. The family are rural peasant class and are barely making ends meet. The brother's fortunes change when into their lives comes Batuta, a soccer scout. Despite their advancing ages, both Beto and Tato are naturally gifted at soccer, Beto as a goaltender and Tato as a striker. Playing professionally has always been Beto's dream, although Tato has other professional thoughts on his mind. Batuta eventually recruits both for different teams in Mexico City. Beto and Tato's fortunes rise and fall, the falls based on those things which hold more passion for the brothers. For Tato, he loves fast women, specifically television spokes-model Maya, but he loves singing even more. He would give up his soccer career for one in Mexican country singing, if only he was any good at it. For Beto, his passion is gambling. Although Beto is up front and straightforward about most things in life, he would lie and cheat to hide his gambling problem and debts. They just have to keep these alternate passions in check to make their soccer lives lucrative ones.", "genres": ["Comedy", "Drama", "Sport"], "imdb": {"id": 405393, "rating": 6.7, "votes": 6342}, "languages": ["Spanish"], "lastupdated": "2015-09-14 18:05:40.433000000", "metacritic": 67, "plot": "Two siblings rival each other inside the world of professional soccer.", "poster": "https://m.media-amazon.com/images/M/MV5BMjAxNzUwMzUzOV5BMl5BanBnXkFtZTcwMzAwNTE0Mg@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1242345600000, "runtime": 103, "title": "Rudo y Cursi", "tomatoes": {"boxOffice": "$1.7M", "consensus": "Despite its fair share of sports movie cliches, Rudo y Cursi marks an auspicious directing debut for Carlos Cuarèn, and features strong performances from Garcèa Bernal and Luna.", "critic": {"meter": 73, "numReviews": 109, "rating": 6.4}, "dvd": 1251158400000, "fresh": 80, "lastUpdated": 1442435230000, "production": "Sony Pictures Classics", "rotten": 29, "viewer": {"meter": 66, "numReviews": 19308, "rating": 3.5}, "website": "http://www.sonyclassics.com/rudoycursi"}, "type": "movie", "writers": ["Carlos Cuarèn (screenplay)"], "year": 2008}