{"_id": "573a1394f29313caabce0b4f", "awards": {"nominations": 4, "text": "2 wins & 4 nominations.", "wins": 2}, "cast": ["Paul Newman", "Joanne Woodward", "Anthony Franciosa", "Orson Welles"], "countries": ["USA"], "directors": ["Martin Ritt"], "fullplot": "Sixty-one year old widower Will Varner, in ill health, owns many businesses and property in Frenchman's Bend, Mississippi, including a plantation. To him, his children are a disappointment, they who he sees as not being able to carry on the Varner name in the style to which he has built around it. Son Jody Varner has no ambition and does not work, spending much of his time fooling around with his seductive wife, Eula. Twenty-three year old daughter Clara Varner he finds clever, but he feels she also wastes her time on more contemplative pursuits. While most of her contemporaries are married, Clara has been dating Alan Stewart, a genteel mama's boy, for six years. Will would not mind Alan so much if he too thought Alan had a bit of a forceful man in him, which he could demonstrate by actually asking Clara to marry him. Conversely, Jody laments that nothing he does is ever good enough for his father, while Clara plain does not like the way he treats them. Into their lives comes Ben Quick, who Jody hired while Will was hospitalized, Ben to do some sharecropping on currently vacant land. Despite Will believing the unsubstantiated stories that Ben burned down someone's barn as an act of vengeance, Will becomes to view Ben as the son he never had as he is much the same mold. As such, Will does whatever he can to get Ben to be part of the family to carry on the Varner name the way Will wants it be, which means marrying Clara. Through the process, Clara may come to a realization about what she really wants in life, while Jody does whatever he can to retain his position in the family.", "genres": ["Drama"], "imdb": {"id": 51878, "rating": 7.5, "votes": 6907}, "languages": ["English"], "lastupdated": "2015-08-28 00:23:32.487000000", "num_mflix_comments": 1, "plot": "Accused barn burner and con man Ben Quick arrives in a small Mississippi town and quickly ingratiates himself with its richest family, the Varners.", "poster": "https://m.media-amazon.com/images/M/MV5BMDJhYzQzMTYtYzQ1OC00NTdkLTlmYzctM2E4ZjY5NTBiYjUwXkEyXkFqcGdeQXVyMjUxODE0MDY@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": -366854400000, "runtime": 115, "title": "The Long, Hot Summer", "tomatoes": {"critic": {"meter": 88, "numReviews": 16, "rating": 7.2}, "dvd": 1053388800000, "fresh": 14, "lastUpdated": 1441994392000, "production": "20th Century Fox", "rotten": 2, "viewer": {"meter": 82, "numReviews": 6058, "rating": 3.8}}, "type": "movie", "writers": ["William Faulkner (stories)", "Irving Ravetch (screenplay)", "Harriet Frank Jr. (screenplay)"], "year": 1958}