{"_id": "573a13cdf29313caabd84ee5", "awards": {"nominations": 4, "text": "1 win & 4 nominations.", "wins": 1}, "cast": ["Omiros Poulakis", "Prometheus Aleifer", "Ioanna Tsirigouli", "Iro Bezou"], "countries": ["Greece"], "directors": ["Giorgos Siougas"], "fullplot": "Milk \"is the tragic story of three heroes of Rina (45 years) and her two sons, Anthony (25 years) and Lefteris (23 years). Having emigrated years from Tbilisi, Anthony, ambitious and willing to evolve socially and turn back to his roots, maintaining relationship with the daughter of his boss, which he is about to marry. Lefteris, on the other, refuses to live in today, it remains weak and naive, while his behavior becomes increasingly strange - - increasingly freakish - Antonia visit scratches family dynamic and profound problems that haunt and three with axis archetypes Motherland, Mother and Love. The film adaptation of the play of Claus Katsikonouris, recounts the troubled balances of a family that has alienated and spasmodic efforts of reunification. Milk, visualizes the harsh reality of a sensitive social group while wondering, looking, remembers and talks about everything Competent silent. The ultimate pragmatic representation, awakens thoughts, sensibilities and memories, submerged in the most secret and fragile emotional intelligence points.", "genres": ["Drama"], "imdb": {"id": 1670715, "rating": 7.2, "votes": 326}, "languages": ["Greek", "Russian"], "lastupdated": "2015-05-27 00:09:51.603000000", "num_mflix_comments": 2, "plot": "Milk \"is the tragic story of three heroes of Rina (45 years) and her two sons, Anthony (25 years) and Lefteris (23 years). Having emigrated years from Tbilisi, Anthony, ambitious and ...", "released": 1316822400000, "runtime": 99, "title": "Burning Heads", "tomatoes": {"lastUpdated": 1430939564000, "viewer": {"numReviews": 16, "rating": 3.8}}, "type": "movie", "writers": ["Vasilis Katsikonouris (play)", "Vasilis Katsikonouris (screenplay)", "Nikos Vouteniotis"], "year": 2011}