{"_id": "573a1395f29313caabce2bd0", "awards": {"nominations": 3, "text": "Nominated for 1 BAFTA Film Award. Another 2 nominations.", "wins": 0}, "cast": ["Julie Christie", "Oskar Werner", "Cyril Cusack", "Anton Diffring"], "countries": ["UK"], "directors": ["Franèois Truffaut"], "fullplot": "Based on the 1951 Ray Bradbury novel of the same name. Guy Montag is a firefighter who lives in a lonely, isolated society where books have been outlawed by a government fearing an independent-thinking public. It is the duty of firefighters to burn any books on sight or said collections that have been reported by informants. People in this society including Montag's wife are drugged into compliancy and get their information from wall-length television screens. After Montag falls in love with book-hoarding Clarisse, he begins to read confiscated books. It is through this relationship that he begins to question the government's motives behind book-burning. Montag is soon found out, and he must decide whether to return to his job or run away knowing full well the consequences that he could face if captured.", "genres": ["Drama", "Sci-Fi"], "imdb": {"id": 60390, "rating": 7.2, "votes": 30813}, "languages": ["English"], "lastupdated": "2015-08-31 00:03:31.200000000", "plot": "In an oppressive future, a fireman whose duty is to destroy all books begins to question his task.", "poster": "https://m.media-amazon.com/images/M/MV5BMjI3MzI3MjQ2OF5BMl5BanBnXkFtZTgwMTI4ODYxMTE@._V1_SY1000_SX677_AL_.jpg", "rated": "UNRATED", "released": -98841600000, "runtime": 112, "title": "Fahrenheit 451", "tomatoes": {"consensus": "Fahrenheit 451 is an intriguing film that suffuses Truffaut's trademark wit and black humor with the intelligence and morality of Ray Bradbury's novel.", "critic": {"meter": 81, "numReviews": 32, "rating": 7.4}, "dvd": 971136000000, "fresh": 26, "lastUpdated": 1441044074000, "production": "Universal Pictures", "rotten": 6, "viewer": {"meter": 72, "numReviews": 25474, "rating": 3.5}}, "type": "movie", "writers": ["Franèois Truffaut (screenplay)", "Jean-Louis Richard (screenplay)", "Ray Bradbury (novel)"], "year": 1966}