{"_id": "573a1398f29313caabceb638", "awards": {"nominations": 8, "text": "Nominated for 2 Oscars. Another 15 wins & 8 nominations.", "wins": 17}, "cast": ["Danny Aiello", "Ossie Davis", "Ruby Dee", "Richard Edson"], "countries": ["USA"], "directors": ["Spike Lee"], "fullplot": "This film looks at life in the Bedford-Stuyvesant district of Brooklyn on a hot summer Sunday. As he does everyday, Sal Fragione opens the pizza parlor he's owned for 25 years. The neighborhood has changed considerably in the time he's been there and is now composed primarily of African-Americans and Hispanics. His son Pino hates it there and would like nothing better than to relocate the eatery to their own neighborhood. For Sal however, the restaurant represents something that is part of his life and sees it as a part of the community. What begins as a simple complaint by one of his customers, Buggin Out - who wonders why he has only pictures of famous Italian-Americans on the wall when most of his customers are black - eventually disintegrates into violence as frustration seemingly brings out the worst in everyone.", "genres": ["Drama"], "imdb": {"id": 97216, "rating": 7.9, "votes": 54561}, "languages": ["English", "Italian", "Spanish"], "lastupdated": "2015-08-25 00:56:37.667000000", "metacritic": 91, "num_mflix_comments": 1, "plot": "On the hottest day of the year on a street in the Bedford-Stuyvesant section of Brooklyn, everyone's hate and bigotry smolders and builds until it explodes into violence.", "poster": "https://m.media-amazon.com/images/M/MV5BODA2MjU1NTI1MV5BMl5BanBnXkFtZTgwOTU4ODIwMjE@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 616982400000, "runtime": 120, "title": "Do the Right Thing", "tomatoes": {"consensus": "Smart, vibrant, and urgent without being didactic, Do the Right Thing is one of Spike Lee's most fully realized efforts -- and one of the most important films of the 1980s.", "critic": {"meter": 93, "numReviews": 67, "rating": 8.9}, "dvd": 1246320000000, "fresh": 62, "lastUpdated": 1440094172000, "production": "Universal Pictures", "rotten": 5, "viewer": {"meter": 90, "numReviews": 72113, "rating": 3.9}}, "type": "movie", "writers": ["Spike Lee"], "year": 1989}