{"_id": "573a1395f29313caabce1e80", "awards": {"nominations": 7, "text": "Nominated for 6 BAFTA Film Awards. Another 1 nomination.", "wins": 0}, "cast": ["Tom Courtenay", "Wilfred Pickles", "Mona Washbourne", "Ethel Griffies"], "countries": ["UK"], "directors": ["John Schlesinger"], "fullplot": "A young British clerk in a gloomy North Country undertaker's office, Billy is bombarded daily by the propaganda of the media that all things are for the asking. This transparently false doctrine, coupled with the humdrum job and his wild imagination, leads him on frequent flights to \"Ambrosia,\" a mythical kingdom where he is crowned king, general, lover or any idealized hero the real situation of the moment makes him desire. His vacillating commitment and post-adolescent immaturity have created situations which make Ambrosia all the more attractive. He's succeeded in becoming engaged to two different girls, simultaneously, while in love with a third, Liz. He's in hot water with his employer, having spent a rather large sum of postage money on his personal frivolities. And last, but not least, his dream of becoming a highly-paid, famous scriptwriter in London seems doomed to failure. The only person in his life capable of bringing him down to earth is Liz, and she's having a difficult time of it. Finally, he gets his life sufficiently in order to leave for London with his true love. Billy still hasn't come to grips with the real world by the end of the film. He leaves the train to buy milk from a vending machine and watches the train slowly pull out for London with Liz aboard. He returns to the more comfortable shelter of his parents home, Ambrosia and his imagination.", "genres": ["Comedy", "Drama", "Romance"], "imdb": {"id": 56868, "rating": 7.5, "votes": 3939}, "languages": ["English"], "lastupdated": "2015-08-01 00:22:43.157000000", "metacritic": 82, "num_mflix_comments": 3, "plot": "A lazy, irresponsible young clerk in provincial Northern England lives in his own fantasy world and makes emotionally immature decisions as he alienates friends and family.", "poster": "https://m.media-amazon.com/images/M/MV5BMTgxMzUzMTk3MV5BMl5BanBnXkFtZTcwMDYzNzAyMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": -190771200000, "runtime": 98, "title": "Billy Liar", "tomatoes": {"critic": {"meter": 100, "numReviews": 11, "rating": 7.6}, "dvd": 883612800000, "fresh": 11, "lastUpdated": 1440356817000, "production": "Continental", "rotten": 0, "viewer": {"meter": 84, "numReviews": 2642, "rating": 3.9}}, "type": "movie", "writers": ["Keith Waterhouse (screenplay)", "Willis Hall (screenplay)", "Keith Waterhouse (novel)", "Keith Waterhouse (play)", "Willis Hall (play)"], "year": 1963}