{"_id": "573a13a5f29313caabd12f06", "awards": {"nominations": 18, "text": "8 wins & 18 nominations.", "wins": 8}, "cast": ["Robin Williams", "Connie Nielsen", "Michael Vartan", "Dylan Smith"], "countries": ["USA"], "directors": ["Mark Romanek"], "fullplot": "Middle aged Sy Parrish works as a technician at a one hour photo lab located in a SavMart store in a suburban mall. Sy is a lonely man, never having had any friends. He knows much about his customers through the photographs they have developed. But he knows more about the Yorkin family - specifically Nina Yorkin and her adolescent son Jake Yorkin, the two in the family who drop off and pick up the family's photofinishing - the family about whom he is obsessed, than anyone else. Nina's husband, Will Yorkin, is incidental to his obsession since Sy has only seen him in photographs. Sy's obsession includes fantasizing about being their favorite \"Uncle Sy\". He has even been making an extra set of prints for himself of all of their photographs since Jake was a newborn. After an incident at work and after Sy finds out more about the family through a set of photographs, he decides to right the injustices he sees in the only way he knows how. His actions demonstrate his true mental state.", "genres": ["Drama", "Thriller"], "imdb": {"id": 265459, "rating": 6.8, "votes": 93626}, "languages": ["English"], "lastupdated": "2015-08-30 00:41:51.180000000", "metacritic": 64, "num_mflix_comments": 1, "plot": "An employee of a one-hour photo lab becomes obsessed with a young suburban family.", "poster": "https://m.media-amazon.com/images/M/MV5BYWVkMjAzY2QtZTA4Yi00OWZmLTliMzctZTkyODU4NTc3MmRjL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1031875200000, "runtime": 96, "title": "One Hour Photo", "tomatoes": {"dvd": 1124150400000, "lastUpdated": 1442263730000, "production": "Ariztical Entertainment", "viewer": {"meter": 67, "numReviews": 148, "rating": 3.2}}, "type": "movie", "writers": ["Mark Romanek"], "year": 2002}