{"_id": "573a13bbf29313caabd52d0a", "awards": {"nominations": 3, "text": "1 win & 3 nominations.", "wins": 1}, "cast": ["Jonathan Rhys Meyers", "Radha Mitchell", "Yun-Fat Chow", "Michelle Yeoh"], "countries": ["Australia", "China", "Germany", "USA"], "directors": ["Roger Spottiswoode"], "fullplot": "People thrown into an unexpected and desperate situation discover their capacity for love and responsibility. A young Englishman, George Hogg, comes to lead sixty orphaned boys on a journey of over 500 perilous miles across the snow-bound Liu Pan Shan mountains to safety on the edge of the Mongolian desert. And how, in doing so, he comes to understand the meaning of courage. During his journey, Hogg learns to rely on the support of Chen, the leader of a Chinese communist partisan group who becomes his closest friend. He soon finds himself falling in love with Lee, a recklessly brave Australian nurse whom war has turned into an unsentimental healer on horseback. Along the way Hogg befriends Madame Wang, an aristocratic survivor who has also been displaced by war, who helps the young Englishman, his friends and their sixty war orphans make their way across mountain and desert regions to a place of safety near the western end of the Great Wall of China.", "genres": ["Drama", "War"], "imdb": {"id": 889588, "rating": 7.1, "votes": 7673}, "languages": ["English", "Japanese", "Mandarin"], "lastupdated": "2015-09-04 00:03:43.693000000", "metacritic": 49, "plot": "About young British journalist, George Hogg, who with the assistance of a courageous Australian nurse, saves a group of orphaned children during the Japanese occupation of China in 1937.", "poster": "https://m.media-amazon.com/images/M/MV5BMTM2MTM3MjM4NV5BMl5BanBnXkFtZTcwNDI1MzA3MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1213315200000, "runtime": 125, "title": "The Children of Huang Shi", "tomatoes": {"boxOffice": "$0.7M", "consensus": "This beautifully photographed but dramatically flat war drama recounts an important chapter in history with little cinematic freshness.", "critic": {"meter": 30, "numReviews": 76, "rating": 4.7}, "dvd": 1232409600000, "fresh": 23, "lastUpdated": 1441915477000, "production": "Sony Pictures Classics", "rotten": 53, "viewer": {"meter": 66, "numReviews": 70028, "rating": 3.2}, "website": "http://www.sonyclassics.com/thechildrenofhuangshi"}, "type": "movie", "writers": ["Jane Hawksley", "James MacManus"], "year": 2008}