{"_id": "573a13b9f29313caabd4f05d", "awards": {"nominations": 1, "text": "1 win & 1 nomination.", "wins": 1}, "cast": ["William Atherton", "Blythe Auffarth", "Blanche Baker", "Kevin Chamberlin"], "countries": ["USA"], "directors": ["Gregory Wilson"], "fullplot": "Loosely based on the true life events surrounding the torture Sylvia Likens faced during her stay with her aunt and her death, this movie is an adaptation Jack Ketchum's 1989 novel of the same name. Story begins with a road accident witnessed by David Moran which sets his mind into a fierce reflection of his not so good childhood memories of Meg and how they first met in 1958. After the death of their parents in a car accident, Meg and her crippled sister, Susan come to stay with their aunt, Ruth Chandler, a sadistic psychopath with their three sons, Willie, Ralphie, and Donny. Meg and her sister become an easy target and fall prey to their aunt's cruelty and her only hope is David, who happens to be her neighbor, who seems to be already captivated by her beauty. After days of mental and physical abuse from her aunt, Meg finds courage, one day to report the events to Officer Jennings. But to her disappointment, her aunt is not arrested and her life, which she thought could never get worse took a bad turn. As a punishment her aunt Ruth, her children, and their friends binds Meg in the cellar with her hands tied to the rafters. They play a bizarre game of \"confession\", and when Meg has nothing to confess, she is stripped naked. Rest of the story covers the various brutal and horrific tortures, Meg's seemingly unending agony, until one day things change. One day, David goes to visit Meg only to find her being raped by Willie. When he's done with her, Ruth even offers to allow David to do the same, which he refuses. But when things get bad, and Ruth decides to etch few words into Meg's stomach with a heated needle, David tries to run but is himself caught and tied up as he helplessly watches as Meg is mutilated with a blowtorch to \"destroying her desire for men forever.\" as her aunt puts it. Next day David gets up in the cellar and finds Susan sitting beside her sister who seems to be on her deathbed. David unties himself and decides that its time to change things. He lights a fire in the cellar to catch the attention of the neighbors and when Ruth enter the cellar he beats her to death using Susan's crutches. And to their luck Officer Jennings arrives to help them out. The rather painful and chaotic memory ends with David retrieving Meg's mother's ring from Ruth, and giving it to her before she finally succumbs to its wounds. Though these memories have marred his life and engraved his soul with such sadness, that not even time cure, the only thing that keeps David going on are those beautiful words that Meg taught him, \"It's what you do last that really counts.\"", "genres": ["Crime", "Drama", "Horror"], "imdb": {"id": 830558, "rating": 6.7, "votes": 16655}, "languages": ["English"], "lastupdated": "2015-08-23 00:18:57", "metacritic": 29, "num_mflix_comments": 1, "plot": "Based on the Jack Ketchum novel of the same name, The Girl Next Door follows the unspeakable torture and abuses committed on a teenage girl in the care of her aunt...and the boys who witness and fail to report the crime.", "poster": "https://m.media-amazon.com/images/M/MV5BMTUwMDcyNjE1MF5BMl5BanBnXkFtZTcwOTA1Njg0MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1224201600000, "runtime": 91, "title": "The Girl Next Door", "tomatoes": {"critic": {"meter": 67, "numReviews": 15, "rating": 6.2}, "dvd": 1196726400000, "fresh": 10, "lastUpdated": 1439926075000, "production": "Moderncine", "rotten": 5, "viewer": {"meter": 62, "numReviews": 6852, "rating": 3.5}, "website": "http://www.thegirlnextdoorfilm.com/"}, "type": "movie", "writers": ["Daniel Farrands (screenplay)", "Philip Nutman (screenplay)", "Jack Ketchum (book)"], "year": 2007}