{"_id": "573a13b3f29313caabd3b3ba", "awards": {"nominations": 14, "text": "12 wins & 14 nominations.", "wins": 12}, "cast": ["Keke Palmer", "Laurence Fishburne", "Angela Bassett", "Curtis Armstrong"], "countries": ["USA"], "directors": ["Doug Atchison"], "fullplot": "Eleven year-old Akeelah Anderson's life is not easy: her father is dead, her mom ignores her, her brother runs with the local gangbangers. She's smart, but her environment threatens to strangle her aspirations. Responding to a threat by her school's principal, Akeelah participates in a spelling bee to avoid detention for her many absences. Much to her surprise and embarrassment, she wins. Her principal asks her to seek coaching from an English professor named Dr. Larabee for the more prestigious regional bee. As the possibility of making it all the way to the Scripps National Spelling Bee looms, Akeelah could provide her community with someone to rally around and be proud of -- but only if she can overcome her insecurities and her distracting home life. She also must get past Dr. Larabee's demons, and a field of more experienced and privileged fellow spellers.", "genres": ["Drama"], "imdb": {"id": 437800, "rating": 7.5, "votes": 14368}, "languages": ["English"], "lastupdated": "2015-08-12 00:35:04.297000000", "metacritic": 72, "plot": "A young girl from South Los Angeles tries to make it to the National Spelling Bee.", "poster": "https://m.media-amazon.com/images/M/MV5BMTUzMDIwNjIzM15BMl5BanBnXkFtZTcwNTczODQzMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 1146182400000, "runtime": 112, "title": "Akeelah and the Bee", "tomatoes": {"boxOffice": "$18.8M", "consensus": "Although predictable in every way, a winning performance from its young star Keke Palmer and the rest of the cast makes it difficult not to cheer for the little heroine of Akeelah and the Bee. Sort of like Rocky for the middle school nerd set, Akeelah is a warm, family-friendly underdog story, featuring terrific supporting performances from Laurence Fishburne and Angela Bassett.", "critic": {"meter": 84, "numReviews": 136, "rating": 7}, "dvd": 1156809600000, "fresh": 114, "lastUpdated": 1440098077000, "production": "Lionsgate Releasing", "rotten": 22, "viewer": {"meter": 81, "numReviews": 84351, "rating": 3.6}, "website": "http://www.akeelahandthebee.com/splash.html"}, "type": "movie", "writers": ["Doug Atchison"], "year": 2006}