{"_id": "573a13b1f29313caabd365ec", "awards": {"nominations": 1, "text": "1 win & 1 nomination.", "wins": 1}, "cast": ["Allen Wagner", "Judy Wagner", "Emily Wagner", "Maggie Wagner"], "countries": ["USA"], "directors": ["Andrew Wagner"], "fullplot": "Judy and Allen are 70 years old, retired now, and at that point in their unremarkable marriage and lives that the farthest the day calls them from the crossword puzzle is to the Fairway supermarket. On one such excursion they run into two of their son Andrew's teachers from high school who want Andrew to return to New York to teach at his alma mater. Judy promises to pass the offer along, concealing the disappointment that she rarely speaks to her son. In the day that follows she spirals into a regret which ends in her epiphany to remedy her relationship with him. Immediately. And face-to-face. But since she's terrified of flying they must drive. Across the country to Los Angeles. Along for what began as a casual drive to the beach, Judy and Allen's two unmarried, thirty-something daughters, Emily and Maggie, find themselves roped into this odyssey. Even though Allen doesn't tear up the road, all the family and marital dirt is dug up.", "genres": ["Comedy", "Drama"], "imdb": {"id": 417182, "rating": 5.3, "votes": 429}, "languages": ["English"], "lastupdated": "2015-08-07 00:45:11.100000000", "metacritic": 72, "plot": "A retired New York City couple drive across country to reconnect with their reclusive son, joined by their two unmarried daughters.", "poster": "https://m.media-amazon.com/images/M/MV5BMTMxMTc0Mjg4Nl5BMl5BanBnXkFtZTcwNTkzMzAzMQ@@._V1_SY1000_SX677_AL_.jpg", "released": 1086912000000, "runtime": 97, "title": "The Talent Given Us", "tomatoes": {"consensus": "The Talent Given Us is an odd hybrid of reality and fiction, but works due to its engaging characters.", "critic": {"meter": 59, "numReviews": 51, "rating": 6.2}, "dvd": 1141689600000, "fresh": 30, "lastUpdated": 1437934327000, "rotten": 21, "viewer": {"meter": 45, "numReviews": 105, "rating": 2.9}, "website": "http://www.thetalentgivenus.com"}, "type": "movie", "writers": ["Andrew Wagner"], "year": 2004}