{"_id": "573a1394f29313caabce03c3", "awards": {"nominations": 8, "text": "Nominated for 3 Oscars. Another 7 wins & 8 nominations.", "wins": 10}, "cast": ["Audrey Hepburn", "Henry Fonda", "Mel Ferrer", "Vittorio Gassman"], "countries": ["USA", "Italy"], "directors": ["King Vidor"], "fullplot": "By 1812, Napoleon's forces controlled much of Europe. Russia, one of the few countries still unconquered, prepares to face Napoleon's troops together with Austria. Among the Russian soldiers are Count Nicholas Rostov and Prince Andrei Bolkonsky. Count Pierre Bezukhov, a friend of Andrei's and self-styled intellectual who is not interested in fighting. Pierre's life changes when his father dies, leaving him a vast inheritance. He is attracted to Natasha Rostov, Nicholas's sister, but she is too young, so he gives in to baser desires and marries the shallow, manipulative Princess Helene. The marriage ends when Pierre discovers his wife's true nature. Andrei is captured and later released by the French, and returns home only to watch his wife die in childbirth. Months later, Pierre and Andrei meet again. Andrei sees Natasha and falls in love, but his father will only permit the marriage if they postpone it for one year until Natasha turns 17. While Andrei is away on a military mission, Natasha is drawn to Anatole Kuragin, a womanizer. Pierre saves Natasha by telling her of Anatole's past before she can elope with him. Napoleon invades Russia. Pierre visits Andrei on the eve of the battle, and observes the battle that follows. Traumatized by the carnage, he vows to kill Napoleon himself.", "genres": ["Drama", "Romance", "War"], "imdb": {"id": 49934, "rating": 6.8, "votes": 6307}, "languages": ["English", "Italian", "Russian"], "lastupdated": "2015-09-05 00:36:04.237000000", "plot": "Napoleon's tumultuous relations with Russia including his disastrous 1812 invasion serve as the backdrop for the tangled personal lives of two aristocratic families.", "poster": "https://m.media-amazon.com/images/M/MV5BNmJjOThlYTYtYzFlZC00NjI1LWFhNzItYmIzNzk5NDZkZmRmL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": -421718400000, "runtime": 208, "title": "War and Peace", "tomatoes": {"critic": {"meter": 33, "numReviews": 6, "rating": 4.8}, "dvd": 1038873600000, "fresh": 2, "lastUpdated": 1442433800000, "production": "Paramount Pictures", "rotten": 4, "viewer": {"meter": 64, "numReviews": 7694, "rating": 3.4}}, "type": "movie", "writers": ["Leo Tolstoy (based on the novel by)", "Bridget Boland (adaptation)", "Robert Westerby (adaptation)", "King Vidor (adaptation)", "Mario Camerini (adaptation)", "Ennio De Concini (adaptation)", "Ivo Perilli (adaptation)"], "year": 1956}