{"_id": "573a13a5f29313caabd1568e", "awards": {"nominations": 4, "text": "2 wins & 4 nominations.", "wins": 2}, "cast": ["Murilo Benècio", "Carolina Ferraz", "Emèlio de Mello", "Beth Goulart"], "countries": ["Brazil"], "directors": ["Sandra Werneck"], "fullplot": "Fifteen year ago, Carlos went to the cinema to meet Jèlia, his university colleague with whom he was in love. She never showed up. Carlos was left waiting in the lobby alone. While he waits, something happens which will change his life. A scene, an encounter, an unfinished sentence... Something insignificant, but which will determine the character's life. Fifteen years later, we follow three completely different versions of Carlos's life. In one, he is a man divided between the stability of a secure life in a lukewarm marriage, and the growing desire to live a great love affair. In the second, he is homosexual and places passion above all else. In the third possible life, Carlos is a man who hasn't yet discovered love, and lives through successive disastrous relationships in search of the perfect woman. One of them is his real life. Another is not his life. And a third is the life he'd like to lead. Which is his true life ?", "genres": ["Comedy", "Romance", "Drama"], "imdb": {"id": 275915, "rating": 6.9, "votes": 919}, "languages": ["Portuguese"], "lastupdated": "2015-09-02 00:16:46.147000000", "num_mflix_comments": 1, "plot": "Fifteen year ago, Carlos went to the cinema to meet Jèlia, his university colleague with whom he was in love. She never showed up. Carlos was left waiting in the lobby alone. While he waits...", "poster": "https://m.media-amazon.com/images/M/MV5BODY5NTA0NTA1MF5BMl5BanBnXkFtZTcwMjE3OTYyMQ@@._V1_SY1000_SX677_AL_.jpg", "released": 985910400000, "runtime": 98, "title": "Possible Loves", "tomatoes": {"dvd": 1058227200000, "lastUpdated": 1437935029000, "production": "TLA Releasing", "viewer": {"meter": 57, "numReviews": 946, "rating": 3.1}}, "type": "movie", "writers": ["Maya Da-Rin (story)", "Paulo Halm"], "year": 2001}