{"_id": "573a13c5f29313caabd705f8", "awards": {"nominations": 25, "text": "21 wins & 25 nominations.", "wins": 21}, "cast": ["Fan Xu", "Jingchu Zhang", "Chen Li", "Zi-feng Zhang"], "countries": ["China"], "directors": ["Xiaogang Feng"], "fullplot": "In Tangshan, the truck driver Da Qiang, his wife Yuan Ni and their twins Fang Da, their son, and Fang Deng, their daughter, are a happy simple family. On 27 July 1976, a devastating earthquake destroys Tangshan, and Da Qiang dies while trying to rescue his children from their apartment. When a collapsed beam traps Fang Da and Fang Deng, Yuan Ni is forced to decide between saving her son or daughter and she chooses Fang Da. However, her daughter Fang Deng overhears her mother's choice and miraculously survives. She is rescued by a soldier and adopted by Mr. Wang and his wife with the name Wang Deng. Thirty-two years later, after an earthquake in China, Wang Deng, now married to a Canadian lawyer and living in Vancouver with her daughter, travels to China and voluntarily joins the rescue team. By chance she meets Fang Da and she learns the drama of Yuan Ni through all those years. The family is finally reunited at Yuan Ni's home, where bitterness is exposed and resolved.", "genres": ["Drama"], "imdb": {"id": 1393746, "rating": 7.6, "votes": 6835}, "languages": ["Mandarin"], "lastupdated": "2015-08-28 00:20:28.050000000", "num_mflix_comments": 1, "plot": "The epic story of a family separated as a result of the Great Tangshan Earthquake of 1976.", "poster": "https://m.media-amazon.com/images/M/MV5BMjEzMTg1MTYxMF5BMl5BanBnXkFtZTcwMzI5MDMwNA@@._V1_SY1000_SX677_AL_.jpg", "released": 1279756800000, "runtime": 135, "title": "Aftershock", "tomatoes": {"critic": {"meter": 90, "numReviews": 10, "rating": 6.4}, "dvd": 1293408000000, "fresh": 9, "lastUpdated": 1440698449000, "production": "China Film Group", "rotten": 1, "viewer": {"meter": 88, "numReviews": 4745, "rating": 4}, "website": "http://www.chinalionentertainment.com/aftershock/"}, "type": "movie", "writers": ["Wu Si (screenplay)", "Ling Zhang (novel)"], "year": 2010}