{"_id": "573a13d3f29313caabd970f2", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Mark Ruffalo", "Tim Robbins", "Gwyneth Paltrow", "Josh Gad"], "countries": ["USA"], "directors": ["Stuart Blumberg"], "fullplot": "Adam (Mark Ruffalo) has just reached the 5-year mark in his sex addiction sobriety with help from his sponsor Mike (Tim Robbins). New-comer Neil (Josh Gad) seeks out Adam's help hoping that he'll be his mentor, but Neil doesn't have the same maturity and continues to harass women at work, on the street, and on the subway. Adam has also just met Phoebe (Gwyneth Paltrow), who might be perfect for him, but Adam hasn't been in a relationship since he recognized his addiction to sex, and Phoebe doesn't date addicts. As Adam navigates the romantic relationship waters, Mike struggles connecting to his former drug-addicted son who has just returned home, and Neil develops a relationship with another woman in his sex addicts group, but a platonic friendship might be exactly what he needs.", "genres": ["Comedy", "Drama"], "imdb": {"id": 1932718, "rating": 6.4, "votes": 17571}, "languages": ["English"], "lastupdated": "2015-08-18 00:08:37.640000000", "metacritic": 54, "num_mflix_comments": 1, "plot": "A romantic comedy that brings together three disparate characters who are learning to face a challenging and often confusing world as they struggle together against a common demon: sex addiction.", "poster": "https://m.media-amazon.com/images/M/MV5BMjA5MzI3ODcxMF5BMl5BanBnXkFtZTcwODY5MTc4OQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1379116800000, "runtime": 112, "title": "Thanks for Sharing", "tomatoes": {"boxOffice": "$1.1M", "consensus": "Thanks For Sharing showcases some fine performances but doesn't delve into its thorny premise as deeply as it should.", "critic": {"meter": 49, "numReviews": 110, "rating": 5.6}, "dvd": 1389052800000, "fresh": 54, "lastUpdated": 1440095795000, "production": "Roadside Attractions", "rotten": 56, "viewer": {"meter": 43, "numReviews": 10596, "rating": 3.1}, "website": "http://thanksforsharingmovie.com/"}, "type": "movie", "writers": ["Stuart Blumberg", "Matt Winston"], "year": 2012}