{"_id": "573a13b2f29313caabd38cc4", "awards": {"nominations": 9, "text": "2 wins & 9 nominations.", "wins": 2}, "cast": ["Joseph Gordon-Levitt", "Jeff Daniels", "Matthew Goode", "Isla Fisher"], "countries": ["USA"], "directors": ["Scott Frank"], "fullplot": "An admired high school hockey player with a bright future foolishly takes a drive in the night with his girlfriend and two other friends with his headlights off with devastating results. The former athlete is left with a brain injury that prevents him from remembering many things for extended periods of time. To compensate, he keeps notes in a small notebook to aid him in remembering what he is to do. He also lives with a blind friend who aids him. Obviously, with the mental incapacitation, he is unable to have meaningful work. Thus he works as a night cleaning man in a bank. It is there he comes under the scrutiny of a gang planning to rob the bank. The leader befriends him and gets him involved with a young woman who further reels him in. After they get close and after reeling him in with his own failures, the bank plan unfolds. Confused but wanting to escape his current existence, he initially goes along with the scheme. After realizing he is being used, he attempts to stop the robbery, which of course immediately goes awry.", "genres": ["Crime", "Drama", "Thriller"], "imdb": {"id": 427470, "rating": 7.1, "votes": 48266}, "languages": ["English"], "lastupdated": "2015-08-31 00:11:28.263000000", "metacritic": 73, "num_mflix_comments": 1, "plot": "Chris is a once promising high school athlete whose life is turned upside down following a tragic accident. As he tries to maintain a normal life, he takes a job as a janitor at a bank, where he ultimately finds himself caught up in a planned heist.", "poster": "https://m.media-amazon.com/images/M/MV5BMjkyMzE5Nzg0OV5BMl5BanBnXkFtZTcwNTM3MzU0MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1175212800000, "runtime": 99, "title": "The Lookout", "tomatoes": {"boxOffice": "$4.5M", "consensus": "The Lookout is a genuinely suspenseful and affecting noir due to the great ensemble cast and their complex, realistic characters.", "critic": {"meter": 87, "numReviews": 166, "rating": 7.3}, "dvd": 1187049600000, "fresh": 145, "lastUpdated": 1441305157000, "production": "Miramax", "rotten": 21, "viewer": {"meter": 74, "numReviews": 80241, "rating": 3.5}, "website": "http://thelookout-movie.com/"}, "type": "movie", "writers": ["Scott Frank"], "year": 2007}