{"_id": "573a13acf29313caabd2941f", "awards": {"nominations": 5, "text": "3 wins & 5 nominations.", "wins": 3}, "cast": ["Jamie Bell", "Kristen Stewart", "Robert Longstreet", "Terry Loughlin"], "countries": ["USA"], "directors": ["David Gordon Green"], "fullplot": "Following the death of his wife Audrey, John Munn moves with his two sons, mid-teen Chris Munn and adolescent Tim Munn, to a pig farm in rural Drees County, Georgia, where they lead a reclusive life. The boys' maternal grandparents no longer visit due to being out of sorts with John. Chris is rebelling against this life in ways where he is regularly picked up by the police. Because of Tim's young age and health issues, Chris is routinely asked by their father to do more than his fair share of work around the farm. Into their lives returns Deel Munn, John's brother who the two boys did not even know existed. John emotionally distanced himself from Deel following Audrey's death and Deel's incarceration, Deel who has just been released from prison. John, however, welcomes his brother in a effort to mend old wounds, and for the boys to get to know one of their few relations. They will all soon learn that Deel has ulterior motives for his visit, those motives emerging largely from those wounds, and which has the boys fighting for their own survival in more ways than one.", "genres": ["Drama", "Thriller"], "imdb": {"id": 360130, "rating": 6.7, "votes": 6968}, "languages": ["English"], "lastupdated": "2015-08-07 00:13:45.990000000", "metacritic": 63, "num_mflix_comments": 2, "plot": "Following the death of his wife Audrey, John Munn moves with his two sons, mid-teen Chris Munn and adolescent Tim Munn, to a pig farm in rural Drees County, Georgia, where they lead a ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTYzODgyOTMzMV5BMl5BanBnXkFtZTcwMjU2MTcyMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1103241600000, "runtime": 108, "title": "Undertow", "tomatoes": {"critic": {"meter": 55, "numReviews": 117, "rating": 5.9}, "dvd": 1114473600000, "fresh": 64, "lastUpdated": 1439921322000, "production": "MGM", "rotten": 53, "viewer": {"meter": 63, "numReviews": 7243, "rating": 3.4}, "website": "http://www.mgm.com/ua/undertow/"}, "type": "movie", "writers": ["Lingard Jervey (story)", "Joe Conway (screenplay)", "David Gordon Green (screenplay)"], "year": 2004}