{"_id": "573a13a5f29313caabd157ea", "awards": {"nominations": 7, "text": "9 wins & 7 nominations.", "wins": 9}, "cast": ["Bill Nighy", "Tom Hollander", "Douglas Henshall", "Clèmentine Cèlariè"], "countries": ["UK", "France"], "directors": ["Tom Hunsinger", "Neil Hunter"], "fullplot": "Devastated by Stuart's death, his brother-in-law, lover and best friend decide to take their lives in hand. Dan is a faithful and loving father and husband, until the day he meets Corinne. This buxom and sublime Frenchwoman seduces Dan with her honesty and hedonism, so much so that he wonders if he hasn't missed out on life. Nick, a homosexual restaurant owner, begins a relationship with a high-spirited young woman right after losing his lover, Stuart. When their apparently innocent relationship takes a more intimate turn, Nick is troubled by his feelings for his female comrade. Tim, carefree and charismatic, comes home after eight years abroad. Still looking for that \"elusive something\" that has been missing in his life, Tim finds it in a woman who works in a fashion boutique. But confronted with his future for the first time, the only thing that stands in the way is this unknown woman's past.", "genres": ["Comedy", "Drama"], "imdb": {"id": 276276, "rating": 6.8, "votes": 1243}, "languages": ["English"], "lastupdated": "2015-08-25 00:02:37.977000000", "metacritic": 75, "num_mflix_comments": 1, "plot": "Three intersecting stories about people whose lives are affected by the death of a gay restaurateur.", "poster": "https://m.media-amazon.com/images/M/MV5BMTUyMzkxMzk5OV5BMl5BanBnXkFtZTcwNTc1MTQyMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1025222400000, "runtime": 100, "title": "Lawless Heart", "tomatoes": {"consensus": "Unconventional and refreshing, this strikingly un-Hollywood film takes a quiet and heartbreaking look at the warmth and inspiration of friendships lost.", "critic": {"meter": 86, "numReviews": 51, "rating": 7.2}, "dvd": 1061251200000, "fresh": 44, "lastUpdated": 1441910569000, "production": "First Look Pictures", "rotten": 7, "viewer": {"meter": 59, "numReviews": 557, "rating": 3.6}, "website": "http://www.lawlessheart.co.uk/"}, "type": "movie", "writers": ["Neil Hunter", "Tom Hunsinger"], "year": 2001}