{"_id": "573a13aef29313caabd2ec92", "awards": {"nominations": 6, "text": "2 wins & 6 nominations.", "wins": 2}, "cast": ["James Allodi", "Maury Chaykin", "Paul Gross", "Rebecca Jenkins"], "countries": ["Canada"], "directors": ["Daniel MacIvor"], "fullplot": "Wilby is the name of a small island in the Canadian Maritimes and the name of the main town located on the island. According to residents, there are two types of people who live on Wilby: islanders (people who were born on Wilby) and non-islanders. Among the townsfolk of Wilby are: single mom and recently returned islander Sandra Anderson, who was known as the girl in town with the reputation, something that has not changed in her adult years; Sandra's teen-aged daughter, Emily, who doesn't want to end up like her mother but can only think about making out with her new boyfriend; Buddy French, the local police officer who is having unspoken marital problems with his non-islander wife, Carol, the town realtor whose controlling behavior is pushing her and others around her on the verge of a nervous breakdown; the Mayor, Brent Fisher, who is secretly planning for his life post politics; dyslexic Duck McDonald, the town handyman; and recently separated non-islander Dan Jarvis who, because of activities at the island's seaside hangout called \"The Watch\", wants to kill himself if only people would leave him alone. As the townsfolk interact with each other, most are looking for the same thing as summed up by Duck to Emily in speaking about her mother: \"She wants to love and be loved, just like all of us\".", "genres": ["Comedy", "Drama"], "imdb": {"id": 383717, "rating": 6.8, "votes": 1291}, "languages": ["English"], "lastupdated": "2015-08-24 00:14:26.870000000", "plot": "A day-in-the-life dark comedy concerning a group of islanders, their respective secrets, and one man's plan to kill himself quietly.", "poster": "https://m.media-amazon.com/images/M/MV5BMjE2NjkzOTE2MV5BMl5BanBnXkFtZTcwOTI4NDEzMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 1126224000000, "runtime": 99, "title": "Wilby Wonderful", "type": "movie", "writers": ["Daniel MacIvor"], "year": 2004}