{"_id": "573a1395f29313caabce2ed9", "awards": {"nominations": 8, "text": "Nominated for 1 Oscar. Another 7 nominations.", "wins": 0}, "cast": ["Elizabeth Hartman", "Geraldine Page", "Peter Kastner", "Rip Torn"], "countries": ["USA"], "directors": ["Francis Ford Coppola"], "fullplot": "Bernard Chanticleer's father gives him two simple words of advice: \"Grow up.\" Bernard knows that his first step is to find a girl who's \"willing,\" but he passes up a sure thing, Amy Partlett, for a more elusive goal. Her name is Barbara Darling, an inscrutable go-go dancer. More than a few obstacles keep Bernard from his dream world. There's his doting mother, who mails him locks of her hair and weeps at the thought of her baby as a man; there's a malicious rooster, trained to attack pretty girls, patrolling the halls of his New York City rooming house; and most of all, there's Barbara herself. She turns out to be a man hater, emotionally scarred by the lecherous wooden-legged hypnotherapist who \"counseled\" her in high school. All in all, Bernard finds himself in an improbable universe with a calculated clumsiness designed to evoke his confusing coming-of-age.", "genres": ["Comedy", "Drama", "Romance"], "imdb": {"id": 61209, "rating": 6.4, "votes": 1051}, "languages": ["English"], "lastupdated": "2015-08-23 01:17:00.647000000", "num_mflix_comments": 1, "plot": "Post-teen virgin moves to New York City, falls for a cold-hearted beauty, then finds true love with a loyal lass.", "poster": "https://m.media-amazon.com/images/M/MV5BMTQ4NTQzNzY3MV5BMl5BanBnXkFtZTgwNjQyNjIzMTE@._V1_SY1000_SX677_AL_.jpg", "rated": "TV-MA", "released": -76464000000, "runtime": 96, "title": "You're a Big Boy Now", "tomatoes": {"critic": {"meter": 78, "numReviews": 9, "rating": 6.4}, "fresh": 7, "lastUpdated": 1440613916000, "rotten": 2, "viewer": {"meter": 54, "numReviews": 433, "rating": 3.3}}, "type": "movie", "writers": ["David Benedictus (novel)", "Francis Ford Coppola (written for the screen by)"], "year": 1966}