{"_id": "573a1397f29313caabce6d5e", "awards": {"nominations": 12, "text": "Won 2 Oscars. Another 16 wins & 12 nominations.", "wins": 18}, "cast": ["Brad Davis", "Irene Miracle", "Bo Hopkins", "Paolo Bonacelli"], "countries": ["UK", "USA"], "directors": ["Alan Parker"], "fullplot": "On October 6, 1970 while boarding an international flight out of Istanbul Airport, American Billy Hayes is caught attempting to smuggle 2 kilos of hashish out of the country, the drugs strapped to his body. He is told that he will be released if he cooperates with the authorities in identifying the person who actually sold him the hash. Billy's troubles really begin when after that assistance, he makes a run for it and is recaptured. He is initially sentenced to just over four years for possession, with no time for the more harsh crime of smuggling. The prison environment is inhospitable in every sense, with a sadistic prison guard named Hamidou ruling the prison, he who relishes the mental and physical torture he inflicts on the prisoners for whatever reason. Told to trust no one, Billy does befriend a few of the other inmates, namely fellow American Jimmy Booth (in for stealing two candlesticks from a mosque), a Swede named Erich, and one of the senior prisoners having already served seven years, an Englishman named Max, the latter two also in for hash related charges. One prisoner not befriended is Rifki, who wields power in the prison as the unofficial eyes and ears for the guards. As Billy, his family and his girlfriend Susan attempt through legal and diplomatic channels for Billy's release, Max tells him that the only way out is to \"catch the midnight express\" aka escape, which is what Jimmy is continually trying to do. When Billy's situation changes, he becomes more desperate in every sense of the word. It seems as if Billy has only two options: to let the prison ultimately figuratively then literally kill him, or to somehow regain control of his life through whatever means available.", "genres": ["Biography", "Crime", "Drama"], "imdb": {"id": 77928, "rating": 7.7, "votes": 49941}, "languages": ["English", "Maltese", "French", "Turkish"], "lastupdated": "2015-08-18 00:03:59.330000000", "num_mflix_comments": 4, "plot": "The true story of Billy Hayes, an American college student who is caught smuggling drugs out of Turkey and thrown into prison.", "poster": "https://m.media-amazon.com/images/M/MV5BNDU1MjQ0YWMtMWQ2MS00NTdmLTg1MGItNDA5NTNkNTRhOTIyXkEyXkFqcGdeQXVyNTIzOTk5ODM@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 276480000000, "runtime": 121, "title": "Midnight Express", "tomatoes": {"critic": {"meter": 95, "numReviews": 21, "rating": 7.8}, "dvd": 990489600000, "fresh": 20, "lastUpdated": 1439836767000, "production": "Sony Pictures Home Entertainment", "rotten": 1, "viewer": {"meter": 90, "numReviews": 30462, "rating": 3.9}}, "type": "movie", "writers": ["Billy Hayes (book)", "William Hoffer (book)", "Oliver Stone (screenplay)"], "year": 1978}