{"_id": "573a13acf29313caabd2768c", "awards": {"nominations": 6, "text": "5 wins & 6 nominations.", "wins": 5}, "cast": ["Robert Lepage", "Anne-Marie Cadieux", "Marco Poulin", "Cèline Bonnier"], "countries": ["Canada"], "directors": ["Robert Lepage"], "fullplot": "Forty-something Quebeèois Philippe Roberge is floundering in his life. He believes that no one listens to him or takes him seriously. A graduate student in Philosophy of Scientific Culture, he has just failed his Ph.D. dissertation for the second time, his theory of interest in outer space being a narcissistic response from man being widely rejected throughout the community. To make ends meet, he works selling newspaper subscriptions. And he has a cordial but basically non-existent relationship with his ex-wife. Philippe examines his life in response to the recent death of his mother coupled with his dissertation beliefs. Although she lived in a care home, he acted as her primary caregiver. His only remaining family is his younger gay brother, Andrè, the two who could not have more different temperaments. As such, they do not get along. Following his mother's death, Philippe's thoughts about his life are influenced by three major incidents: being invited to speak at a major conference in Russia by a cosmonaut who he idolizes, entering a contest on sending messages into outer space, and receiving information regarding the nature of his mother's death.", "genres": ["Drama"], "imdb": {"id": 352332, "rating": 7.2, "votes": 1603}, "languages": ["French", "English", "Russian"], "lastupdated": "2015-09-15 03:22:04.467000000", "metacritic": 76, "plot": "After the death of his mother, a man tries to discover a meaning to his life, to the universe and to rebuild a relationship with the only family he has left: his brother.", "poster": "https://m.media-amazon.com/images/M/MV5BMTM2NTEzMDk4NF5BMl5BanBnXkFtZTcwMzA2NTIzMQ@@._V1_SY1000_SX677_AL_.jpg", "released": 1095379200000, "runtime": 105, "title": "The Far Side of the Moon", "tomatoes": {"critic": {"meter": 79, "numReviews": 19, "rating": 7}, "dvd": 1144108800000, "fresh": 15, "lastUpdated": 1435177548000, "production": "Max Films International", "rotten": 4, "viewer": {"meter": 87, "numReviews": 10624, "rating": 3.1}, "website": "http://www.farsideofthemoon.com/"}, "type": "movie", "writers": ["Robert Lepage (play)", "Robert Lepage"], "year": 2003}