{"_id": "573a13acf29313caabd289b3", "awards": {"nominations": 9, "text": "1 win & 9 nominations.", "wins": 1}, "cast": ["Will Ferrell", "Christina Applegate", "Paul Rudd", "Steve Carell"], "countries": ["USA"], "directors": ["Adam McKay"], "fullplot": "In 1970s San Diego, journalism was a well respected profession and people actually cared about what they saw on TV. And the top rated anchor man in the city is Ron Burgundy. He enjoys his run at the top, and has for the last five years. And his news team is equally as good as he is. Professional jock and former professional baseball player Champ Kind handles the sports, the curiously dim witted Brick Tamland - who's a few channels short of a cable subscription - handles the weather, and ladies' man Brian Fantana - whose collection of fine scents would be in the Guinness Book Of Records - handles the on-field reporting. But now all that is about to change forever. The TV station Burgundy works for, Channel 4, has embraced diversity and has hired a beautiful new female anchor named Veronica Corningstone. While Ron Burgundy and the rest of the Channel 4 news team enjoys fighting with competitors, drinking, and flirting with the ladies, Veronica quietly climbs her way to the top. And Veronica's success drives Ron Burgundy crazy. So much that Veronica's meddling causes Ron to get demoted and ultimately lose his job with Channel 6. Now left with nothing, Ron must find a way to get back to the top - and that involves a story about a rare Chinese panda giving birth on US soil. Will Ron be the one to report the story on a national level?", "genres": ["Comedy"], "imdb": {"id": 357413, "rating": 7.3, "votes": 246089}, "languages": ["English", "French", "Spanish"], "lastupdated": "2015-09-07 00:05:29.703000000", "metacritic": 63, "num_mflix_comments": 428, "plot": "Ron Burgundy is San Diego's top rated newsman in the male-dominated broadcasting of the '70s, but that's all about to change for Ron and his cronies when an ambitious woman is hired as a new anchor.", "poster": "https://m.media-amazon.com/images/M/MV5BMTQ2MzYwMzk5Ml5BMl5BanBnXkFtZTcwOTI4NzUyMw@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1089331200000, "runtime": 94, "title": "Anchorman: The Legend of Ron Burgundy", "tomatoes": {"boxOffice": "$84.1M", "consensus": "Filled with inspired silliness and quotable lines, Anchorman isn't the most consistent comedy in the world, but Will Ferrell's buffoonish central performance helps keep this portrait of a clueless newsman from going off the rails.", "critic": {"meter": 66, "numReviews": 196, "rating": 6.3}, "dvd": 1104192000000, "fresh": 130, "lastUpdated": 1442081909000, "production": "Dreamworks", "rotten": 66, "viewer": {"meter": 86, "numReviews": 792662, "rating": 3.6}, "website": "http://www.anchorman-themovie.com/"}, "type": "movie", "writers": ["Will Ferrell", "Adam McKay"], "year": 2004}