{"_id": "573a139bf29313caabcf37d8", "awards": {"nominations": 4, "text": "2 wins & 4 nominations.", "wins": 2}, "cast": ["Rene Russo", "Jason Alexander", "Piper Perabo", "Randy Quaid"], "countries": ["USA", "Germany"], "directors": ["Des McAnuff"], "fullplot": "35 years after The Rocky and Bullwinkle Show's cancellation, our two TV heroes have been living off the finances of their reruns on TV. To make matters worse, Rocky has lost his ability to fly, and the trees in Frostbite Falls have all been cut down. Meanwhile, over in Pottsylvania, home of Rocky and Bullwinkle's arch enemies Fearless Leader, Boris, and Natasha, the Iron Curtain has fallen, leading the villains to leave Pottsylvania, and dig through a tunnel all the way to the TV of a Hollywood Producer, Minnie Mogul. She signs a contract, giving her the rights to produce the Rocky and Bullwinkle Movie, and accidentally pulls the three villains out of the TV, turning them into humans! Now, they have an evil plan to hypnotize America, using RBTV (Really Bad TeleVision), making everyone's mind mush, so he can go on to the TV, and get everyone to vote him President of the USA! However, new FBI Agent Karen Sympathy has an assignment--get the only ones who could ever defeat the villains- Rocky and Bullwinkle. Using a green light lighthouse, Rocky and Bullwinkle (and their Narrator) are sucked out of the TV world, and to real life as 3D computer-generated characters! With all of America being hypnotized, and Fearless Leader's evil speech in 48 hours, and Boris and Natasha giving chase, planning to use a computer laser to send destroy moose and squirrel, it's Rocky, Bullwinkle, and Karen on a hilarious, pun-filled, and cameo-filled adventure to New York by plane, car, truck, hoof, flying squirrel, and yes, e-mail, to stop Fearless Leader and save America!", "genres": ["Animation", "Adventure", "Comedy"], "imdb": {"id": 131704, "rating": 4.1, "votes": 15926}, "languages": ["English"], "lastupdated": "2015-08-18 00:10:35.377000000", "metacritic": 36, "num_mflix_comments": 2, "plot": "When enemies Boris, Natasha and Fearless leader escape into the real world with a nefarious scheme, Rocky & Bullwinkle do the same and team up with a young F.B.I. agent to stop the trio.", "poster": "https://m.media-amazon.com/images/M/MV5BNWNiYmIwNjItNTYzNC00NzQyLTlkOTEtM2M4NDg4NTQxYmMzXkEyXkFqcGdeQXVyNTUyMzE4Mzg@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 962323200000, "runtime": 92, "title": "The Adventures of Rocky & Bullwinkle", "tomatoes": {"boxOffice": "$0.4M", "consensus": "Though the film stays true to the nature of the original cartoon, the script is disappointing and not funny.", "critic": {"meter": 43, "numReviews": 96, "rating": 4.8}, "dvd": 982022400000, "fresh": 41, "lastUpdated": 1442340385000, "production": "Universal Pictures", "rotten": 55, "viewer": {"meter": 19, "numReviews": 51789, "rating": 2.2}, "website": "http://www.rockyandbullwinkle.com"}, "type": "movie", "writers": ["Jay Ward (characters)", "Kenneth Lonergan"], "year": 2000}