{"_id": "573a13b7f29313caabd4a87d", "awards": {"nominations": 3, "text": "3 nominations.", "wins": 0}, "cast": ["Tre Armstrong", "Boyd Banks", "Clè Bennett", "Ardon Bess"], "countries": ["Canada", "USA", "France"], "directors": ["Ian Iqbal Rashid"], "fullplot": "Unable to afford the tuition needed to fund her private school education, Rayanna or Raya (Rutina Wesley) returns to her family home in the city while reluctantly re-evaluating her future. Upon learning that the top prize for an upcoming step-dancing competition is $50,000, Raya uses her impressive moves to earn a coveted slot in her good friend Bishop's (Dwain Murphy) predominantly male JSJ crew. Isolated from the local females due to jealousy and separated from her fellow dancers by gender, the ambitious dancer is subsequently kicked-off the team for showing off during a preliminary competition. Now, if Raya has any hope of realizing her medical school dreams, she will have to either earn back Bishop's trust or organize her own dance crew and start over from scratch. In the end, she eventually learns \"how she move\".", "genres": ["Drama"], "imdb": {"id": 770810, "rating": 3.2, "votes": 4575}, "languages": ["English"], "lastupdated": "2015-09-17 00:48:09.577000000", "metacritic": 63, "num_mflix_comments": 2, "plot": "Following her sister's death from drug addiction, a high school student is forced to leave her private school to return to her old, crime-filled neighborhood where she re-kindles an unlikely passion for the competitive world of step dancing.", "poster": "https://m.media-amazon.com/images/M/MV5BMzI3MDA5ODg4NV5BMl5BanBnXkFtZTcwMzkyMjc1MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1201219200000, "runtime": 94, "title": "How She Move", "tomatoes": {"boxOffice": "$7.0M", "consensus": "Despite a formulaic plot, the energetic and gritty How She Move is elevated by a commanding debut performance by Rutina Wesley.", "critic": {"meter": 66, "numReviews": 77, "rating": 6}, "dvd": 1209427200000, "fresh": 51, "lastUpdated": 1439316363000, "production": "Paramount Vantage", "rotten": 26, "viewer": {"meter": 50, "numReviews": 32694, "rating": 3.3}, "website": "http://www.howshemove.com"}, "type": "movie", "writers": ["Annmarie Morais"], "year": 2007}