{"_id": "573a13daf29313caabdadaea", "awards": {"nominations": 3, "text": "3 nominations.", "wins": 0}, "cast": ["Prabhudheva", "Ganesh Acharya", "Kay Kay Menon", "Lauren Gottlieb"], "countries": ["India"], "directors": ["Remo"], "fullplot": "For Vishnu (Prabhudheva), widely regarded as India's best dancer, dance is more than a passion - it's the reason he lives! So when he finds himself thrown out from the swish dance academy he himself set up, by his manipulative business partner, it feels like the oxygen has been sucked out from the air he breathes. Heart-broken, Vishnu decides to give up dance and leave Mumbai forever. However the night before his departure he witnesses a most amazing sight - a group of dancers preparing for the upcoming Ganpati Dance Battle - an annual festival that pits Mumbai's best dance groups against each other. Watching the raw talent of these amazing dancers helps Vishnu arrive at a decision - he will take this disparate group under his wing, help them overcome their personal rivalries and past demons and turn them into India's best dance squad! From India's biggest film studio, UTV Motion Pictures, and renowned choreographer & director, Remo D'souza comes India's first dance film in 3D - a spectacular entertainer that proves yet again that if you dare to dream, impossible is nothing!", "genres": ["Music", "Western"], "imdb": {"id": 2321163, "rating": 6.5, "votes": 4415}, "languages": ["Hindi"], "lastupdated": "2015-08-16 00:54:17.400000000", "plot": "When a capable dancer is provoked by the evil design of his employer, naturally he will be out to prove his mettle.", "poster": "https://m.media-amazon.com/images/M/MV5BMTU3NTk0NjE5Nl5BMl5BanBnXkFtZTcwMTU2ODMwOQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 1360281600000, "runtime": 160, "title": "ABCD (Any Body Can Dance)", "tomatoes": {"boxOffice": "$0.2M", "lastUpdated": 1441304924000, "production": "UTV Motion Pictures", "viewer": {"meter": 64, "numReviews": 313, "rating": 3.5}, "website": "http://www.utvgroup.com/motion-pictures/coming-soon/abcd-anybody-can-dance.html"}, "type": "movie", "writers": ["Amit Aryan (dialogue)", "Tushar Hiranandani (screenplay)", "Mayur Puri (additional dialogue)", "Remo (story)", "Bhanu Pratap Singh (associate writer)"], "year": 2013}