{"_id": "573a13d2f29313caabd92b7a", "awards": {"nominations": 51, "text": "46 wins & 51 nominations.", "wins": 46}, "cast": ["Daniel Gimènez Cacho", "Ramèn Barea", "Inma Cuesta", "èngela Molina"], "countries": ["Spain", "Belgium", "France"], "directors": ["Pablo Berger"], "fullplot": "A band of bullfighting dwarfs save the life of a young woman with amnesia. They end up taking her under their wing when they find out that she has seemingly natural skills as a bullfighter, upon which they can capitalize not only for their act but for her own personal gain. As she does not know her name or background, the dwarfs coin her Blancanieves, after the famed fairy tale. What they are all unaware of is that she is really Carmen, the daughter of the once great matador, Antonio Villalta. On the day Carmen was born, her father suffered a career ending accident, and her mother died in childbirth. Her father quickly remarried his nurse, the evil Encarna. Although raised by her grandmother during her early years, Carmen, following the death of her grandmother, went to live with Encarna while an adolescent, Encarna who treated her as a slave. Carmen eventually found her disabled father, who was hidden away and treated poorly by Encarna. In the meantime, Encarna was cavorting with the household chauffeur while living off her husband's riches. Antonio did pass along to Carmen the art of bullfighting. As Blancanieves teeters on the brink of fame as a matador, her life may be placed in jeopardy if Encarna learns who she is, as Encarna believed Carmen was dead since she was the one who ordered her murder at the hands of the chauffeur.", "genres": ["Drama", "Fantasy"], "imdb": {"id": 1854513, "rating": 7.5, "votes": 7074}, "languages": ["Spanish"], "lastupdated": "2015-09-15 02:24:03.127000000", "metacritic": 82, "num_mflix_comments": 2, "plot": "A twist on the Snow White fairy tale that is set in 1920s Seville and centered on a female bullfighter.", "poster": "https://m.media-amazon.com/images/M/MV5BMjIyNjY2MTgxMF5BMl5BanBnXkFtZTcwODg2Njk1OA@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1348790400000, "runtime": 104, "title": "Snow White", "tomatoes": {"boxOffice": "$0.2M", "consensus": "Smartly written and beautiful to behold, Blancanieves uses its classic source material to offer a dark tale, delightfully told.", "critic": {"meter": 94, "numReviews": 103, "rating": 7.8}, "dvd": 1378166400000, "fresh": 97, "lastUpdated": 1441996886000, "production": "Cohen Media Group", "rotten": 6, "viewer": {"meter": 83, "numReviews": 4860, "rating": 4}, "website": "http://cohenmedia.net/blancanieves/synopsis/"}, "type": "movie", "writers": ["Pablo Berger"], "year": 2012}