{"_id": "573a13a2f29313caabd0bd50", "awards": {"nominations": 2, "text": "3 wins & 2 nominations.", "wins": 3}, "cast": ["Henry Thomas", "Dominique Swain", "Scott Bairstow", "Sebastian DeVicente"], "countries": ["USA"], "directors": ["Gustavo Lipsztein"], "fullplot": "In Rio de Janeiro, Gloria is an ambitious young woman, whose father is bankrupted. When the son of his business partner, Marcos, arrives in Rio, her father asks Gloria to have a trip with him in their boat Boa Vida. Gloria, her boyfriend Danny and their common friend Jeff get Marcos in his hotel and they go to Angra dos Reis. While in the sea, they drink Caipirinha and beer, and Gloria flirts with the wealthy Marcos. The jealous Danny sees they kissing each other, throws Marcos in the water with a lifebuoy and drives the boat to a distant island to scare Marcos. However, they have a problem with the propellers and when they return to the spot, they do not find Marcos anymore. Afraid of the consequences of his possible drowning, they discuss alibis and how to resolve the situation, shattering their relationship in an environment of high-tension and selfishness.", "genres": ["Crime", "Thriller"], "imdb": {"id": 235333, "rating": 4.8, "votes": 682}, "languages": ["English"], "lastupdated": "2015-08-08 00:08:54.367000000", "num_mflix_comments": 3, "plot": "With the guilt of a young man's death on their hands, three friends see their relationship disintegrate as each vies for survival by trying to kill one another.", "poster": "https://m.media-amazon.com/images/M/MV5BMTk2MTQ4Njk0M15BMl5BanBnXkFtZTcwMjk3MzIyMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1013472000000, "runtime": 90, "title": "Dead in the Water", "tomatoes": {"critic": {"meter": 40, "numReviews": 5, "rating": 5}, "dvd": 1013472000000, "fresh": 2, "lastUpdated": 1438970849000, "production": "Studio Home Entertainment", "rotten": 3, "viewer": {"meter": 33, "numReviews": 261, "rating": 2.8}}, "type": "movie", "writers": ["Gustavo Lipsztein"], "year": 2002}