{"_id": "573a13dff29313caabdb9453", "awards": {"nominations": 4, "text": "9 wins & 4 nominations.", "wins": 9}, "cast": ["Matteo Simoni", "Luigi Lo Cascio", "Donatella Finocchiaro", "Evelien Bosmans"], "countries": ["Belgium", "Italy"], "directors": ["Stijn Coninx"], "fullplot": "Salvatore Granata is a rather poor man who lives with his wife, son and daughter in Calabria in Italy. One day Salvatore decides to move to Belgium to work in the coal mine of Waterschei as a \"gastarbeider,\" an immigrant worker. His family will stay in Italy as Salvatore will only be in Belgium for three years. He hopes to earn much money in a rather small time frame so he can buy a forge for his son Rocco who is now still a 9 year old boy. After a year, Salvatore decides his family should be with him, so they also move to Belgium. They soon discover the life of a \"gastarbeider\" is difficult: they have to live in some kind of barracks, they are neglected by the Belgian people and they do not earn much. They are astonished when they hear Salvatore signed a contract of five years and children of \"gastarbeiders\" ought to work in the mines as soon they leave high school. Rocco meets Helena, the daughter of the local grocer. However, the man is a racist and forbids his daughter to play with Italian boys.", "genres": ["Biography", "Drama", "Music"], "imdb": {"id": 2614860, "rating": 7.2, "votes": 1555}, "languages": ["Flemish", "Italian", "French"], "lastupdated": "2015-08-21 00:01:24.673000000", "plot": "The true story of Rocco Granata, an Italian coal miner's son who followed his passion for music against his father's wishes and social barriers.", "poster": "https://m.media-amazon.com/images/M/MV5BMjE0ODk2NDk5Ml5BMl5BanBnXkFtZTgwMzEzMTg5MDE@._V1_SY1000_SX677_AL_.jpg", "released": 1383696000000, "runtime": 118, "title": "Marina", "tomatoes": {"lastUpdated": 1440442688000, "viewer": {"numReviews": 47, "rating": 3.5}}, "type": "movie", "writers": ["Stijn Coninx", "Rik D'Hiet"], "year": 2013}