{"_id": "573a13d2f29313caabd9122b", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Sarah Hyland", "Matt Prokop", "Sasha Pieterse", "Jordan Nichols"], "countries": ["USA"], "directors": ["Jeffrey Hornaday"], "fullplot": "Dylan Shoenfield is the pink princess of the upscale Woodlands Academy. She has the coolest boyfriend, the most popular friends, and a brand-new it bag that everyone covets, but when she accidentally tosses her Serge Sanchez bag into a fountain, this princess comes face-to-face with her own personal frog - self-professed film geek Josh Rosen. In return for rescuing Dylan's bag, Josh convinces Dylan to let him film her for his documentary on high school popularity. Reluctantly, Dylan lets F-list Josh into her A-list world, and is shocked to realize that sometimes nerds can be pretty cool. But when Dylan's so-called prince charming of a boyfriend dumps her flat, her life and her social status comes to a crashing halt. Can Dylan win the Woodlands Academy Fall Formal Leaf Queen crown? Can Josh win the Woodlands Academy 10th Annual Film Festival? Can Dylan, with Josh's help, pull the pieces together to create her own happily-ever-after?", "genres": ["Comedy", "Drama", "Romance"], "imdb": {"id": 1835977, "rating": 6.6, "votes": 7294}, "languages": ["English"], "lastupdated": "2015-09-01 00:32:54.287000000", "num_mflix_comments": 1, "plot": "To win a school popularity contest, a high school diva permits a film club classmate to record her popular life, but the film starts documenting her decline instead.", "poster": "https://m.media-amazon.com/images/M/MV5BMzQ0M2I2MDUtNTQxYi00ZTczLTlhN2QtZjJkNTUzYWQ4OTYwXkEyXkFqcGdeQXVyNjQ2MjQ5NzM@._V1_SY1000_SX677_AL_.jpg", "rated": "TV-G", "released": 1320969600000, "runtime": 94, "title": "Geek Charming", "tomatoes": {"lastUpdated": 1420297256000, "viewer": {"meter": 50, "numReviews": 2, "rating": 0}}, "type": "movie", "writers": ["Robin Palmer (based on the novel by)", "Elizabeth Hackett (teleplay)", "Hilary Galanoy (teleplay)"], "year": 2011}