{"_id": "573a1397f29313caabce5c08", "awards": {"nominations": 2, "text": "Nominated for 1 Oscar. Another 6 wins & 2 nominations.", "wins": 7}, "cast": ["Yossi Yadin", "Len Birman", "Marilyn Lightstone", "Jeff Lynas"], "countries": ["Canada"], "directors": ["Jèn Kadèr"], "fullplot": "It's the 1920's. The Hermans - Harry Herman, his wife Annie Herman nèe Elias, their adolescent son David Herman, and Annie's father - are a Jewish family living in a small flat in the working class Jewish neighborhood of Montrèal. David loves his \"Zaida\" (grandfather) with who he spends most Sundays driving around in their horse drawn wagon collecting junk - namely \"rags, clothes, bottles\" - to earn money. David also loves hearing his Zaida's stories about their Jewish culture, although most of those stories are made up and not based based on religious Jewish beliefs. Those stories are only one bone of contention between religious Zaida and secular Harry, as modern thinking Harry feels the stories are old fashioned hogwash and provide David with no grounding in what is real in life. Another issue of contention is money, as Harry is always dreaming of get rich schemes - the latest being to manufacture permanently creased and thus iron-less trousers - for which Zaida will not provide unconditional funding. And a third issue is Zaida's aging horse Ferdeleh, which Harry believes would be better put to sleep. Usually, David, who is at the stage in his life where he takes most things literally, sides with his Zaida, and considers his father a liar. Caught in the middle is Annie. How to handle David becomes a larger issue when two of the most natural of events occur within their family.", "genres": ["Drama"], "imdb": {"id": 73293, "rating": 7, "votes": 363}, "languages": ["English", "French", "Hebrew"], "lastupdated": "2015-07-20 00:17:17.027000000", "num_mflix_comments": 2, "plot": "A Jewish boy grows up in 1920s Montreal with a grandfather who tells stories and a father who won't work.", "poster": "https://m.media-amazon.com/images/M/MV5BNzc2N2Q2ZGQtYTFkZi00Y2UxLWFjNWYtYTRiN2YxOTQ0ZDk1XkEyXkFqcGdeQXVyNTA1NDY3NzY@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 180921600000, "runtime": 102, "title": "Lies My Father Told Me", "tomatoes": {"lastUpdated": 1441222960000, "viewer": {"meter": 93, "numReviews": 164, "rating": 4.1}}, "type": "movie", "writers": ["Ted Allan (story)", "Ted Allan (screenplay)"], "year": 1975}