{"_id": "573a13cbf29313caabd7faf2", "awards": {"nominations": 8, "text": "1 win & 8 nominations.", "wins": 1}, "cast": ["Michelle Pfeiffer", "Zac Efron", "Charlotte Marshall-Fricker", "Fiona Choi"], "countries": ["USA"], "directors": ["Garry Marshall"], "fullplot": "Set during New Year's Eve in New York city, this movie follows several people and how the day affects them. Kim is a single mother who still thinks of her daughter, Hailey as a child who wants to go out with a boy so that she could kiss him at midnight. Claire, who is in charge of the city's annual tradition, the ball drop on Times Square. And when something goes wrong she has to ask an electrician, who was fired, to come and fix it. Laura, a chef who is cooking the New year's Eve party for a record company who runs into Jensen, her ex who's a singer whose performing at the party. While he tries to apologize for how things ended, she refuses to accept it. Ingrid, a woman who works at the record company, after having a near death experience decides to quit her job and asks a young messenger, Paul to help her fulfill her resolutions. And at a hospital, Stan, a man who is in the final stages of cancer, only wishes to see the ball drop. Also Griffin and Tess, a couple who are expecting, want to be the ones who give birth first after New Year because of the available cash prize; but another couple is also about to give birth. Randy a man who's not exactly fond of the holiday because of something that happened, finds himself trapped in an elevator with a singer who is one of Jensen's back up singers when he performs at Times Square. And Sam, son of the owner of the record company, who is out of town and is trying to get back to the city so that he could give a speech at the party, but when he has an accident and since it's a holiday, his car can't be fixed so he hitches a ride with some people going to the city. But it seems he has another reason why he needs to get back.", "genres": ["Comedy", "Romance"], "imdb": {"id": 1598822, "rating": 5.6, "votes": 61038}, "languages": ["English"], "lastupdated": "2015-09-07 00:02:43.920000000", "metacritic": 22, "num_mflix_comments": 1, "plot": "The lives of several couples and singles in New York intertwine over the course of New Year's Eve.", "poster": "https://m.media-amazon.com/images/M/MV5BMjI2Mzg2MDQxOV5BMl5BanBnXkFtZTcwNzc3NTY5Ng@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1323388800000, "runtime": 113, "title": "New Year's Eve", "type": "movie", "writers": ["Katherine Fugate"], "year": 2011}