{"_id": "573a13bcf29313caabd56689", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Erin Cottrell", "Scout Taylor-Compton", "Dale Midkiff", "Robert Pine"], "countries": ["USA"], "directors": ["Harvey Frost"], "fullplot": "Centers on Missy's adopted daughter Belinda Tyler as she follows her dream. Belinda wants to be a doctor, but this time period does not look kindly on women with careers, especially one in the medical field. But Belinda is a strong-minded woman and deeply wants a career as a doctor. She manages to prove her abilities while assisting the local doctor and caring for an old woman who recently experienced a stroke. Belinda nurses her back to health and helps her regain the use of her arm again. Belinda also meets the nephew of their deceased neighbor. Drew comes to town to get his uncle's farm in shape to sell. After that he intends on returning to New York to join his father's law practice. He has no desire to stay in this small, unsophisticated town. But after meeting Belinda he has second thoughts. Belinda also feels something for Drew, but she is conflicted because she wants to be a doctor. Even though the norm of the time is for a woman to get married and have children, Belinda wants more. She has a calling and a great mind for medicine.", "genres": ["Family", "Western"], "imdb": {"id": 960143, "rating": 7.1, "votes": 707}, "languages": ["English"], "lastupdated": "2015-08-15 00:39:04.020000000", "num_mflix_comments": 1, "plot": "Belinda Tyler struggles to choose between her career aspirations as a doctor and her feelings for a New York lawyer who wants a traditional wife.", "poster": "https://m.media-amazon.com/images/M/MV5BMTIxNjk5OTE0N15BMl5BanBnXkFtZTcwMDk5MjA3MQ@@._V1_SY1000_SX677_AL_.jpg", "released": 1197676800000, "title": "Love's Unfolding Dream", "tomatoes": {"dvd": 1210032000000, "lastUpdated": 1441905092000, "production": "Alpine Medien", "viewer": {"meter": 84, "numReviews": 2245, "rating": 4.2}, "website": "http://www.hallmarkchannel.com/publish/consumer/home/shows/love_s_unfolding_dream.html"}, "type": "movie", "writers": ["Michael Landon Jr. (teleplay)", "Cindy Kelley (teleplay)", "Janette Oke (book)"], "year": 2007}