{"_id": "573a13c9f29313caabd7a403", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Josh Holloway", "Laz Alonso", "Josh Peck", "Caity Lotz"], "countries": ["USA"], "directors": ["Benson Lee"], "fullplot": "The producer Dante Graham promotes a group of b-boys expecting to bring the Battle of the Year Trophy back to the USA that have not won it in fifteen years. He hires his friend and former basketball coach Jason Blake that grieves the loss of his wife and son to prepare his team. Blake fires the whole team since they do not have motivation and decides to select a new group of dancers under the nickname of Dream Team. He also hires the youngster Franklyn and the choreographer of break-dance Stacy to help him. Along the months, Blake tries to implement teamwork and works hard with the group. In the competition in France, he has a great surprise.", "genres": ["Music"], "imdb": {"id": 1532958, "rating": 4.9, "votes": 7352}, "languages": ["English"], "lastupdated": "2015-08-24 00:35:49.620000000", "metacritic": 29, "num_mflix_comments": 2, "plot": "Battle of the Year attracts all the best teams from around the world, but the Americans haven't won in fifteen years. Dante enlists Blake to assemble a team of the best dancers and bring the Trophy back to America where it started.", "poster": "https://m.media-amazon.com/images/M/MV5BOTY2OTcyNzM3NF5BMl5BanBnXkFtZTgwNzgxMjkxMDE@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1379635200000, "runtime": 110, "title": "Battle of the Year", "tomatoes": {"boxOffice": "$8.9M", "consensus": "With a hopelessly hokey plot and unintentionally hilarious dialogue, Battle of the Year is flimsy even by the standards of the dance movie genre.", "critic": {"meter": 6, "numReviews": 49, "rating": 3.5}, "dvd": 1386633600000, "fresh": 3, "lastUpdated": 1442252942000, "production": "Sony Pictures", "rotten": 46, "viewer": {"meter": 50, "numReviews": 17377, "rating": 3.2}, "website": "http://www.BattleoftheYear-Movie.com"}, "type": "movie", "writers": ["Brin Hill", "Chris Parker", "Benson Lee (based upon the documentary \"Planet B-Boy\" by)"], "year": 2013}