{"_id": "573a13bcf29313caabd55a60", "awards": {"nominations": 5, "text": "5 nominations.", "wins": 0}, "cast": ["Igal Naor", "Said Faraj", "Faycal Attougui", "Aymen Hamdouchi"], "countries": ["France", "USA", "Spain", "UK"], "directors": ["Paul Greengrass"], "fullplot": "Following the American invasion of Iraq in 2003 Chief Warrant Officer Roy Miller and his men are charged with finding the so-called weapons of mass destruction, whose existence justified American involvement, according to the Pentagon and their man in Baghdad, Poundstone. Veteran CIA operative Marty tells Miller that there are no weapons, it is a deception to allow the Americans to take over the country and install a puppet leader. Also suspicious of Poundstone is Wall Street Journal reporter Lawrie Dayne, who lets slip to Miller that Poundstone told her he had secret talks in Jordan with an important Iraqi, code-named Magellan, who told him about the weapons, though it now seems likely Magellan's true information was to the contrary. So begins a hunt for the truth. Who's playing whom?", "genres": ["Action", "Drama", "Thriller"], "imdb": {"id": 947810, "rating": 6.9, "votes": 103348}, "languages": ["English", "Arabic"], "lastupdated": "2015-09-06 00:18:28.930000000", "metacritic": 63, "num_mflix_comments": 1, "plot": "Discovering covert and faulty intelligence causes a U.S. Army officer to go rogue as he hunts for Weapons of Mass Destruction in an unstable region.", "poster": "https://m.media-amazon.com/images/M/MV5BMTYzMTA1NDMyNV5BMl5BanBnXkFtZTcwMzUwODY5Mg@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1268352000000, "runtime": 115, "title": "Green Zone", "tomatoes": {"boxOffice": "$33.1M", "consensus": "Matt Damon and Paul Greengrass return to the propulsive action and visceral editing of the Bourne films -- but a cliched script and stock characters keep those methods from being as effective this time around.", "critic": {"meter": 53, "numReviews": 180, "rating": 5.9}, "dvd": 1277164800000, "fresh": 96, "lastUpdated": 1441907012000, "production": "Universal Pictures", "rotten": 84, "viewer": {"meter": 57, "numReviews": 152309, "rating": 3.4}, "website": "http://www.greenzonemovie.com/"}, "type": "movie", "writers": ["Brian Helgeland", "Rajiv Chandrasekaran (book)"], "year": 2010}