{"_id": "573a13b4f29313caabd3f8d9", "awards": {"nominations": 7, "text": "1 win & 7 nominations.", "wins": 1}, "cast": ["Saif Ali Khan", "Preity Zinta", "Arshad Warsi", "Tania Zaetta"], "countries": ["India"], "directors": ["Siddharth Anand"], "fullplot": "The new millennium has begun and one must accept the reality that East Indians have immigrated everywhere on Earth. One such place where a number of Indians have made their new homes is Australia's Melbourne. A doctor, who does have problems translating some words into Hindi; Jignesh Pandya, who has come from Surat, India, where his parents operate and run \"Archana Sarees\" and has become a doctor; Ranjan Mathur who has recently immigrated, is now on the look-out for a wife, and does find one, after many hilarious misadventures, including one with a gorgeous hooker, Lisa; Then there is Ambar Malhotra or Ambi, who lived in Bangalore with her parents, quarreled with them because she did not want to marry someone of their choice, ended up coming to Australia on a student exchange program, studies medicine, but lands a job as a radio announcer with 101.5 FM \"Salaam Namaste\"; and finally there is Nikhil Arora alias Nicki, who came here to become an Architect, did get his qualifications, but ended up as Head Chef with \"Nick of Time\" restaurant. Watch what happens when two completely different people, from different backgrounds, habits and culture, meet and decide to live together to see if they can maintain a long-term relationship.", "genres": ["Comedy", "Drama", "Romance"], "imdb": {"id": 456165, "rating": 6.3, "votes": 4592}, "languages": ["Hindi", "English"], "lastupdated": "2015-09-02 12:28:40.240000000", "num_mflix_comments": 1, "plot": "Salaam Namaste is about two Indians who have left their houses to make a life on their own, and how they meet and how they tackle their own relationships and problems and overcome them themselves without their families.", "poster": "https://m.media-amazon.com/images/M/MV5BMjlmOWRhYmUtYmYxYi00Mzg0LTllOTYtNTE0MDEyNzQzODA0XkEyXkFqcGdeQXVyNTkzNDQ4ODc@._V1_SY1000_SX677_AL_.jpg", "released": 1126224000000, "runtime": 158, "title": "Salaam Namaste", "tomatoes": {"boxOffice": "$1.3M", "critic": {"meter": 83, "numReviews": 6, "rating": 6.5}, "dvd": 1135036800000, "fresh": 5, "lastUpdated": 1442510885000, "production": "Yash Raj Films", "rotten": 1, "viewer": {"meter": 76, "numReviews": 7584, "rating": 3.8}, "website": "http://www1.yashrajfilms.com"}, "type": "movie", "writers": ["Siddharth Anand (screenplay)", "Abbas Tyrewala (dialogue)"], "year": 2005}