{"_id": "573a1395f29313caabce2b25", "awards": {"nominations": 6, "text": "Won 2 Oscars. Another 4 wins & 6 nominations.", "wins": 6}, "cast": ["Virginia McKenna", "Bill Travers", "Geoffrey Keen", "Peter Lukoye"], "countries": ["UK", "USA"], "directors": ["James Hill", "Tom McGowan"], "fullplot": "Married couple George Adamson and Joy Adamson have longed lived in northern Kenya for George's work as the senior game warden of the region. One of George's primary responsibilities is to deal with dangerous animals that may be chronically threatening to humans, livestock and/or crops. It is in this vein that George and his staff end up killing a man eating lion and its lioness, resulting in their three young female cubs being orphaned. Although difficult to begin, George and Joy are able to wean and take care of the three cubs, who they adopt as pets. But soon, they know they have to provide a more suitable environment for the cubs, namely sending them to Rotterdam Zoo... that is except for the smallest, who they have named Elsa and to who Joy in particular has become attached as the emotional fighter among the three. As Elsa grows into lioness maturity, George and Joy provide her with greater freedom away from their property, which may get her into trouble as a largely tame animal. Ultimately, John Kendall, George's boss, directs them to send Elsa to a zoo like they did with her sisters, especially as with anyone in George's job he is soon being reassigned. Joy cannot bear the thought of Elsa being locked up for the rest of her life, believing that they can reintegrate her back into the wild instead, something that had never been done with a tame lion. John gives them three months to accomplish this task, which most specifically involves getting Elsa to be able to kill for food, other creatures which up to this point she has seen only as fellow playthings, and to be accepted by other lions, most specifically mate with and provide food for a male partner while standing up successfully to female competitors.", "genres": ["Adventure", "Drama", "Family"], "imdb": {"id": 60182, "rating": 7.3, "votes": 4314}, "languages": ["English"], "lastupdated": "2015-08-24 00:52:21.853000000", "plot": "Married couple George Adamson and Joy Adamson have longed lived in northern Kenya for George's work as the senior game warden of the region. One of George's primary responsibilities is to ...", "poster": "https://m.media-amazon.com/images/M/MV5BNDk3MGE1MzUtYWZlOS00OGVlLWJmOTUtNzgxYWY1NzU0YmQ1XkEyXkFqcGdeQXVyNjQ2MjQ5NzM@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": -111369600000, "runtime": 95, "title": "Born Free", "tomatoes": {"critic": {"meter": 92, "numReviews": 12, "rating": 7}, "dvd": 1046736000000, "fresh": 11, "lastUpdated": 1441912078000, "production": "Sony Pictures Home Entertainment", "rotten": 1, "viewer": {"meter": 87, "numReviews": 8656, "rating": 3.6}}, "type": "movie", "writers": ["Joy Adamson (book)", "Lester Cole (screenplay)"], "year": 1966}