{"_id": "573a13b3f29313caabd3c97a", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Marèa Valverde", "Letizia Ciampa", "Primo Reggiani", "Fabrizia Sacchi"], "countries": ["Italy", "Spain"], "directors": ["Luca Guadagnino"], "fullplot": "Melissa lives with her mother and her grandmother in Sicily. She has a close relationship with her grandmother, a heavy smoker, who seems to be the only person in the world who understands Melissa. Melissa's father lives in another country. One day Melissa and her friend go to a party at a school friend's home. While there, Melissa meets Daniele, a boy from the school, and has her first sexual experience. The experience is far from being what Melissa always has dreamed it would be, because Daniele forces her and later forgets her. However, Melissa has fallen in love with Daniele. Back at school, when Melissa tries to get Daniele's attention, he barely remembers her. He takes advantage of Melissa's feelings for him, convincing her to have sex with him whenever he wants. When Melissa discovers Daniele's true motivations, she takes revenge by having even wilder sexual experiences with him and other boys. She even begins keeping a diary to document her sexual experiences. Melissa's mother is worried and tries to approach her distant daughter, while her grandmother is sent off to a rest home.", "genres": ["Drama"], "imdb": {"id": 443584, "rating": 4.7, "votes": 4443}, "languages": ["Italian"], "lastupdated": "2015-08-21 00:35:22.330000000", "num_mflix_comments": 2, "plot": "An adolescent girl, living with her mother and her grandmother, will have her first sexual experiences in a heavy and excessive way.", "poster": "https://m.media-amazon.com/images/M/MV5BMWFiYmYyNTMtNDBkZS00NDY0LTljYTMtNmM2YTc0ODcwNzUyXkEyXkFqcGdeQXVyODc0OTEyNDU@._V1_SY1000_SX677_AL_.jpg", "released": 1132272000000, "runtime": 100, "title": "Melissa P.", "tomatoes": {"dvd": 1344297600000, "lastUpdated": 1439837057000, "production": "Bess Films", "viewer": {"meter": 30, "numReviews": 1726, "rating": 2.7}, "website": "http://www.melissa-p.it/"}, "type": "movie", "writers": ["Barbara Alberti (screenplay)", "Cristiana Farina (screenplay)", "Luca Guadagnino (screenplay)", "Luca Guadagnino (story)", "Cristiana Farina (story)", "Melissa Panarello (memoir)"], "year": 2005}