{"_id": "573a1395f29313caabce142b", "awards": {"nominations": 5, "text": "Nominated for 7 Oscars. Another 2 wins & 5 nominations.", "wins": 9}, "cast": ["Cantinflas", "Dan Dailey", "Shirley Jones", "Carlos Montalbèn"], "countries": ["Mexico", "USA"], "directors": ["George Sidney"], "fullplot": "In Mexico, Pepe is the good-natured ranch foreman of Sr. Rodriguez. Pepe's pride and joy is Don Juan, a magnificent white stud stallion that he raised from a colt for Sr. Rodriguez and that he refers to as his \"son\". As Sr. Rodriguez has decided to sell Don Juan at auction, Pepe enacts a plan to dissuade any interested buyers so that he can buy Don Juan himself. The plan doesn't work, as Don Juan is sold to washed-up Hollywood movie director Ted Holt - his current Hollywood status due to alcohol over-consumption - who wants to use Don Juan for his comeback project to be shot in Mexico with an all-Mexican cast except for an American female lead. Pepe decides to head to Hollywood and earn lots of money so that he can buy Pepe and bring him back to Mexico. In Hollywood, Pepe gets into one misadventure after another with a cavalcade of Hollywood movie stars, those misadventures based largely on Pepe's limited grasp of the English language, he often taking what is said to him in their literal meaning. Pepe does eventually locate Holt, who hires Pepe \"for free\" to handle Don Juan. Pepe also meets Suzie Murphy, a coffee house waitress and performer, who believes Hollywood has given her parents a raw deal on their lives, they who worked hard but remained on the lowest rung of the studio food chain for their entire careers. As such, she is an angry young woman with a tough exterior, who has no desire to be in the movie business. Despite Holt realizing that Suzie's exterior is all a front, he does end up hiring her as the lead for the movie, which he is able to get off the ground on a deal made with Edward G. Robinson. As Pepe is required to travel to Las Vegas and back to Mexico for filming, Pepe falls in love with Suzie, the affection which he slowly believes is returned. But Holt may ultimately get in the way of Pepe's dreams with Suzie, and perhaps his permanent reunion with Don Juan.", "genres": ["Comedy", "Musical"], "imdb": {"id": 54172, "rating": 5.5, "votes": 595}, "languages": ["English"], "lastupdated": "2015-09-01 00:34:43.223000000", "num_mflix_comments": 1, "plot": "The young Mexican Pepe's beloved horse is sold to Hollywood star Ted Holt, leading to Pepe's journey to Hollywood to get the horse back, and Pepe's encounter with half the stars working in Hollywood at the time.", "poster": "https://m.media-amazon.com/images/M/MV5BMTgyMjc4NDI1NF5BMl5BanBnXkFtZTcwMDQ1MDE2MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "UNRATED", "released": -242524800000, "runtime": 180, "title": "Pepe", "tomatoes": {"lastUpdated": 1436122650000, "viewer": {"meter": 54, "numReviews": 238, "rating": 3.5}}, "type": "movie", "writers": ["Claude Binyon", "Leslie Bush-Fekete (play)", "Dorothy Kingsley", "Sonya Levien (story)", "Leonard Spigelgass (story)"], "year": 1960}