{"_id": "573a13b5f29313caabd434a2", "awards": {"nominations": 0, "text": "2 wins.", "wins": 2}, "cast": ["Paddy Considine", "Oscar Isaac", "Valeriu Pavel Dan", "Kenneth Bryans"], "countries": ["USA"], "directors": ["Scott Z. Burns"], "fullplot": "In Russia, the technician and family man Timofey is exposed to 1,000 REMs (Roentgen Equivalent Man) of radiation in the nuclear facility where he works. The facility director hides the level of exposure from Timofey and tries to force him to assume the blame for the accident and puts Timofey on unpaid leave. Aware that the exposure is lethal and feeling the sickness of radiation, Timofey steals 100 mg of plutonium and heads to Moscow expecting to sell it on the black market for US$ 30,000.00 to give to his wife Marina and his seven year-old son Tolya. Meanwhile, the small-time criminal Shiv and the gangsters Vlad and Yegor need to pay US$ 6,000.00 to the powerful mobster Starkov in 72 hours. When Shiv meets Timofey trying to sell the Pu-239, he sees the chance to pay his debts and make some money. But he is incompetent and gets in trouble with powerful mobsters.", "genres": ["Drama"], "imdb": {"id": 472156, "rating": 7, "votes": 2645}, "languages": ["English"], "lastupdated": "2015-09-10 17:23:41.540000000", "num_mflix_comments": 1, "plot": "A worker at a Russian nuclear facility gets exposed to a lethal dose of radiation. In order to provide for his family, he steals some plutonium and sets out to sell it on Moscow's black market with the help of an incompetent criminal.", "poster": "https://m.media-amazon.com/images/M/MV5BMTM3MjgyOTAyN15BMl5BanBnXkFtZTcwMzYyMTU1MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1195257600000, "runtime": 97, "title": "Pu-239", "tomatoes": {"critic": {"meter": 57, "numReviews": 7, "rating": 6.2}, "dvd": 1206403200000, "fresh": 4, "lastUpdated": 1442268276000, "production": "Picturehouse", "rotten": 3, "viewer": {"meter": 68, "numReviews": 1280, "rating": 3.5}}, "type": "movie", "writers": ["Scott Z. Burns (screenplay)", "Ken Kalfus (short story \"PU-239\")"], "year": 2006}