{"_id": "573a13c0f29313caabd627c9", "awards": {"nominations": 6, "text": "1 win & 6 nominations.", "wins": 1}, "cast": ["Vinessa Shaw", "Michael C. Hall", "Ken Holmes", "Nick Damici"], "countries": ["USA", "France"], "directors": ["Jim Mickle"], "fullplot": "In 1989, in the east of Texas, Ann Dane overhears a noise during the night and awakes her husband Richard Dane. He picks up his gun and stumbles with a burglar in the living room and accidentally shoots and kills the intruder. He is identified by the police as the wanted criminal Freddy Russell, but Richard is affected by the incident. Richard goes to the cemetery to see Freddy's burial and his father Ben Russell, who is also a criminal on parole, talks to Richard and asks for his son. Richard brings his son from the school and meets his wife at the police station, but the police inspector Ray Price cannot do anything to help him. Soon Richard finds that someone has broken in his house and the police officers stake out the place. However Ben breaks in the house but escapes. Ray calls Richard to tell him that Ben was arrested in Mexico and the case is closed. While leaving the station, he sees a picture of Freddy Russell and he realizes that he is not the burglar. Richard unsuccessfully calls Ray and he decides to go to the station during the night. He witnesses Ray and other officers taken Ben away in a car and leaving him on the train tracks after hitting him. Richard saves Ben and brings him to an isolated cabin that belonged to his father. After proving that the buried corpse is not Freddy, Richard teams up with Ben and his friend, the private investigator Jim Bob, to seek out Freddy and find who has been killed, and the trio is involved with a gang that makes pornographic snuff movies.", "genres": ["Crime", "Thriller"], "imdb": {"id": 1179031, "rating": 6.8, "votes": 21536}, "languages": ["English"], "lastupdated": "2015-09-10 17:19:40.230000000", "metacritic": 73, "num_mflix_comments": 2, "plot": "When a protective father meets a murderous ex-con, both need to deviate from the path they are on as they soon find themselves entangled in a downwards spiral of lies and violence while having to confront their own inner psyche.", "poster": "https://m.media-amazon.com/images/M/MV5BMTc4NTU4MTY2Nl5BMl5BanBnXkFtZTgwNDM5MjQ2MTE@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1419984000000, "runtime": 109, "title": "Cold in July", "tomatoes": {"consensus": "Boasting plenty of twists, a suitably seedy tone, and a memorable supporting turn from Don Johnson, Cold in July proves an uncommonly rewarding thriller.", "critic": {"meter": 86, "numReviews": 104, "rating": 7}, "dvd": 1412035200000, "fresh": 89, "lastUpdated": 1442423883000, "production": "IFC Films", "rotten": 15, "viewer": {"meter": 67, "numReviews": 11666, "rating": 3.5}, "website": "http://www.ifcfilms.com/films/cold-in-july"}, "type": "movie", "writers": ["Nick Damici", "Joe R. Lansdale (based on the novel by)", "Jim Mickle"], "year": 2014}