{"_id": "573a13a0f29313caabd03c8e", "awards": {"nominations": 0, "text": "5 wins.", "wins": 5}, "cast": ["Liam Aiken", "Frances Fisher", "Alice Drummond", "Frances Sternhagen"], "countries": ["USA"], "directors": ["Tom Rice"], "fullplot": "Set against the picturesque landscape of the Mississippi Delta in the 1940's, \"The Rising Place\" follows the close friendship of two young women, each of a different race, and their struggle to find purpose in their lives during this time of social injustice and world war. When Virginia visits her Aunt Millie at Christmas, she discovers a stack of handwritten letters over half a century old, and unlocks the story of her aunt's youthful days as a young woman living in Hamilton, Mississippi, during the second World War. Beautifully shot sequences episodically shift back and forth from the past to the present. In a time when a woman's place was in the home, young Emily ventures out and falls in love with a young soldier, eventually carrying his baby out of wedlock. With the support of her best friend Wilma Watson and their draft-dodging companion Will Bacon, Emily is able to stand by her convictions in a household dominated by the standards of a salt-of-the-earth father and an unconditionally loving mother.", "genres": ["Drama"], "imdb": {"id": 201020, "rating": 6.5, "votes": 154}, "languages": ["English"], "lastupdated": "2015-08-15 00:49:13.770000000", "metacritic": 32, "num_mflix_comments": 4, "plot": "The close friendship of two young women, each of a different race, and their struggle to find purpose in their lives during this time of social injustice and world war.", "poster": "https://m.media-amazon.com/images/M/MV5BMTY4MTA4NjE0M15BMl5BanBnXkFtZTYwMTcxMDg5._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 980985600000, "runtime": 93, "title": "The Rising Place", "tomatoes": {"critic": {"meter": 13, "numReviews": 16, "rating": 4.3}, "dvd": 1067299200000, "fresh": 2, "lastUpdated": 1421080442000, "production": "Flatland Pictures", "rotten": 14, "viewer": {"meter": 75, "numReviews": 80, "rating": 3.5}, "website": "http://www.therisingplace.com"}, "type": "movie", "writers": ["David Armstrong (novel)", "Tom Rice"], "year": 2001}