{"_id": "573a139cf29313caabcf5ea5", "awards": {"nominations": 9, "text": "Won 2 Primetime Emmys. Another 6 wins & 9 nominations.", "wins": 8}, "cast": ["William Hurt", "Alec Newman", "Saskia Reeves", "P.H. Moriarty"], "countries": ["USA", "Canada", "Germany", "Italy"], "fullplot": "In the 11th millennium, Shaddam IV, ruler of the Galactic Empire, rids himself of his competitor Duke Leto Atreides by giving him control of the desert planet Dune also called Arrakis; fully aware that its present owner, Baron Vladimir Harkonnen, will not give it up without a fight. The reason is that Arrakis is the source of the valuable spice, a substance produced by enormous and dangerous sandworms, which bestows special mental qualities on anyone who consumes it. A short while later Harkonnen does indeed succeed in ambushing and massacring Leto and his men. Leto's mistress Lady Jessica, who is a member of the clairvoyant order of Bene Gesserit, manages to escape into the desert with her son Paul, and after a long and dangerous march they finally encounter the Fremen, the long suppressed desert tribe of Arrakis. Impressed by Paul's clairvoyant abilities, tribal prince Stilgar takes in the fugitives. Very soon the Fremen are convinced that Paul is their long-prophesied redeemer, and Stilgar prepares him for his great task. While Paul is being instructed in the secrets of desert life he falls in love with young Chani, who bears him a son. During the next few years the Fremen, led by Paul, wage a guerrilla war of attrition against Harkonnen, who suffers heavy losses. Most important of all, they sabotage the planet's spice production: this brings Shaddam IV. onto the scene, who senses that the basis of his power is being threatened. The rebels on Arrakis want to finish off the Imperial forces once and for all, but after a terrible battle which costs him almost all his men, Shaddam is finally forced to concede defeat.", "genres": ["Adventure", "Drama", "Fantasy"], "imdb": {"id": 142032, "rating": 7.1, "votes": 14048}, "languages": ["English", "Italian"], "lastupdated": "2015-08-26 00:53:13.010000000", "num_mflix_comments": 2, "plot": "A three-part miniseries on politics, betrayal, lust, greed and the coming of a Messiah. Based on Frank Herbert's classic science fiction novel.", "poster": "https://m.media-amazon.com/images/M/MV5BMTU4MjMyMTkxN15BMl5BanBnXkFtZTYwODA5OTU5._V1._CR15,35,299,438_SY264_CR1,0,178,264_AL_.jpg", "rated": "UNRATED", "released": 975801600000, "runtime": 265, "title": "Dune", "tomatoes": {"dvd": 985046400000, "lastUpdated": 1442080626000, "production": "Artisan Entertainment", "viewer": {"meter": 74, "numReviews": 1151, "rating": 3.9}}, "type": "movie", "year": 2000}