{"_id": "573a13bcf29313caabd55a6b", "awards": {"nominations": 210, "text": "Won 1 Oscar. Another 104 wins & 210 nominations.", "wins": 105}, "cast": ["Natalie Portman", "Mila Kunis", "Vincent Cassel", "Barbara Hershey"], "countries": ["USA"], "directors": ["Darren Aronofsky"], "fullplot": "Nina (Portman) is a ballerina in a New York City ballet company whose life, like all those in her profession, is completely consumed with dance. She lives with her obsessive former ballerina mother Erica (Hershey) who exerts a suffocating control over her. When artistic director Thomas Leroy (Cassel) decides to replace prima ballerina Beth MacIntyre (Ryder) for the opening production of their new season, Swan Lake, Nina is his first choice. But Nina has competition: a new dancer, Lily (Kunis), who impresses Leroy as well. Swan Lake requires a dancer who can play both the White Swan with innocence and grace, and the Black Swan, who represents guile and sensuality. Nina fits the White Swan role perfectly but Lily is the personification of the Black Swan. As the two young dancers expand their rivalry into a twisted friendship, Nina begins to get more in touch with her dark side - a recklessness that threatens to destroy her.", "genres": ["Drama", "Thriller"], "imdb": {"id": 947798, "rating": 8, "votes": 505565}, "languages": ["English", "French", "Italian"], "lastupdated": "2015-09-04 00:22:54.443000000", "metacritic": 79, "num_mflix_comments": 1, "plot": "A ballet dancer wins the lead in \"Swan Lake\" and is perfect for the role of the delicate White Swan - Princess Odette - but slowly loses her mind as she becomes more and more like Odile, the Black Swan.", "poster": "https://m.media-amazon.com/images/M/MV5BNzY2NzI4OTE5MF5BMl5BanBnXkFtZTcwMjMyNDY4Mw@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1292544000000, "runtime": 108, "title": "Black Swan", "tomatoes": {"boxOffice": "$107.0M", "consensus": "Bracingly intense, passionate, and wildly melodramatic, Black Swan glides on Darren Aronofsky's bold direction -- and a bravura performance from Natalie Portman.", "critic": {"meter": 87, "numReviews": 274, "rating": 8.2}, "dvd": 1301356800000, "fresh": 238, "lastUpdated": 1441907349000, "production": "Fox Searchlight", "rotten": 36, "viewer": {"meter": 84, "numReviews": 174697, "rating": 4}, "website": "http://www.BlackSwan2010.com/"}, "type": "movie", "writers": ["Mark Heyman (screenplay)", "Andres Heinz (screenplay)", "John J. McLaughlin (screenplay)", "Andres Heinz (story)"], "year": 2010}