{"_id": "573a13b0f29313caabd32e0a", "awards": {"nominations": 16, "text": "Nominated for 1 Oscar. Another 8 wins & 16 nominations.", "wins": 9}, "cast": ["Colin Farrell", "Q'orianka Kilcher", "Christopher Plummer", "Christian Bale"], "countries": ["USA", "UK"], "directors": ["Terrence Malick"], "fullplot": "Captain Smith is spared his mutinous hanging sentence after captain Newport's ship arrives in 1607 to found Jamestown, an English colony in Virginia. The initially friendly natives, who have no personal property concept, turn hostile after a 'theft' is 'punished' violently on the spot. During an armed exploration, Smith is captured, but spared when the chief's favorite daughter Pocahontas pleads for the stranger who soon becomes her lover and learns to love their naive 'savage' way of harmonious life. Ultimately he returns to the grim fort, which would starve hadn't she arranged for Indian generosity. Alas, each side soon brands their own lover a traitor, so she is banished and he flogged as introduction to slavish toiling. Changes turn again, leading Smith to accept a northern-more mission and anglicized Pocahontas, believing him dead, becoming the mother of aristocratic new lover John Rolfe's son. They'll meet again for a finale in England.", "genres": ["Biography", "Drama", "History"], "imdb": {"id": 402399, "rating": 6.7, "votes": 66653}, "languages": ["English", "Algonquin"], "lastupdated": "2015-09-05 00:59:50.540000000", "metacritic": 69, "plot": "The story of the English exploration of Virginia, and of the changing world and loves of Pocahontas.", "poster": "https://m.media-amazon.com/images/M/MV5BMTdjNjQ5ZTAtODJlZi00MzcyLWJjY2UtNDZhNTJkYjlkNGY5XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1137715200000, "runtime": 135, "title": "The New World", "tomatoes": {"boxOffice": "$12.5M", "consensus": "Despite arresting visuals and strong lead performances, The New World suffers from an unfocused narrative that will challenge viewers' attention spans over its 2 1/2 hours.", "critic": {"meter": 62, "numReviews": 177, "rating": 6.7}, "dvd": 1147132800000, "fresh": 109, "lastUpdated": 1439922622000, "production": "New Line Cinema", "rotten": 68, "viewer": {"meter": 57, "numReviews": 147639, "rating": 2.9}, "website": "http://www.thenewworldmovie.com/"}, "type": "movie", "writers": ["Terrence Malick"], "year": 2005}