{"_id": "573a13b9f29313caabd4e9b3", "awards": {"nominations": 0, "text": "3 wins.", "wins": 3}, "cast": ["Joshua Leonard", "Azura Skye", "Diane Salinger", "Aaron Hendry"], "countries": ["USA"], "directors": ["Jim Torres"], "fullplot": "Everything that could go wrong did go wrong: War, Terrorism, Natural Disasters. Evacuees were ushered from the cities to refugee camps in the surrounding counties. In-fighting, famine and disease took their toll on the survivors. Now, twenty years after the bombs fell and the plagues ran their course the few that remain live in fear and without hope. Azura Skye stars as Sarah in this Post-Apocalyptic Fairy Tale about a young woman's journey to deliver the first child born in 15 Years. Sarah's refusal to give up is inspired by a lone voice on her radio. Michael broadcasts dim and distant messages of hope mixed with the music he scavenges from the dead. Forced from her basement home by drought and relentlessly pursued by those who want her baby, Sarah crosses paths with Michael in a cavernous, underground refuge of disparate survivors. It is from Three Caves that Michael and Sarah will embark on a journey beyond the boundaries of the Southern Corridor and into the unknown future.", "genres": ["Drama", "Fantasy", "Sci-Fi"], "imdb": {"id": 825279, "rating": 3.3, "votes": 1375}, "languages": ["English"], "lastupdated": "2015-09-07 00:22:35.610000000", "num_mflix_comments": 2, "plot": "Everything that could go wrong did go wrong: War, Terrorism, Natural Disasters. Evacuees were ushered from the cities to refugee camps in the surrounding counties. In-fighting, famine and ...", "poster": "https://m.media-amazon.com/images/M/MV5BOTZiMmJlZTMtNjQxYS00YzFiLWIzZjEtYmNkMmM1ZTI2ZDQ0XkEyXkFqcGdeQXVyNzMzMjU5NDY@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "runtime": 95, "title": "20 Years After", "tomatoes": {"dvd": 1223337600000, "lastUpdated": 1440612287000, "production": "MTI Home Video", "viewer": {"meter": 10, "numReviews": 406, "rating": 2.2}}, "type": "movie", "writers": ["Ron Harris", "Jim Torres"], "year": 2008}