{"_id": "573a13c2f29313caabd6678f", "awards": {"nominations": 54, "text": "Nominated for 1 Golden Globe. Another 29 wins & 54 nominations.", "wins": 30}, "cast": ["Tilda Swinton", "John C. Reilly", "Ezra Miller", "Jasper Newell"], "countries": ["UK", "USA"], "directors": ["Lynne Ramsay"], "fullplot": "Eva Khatchadourian is trying to piece together her life following the \"incident\". Once a successful travel writer, she is forced to take whatever job comes her way, which of late is as a clerk in a travel agency. She lives a solitary life as people who know about her situation openly shun her, even to the point of violent actions toward her. She, in turn, fosters that solitary life because of the incident, the aftermath of which has turned her into a meek and scared woman. That incident involved her son Kevin Khatchadourian, who is now approaching his eighteenth birthday. Eva and Kevin have always had a troubled relationship, even when he was an infant. Whatever troubles he saw, Franklin, Eva's complacent husband, just attributed it to Kevin being a typical boy. The incident may be seen by both Kevin and Eva as his ultimate act in defiance against his mother.", "genres": ["Drama"], "imdb": {"id": 1242460, "rating": 7.5, "votes": 84232}, "languages": ["English"], "lastupdated": "2015-09-14 07:42:08.493000000", "metacritic": 68, "num_mflix_comments": 1, "plot": "Kevin's mother struggles to love her strange child, despite the increasingly vicious things he says and does as he grows up. But Kevin is just getting started, and his final act will be beyond anything anyone imagined.", "poster": "https://m.media-amazon.com/images/M/MV5BMjE0NDE0MjYxNF5BMl5BanBnXkFtZTcwNjM2NTY5Ng@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1319155200000, "runtime": 112, "title": "We Need to Talk About Kevin", "tomatoes": {"boxOffice": "$1.7M", "consensus": "We Need to Talk About Kevin is a masterful blend of drama and horror, with fantastic performances across the board (Tilda Swinton especially, delivering one of her very best).", "critic": {"meter": 76, "numReviews": 187, "rating": 7.4}, "dvd": 1338249600000, "fresh": 142, "lastUpdated": 1439837941000, "production": "Oscilloscope Pictures", "rotten": 45, "viewer": {"meter": 78, "numReviews": 33061, "rating": 3.8}, "website": "http://www.oscilloscope.net/films/film/56/We-Need-To-Talk-About-Kevin"}, "type": "movie", "writers": ["Lynne Ramsay (screenplay)", "Rory Stewart Kinnear (screenplay)", "Lionel Shriver (novel)"], "year": 2011}