{"_id": "573a13a2f29313caabd0a325", "awards": {"nominations": 3, "text": "Nominated for 1 Primetime Emmy. Another 2 nominations.", "wins": 0}, "cast": ["Leon", "Jenifer Lewis", "Carl Lumbly", "Tamala Jones"], "countries": ["USA"], "directors": ["Robert Townsend"], "fullplot": "A revealing movie about the tumultuous life of Little Richard Penniman, whose ground-breaking music revolutionized rock and roll. Growing up a social misfit in poverty, Little Richard's passion, talent and flamboyance catapulted him into the limelight of rock music. His career was rocked by his homosexuality, his fundamental beliefs and the pervasive discrimination within the music industry. We go through his chart-topping years when he lived the quintessential Rock and Roll life, indulging in all-night orgies and the spiritual callings that pulled him in and out of the music industry. But as alcohol and drug addition plagued his career in the late 1960s, Little Richard makes the life-saving decision to return to his family. Through their love and strength, and Little Richard's resolve, he moves on in history to become one of the most memorable performers in rock and roll.", "genres": ["Biography", "Drama", "Music"], "imdb": {"id": 228528, "rating": 6.6, "votes": 465}, "languages": ["English"], "lastupdated": "2015-08-24 00:31:27.773000000", "plot": "The story of Little Richard Penniman, from his poor Southern upbringing to dealing with the trials and tribulations of being a black singer in the 1950s, to his born-again phase and brief \"retirement\" from rock and roll.", "poster": "https://m.media-amazon.com/images/M/MV5BODM1NDY2NTQ3MF5BMl5BanBnXkFtZTcwODU2MjcxMQ@@._V1_SY1000_SX677_AL_.jpg", "released": 951004800000, "runtime": 120, "title": "Little Richard", "tomatoes": {"dvd": 1035244800000, "lastUpdated": 1441913950000, "production": "Artisan Home Entertainment", "viewer": {"meter": 60, "numReviews": 100, "rating": 3.8}}, "type": "movie", "writers": ["Bill Kerby", "Daniel Taplitz"], "year": 2000}