{"_id": "573a1395f29313caabce2946", "awards": {"nominations": 2, "text": "Won 1 Oscar. Another 3 wins & 2 nominations.", "wins": 4}, "cast": ["Elizabeth Taylor", "Richard Burton", "Eva Marie Saint", "Charles Bronson"], "countries": ["USA"], "directors": ["Vincente Minnelli"], "fullplot": "Twenty-something Laura Reynolds is a free spirit who questions social conventions, laws and regulations. A struggling artist, she lives in a secluded beach-side cabin in Big Sur with her nine year old illegitimate son, Danny, on who she has instilled her values. Because of this questioning of convention, Laura has decided to home school Danny. Also because of this questioning of the law, Danny runs into some legal problems, and as such is court ordered to be sent to San Simeon, a Christian school in Monterey. This order is against Laura's wishes. The school's headmaster is Dr. Rev. Edward Hewitt, who tries to convince Laura that San Simeon is not the prison she probably believes it to be. Married for twenty-one years to his faithful wife Claire, Edward has become more a fund-raiser at all cost (for a new chapel) rather than an educator or priest. Despite their differences, Laura and Edward begin to fall for each other. Both but especially Edward have to reconcile their feelings for each other to their beliefs, which they learn are closer to each other than what may appear on the surface. Their feelings also bring to the forefront what each really wants in life beyond their current lot.", "genres": ["Drama"], "imdb": {"id": 59674, "rating": 6.2, "votes": 1959}, "languages": ["English"], "lastupdated": "2015-09-17 04:02:33.120000000", "num_mflix_comments": 1, "plot": "A free-spirited single mother forms a connection with the wed headmaster of an Episcopal boarding school in California.", "poster": "https://m.media-amazon.com/images/M/MV5BZDM3MGIwN2QtN2MzOS00NDEwLTk1YTktYWU3MThmNzJiZmIyXkEyXkFqcGdeQXVyMTAwMzUyOTc@._V1_SY1000_SX677_AL_.jpg", "rated": "TV-14", "released": -142819200000, "runtime": 117, "title": "The Sandpiper", "tomatoes": {"lastUpdated": 1440183443000, "viewer": {"numReviews": 33, "rating": 0}}, "type": "movie", "writers": ["Martin Ransohoff (story)", "Irene Kamp (adaptation)", "Louis Kamp (adaptation)", "Dalton Trumbo", "Michael Wilson"], "year": 1965}