{"_id": "573a13a5f29313caabd159a9", "awards": {"nominations": 21, "text": "Nominated for 1 Oscar. Another 12 wins & 21 nominations.", "wins": 13}, "cast": ["Hugh Grant", "Nicholas Hoult", "Sharon Small", "Madison Cook"], "countries": ["UK", "USA", "France", "Germany"], "directors": ["Chris Weitz", "Paul Weitz"], "fullplot": "Twelve year old Marcus Brewer lives with his chronically depressed single mother, Fiona Brewer. Both Fiona and Marcus beat to their own respective drummers. Marcus will do whatever he can to make his depressed mother happy, even if it causes himself grief. As such, he realizes that he is perceived as different than most kids, as even the self-professed weird kids don't want to hang out with him as he is the target of bullying. Part of the taunts against him are the fact that he sings and speaks to himself without even realizing that he is doing it. Meanwhile, thirty-eight year old Will Freeman is a slacker who has lived comfortably off the royalties of a song written by his deceased father, and as such has never had to work a day in his life. He is a solitary man who places himself as the first and only priority in life. He comes across the idea that dating single moms meets his selfish carnal needs. It is in this capacity that Will meets Marcus, as one of Will's single mother conquests, Suzie, is friends with the Brewers. Trying to escape his life but wanting Will to date Fiona, Marcus infiltrates Will's life, much to Will's chagrin. Will slowly begins to realize that Marcus is more than just a nuisance, but rather someone who needs some guidance navigating through the trials of adolescence and the trials of dealing with a suicidal mother, and perhaps he can be a small part of providing that direction. Conversely, Marcus may be able to show Will the path to becoming a real adult.", "genres": ["Comedy", "Drama", "Romance"], "imdb": {"id": 276751, "rating": 7.1, "votes": 136354}, "languages": ["English"], "lastupdated": "2015-09-06 00:18:30.260000000", "metacritic": 75, "num_mflix_comments": 441, "plot": "A cynical, immature young man is taught how to act like a grown-up by a little boy.", "poster": "https://m.media-amazon.com/images/M/MV5BMTQ2Mzg4MDAzNV5BMl5BanBnXkFtZTgwMjcxNTYxMTE@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1021593600000, "runtime": 101, "title": "About a Boy", "tomatoes": {"boxOffice": "$40.6M", "consensus": "A winning comedy that benefits from Hugh Grant's boyish charms.", "critic": {"meter": 93, "numReviews": 184, "rating": 7.7}, "dvd": 1042502400000, "fresh": 172, "lastUpdated": 1442085265000, "production": "Universal Pictures", "rotten": 12, "viewer": {"meter": 54, "numReviews": 31162671, "rating": 2.8}, "website": "http://www.about-a-boy.com"}, "type": "movie", "writers": ["Nick Hornby (novel)", "Peter Hedges (screenplay)", "Chris Weitz (screenplay)", "Paul Weitz (screenplay)"], "year": 2002}