{"_id": "573a1395f29313caabce2500", "awards": {"nominations": 3, "text": "Nominated for 1 Oscar. Another 8 wins & 3 nominations.", "wins": 9}, "cast": ["Kim Stanley", "Margaret Lacey", "Marie Burke", "Maria Kazan"], "countries": ["UK"], "directors": ["Bryan Forbes"], "fullplot": "Myra and Billy Savage are a married couple living in London. Myra works as a medium, she who holds weekly meetings - sèances - for a regular group of customers, while Billy supports her in these ventures as he does not otherwise work due to his asthma. \"Arthur\" is her spirit guide, he who was their stillborn son. Myra is the dominant in the couple, Billy the weak minded follower. Myra, with Billy's support, devises a scheme to raise her public prominence as a medium: kidnap Amanda Clayton, the adolescent daughter of a wealthy couple, and using her psychic powers provide information to the Claytons and the police of Amanda and the requested ransom money's whereabouts. Myra and Billy view this scheme as a victimless crime, if a crime at all, as they don't plan on harming Amanda and they are returning the requested ransom. To carry out the scheme successfully, they will have to: kidnap Amanda; convince Amanda that her temporary captivity is not out of the ordinary, while having her not be able to identify them; insert Myra into the case of Amanda's kidnapping, her information which will be the key to finding Amanda and the money; and return Amanda and the money without having either traced back to them. Beyond these logistics, Myra and Billy themselves will factor into how the plan works, Myra who may have other either conscious or subconscious thoughts on what she wants to do in her belief that she truly does have the power.", "genres": ["Crime", "Drama"], "imdb": {"id": 58557, "rating": 8, "votes": 4249}, "languages": ["English"], "lastupdated": "2015-08-12 00:06:17.347000000", "num_mflix_comments": 2, "plot": "A psychic convinces her weak-willed husband to kidnap the child of a wealthy couple, so she can use her abilities to locate the child and thus achieve fame.", "poster": "https://m.media-amazon.com/images/M/MV5BMDA3N2Y3ODItNzM1NS00M2Y5LTljMDUtZDQxNTYyOGM0ODk2XkEyXkFqcGdeQXVyMjI4MjA5MzA@._V1_SY1000_SX677_AL_.jpg", "released": -162691200000, "runtime": 115, "title": "Seance on a Wet Afternoon", "tomatoes": {"critic": {"meter": 82, "numReviews": 11, "rating": 7.3}, "dvd": 1032825600000, "fresh": 9, "lastUpdated": 1439316169000, "production": "Artixo", "rotten": 2, "viewer": {"meter": 85, "numReviews": 1223, "rating": 3.8}}, "type": "movie", "writers": ["Mark McShane (novel)", "Bryan Forbes (written for the screen by)"], "year": 1964}