{"_id": "573a13d4f29313caabd99301", "awards": {"nominations": 6, "text": "6 nominations.", "wins": 0}, "cast": ["Antonio Banderas", "Dylan McDermott", "Melanie Griffith", "Birgitte Hjort Sèrensen"], "countries": ["Bulgaria", "USA", "Spain", "Canada"], "directors": ["Gabe Ibèèez"], "fullplot": "In 2044, solar storms have killed 99.7 % of the world's population and only 21 million people survive. The ROC Corporation has designed and built robots called Automata Pilgrim 7000 to help to rebuild the world. These robots have two security protocols; they can neither harm humans nor alter themselves or other robots. When police officer Sean Wallace shoots a robot and claims that it was altering itself, ROC insurance agent Jacq Vaucan is placed in charge of the investigation. Soon he believes that there is a \"clocksmith\" illegally modifying the robots. Jacq wants to live in the coast and asks his boss and friend Robert Bold to transfer him with his pregnant wife Rachel Vaucan to the coast. Robert offers the possibility if Jacq resolves the case. Jacq and Wallace go to a brothel where the modified robot Cleo attends and Wallace shoots its leg, expecting that the owner will lead them to the clocksmith. They meet Duprè but she is not the clocksmith that is modifying the robots. Soon Jacq discovers who is the responsible for modifying the robots but the Powers that Be in ROC believe that Jacq is the one to be blamed.", "genres": ["Action", "Sci-Fi", "Thriller"], "imdb": {"id": 1971325, "rating": 6.1, "votes": 33950}, "languages": ["English"], "lastupdated": "2015-09-14 00:01:13.783000000", "metacritic": 37, "num_mflix_comments": 2, "plot": "Jacq Vaucan is an insurance agent of ROC robotics corporation who investigates cases of robots violating their primary protocols against altering themselves. What he discovers will have profound consequences for the future of humanity.", "poster": "https://m.media-amazon.com/images/M/MV5BNzgyMDcyMjMwMV5BMl5BanBnXkFtZTgwNjY5MTA1MjE@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1413504000000, "runtime": 109, "title": "Automata", "tomatoes": {"consensus": "Beautiful to look at but narratively hollow, Autèmata short-circuits its handful of intriguing ideas with an overload of sci-fi clichès.", "critic": {"meter": 29, "numReviews": 28, "rating": 5.2}, "dvd": 1416268800000, "fresh": 8, "lastUpdated": 1441905038000, "production": "Millennium Entertainment", "rotten": 20, "viewer": {"meter": 31, "numReviews": 6697, "rating": 2.8}, "website": "http://www.automata-movie.com/"}, "type": "movie", "writers": ["Gabe Ibèèez", "Igor Legarreta", "Javier Sènchez Donate"], "year": 2014}