{"_id": "573a13b6f29313caabd477fa", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Harman Baweja", "Priyanka Chopra", "Boman Irani", "Archana Puran Singh"], "countries": ["Australia", "India"], "directors": ["Harry Baweja"], "fullplot": "Tells the story about Karan, a young, spirited, sporty boy who lives life off the rules and Sana, a young petite, shy girl who lives life by the rules. This develops into a magical love story. Karan's uncle, Dr. Yatinder Khanna's much developed time machine finally works. Sana expresses her wish to travel ahead in time to Mumbai in the future. We land in Mumbai 2050 in the time machine... along with Uncle Yatinder, Rahul and Thea (Sana's younger brother and sister). Flying cars, 200 storey buildings, robots and sky rails have changed the very face of Mumbai. Through a series of twists and turns, the time traveler Karan finds himself separating from his love. QT, a friendly femme robot and Boo, a small robotic teddy bear play their distinct roles in bringing their love story together but soon find themselves under the threat of the demi-god of the future, Dr. Hoshi. Will Karan be able to overcome the threat of Dr. Hoshi and win his love and travel back in time?", "genres": ["Action", "Adventure", "Drama"], "imdb": {"id": 490170, "rating": 2.7, "votes": 1687}, "languages": ["Hindi"], "lastupdated": "2015-08-23 00:22:04.750000000", "num_mflix_comments": 2, "plot": "With the help of his uncle, a man travels to the future to try and bring his girlfriend back to life.", "released": 1215129600000, "runtime": 180, "title": "Love Story 2050", "tomatoes": {"dvd": 1223337600000, "lastUpdated": 1439664494000, "production": "BIGFlix", "viewer": {"meter": 23, "numReviews": 2337, "rating": 2.5}}, "type": "movie", "writers": ["Harry Baweja (story)", "Bhavani Iyer (additional screenplay)", "Mayur Puri (dialogue)", "Karan Razdan (additional screenplay)", "Prem Soni (additional screenplay)", "Suparn Verma (additional screenplay)"], "year": 2008}