{"_id": "573a139af29313caabcf0129", "awards": {"nominations": 11, "text": "Nominated for 1 Oscar. Another 5 wins & 11 nominations.", "wins": 6}, "cast": ["Meryl Streep", "Leonardo DiCaprio", "Diane Keaton", "Robert De Niro"], "countries": ["USA"], "directors": ["Jerry Zaks"], "fullplot": "Estranged since their father's first stroke some 17 years earlier, Lee and Bessie lead separate lives in separate states. Lee's son, Hank, finds himself committed to a mental institution after setting fire to his mother's house. His younger brother, Charlie, seems unfazed by his brother's eccentricities or his mother's seeming disinterest. When Lee comes to the asylum to spring Hank for a week in Florida so that he can be tested as a possible bone marrow donor for Bessie, Hank is incredulous. \"I didn't even know you had a sister,\" he says. \"Remember, every Christmas, when I used to say 'Well, looks like Aunt Bessie didn't send us a card again this year?'\" \"Oh yeah,\" Hank says. Meanwhile, Marvin, the two women's bedridden father, has \"been dying for the past twenty years.\" \"He's doing it real slow so I don't miss anything,\" Bessie tells Dr. Wally. In Bessie's regular doctor's absence, it has fallen to Dr. Wally to inform Bessie that she has leukemia and will die without a bone marrow transplant. This precipitates the two sisters uneasy reunion. In Marvin's room, Bessie cares for her father's every need. In Lee's eyes, the sacrifice Bessie has made is too great and realizing the old man's welfare will fall to her if Bessie dies, Lee's first instinct is to look for a nursing home. \"In a few month's, I'll have my cosmotology degree,\" she says. \"My life is just coming together; I'm not going to give it all up, now!\" As first Lee is tested and then the boys for the compatibility of their marrow with Bessie's, the women take stock of their lives and rediscover the meaning of \"family.\"", "genres": ["Drama"], "imdb": {"id": 116999, "rating": 6.7, "votes": 18263}, "languages": ["English"], "lastupdated": "2015-08-11 00:24:52.547000000", "metacritic": 68, "plot": "A leukemia patient attempts to end a 20-year feud with her sister to get her bone marrow.", "poster": "https://m.media-amazon.com/images/M/MV5BOTk0ZDk3YWItZDZlOC00Y2FiLTgxNzYtODZmYzdkYWVmNmRiXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 855360000000, "runtime": 98, "title": "Marvin's Room", "tomatoes": {"consensus": "Marvin's Room rises above the pack of dysfunctional family dramas thanks to an impeccable cast that includes Meryl Streep, Diane Keaton, and Leonardo DiCaprio.", "critic": {"meter": 80, "numReviews": 49, "rating": 6.7}, "dvd": 1011052800000, "fresh": 39, "lastUpdated": 1441131236000, "production": "Miramax Films", "rotten": 10, "viewer": {"meter": 62, "numReviews": 21390, "rating": 3.2}}, "type": "movie", "writers": ["Scott McPherson (play)", "Scott McPherson (screenplay)"], "year": 1996}