{"_id": "573a13dcf29313caabdb248f", "awards": {"nominations": 1, "text": "3 wins & 1 nomination.", "wins": 3}, "cast": ["Neil Platt"], "countries": ["Denmark", "UK"], "directors": ["Emma Davie", "Morag McKinnon"], "fullplot": "I AM BREATHING reminds us what it is to be alive - a tale of fun and laughs with a smattering of upset and devastation. Within a year, Neil Platt goes from being a healthy 30-something British bloke with a great sense of humor to becoming completely paralyzed from the neck down, thanks to the devastating illness he has inherited - known as ALS, MND, or Lou Gehrig's Disease. As his body gets weaker, his perspective on life changes. His humor remains, but new wisdom emerges: \"It's amazing how adaptable we are when we have to be. It's what separates us and defines us as human beings.\" Knowing he only has a few months left to live, and while he still has the ability to speak, Neil puts together a letter and memory box for his baby son Oscar and communicates his experience and thoughts about life in a blog - and in this film which he was determined to make. The directness of his communication mingles with images of the sensory details of a life well lived, and makes us revalue the ordinary. His blog posts form the film's narration as he tells his own story through memories and impressions of his life - the sheer joy of falling in love, of partying with his mates, of fast motorbike rides. Through his determination to share his final journey, he makes us ask questions about our own lives.", "genres": ["Documentary", "Biography"], "imdb": {"id": 2392634, "rating": 7.1, "votes": 155}, "languages": ["English"], "lastupdated": "2015-09-06 00:45:28.447000000", "metacritic": 71, "plot": "A documentary follows the last months of Neil Platt, a young father with terminal and debilitating motor neuron disease (MND).", "poster": "https://m.media-amazon.com/images/M/MV5BODcyODUxODQ2NF5BMl5BanBnXkFtZTgwMDUyNjQ4MTE@._V1_SY1000_SX677_AL_.jpg", "released": 1378425600000, "runtime": 72, "title": "I Am Breathing", "tomatoes": {"critic": {"meter": 92, "numReviews": 24, "rating": 7.5}, "dvd": 1433203200000, "fresh": 22, "lastUpdated": 1435861536000, "production": "SDI Productions Ltd.", "rotten": 2, "viewer": {"meter": 82, "numReviews": 325, "rating": 4}, "website": "http://www.iambreathingfilm.com"}, "type": "movie", "year": 2013}