{"_id": "573a13a8f29313caabd1ddaa", "awards": {"nominations": 8, "text": "2 wins & 8 nominations.", "wins": 2}, "cast": ["Tony Chiu Wai Leung", "Faye Wong", "Wei Zhao", "Chen Chang"], "countries": ["Hong Kong"], "directors": ["Jeffrey Lau"], "fullplot": "In Ming Dynasty China, two pairs of siblings are destined for each other. But fate throws countless obstacles in the path of their happiness. One pair is high-born: the young Emperor and his sister Wushuang, both confined to the Imperial Palace and very much under the thumb of their mother, the Empress Dowager. The other pair is decidedly lowborn: the wanderer Li Yilong (known as King Bully for the way he terrorized the town of Meilong in his youth) and his sister Phoenix, who still runs a restaurant in Meilong. When both the young Emperor and his sister Wushuang contrive to leave the Palace and head south, they meet the loves of their lives in Meilong. But Wushuang has disguised herself as a man, and the Emperor is incognito. Numerous confusions, complications and misunderstandings ensue: genders and gender-roles are reversed, class differences prove hard to negotiate and identities and egos block the promptings of desire. It takes the interventions of a goddess to get everyone back on the right road. But it may be already too late to heal the wounds of disappointment and separation.", "genres": ["Comedy", "Romance", "Action"], "imdb": {"id": 311913, "rating": 7.1, "votes": 1927}, "languages": ["Cantonese", "Mandarin"], "lastupdated": "2015-08-26 01:27:51.620000000", "num_mflix_comments": 2, "plot": "In Ming Dynasty China, two pairs of siblings are destined for each other. But fate throws countless obstacles in the path of their happiness. One pair is high-born: the young Emperor and ...", "poster": "https://m.media-amazon.com/images/M/MV5BNWJkM2Y1YTAtOWFhOS00YTZiLWJhZWItMGI3ZTU3OTNmN2UyXkEyXkFqcGdeQXVyMjcxNjI4NTk@._V1_SY1000_SX677_AL_.jpg", "released": 1012953600000, "runtime": 97, "title": "Chinese Odyssey 2002", "tomatoes": {"dvd": 1254787200000, "lastUpdated": 1440097500000, "viewer": {"meter": 72, "numReviews": 2571, "rating": 3.6}, "website": "http://movie.kingnet.com.tw/channelk/chineseodyssey"}, "type": "movie", "writers": ["Jeffrey Lau (screenplay)"], "year": 2002}