{"_id": "573a13b7f29313caabd49ff6", "awards": {"nominations": 25, "text": "Won 2 Golden Globes. Another 23 wins & 25 nominations.", "wins": 25}, "cast": ["Drew Barrymore", "Jessica Lange", "Jeanne Tripplehorn", "Ken Howard"], "countries": ["USA"], "directors": ["Michael Sucsy"], "fullplot": "In 1973, documentary filmmaking brothers Albert Maysles and David Maysles decide to change the focus of their latest project from Jacqueline Kennedy Onassis to her aunt and older cousin, mother and daughter Edith Bouvier Beale - called Big Edie - and Edith 'Little Edie' Bouvier Beale, who were found living in squalor and isolation in the longtime family mansion, Grey Gardens, in East Hampton, New York. Through flashbacks starting in 1936, the path mother and daughter take from their socialite past to the time that the Mayles brothers show their completed film is shown. Big Edie's husband/Little Edie's father, Phelan Beale, controlled the family money, which included providing singing lessons to Big Edie with musician Gould Strong, with who she had more than a musical interest. Big Edie saw herself as a singer, first and foremost. Mother and father also controlled Little Edie's life, they who wanted her to stay at Grey Gardens rather than pursue her dream of becoming a professional dancer and actress in New York City. Phelan and Big Edie's eventual divorce, Little Edie's ill-fated relationship with Cap Krug in New York City, Big Edie's failing health, the pressure Little Edie faced to care for her mother, and a dwindling trust, which is used to maintain a life at Grey Gardens, slowly transform the lives of mother and daughter over the four decades. Mother and daughter agree to be the subjects of the documentary film in an effort to regain their past careers and glories, which never really materialized in their younger days.", "genres": ["Biography", "Drama"], "imdb": {"id": 758751, "rating": 7.5, "votes": 6910}, "languages": ["English"], "lastupdated": "2015-09-16 06:10:49.293000000", "num_mflix_comments": 3, "plot": "In 1973, documentary filmmaking brothers Albert Maysles and David Maysles decide to change the focus of their latest project from Jacqueline Kennedy Onassis to her aunt and older cousin, ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTI0MDAzODM1Ml5BMl5BanBnXkFtZTcwODA1NzE0Mg@@._V1_SY1000_SX677_AL_.jpg", "rated": "TV-PG", "released": 1240012800000, "runtime": 104, "title": "Grey Gardens", "tomatoes": {"critic": {"meter": 100, "numReviews": 10, "rating": 7.9}, "dvd": 1247529600000, "fresh": 10, "lastUpdated": 1440615191000, "production": "Oscilloscope Pictures", "rotten": 0, "viewer": {"meter": 78, "numReviews": 4127, "rating": 3.8}}, "type": "movie", "writers": ["Michael Sucsy (teleplay)", "Patricia Rozema (teleplay)", "Michael Sucsy (story)"], "year": 2009}