{"_id": "573a1396f29313caabce566a", "awards": {"nominations": 1, "text": "Won 1 BAFTA Film Award. Another 2 wins & 1 nomination.", "wins": 3}, "cast": ["Robert Powell", "Georgina Hale", "Lee Montague", "Miriam Karlin"], "countries": ["UK"], "directors": ["Ken Russell"], "fullplot": "Both trifles and structure are tossed out the door by director Ken Russell in this film. Here, historical content matters not so much as metaphors, feelings, emotions, and interpretations, and pay close attention, as every word and frame is intended to be important. The film takes place on a single train ride, in which the sickly composer Gustav Mahler and his wife, Alma, confront the reasons behind their faltered marriage and dying love. Each word seems to evoke memories of past, and so the audience witnesses events of Mahler's life that explain somewhat his present state. Included are his turbulent and dysfunctional family life as a child, his discovery of solace in the \"natural\" world, his brother's suicide, his [unwanted] conversion from Judiasm to Catholicism, his rocky marriage and the death of their young child. The movie weaves in and out of dreams, flashbacks, thoughts and reality as Russell poetically describes the man behind the music.", "genres": ["Biography", "Drama", "Music"], "imdb": {"id": 71797, "rating": 7.2, "votes": 1539}, "languages": ["English"], "lastupdated": "2015-08-08 00:03:04.663000000", "num_mflix_comments": 3, "plot": "Both trifles and structure are tossed out the door by director Ken Russell in this film. Here, historical content matters not so much as metaphors, feelings, emotions, and interpretations, ...", "poster": "https://m.media-amazon.com/images/M/MV5BYzY4MzQ3ZWMtMDM5ZC00ODcxLWEwMDgtZWYzMTJlMGRlZmU1XkEyXkFqcGdeQXVyMjUyNDk2ODc@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 160444800000, "runtime": 115, "title": "Mahler", "tomatoes": {"dvd": 1129593600000, "lastUpdated": 1442086237000, "viewer": {"meter": 75, "numReviews": 383, "rating": 3.1}}, "type": "movie", "writers": ["Ken Russell"], "year": 1974}