{"_id": "573a13a6f29313caabd18aee", "awards": {"nominations": 14, "text": "9 wins & 14 nominations.", "wins": 9}, "cast": ["Amitabh Bachchan", "Raveena Tandon", "Manoj Bajpayee", "Nandita Das"], "countries": ["India"], "directors": ["Rakeysh Omprakash Mehra"], "fullplot": "Aks is the story of a hunter and his prey. A cop and a killer. Aks is the story of Manu Verma and Raghuvan. The story begins in the heart of Budapest. The Indian Defence minister is on a routine foreign visit. He reveals the true details of his diplomatic trip to his head of Security Manu Verma by informing him about the floppy which has valuable information that could affect the very destiny of the nation. On the other hand Intelligence sources have revealed to Manu Verma that a lone assassin long feared for his ruthlessness has been paid to eliminate the Defence minister. The shadowy figure is called Raguhvan, Manu Verma reaches the Indian Defence Minister just moments too late to save him and finds the statesman in a pool of blood Raguhvan has struck and vanished into thin air. Now the hunter becomes the hunted as Manu Verma tries to find Raghuvan. When he does find him something unexpected happens, which changes both Manu and Raguhvan forever.", "genres": ["Thriller", "Mystery"], "imdb": {"id": 289845, "rating": 5.9, "votes": 1151}, "languages": ["Hindi"], "lastupdated": "2015-05-28 00:18:32.793000000", "num_mflix_comments": 2, "plot": "Raghavan Ghatge, a psychotic terrorist, and Manu Verma, the cop who tracks him down, shoot each other simultaneously, the result being that Raghavan's soul is transferred into Verma's body...", "poster": "https://m.media-amazon.com/images/M/MV5BMTUxOTg1MjQ1NF5BMl5BanBnXkFtZTYwNTc0NDc2._V1_SY1000_SX677_AL_.jpg", "released": 994982400000, "title": "Aks", "tomatoes": {"dvd": 1127779200000, "lastUpdated": 1438283638000, "viewer": {"meter": 39, "numReviews": 827, "rating": 3}}, "type": "movie", "writers": ["Renzil D'Silva (story)", "Rakeysh Omprakash Mehra (screenplay)", "Rakeysh Omprakash Mehra (story)", "Kamlesh Pandey (dialogue)", "Kamlesh Pandey (script)"], "year": 2001}