{"_id": "573a13b8f29313caabd4c759", "awards": {"nominations": 0, "text": "2 wins.", "wins": 2}, "cast": ["Dan Crane", "David S. Jung", "Hadia Ackerman", "Lance Kasten"], "countries": ["USA"], "directors": ["Alexandra Lipsitz"], "fullplot": "It's time to rock and roll - air guitar style. AIR GUITAR NATION is the feature documentary about the year that air guitar swept America - from New York to Los Angeles and then all the way to northern Finland. AIR GUITAR NATION chronicles the birth of the US Air Guitar Championships and the personal journeys of those talented contestants who are vying to become the first World Air Guitar Champion from the United States. Every August, the Air Guitar World Championships bring thousands of fans all the way to Oulu, Finland to see the world's best air guitarists battle it out for 60 seconds of mock stardom. For years, the USA was missing in action. Enter the first official US Air Guitar Championships. What starts as a friendly contest above a New York strip club becomes a battle of naked ambition played out on the national and, ultimately, the world stage. Full of triumph and disappointment, patriotic spirit and political tension - and of course invisible guitars - this tension filled competition quickly turns very real as the contest becomes even more fierce as the contestants work hard to win the title of World Air Guitar Champion. AIR GUITAR NATION captures the explosion of competitive air guitar through the eyes of former world champions, fans and media, and through the personal rivalries of those trying to attain the title of \"The best Air Guitarist in the world.\"", "genres": ["Documentary", "Biography", "Music"], "imdb": {"id": 799915, "rating": 7.2, "votes": 1215}, "languages": ["English"], "lastupdated": "2015-08-08 00:18:52.850000000", "metacritic": 72, "num_mflix_comments": 3, "plot": "It's time to rock and roll - air guitar style. AIR GUITAR NATION is the feature documentary about the year that air guitar swept America - from New York to Los Angeles and then all the way ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTk2MDcxMjMwN15BMl5BanBnXkFtZTcwODEzMjU0MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1191628800000, "runtime": 81, "title": "Air Guitar Nation", "tomatoes": {"consensus": "It's up for debate how serious or ironic its subjects are, but Air Guitar Nation is nonetheless a funny and exciting documentary with a killer soundtrack.", "critic": {"meter": 85, "numReviews": 65, "rating": 7.1}, "dvd": 1188259200000, "fresh": 55, "lastUpdated": 1440529909000, "production": "Shadow Distribution", "rotten": 10, "viewer": {"meter": 79, "numReviews": 5581, "rating": 3.6}, "website": "http://www.airguitarnation.com"}, "type": "movie", "year": 2006}