{"_id": "573a139af29313caabcf0485", "awards": {"nominations": 1, "text": "Nominated for 1 Golden Globe. Another 1 win & 1 nomination.", "wins": 2}, "cast": ["Kevin Costner", "Rene Russo", "Don Johnson", "Cheech Marin"], "countries": ["USA"], "directors": ["Ron Shelton"], "fullplot": "Roy 'Tin cup' McAvoy, a failed pro golfer who lives at the run-down driving range which he manages with his sidekick and caddy Romeo in the West Texas tin pot town of Salome, ends up signing over ownership to a madam of 'show girls' to pay off debts. His foxy novice golf pupil, female psychiatrist Dr. Molly Griswold, turns out to be the new girlfriend of McAvoy's sarcastic one-time college golf partner, slick PGA superstar David Simms, who drops by to play into Roy's fatal flaw: the inability to resist a dare, all too often causing him to lose against lesser players, in this case gambling away his car. Falling for Molly, Roy decides to become her patient; in order to earn her respect, he decides to try to qualify for the US Open, after starting off as Simm's caddy 'for the benefit of his experience'. His talent proves more then adequate, but over-confident negligence of risks, while pleasing the crowds, is murder on his scores, while Simms spits on the fans but never wastes a point...", "genres": ["Comedy", "Drama", "Romance"], "imdb": {"id": 117918, "rating": 6.3, "votes": 35489}, "languages": ["English"], "lastupdated": "2015-08-22 00:54:15.640000000", "metacritic": 60, "num_mflix_comments": 1, "plot": "A washed up golf pro working at a driving range tries to qualify for the US Open in order to win the heart of his succesful rival's girlfriend.", "poster": "https://m.media-amazon.com/images/M/MV5BNDQxNzY1MzItZmU1Mi00MWI3LTk4ZjYtOTBlM2RmYTk1MTJjXkEyXkFqcGdeQXVyNDk3NzU2MTQ@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 840153600000, "runtime": 135, "title": "Tin Cup", "tomatoes": {"consensus": "Breezy and predictable, Tin Cup is a likeable sports comedy that benefits greatly from Kevin Costner's amiable lead performance.", "critic": {"meter": 69, "numReviews": 48, "rating": 6.5}, "dvd": 872640000000, "fresh": 33, "lastUpdated": 1440183803000, "production": "New Line Home Entertainment", "rotten": 15, "viewer": {"meter": 65, "numReviews": 48920, "rating": 3}}, "type": "movie", "writers": ["John Norville", "Ron Shelton"], "year": 1996}