{"_id": "573a13abf29313caabd2502d", "awards": {"nominations": 1, "text": "Nominated for 1 Primetime Emmy. Another 1 win & 1 nomination.", "wins": 2}, "cast": ["Robert Altman", "John G. Avildsen", "Warren Beatty", "Linda Blair"], "countries": ["USA"], "directors": ["Ted Demme", "Richard LaGravenese"], "fullplot": "The 1970s was an extraordinary time of rebellion, of questioning every accepted idea: political activism, hedonism, protests, the sexual revolution, the women's movement, the civil rights movement, the music revolution, rage and liberation. Every standard by which we set our social and cultural clocks was either turned inside out or thrown away completely and reinvented. For American cinema, the 1970s was an era during which a new generation of filmmakers created work for a new kind of audience--moviegoers who were hungry for stories that reflected their own experiences and who were turning their backs on aged old studio formulas. As a result, emerging filmmakers influenced by foreign directors such as Godard, Kurosawa and Fellini coupled with the social climate and a struggling studio system, converged to create a new kind of moviemaking. Through their choice of material, filmmakers such as Francis Ford Coppola, Martin Scorsese, Robert Altman, Peter Bogdanovich, William Friedkin, Roger Corman and Paul Schrader revolutionized mainstream movies and for the first time personal visions were coming out of the studio system.", "genres": ["Documentary"], "imdb": {"id": 342275, "rating": 7.6, "votes": 2096}, "languages": ["English"], "lastupdated": "2015-07-25 00:04:11.180000000", "metacritic": 67, "num_mflix_comments": 1, "plot": "A documentary examining the decade of the 1970s as a turning point in American cinema. Some of today's best filmmakers interview the influential directors of that time.", "poster": "https://m.media-amazon.com/images/M/MV5BMTQ3OTEyMDExNV5BMl5BanBnXkFtZTcwMDA0MzAwMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1042934400000, "runtime": 138, "title": "A Decade Under the Influence", "tomatoes": {"critic": {"meter": 77, "numReviews": 30, "rating": 6.7}, "dvd": 883612800000, "fresh": 23, "lastUpdated": 1440094060000, "production": "IFC Films", "rotten": 7, "viewer": {"meter": 82, "numReviews": 3701, "rating": 3.8}, "website": "http://www.adecadeundertheinfluence.com"}, "type": "movie", "year": 2003}