{"_id": "573a1396f29313caabce54b7", "awards": {"nominations": 1, "text": "1 win & 1 nomination.", "wins": 1}, "cast": ["Jon Voight", "Paul Winfield", "Madge Sinclair", "Tina Andrews"], "countries": ["USA"], "directors": ["Martin Ritt"], "fullplot": "White Pat Conroy was born and raised in Beaufort, South Carolina. In March, 1969 under the Beaufort School District, he starts a job teaching at a small poor school located on Daufuskie Island, an island in a South Carolina river delta, the island accessible only by boat. The island is inhabited exclusively by blacks. He quickly learns that his students, who have never left the island, lack not only a basic understanding of academic items such as the alphabet and simple arithmetic, but also of other basic necessities of life such as personal hygiene. They can't even pronounce his name, they who call him Conrack. The teachers before him, including the school principal Mrs. Scott, have always treated the students as being slow and basically unteachable of academics. Conrack, a free thinking man, decides to expose his students not only to the academic subjects, but also to the gamut of life skills from brushing one's teeth to human anatomy, and some of the fun things in life like classical music, art, baseball, movies, swimming (despite living on an island, the islanders live in fear of the river because they don't know how to swim) and Halloween. He does so with compassion and without being patronizing. His teaching methods come under question by both Mrs. Scott and the Beauford School District administration led by its superintendent, Mr. Skeffington. These differences in viewpoint may place Conrack's tenure at the school in jeopardy.", "genres": ["Drama"], "imdb": {"id": 71358, "rating": 7.3, "votes": 1210}, "languages": ["English"], "lastupdated": "2015-09-12 00:35:40.967000000", "num_mflix_comments": 1, "plot": "White Pat Conroy was born and raised in Beaufort, South Carolina. In March, 1969 under the Beaufort School District, he starts a job teaching at a small poor school located on Daufuskie ...", "rated": "PG", "released": 146880000000, "runtime": 106, "title": "Conrack", "tomatoes": {"critic": {"meter": 73, "numReviews": 11, "rating": 6.1}, "fresh": 8, "lastUpdated": 1440099383000, "production": "20th Century Fox", "rotten": 3, "viewer": {"meter": 81, "numReviews": 262, "rating": 4}}, "type": "movie", "writers": ["Pat Conroy (novel)", "Irving Ravetch", "Harriet Frank Jr."], "year": 1974}