{"_id": "573a13a1f29313caabd0891d", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Thomas Calabro", "Dean Stockwell", "John Savage", "Kristen Dalton"], "countries": ["USA", "Canada"], "directors": ["Ellory Elkayem"], "fullplot": "Dr. Ben Cahill, a fine city doctor, gets so stressed by marital problems and alcohol that he freezes up under pressure in the emergency room. To get his act back together, he decides to unwind a few months in the house he and his ex bought on Orr island, an insignificant (former) fishermen place off the coast of Maine. He almost immediately becomes the butt of spite from a gang of local nobodies. After the doctor started examining, at the request of the reasonable sheriff Hobbs who leans to his side, some animal and human corpses with strange internal as well as external injuries, one of the brutes, not so handy handyman Jack Wald, has a fatal nocturnal accident crashing into Dr. Cahill's car. The doc observes one of the red cockroaches which recently infest the island has pincers, most unusual, reads up and contacts the university entomology department, where this African species isn't too well-known either. Jack's even dumber brother Eamon Wald uses violence which ends up causing the sheriff's death, so the doc has no other help then the enterprising local store clerk Nell Bartle, who takes a liking to the only educated men around, to continue investigating fighting off Eamon's gang and as they find out how bad the danger is, try to evacuate...", "genres": ["Sci-Fi", "Horror"], "imdb": {"id": 221633, "rating": 5, "votes": 1346}, "languages": ["English"], "lastupdated": "2015-09-14 08:37:28.307000000", "plot": "A Maine island becomes infested with lethal insects that root inside their victims, while a local doctor battles the bugs and incorrigible locals that don't believe him.", "poster": "https://m.media-amazon.com/images/M/MV5BMTAzNjUyMTQxODBeQTJeQWpwZ15BbWU3MDg3MzI2MjE@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 964483200000, "runtime": 92, "title": "They Nest", "tomatoes": {"lastUpdated": 1441995727000, "viewer": {"meter": 26, "numReviews": 181, "rating": 2.5}}, "type": "movie", "writers": ["John Claflin", "Daniel Zelman"], "year": 2000}