{"_id": "573a13a6f29313caabd167b3", "awards": {"nominations": 0, "text": "Nominated for 1 Golden Globe. Another 1 win.", "wins": 2}, "cast": ["Goldie Hawn", "Susan Sarandon", "Geoffrey Rush", "Erika Christensen"], "countries": ["USA"], "directors": ["Bob Dolman"], "fullplot": "In West Hollywood, Suzette, now on the far side of middle age, has always been a party girl, leading a life solely for the here and now. When the here and now leads to her without a job, no money and thus no sense of whether her partying life has gotten her anywhere, she decides to go into her distant past to visit in Phoenix an old friend, Vinnie, who she has not seen or talked to in twenty years. In their shared past, Suzette and Vinnie were Los Angeles groupies coined the Banger Sisters for their penchant to sleep with any and all rock musicians who came through Southern California. Suzette does know however that Vinnie's life has changed, she married to Raymond, a lawyer who has political aspirations, the two who have two teenaged daughters. It is in part the reason she decides to visit now well off Vinnie, to see if she will lend her some money. Suzette reconsiders when she finds out just how far Vinnie has changed. She now goes by her full given name Lavinia, and is not only the model of conservatism and respectability, but will go to extreme lengths to control this respectable agenda, which probably does not include a friend from their wild past. Suzette guesses that Vinnie's family may not know about her past life. If Suzette does decide to see Vinnie, she may upset Vinnie's apple cart for good or bad. Suzette's life is also mutually affected by Harry Plummer, a man she picks picks up on the way to Phoenix. With an extreme case of OCD, fifty year old Harry is failed Hollywood screenwriter who is returning to his hometown of Phoenix to conclude some business regarding what he considers his failed life.", "genres": ["Comedy", "Drama"], "imdb": {"id": 280460, "rating": 5.6, "votes": 11889}, "languages": ["English"], "lastupdated": "2015-09-02 00:18:36.990000000", "metacritic": 48, "num_mflix_comments": 1, "plot": "Lavinia and Suzette, former rock groupies and best friends, reconnect after twenty years; one is still as wild as ever, while the other has adopted a more conservative life-style.", "poster": "https://m.media-amazon.com/images/M/MV5BZjA1OTQxNGEtNTRjNi00MWIwLWEyZGYtNGRjOGEwNzE5OWU2XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1032480000000, "runtime": 98, "title": "The Banger Sisters", "tomatoes": {"boxOffice": "$30.2M", "consensus": "Hawn and Sarandon are terrific together, but the hoary plot is predictable and contrived.", "critic": {"meter": 47, "numReviews": 140, "rating": 5.3}, "dvd": 1043712000000, "fresh": 66, "lastUpdated": 1442270765000, "production": "Fox Searchlight Pictures", "rotten": 74, "viewer": {"meter": 42, "numReviews": 44678, "rating": 2.7}, "website": "http://www.foxsearchlight.com/thebangersisters/index.html"}, "type": "movie", "writers": ["Bob Dolman"], "year": 2002}