{"_id": "573a13b3f29313caabd3d55e", "awards": {"nominations": 5, "text": "6 wins & 5 nominations.", "wins": 6}, "cast": ["Martin Freeman", "Emily Holmes", "Eva Birthistle", "Jodhi May"], "countries": ["UK", "Poland", "Canada", "Netherlands"], "directors": ["Peter Greenaway"], "fullplot": "The year 1642 marks the turning point in the life of the famous Dutch painter, Rembrandt, turning him from a wealthy respected celebrity into a discredited pauper. At the insistence of his pregnant wife Saskia, Rembrandt has reluctantly agreed to paint the Amsterdam Musketeer Militia in a group portrait that will later become to be known as The Nightwatch. He soon discovers that there is a conspiracy afoot with the Amsterdam merchants playing at soldiers maneuvering for financial advantage and personal power in, that time, the richest city in the Western World. Rembrandt stumbles on a foul murder. Confident in the birth of a longed-for son and heir, Rembrandt is determined to expose the conspiring murderers and builds his accusation meticulously in the form of the commissioned painting, uncovering the seamy and hypocritical side to Dutch Society in the Golden Age. Rembrandt's great good fortune turns. Saskia dies. Rembrandt reveals the accusation of murder in the painting and the conspirators plan revenge. They set out to discredit him at home and abroad. They plant a treacherous mistress, Geertje, to seduce him. They try to blind him. They plan his social and financial ruin, and to create the circumstances for his slide into penury, insult his young mistress Hendrickje, conspire to destroy his son, and bring Rembrandt to his knees. The bold and courageous painting of the Nightwatch, exceptional in aesthetics and content, is Rembrandt's most celebrated painting, it consolidated his reputation as a master-painter but it also destroyed him socially and financially.", "genres": ["Biography", "Drama", "History"], "imdb": {"id": 446750, "rating": 6.5, "votes": 2167}, "languages": ["English"], "lastupdated": "2015-08-13 00:04:17.253000000", "plot": "An extravagant, exotic and moving look at Rembrandt's romantic and professional life, and the controversy he created by the identification of a murderer in the painting 'The Night Watch'.", "poster": "https://m.media-amazon.com/images/M/MV5BMTMxMzExNzg4OF5BMl5BanBnXkFtZTcwNzM0NjQ2MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1193961600000, "runtime": 134, "title": "Nightwatching", "tomatoes": {"critic": {"meter": 76, "numReviews": 17, "rating": 6.4}, "dvd": 1252972800000, "fresh": 13, "lastUpdated": 1441906614000, "production": "Kasander Film Company", "rotten": 4, "viewer": {"meter": 61, "numReviews": 1469, "rating": 3.3}, "website": "http://www.nightwatchingthefilm.com/"}, "type": "movie", "writers": ["Peter Greenaway"], "year": 2007}