{"_id": "573a13c5f29313caabd705eb", "awards": {"nominations": 5, "text": "Nominated for 1 BAFTA Film Award. Another 1 win & 5 nominations.", "wins": 2}, "cast": ["Andy Serkis", "Tom Hughes", "Clifford Samuel", "Joseph Kennedy"], "countries": ["UK"], "directors": ["Mat Whitecross"], "fullplot": "Flamboyant entertainer Ian Dury, backed by the Blockheads, takes to the stage, explaining to his audience how, as a child, he contracted polio from a swimming pool and attended a special needs school where he was bullied, particularly by orderly Hargreaves, a fact which shaped his tough and frequently iconoclastic approach to life, culminating in his controversial contribution to the Year of the Disabled. From his early days with Kilburn and the High Roads, playing seedy pubs with no dressing rooms Ian moves onto chart success with the Blockheads, collaborating with musician Chaz Jankel. His private life is complicated as, separated from the tolerant Betty with whom he remains friends but refuses to divorce for many years, he lives with the much younger Denise along with his adored son Baxter, who will himself become a performer. Ian dies in 2000, having packed an enormous amount of living into a comparatively short life.", "genres": ["Biography", "Drama", "Music"], "imdb": {"id": 1393020, "rating": 6.6, "votes": 3160}, "languages": ["English"], "lastupdated": "2015-08-20 00:59:19.033000000", "metacritic": 57, "num_mflix_comments": 1, "plot": "A biography of Ian Dury, who was stricken with polio at a young age and defied expectations by becoming one of the founders of the punk-rock scene in Britain in the 1970s.", "poster": "https://m.media-amazon.com/images/M/MV5BMjA4NjI1MzAyMF5BMl5BanBnXkFtZTcwMTEyNzUyNA@@._V1_SY1000_SX677_AL_.jpg", "released": 1273017600000, "runtime": 115, "title": "Sex & Drugs & Rock & Roll", "tomatoes": {"critic": {"meter": 76, "numReviews": 38, "rating": 6.5}, "dvd": 1295913600000, "fresh": 29, "lastUpdated": 1439924232000, "production": "Lipsync Productions", "rotten": 9, "viewer": {"meter": 66, "numReviews": 4668, "rating": 3.5}, "website": "http://www.sex-drugs-rock-roll-thefilm.com/"}, "type": "movie", "writers": ["Paul Viragh"], "year": 2010}