{"_id": "573a13dbf29313caabdb0186", "awards": {"nominations": 1, "text": "1 win & 1 nomination.", "wins": 1}, "cast": ["Bettina Gèring", "Katrin Himmler", "Monika Hertwig", "Rainer Hèè"], "countries": ["Israel", "Germany"], "directors": ["Chanoch Ze'evi"], "fullplot": "Bettina Gèring is the great-niece of Nazi official Hermann Gèring. Katrin Himmler is the great-niece of Heinrich Himmler, second in command of the Nazi Party under Adolf Hitler. Rainer Hèè is the grandson of Rudolf Hoess, creator and commandant of the Auschwitz Concentration Camp. Niklas Frank is the son of Hans Frank, Polish Governor-General during WWII, he who was responsible for the ghettos and concentration camps in Nazi occupied Poland. Monika Hertwig is the daughter of Amon Goeth, commandant of the Plaszèw Concentration Camp. None with Nazi leanings, the five talk individually about what it is like to carry a name associated with the Nazi Party, being a blood relative to someone associated with hate and murder, being German at a time when that in and of itself was seen as being associated with Naziism, dealing with their family regardless of their allegiance to the Nazi Party, and if they feel any guilt associated with the actions of their infamous ancestor. In addition to these musings, Hoess and journalist Eldad Beck - a third generation Holocaust survivor - travel back to Auschwitz to revisit their shared ancestral past. And Frank tells in his writings and in public speaking engagements, most to school aged children, of his past of being the direct beneficiary to many of the Nazi Party's favors which in turn is partly the reason he denounces his parents.", "genres": ["Documentary", "History"], "imdb": {"id": 2359085, "rating": 7.4, "votes": 814}, "languages": ["German", "English", "Hebrew"], "lastupdated": "2015-08-24 00:24:28.620000000", "metacritic": 69, "num_mflix_comments": 4, "plot": "A look into the lives of the descendants of the top Nazi officials who worked under Hitler's command.", "poster": "https://m.media-amazon.com/images/M/MV5BMjAwMTY0MDQ4NF5BMl5BanBnXkFtZTgwODk3OTU0MDE@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 1320105600000, "runtime": 59, "title": "Hitler's Children", "tomatoes": {"boxOffice": "$26.1k", "critic": {"meter": 81, "numReviews": 16, "rating": 7}, "dvd": 1364860800000, "fresh": 13, "lastUpdated": 1442260765000, "production": "Film Movement", "rotten": 3, "viewer": {"meter": 70, "numReviews": 5787, "rating": 3.7}, "website": "http://www.hitlerschildren.com/"}, "type": "movie", "year": 2011}