{"_id": "573a13d1f29313caabd8fefc", "awards": {"nominations": 3, "text": "3 nominations.", "wins": 0}, "cast": ["Bruce Willis", "John Malkovich", "Mary-Louise Parker", "Helen Mirren"], "countries": ["USA", "France", "Canada"], "directors": ["Dean Parisot"], "fullplot": "Retired CIA agent Frank Moses is in love with Sarah Ross and enjoying their normal life. Out of the blue, Marvin Boggs meets Frank in the supermarket and tells that Wikileaks has released the information that they had participated and know the whereabouts of the Nightshade, a portable nuclear weapon that was smuggled in pieces and hidden in Russia. Now the top agents in the world are under contract to seek them out to discover where Nightshade is. The trio travels to Paris and teams-up with the Russian Katja to track down the former Russian Agent 'The Frog' to get more information about the operation. They learn that the brilliant inventor Dr. Edward Bailey might know where the weapon is. They discover that Bailey has been interned in an asylum in London by the MI-6 for thirty-two years and the British Victoria joins the team. They rescue Bailey and find that the nuclear device is hidden in the Kremlin. Soon the dangerous South Korean Han joins the group expecting to retrieve the weapon. But dangerous killer Jack Horton is hunting Frank down and will not stop until he recovers the nuclear bomb.", "genres": ["Action", "Comedy", "Crime"], "imdb": {"id": 1821694, "rating": 6.7, "votes": 110744}, "languages": ["English", "Russian", "French"], "lastupdated": "2015-08-23 00:40:52.860000000", "metacritic": 47, "num_mflix_comments": 3, "plot": "Retired C.I.A. agent Frank Moses reunites his unlikely team of elite operatives for a global quest to track down a missing portable nuclear device.", "poster": "https://m.media-amazon.com/images/M/MV5BMjI2ODQ4ODY3Nl5BMl5BanBnXkFtZTcwNTc2NzE1OQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1374192000000, "runtime": 116, "title": "RED 2", "tomatoes": {"boxOffice": "$53.2M", "consensus": "While it's still hard to argue with its impeccable cast or the fun they often seem to be having, Red 2 replaces much of the goofy fun of its predecessor with empty, over-the-top bombast.", "critic": {"meter": 43, "numReviews": 138, "rating": 5.4}, "dvd": 1385424000000, "fresh": 59, "lastUpdated": 1441906854000, "production": "Lionsgate Films", "rotten": 79, "viewer": {"meter": 63, "numReviews": 92759, "rating": 3.6}, "website": "http://www.red-themovie.com/"}, "type": "movie", "writers": ["Jon Hoeber", "Erich Hoeber", "Warren Ellis (characters)", "Cully Hamner (characters)"], "year": 2013}