{"_id": "573a1397f29313caabce7849", "awards": {"nominations": 1, "text": "Nominated for 1 Oscar. Another 4 wins & 1 nomination.", "wins": 5}, "cast": ["Julie Carmen", "Tony Knesich", "Gregory Cleghorne", "Buck Henry"], "countries": ["USA"], "directors": ["John Cassavetes"], "fullplot": "Mild mannered Jack Dawn has been secretly working as an accountant for the mob. He, his Puerto Rican wife Jeri, his teen-aged daughter Joan and his mother-in-law, all who were planning on going on the run, are murdered by the mob because Jack was going to inform on them to the FBI. Before they're killed, Jack and Jeri are able to send their six-year old son Phil to Jeri's friend and their neighbor, Gloria Swenson, for safe keeping. Also with Phil is the book which contains all the information Jack was going to turn over. Gloria and Phil have an antagonistic relationship, not so much for who they are but what they are, Phil a kid, and Gloria a strange white woman who hates kids. As an ex-mistress of a mobster, Gloria learns that the people that killed the Dawns are old friends of hers. As Gloria and Phil go on the run both from the mob and from the authorities (who believe she kidnapped Phil) throughout New York City, Gloria has to come up with a plan on how best to save themselves, which is not easy because of their love/hate relationship and the fact that precocious Phil has a mind of his own. That plan includes what to do with the book, but more importantly how to save Phil as the mob would still be after him regardless of the book just in case he knows something about his father's dealings. All through their ordeal, Gloria is not averse to shooting to kill, especially if those who she is trying to kill are trying to kill her and Phil first.", "genres": ["Crime", "Drama", "Thriller"], "imdb": {"id": 80798, "rating": 7.1, "votes": 5613}, "languages": ["English"], "lastupdated": "2015-08-24 00:40:38.993000000", "num_mflix_comments": 1, "plot": "When a young boy's family is killed by the mob, their tough neighbor Gloria becomes his reluctant guardian. In possession of a book that the gangsters want, the pair go on the run in New York.", "poster": "https://m.media-amazon.com/images/M/MV5BODRiMDViZTUtODQ3MC00NTE4LWI3MmItYjJhMzE3NjE0NThjL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMjQwMjk0NjI@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 338169600000, "runtime": 123, "title": "Gloria", "tomatoes": {"critic": {"meter": 95, "numReviews": 22, "rating": 7}, "dvd": 1046131200000, "fresh": 21, "lastUpdated": 1439924580000, "production": "Columbia Pictures Corporation", "rotten": 1, "viewer": {"meter": 81, "numReviews": 4591, "rating": 3.7}}, "type": "movie", "writers": ["John Cassavetes"], "year": 1980}