{"_id": "573a13c0f29313caabd6290e", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Jensen Ackles", "Jaime King", "Kerr Smith", "Betsy Rue"], "countries": ["USA"], "directors": ["Patrick Lussier"], "fullplot": "In the mining town of Harmony, a drilling accident is caused by the son of the owner, Tom Hanniger. The mine collapses, burying six miners alive. The rescue team finds only Harry Warden alive, but in coma, and the other miners murdered by his pickax, and they conclude that Harry killed them to save oxygen for himself. On Valentine's Day, Harry awakes from his coma in the local hospital, and he kills twenty-two people, including a group of teenagers that are partying in the mine. Harry is killed by the deputy, but the only survivors are Tom Hanniger, his girlfriend Sarah, their friend Axel Palmer and his girlfriend Irene. Ten years later, Tom returns to Harmony after the death of his father. Tom has decided to sell the Hanniger Mine, and finds that Sarah has married Axel, who is now the local sheriff, and they have a son named Noah. On Valentine's Day, Harry Warden also returns, seeking revenge against those that had escaped his pickax in the past, and Tom is accused by Axel and other locals, who in turn makes accusations against Axel.", "genres": ["Horror"], "imdb": {"id": 1179891, "rating": 5.5, "votes": 43008}, "languages": ["English"], "lastupdated": "2015-08-18 00:05:45.390000000", "metacritic": 51, "num_mflix_comments": 2, "plot": "Tom returns to his hometown on the tenth anniversary of the Valentine's night massacre that claimed the lives of 22 people. Instead of a homecoming, Tom finds himself suspected of committing the murders, and it seems like his old flame is the only one that believes he's innocent.", "poster": "https://m.media-amazon.com/images/M/MV5BMTY2MTQ1OTcxOF5BMl5BanBnXkFtZTcwMjc2ODUxMg@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1232064000000, "runtime": 101, "title": "My Bloody Valentine", "tomatoes": {"boxOffice": "$51.5M", "consensus": "This gory, senses-assaulting slasher film is an unpretentious, effective mix of old-school horror stylings and modern 3D technology.", "critic": {"meter": 57, "numReviews": 89, "rating": 5.8}, "dvd": 1242691200000, "fresh": 51, "lastUpdated": 1442165645000, "production": "Lionsgate Films", "rotten": 38, "viewer": {"meter": 45, "numReviews": 208364, "rating": 3.1}, "website": "http://www.mybloodyvalentinein3d.com/"}, "type": "movie", "writers": ["Todd Farmer (screenplay)", "Zane Smith (screenplay)", "John Beaird", "Stephen A. Miller"], "year": 2009}