{"_id": "573a1395f29313caabce3011", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Marlon Brando", "Sophia Loren", "Sydney Chaplin", "Tippi Hedren"], "countries": ["UK"], "directors": ["Charles Chaplin"], "fullplot": "In Hong Kong, the wealthy Ogden Mears is traveling in a transatlantic and is near to be assigned Saudi Arabia Ambassador and is divorcing from his wife Martha. His friend Harvey and he are invited by their old friend Clark to go to a nightclub with three aristocratic Russian refugees on their last night. Ogden drinks too much and spends the night with Countess Natascha. On the next morning, while sailing back home, Ogdeb finds Natascha hidden in his cabin wearing a ball gown and with no documents. The stowaway explains that she wants to go to the United States and Ogden is worried with his career. But Harvey convinces him to help Natascha. Ogden falls in love with Natascha and together with Harvey, they plot a fake marriage of Natascha with his valet Hudson. But things get complicated when immigration requests her documents and Martha arrives on board.", "genres": ["Comedy", "Romance"], "imdb": {"id": 61523, "rating": 6, "votes": 3544}, "languages": ["English", "French"], "lastupdated": "2015-08-14 00:33:54.333000000", "num_mflix_comments": 1, "plot": "In Hong Kong, the wealthy Ogden Mears is traveling in a transatlantic and is near to be assigned Saudi Arabia Ambassador and is divorcing from his wife Martha. His friend Harvey and he are ...", "poster": "https://m.media-amazon.com/images/M/MV5BODQ0NjM3OGMtYzhmOC00NzA1LTg1ODgtMjkzMDcwZDVlZjZkXkEyXkFqcGdeQXVyNjUwNzk3NDc@._V1_SY1000_SX677_AL_.jpg", "rated": "G", "released": -88387200000, "runtime": 120, "title": "A Countess from Hong Kong", "tomatoes": {"critic": {"meter": 60, "numReviews": 5, "rating": 5.1}, "dvd": 1044316800000, "fresh": 3, "lastUpdated": 1440614012000, "production": "Universal Pictures", "rotten": 2, "viewer": {"meter": 43, "numReviews": 670, "rating": 3.1}}, "type": "movie", "writers": ["Charles Chaplin (original screenplay)"], "year": 1967}