{"_id": "573a13b0f29313caabd34ee4", "awards": {"nominations": 3, "text": "3 nominations.", "wins": 0}, "cast": ["Al Pacino", "Alicia Witt", "Leelee Sobieski", "Amy Brenneman"], "countries": ["USA", "Germany", "Canada"], "directors": ["Jon Avnet"], "fullplot": "In Seattle, the successful forensic psychiatrist and college professor Jack Gramm is in evidence since he was responsible for the condemnation of the serial killer Jon Forster, influencing the jury to sentence him to the death row. Jon accuses Jack of manipulation, inducing one witness and sister of one of his victims to testify against him. On the eve of Jon's execution, Jack receives a phone call telling him that he has only eighty-eight minutes of life, while a killer is copycatting Jon, killing women with the same \"modus-operandi\" and is investigated by Seattle Slayer Task Force. With the support of associate Shelly Barnes, an FBI agent, his friend Frank Parks, and his assistant Kim Cummings, Jack investigates some weird and problematic students, a security guard of the campus and the woman with whom he had one night stand.", "genres": ["Crime", "Drama", "Mystery"], "imdb": {"id": 411061, "rating": 5.9, "votes": 62548}, "languages": ["English"], "lastupdated": "2015-09-04 00:09:35.833000000", "metacritic": 17, "num_mflix_comments": 1, "plot": "On the day that a serial killer that he helped put away is supposed to be executed, a noted forensic psychologist and college professor receives a call informing him that he has 88 minutes left to live.", "poster": "https://m.media-amazon.com/images/M/MV5BMTgxOTg1NzgzMV5BMl5BanBnXkFtZTcwNTM3Mjc1MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1208476800000, "runtime": 108, "title": "88 Minutes", "tomatoes": {"boxOffice": "$16.9M", "consensus": "88 Minutes is a shockingly inept psychological thriller that expertly squanders the talent at hand.", "critic": {"meter": 5, "numReviews": 121, "rating": 2.6}, "dvd": 1221523200000, "fresh": 6, "lastUpdated": 1439837333000, "production": "Sony Pictures Entertainment", "rotten": 115, "viewer": {"meter": 44, "numReviews": 103796, "rating": 3.1}, "website": "http://www.sonypictures.com/movies/88minutes/index.html"}, "type": "movie", "writers": ["Gary Scott Thompson"], "year": 2007}