{"_id": "573a1393f29313caabcddf0c", "awards": {"nominations": 13, "text": "Won 1 Oscar. Another 4 wins & 13 nominations.", "wins": 5}, "cast": ["Jane Wyman", "Lew Ayres", "Charles Bickford", "Agnes Moorehead"], "countries": ["USA"], "directors": ["Jean Negulesco"], "fullplot": "Dr. Robert Richardson, a dedicated young general practitioner, seeks to establish himself in an isolated fishing village on Cape Breton Island off the Nova Scotia coast. The population is poor and the struggling physician generally gets paid for his efforts in barter. When he meets Belinda McDonald, a young deaf mute callously dismissed by family and neighbors as \"the dummy,\" he alone senses her innate intelligence. He overcomes the initial skepticism of her flinty, gruff father and indifferently cold aunt, who operate a hardscrabble grist mill and farm, and devotes himself to teaching the young girl sign language and lip-reading. Hopes are even raised that she might even eventually qualify for a medical procedure that might improve her condition. Her optimism is crushed, however, when she raped by Locky McCormick, a brutish local fisherman. Traumatized, she is unable to communicate the outrage to her family, who are baffled and angry when they learn she is pregnant. The local gossips blame the doctor, and he and the McDonalds become pariahs, unable to earn a living in the provincial village. Matters come to a head when McCormick and his new wife pressure the local council to declare Belinda an unfit mother and declare them the baby's legal guardians.", "genres": ["Drama", "Film-Noir"], "imdb": {"id": 40495, "rating": 7.9, "votes": 2842}, "languages": ["English", "American Sign Language"], "lastupdated": "2015-08-13 00:06:09.067000000", "num_mflix_comments": 1, "plot": "In post-war Cape Breton, a doctor's efforts to tutor a deaf/mute woman are undermined when she is raped, and the resulting pregnancy causes scandal to swirl.", "poster": "https://m.media-amazon.com/images/M/MV5BMTRiMzkzYmEtZGJiZC00NmNiLTk2ZGItNWNiOTg0ZjE1NWJjXkEyXkFqcGdeQXVyNjE5MjUyOTM@._V1_SY1000_SX677_AL_.jpg", "rated": "UNRATED", "released": -672105600000, "runtime": 102, "title": "Johnny Belinda", "tomatoes": {"critic": {"meter": 88, "numReviews": 8, "rating": 7.2}, "dvd": 1138665600000, "fresh": 7, "lastUpdated": 1441135757000, "production": "Warner Bros. Pictures", "rotten": 1, "viewer": {"meter": 88, "numReviews": 1381, "rating": 3.8}}, "type": "movie", "writers": ["Irma von Cube (screenplay)", "Allen Vincent (screenplay)", "Elmer Harris (from the stage play by)"], "year": 1948}