{"_id": "573a139af29313caabcf0b6c", "awards": {"nominations": 5, "text": "1 win & 5 nominations.", "wins": 1}, "cast": ["Om Puri", "Rachel Griffiths", "Akbar Kurtha", "Stellan Skarsgèrd"], "countries": ["UK", "France"], "directors": ["Udayan Prasad"], "fullplot": "Parvez was born in Lahore, Pakistan, and as a child was asked to study the Holy scriptures through a Maulvi. When the Maulvi started his sermon, Parvez would fall asleep, this lead to the Maulvi devising a unique punishment, which ultimately compelled Parvez to stop attending. When he grew up, his marriage was arranged with Minoo and they immigrated to a small town in Britain, where Parvez started to make a living driving a taxi, and found himself free from all religious activity. 25 years later, Parvez is an alcoholic, still driving a cab, while people who had immigrated after him have their own businesses and are wealthier. Parvez now has a grown son, Farid, who is the apple of his eye, and is to be engaged to Madeleine Fingerhut, who is the daughter of the local Chief Inspector. After the two families' meet, Farid has a sudden change of heart when he notices that the Chief Inspector detests his family, and it slowly dawns on him that he and his girlfriend are quite different, and he cannot be part of a culture that relies solely on filth, porn, is soaked in sex, along with a mix of Caucasian (white) and Jewish propaganda against Islam. He starts reciting the Holy Quran, and asks permission from his dad to invite some religious leaders from Pakistan, after receiving consent, they do arrive to live in Parvez's home. It is here that Parvez will find that Farid has broken off the forthcoming engagement with Ms. Fingerhut, and has become a born again Muslim. His wife, Minoo, has taken to wearing the Hizaab, remains in the kitchen all day, and is not even permitted to sup or dine with her family, while Parvez finds that he cannot even sleep in his bedroom. Things start to heat up when Farid finds out that his dad has been patronizing a prostitute by the name of Beltina, whose real name is Sandra, and he also notes that his dad is her pimp. Then he and his colleagues set about to cleanse this town of its prostitutes - leading to a confrontation between him and his dad - a confrontation that may well split this family forever.", "genres": ["Comedy", "Drama", "Romance"], "imdb": {"id": 119743, "rating": 7, "votes": 1426}, "languages": ["English"], "lastupdated": "2015-09-06 00:42:02.993000000", "plot": "Pakistani taxi-driver Parvez and prostitute Bettina find themselves trapped in the middle when Islamic fundamentalists decide to clean up their local town.", "poster": "https://m.media-amazon.com/images/M/MV5BMDI2NTFhYWItNWY2ZS00YzY3LTg4OWEtZDg4NTk0ZGVhZjFmXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 884131200000, "runtime": 87, "title": "My Son the Fanatic", "tomatoes": {"critic": {"meter": 78, "numReviews": 27, "rating": 6.9}, "dvd": 948758400000, "fresh": 21, "lastUpdated": 1439407366000, "production": "Miramax", "rotten": 6, "viewer": {"meter": 77, "numReviews": 1060, "rating": 3.5}}, "type": "movie", "writers": ["Hanif Kureishi (short story)", "Hanif Kureishi"], "year": 1997}