{"_id": "573a1392f29313caabcdaf75", "awards": {"nominations": 6, "text": "Won 1 Oscar. Another 1 win & 6 nominations.", "wins": 2}, "cast": ["Clark Gable", "Jeanette MacDonald", "Spencer Tracy", "Jack Holt"], "countries": ["USA"], "directors": ["W.S. Van Dyke"], "fullplot": "Mary Blake arrives at Blackie Norton's Paradise gambling hall and beer garden looking for work as a singer. Blackie embarrasses her by asking to see her legs, but does hire her. She faints from hunger. Nob Hill Socialite Jack Burley and Maestro Baldini of the Tivoli Opera House see her singing and offer her a chance to do opera, but Blackie has her under a two-year contract which she sorrowfully stands by. Later, when he makes up posters featuring Mary in tights, she does leave for the Tivoli. Blackie gets an injunction against Burley, but knocks out the process server when he hears Mary's performance as Marguerite in \"Faust\". She asks her to marry him and she agrees to go back to the Paradise as his kind of singer, but Blackie's childhood chum Father Tim intervenes. After Blackie slugs the priest, Mary leaves. She is soon the star of the Tivoli and Blackie's place is closed down. She sings a rousing \"San Francisco\" on behalf of the Paradise at the annual \"Chicken Ball\" and wins the $10,000 prize which Blackie throws to the floor. As she storms out of the hall a terrible rumble betokens the famous San Francisco earthquake. Buildings collapse, streets split wide open, the city burns, the army dynamites whole sections of town. After staggering around in a stupor Blackie finds Father Tim and the two of them find Mary at a Salvation Army camp. Backed by hundreds of others, they look out over the ruins which are gradually replaced by the shining new city with a reprise of the title song.", "genres": ["Drama", "Musical", "Romance"], "imdb": {"id": 28216, "rating": 7.3, "votes": 3653}, "languages": ["English"], "lastupdated": "2015-08-28 00:36:27.707000000", "num_mflix_comments": 2, "plot": "A Barbary Coast saloonkeeper and a Nob Hill impresario are rivals for the affections of a beautiful singer, both personally and professionally in 1906 San Francisco.", "poster": "https://m.media-amazon.com/images/M/MV5BMjM4MjA5MDU0Nl5BMl5BanBnXkFtZTgwOTIyNTczMjE@._V1_SY1000_SX677_AL_.jpg", "rated": "UNRATED", "released": -1057708800000, "runtime": 115, "title": "San Francisco", "tomatoes": {"critic": {"meter": 100, "numReviews": 8, "rating": 7.4}, "dvd": 1150761600000, "fresh": 8, "lastUpdated": 1442138250000, "production": "MGM", "rotten": 0, "viewer": {"meter": 71, "numReviews": 1290, "rating": 3.7}}, "type": "movie", "writers": ["Anita Loos (screen play)", "Robert E. Hopkins (from the story by)"], "year": 1936}