{"_id": "573a13d1f29313caabd8e193", "awards": {"nominations": 4, "text": "8 wins & 4 nominations.", "wins": 8}, "cast": ["Paul Eenhoorn", "Demetrius Grosse", "Tom Plunkett", "Christy Lighthouse"], "countries": ["USA"], "directors": ["Chad Hartigan"], "fullplot": "Martin Bonner has just moved to Nevada from the East Coast, leaving behind his two adult children and a life he spent more than two decades building. He's there working a new job as the volunteer coordinator for a non-profit organization that helps prisoners make the transition from incarceration to freedom. It's Martin's first job in two years and he's recently declared bankruptcy. At the same time, Travis Holloway, a prisoner in the program, is being released after serving twelve years. Sent back into the world with nothing, Travis also finds life in Reno difficult to adjust to, despite the help from his program sponsor, Steve Helms. The stories of Martin and Travis slowly converge, as the two men meet and find that they have much in common, not the least of which is an unspoken need for encouragement and support. Their unlikely friendship blossoms but is put to the test when Travis betrays Martin's trust in order to reunite with his estranged daughter.", "genres": ["Drama"], "imdb": {"id": 1798291, "rating": 6.6, "votes": 712}, "languages": ["English"], "lastupdated": "2015-08-23 01:10:09.567000000", "metacritic": 71, "num_mflix_comments": 2, "plot": "Martin Bonner has just moved to Nevada from the East Coast, leaving behind his two adult children and a life he spent more than two decades building.", "poster": "https://m.media-amazon.com/images/M/MV5BODUxMDgzMDEwMV5BMl5BanBnXkFtZTcwMTM0MDg0OQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1358640000000, "runtime": 83, "title": "This Is Martin Bonner", "tomatoes": {"consensus": "Solemn but heartfelt, This is Martin Bonner is a slow-burning drama with an outstanding performance by Paul Eenhoorn as the title character.", "critic": {"meter": 93, "numReviews": 28, "rating": 7.8}, "dvd": 1378771200000, "fresh": 26, "lastUpdated": 1442431207000, "production": "Monterey Media", "rotten": 2, "viewer": {"meter": 69, "numReviews": 669, "rating": 3.5}, "website": "http://martinbonner.com/"}, "type": "movie", "writers": ["Tara Everhart (additional dialogue written by)", "Chad Hartigan"], "year": 2013}