{"_id": "573a13b0f29313caabd3324e", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Beanie Sigel", "Noreaga", "Damon Dash", "Michael Bentt"], "countries": ["USA"], "directors": ["Damon Dash"], "fullplot": "Three notorious gangsters wage a bloody battle for supremacy in the City of Brotherly Love. Beans, the imprisoned kingpin and hometown drug lord, struggles to keep his renegade ABM Crime Syndicate on the map. He is driven and consumed by a festering hatred for his longtime rival. Dame, the Harlem-born hustler, is also the top dog in town. His Umbrella network is unmatched in cash-flow and manpower. With a long list of enemies seeking territory and revenge, the self-proclaimed \"cakeaholic\" is forced into a vicious war. Loco, the flashy Miami playboy, is about to be released from prison. His deep pockets and stellar reputation prove to be valuable tools in Loco's plot to take over the streets of Philly. But he must first overcome the ghosts from a turbulent past. Alliances are formed and shattered, and lifelong friendships are put to the test as the various crews deal and duel to the death. Somewhere, buried deep within the ranks of one of these gangs, a ruthless criminal mastermind is conspiring to take them all down. The backstabbing, thievery and deception simmers, boils and ultimately spills into a gruesome finale--an old-fashioned shootout on the cold, unforgiving Philly streets.", "genres": ["Musical", "Action", "Crime"], "imdb": {"id": 403537, "rating": 4.3, "votes": 1163}, "languages": ["English"], "lastupdated": "2015-09-01 00:50:50.037000000", "metacritic": 33, "num_mflix_comments": 2, "plot": "Three gangsters vie for control of the streets of Philadelphia.", "poster": "https://m.media-amazon.com/images/M/MV5BMTQ5NjIzNDgyN15BMl5BanBnXkFtZTcwMTUxNzgyMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1113350400000, "runtime": 94, "title": "State Property 2", "tomatoes": {"boxOffice": "$1.7M", "critic": {"meter": 14, "numReviews": 14, "rating": 3.5}, "dvd": 1121126400000, "fresh": 2, "lastUpdated": 1437416491000, "production": "Lions Gate Films", "rotten": 12, "viewer": {"meter": 83, "numReviews": 6955, "rating": 3.9}, "website": "http://www.lionsgatefilms.com/profile/stateproperty2.php"}, "type": "movie", "writers": ["Adam Moreno (story)", "Damon Dash (story)", "Adam Moreno (screenplay)"], "year": 2005}