{"_id": "573a1392f29313caabcd9aff", "awards": {"nominations": 0, "text": "Nominated for 3 Oscars. Another 3 wins.", "wins": 6}, "cast": ["Paul Muni", "Glenda Farrell", "Helen Vinson", "Noel Francis"], "countries": ["USA"], "directors": ["Mervyn LeRoy"], "fullplot": "Having returned from fighting in World War I, James Allen doesn't want to settle into a humdrum life and decides to set off to find his fortune. He travels the length and breadth of America, working as a skilled tradesman in the construction industry. When times get tough however, he finds himself living in a shelter where an acquaintance suggests they go out for a hamburger. What the friend really has in mind is to rob the diner and Allen soon finds himself working on a chain gang with a long jail sentence. Allen manages to escape however and heads to Chicago where over several years he slowly but surely works his way up the ladder to become one of the most respected construction engineers in the city. His past catches up with him and despite protestations from civic leaders and his many friends in Chicago, he finds himself again on the chain gang. Escaping for a second time, he accepts that to survive, he must lead a life of crime.", "genres": ["Crime", "Drama", "Film-Noir"], "imdb": {"id": 23042, "rating": 8.1, "votes": 8696}, "languages": ["English"], "lastupdated": "2015-09-15 03:22:11.277000000", "plot": "Wrongly convicted James Allen serves in the intolerable conditions of a southern chain gang, which later comes back to haunt him.", "poster": "https://m.media-amazon.com/images/M/MV5BMDllMDA4YWQtYzdmNC00OGYxLWE0N2QtZmNjM2QxMTgxYzFkXkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": -1171324800000, "runtime": 92, "title": "I Am a Fugitive from a Chain Gang", "tomatoes": {"critic": {"meter": 100, "numReviews": 21, "rating": 8.3}, "dvd": 1115683200000, "fresh": 21, "lastUpdated": 1442336573000, "production": "Vitaphone Corporation", "rotten": 0, "viewer": {"meter": 91, "numReviews": 3095, "rating": 4.1}}, "type": "movie", "writers": ["Robert E. Burns (by)", "Howard J. Green (screen play)", "Brown Holmes (screen play)"], "year": 1932}