{"_id": "573a13b5f29313caabd41f54", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Anupam Kher", "Boman Irani", "Parvin Dabas", "Tara Sharma"], "countries": ["India"], "directors": ["Dibakar Banerjee"], "fullplot": "K.K. Khosla (Anupam Kher) is a middle class man living in New Delhi. He is a simple man with simple tastes. The plot starts with a scene where Khosla dreams about his death. The irony is that nobody cares about his death; instead his children & neighbours are more interested in their materialistic needs. One early morning in Delhi, Khosla wakes up and plans to go to the site where he has purchased a plot to build his house. He is accompanied by his wife, eldest son Bunty (Ranvir Shorey), second son Chironji Lal Khosla (Parvin Dabas), and his daughter. When they reach the spot they find that the site has been occupied by someone else and on further investigation find that it has been captured by a property usurping nexus headed by a man named Kishan Khurana (Boman Irani). Khurana demands Rs. 15 lakhs to vacate the plot, which Khosla refuses to give. Bunty gathers few local strongmen and forcefully destroys the walls and re-occupies the plot. But Khurana has the police on his side and he gets Khosla arrested. After a day in the lock-up, Khosla is released. After Cherry meets Asif Iqbal who at one time was Khurana's partner. Khurana took away Asif's ancestral land by cheating him. So Asif and the Khoslas turn the tables on Khurana and dupe him of Rs. 35 lakhs (by fraud). In the end, Khosla gives the required 15 lakh to Khurana and takes possession of his plot.", "genres": ["Comedy", "Crime", "Drama"], "imdb": {"id": 466460, "rating": 8.4, "votes": 8998}, "languages": ["Hindi"], "lastupdated": "2015-08-24 00:26:30.057000000", "num_mflix_comments": 3, "plot": "A Delhi based retired middle class man tries half-heartedly to get his land back from a swindling property dealer with the help of his sons and their friends.", "poster": "https://m.media-amazon.com/images/M/MV5BZTg2YWFkOGMtYWExMy00YmFiLTk2YjctNTAzZDk5MjdhMzdlXkEyXkFqcGdeQXVyNjQ2MjQ5NzM@._V1_SY1000_SX677_AL_.jpg", "released": 1158883200000, "runtime": 135, "title": "Khosla's Nest", "tomatoes": {"dvd": 1161043200000, "lastUpdated": 1431714703000, "viewer": {"meter": 90, "numReviews": 2782, "rating": 4}, "website": "http://www.khoslakaghosla.com"}, "type": "movie", "writers": ["Jaideep Sahni (story)"], "year": 2006}