{"_id": "573a13cef29313caabd871a8", "awards": {"nominations": 2, "text": "3 wins & 2 nominations.", "wins": 3}, "cast": ["Mitsuki Tanimura", "Pistol Takehara", "Ryè Kase", "Kaho Minami"], "countries": ["Japan"], "directors": ["Kazuyoshi Kumakiri"], "fullplot": "In the city of Kaitan, during the winter, the local shipyard is downsized and workers are laid off. Futa (Pistol Takehara) lives with his younger sister Honami (Mitsuki Tanimura. He loses his job at the shipyard and, feeling uneasy about their situation, goes with Honami to see the sunrise on a nearby mountainside for New Year's Day. Makoto (Takashi Yamanaka), a new city hall employee, visits the only remaining house in a redevelopment area. The home belongs to a 70-year-old woman,Toki (Aki Nakazato) who lives with her cat and a few animals in her backyard. Toki refuses to vacate the land and Makoto tries to persuade her that she will be forcibly evicted. 49-year-old Ryuzo (Kaoru Kobayashi) works in a small planetarium, while his relationship with his wife Haruyo (Haruyo Hika) and teenage son is deteriorating. Haruyo finds release by working as a hostess in a cabaret. Haruo (Ryo Kase)has taken over the operation of his father's gas company, but he worries about the state of his business. He also has a strained relationship with his wife, who takes out her anger on their son Akira. Taichiro, a street car driver, spots his son, Hiroshi (Masaki Miura) walking in downtown Kaitan. Although Hiroshi lives & works in Tokyo, he has come back to Kaitan for business. But he doesn't contact his father, even though it is the holiday season.", "genres": ["Drama"], "imdb": {"id": 1703068, "rating": 7.2, "votes": 84}, "languages": ["Japanese"], "lastupdated": "2015-05-14 00:07:07.640000000", "num_mflix_comments": 3, "plot": "In the city of Kaitan, during the winter, the local shipyard is downsized and workers are laid off. Futa (Pistol Takehara) lives with his younger sister Honami (Mitsuki Tanimura. He loses ...", "released": 1292630400000, "runtime": 152, "title": "Sketches of Kaitan City", "tomatoes": {"lastUpdated": 1433966015000, "viewer": {"meter": 100, "numReviews": 15, "rating": 3.2}}, "type": "movie", "writers": ["Yasushi Satè (short stories)", "Takashi Ujita (screenplay)"], "year": 2010}