{"_id": "573a139ff29313caabd0077f", "awards": {"nominations": 2, "text": "2 wins & 2 nominations.", "wins": 2}, "cast": ["Ben Affleck", "Gwyneth Paltrow", "Natasha Henstridge", "Edward Edwards"], "countries": ["USA"], "directors": ["Don Roos"], "fullplot": "Buddy (Affleck) has just signed an airline in Chicago as a big client, but is ironically delayed at the airport waiting for a flight to LA on that same airline. He meets fellow passenger Greg, who opts to be bumped, even though it means missing an activity with his older son. When the flight gets resumed, Buddy thinks he's doing a good deed by swapping tickets with Greg so he can get home to his son. Sadly, the flight crashes. Buddy conspires with his friend, the ticket agent that night, to take his name off the passenger list and put Greg's on. Once he's back in LA, his new client dictates that the company run a series of feel-good ads about the crash. Buddy feels very hypocritical, and completely loses it when the commercials win a Cleo. After going through re-hab, he decides he needs to check on Greg's widow. But he doesn't plan on falling in love with her.", "genres": ["Drama", "Romance"], "imdb": {"id": 186894, "rating": 5.7, "votes": 16564}, "languages": ["English"], "lastupdated": "2015-08-30 00:49:17.883000000", "metacritic": 52, "plot": "A man switches plane tickets with another man who dies in that plane in a crash. The man falls in love with the deceased one's wife.", "poster": "https://m.media-amazon.com/images/M/MV5BMDhjMmJiOWUtYzU5Yy00YWYzLTg3MzItNDFjYTVmMGFkMWQxXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 974419200000, "runtime": 106, "title": "Bounce", "tomatoes": {"consensus": "Critics say Bounce is more of a thud. Plot turns feel cliched and contrived, and the romance between Paltrow and Affleck fails to engage.", "critic": {"meter": 52, "numReviews": 107, "rating": 5.5}, "dvd": 986860800000, "fresh": 56, "lastUpdated": 1440444057000, "production": "Miramax Films", "rotten": 51, "viewer": {"meter": 33, "numReviews": 21752, "rating": 2.7}, "website": "http://www.miramax.com/mm_front/owa/mp.entryPoint?action=0&midStr=1376"}, "type": "movie", "writers": ["Don Roos"], "year": 2000}