{"_id": "573a13b6f29313caabd48a2f", "awards": {"nominations": 9, "text": "29 wins & 9 nominations.", "wins": 29}, "cast": ["Jannik Lorenzen", "Jesper Asholt", "Julie Kolbech", "Hanne Hedelund"], "countries": ["Denmark"], "directors": ["Peter Schènau Fog"], "fullplot": "Follows a precocious, eleven-year-old Allan, who tries desperately to keep his dysfunctional, rural family together during the social upheavals of the early seventies. Allan reveres his father, Henry, the local milkman, and can't understand why others don't feel the same way. His family life is so twisted he thinks it's perfectly normal to stay awake all night dealing with his father's hysterics and suicidal threats. Allan's older brother left town several years ago, and his mother gave up long before that, relying on sleeping pills to escape Henry's tantrums. Allan then becomes obsessed with a rival family, whom he considers foolish white trash until they start taking away Henry's customers. He is frustrated that his mother doesn't take his father's complaints seriously, and is perplexed by the increasingly rebellious and bizarre behavior of his sister, Sanne. Incapable of understanding what's going on and heavily influenced by his father, Allan commits appalling acts, unaware of their import.", "genres": ["Comedy", "Drama"], "imdb": {"id": 495040, "rating": 7.4, "votes": 1732}, "languages": ["Danish"], "lastupdated": "2015-08-16 00:34:39.493000000", "num_mflix_comments": 2, "plot": "Follows a precocious, eleven-year-old Allan, who tries desperately to keep his dysfunctional, rural family together during the social upheavals of the early seventies. Allan reveres his ...", "released": 1177632000000, "runtime": 106, "title": "The Art of Crying", "tomatoes": {"critic": {"meter": 50, "numReviews": 6, "rating": 6}, "fresh": 3, "lastUpdated": 1441136194000, "production": "SF Film A/S", "rotten": 3, "viewer": {"meter": 83, "numReviews": 1778, "rating": 3.9}}, "type": "movie", "writers": ["Bo Hr. Hansen (screenplay)", "Erling Jepsen (novel)"], "year": 2006}