{"_id": "573a13b2f29313caabd38eaa", "awards": {"nominations": 7, "text": "Nominated for 1 Golden Globe. Another 3 wins & 7 nominations.", "wins": 4}, "cast": ["Adrien Brody", "Diane Lane", "Ben Affleck", "Bob Hoskins"], "countries": ["USA"], "directors": ["Allen Coulter"], "fullplot": "Struggling private investigator Louis Simo treats his work more as a means to make a living than a want to do right by what few clients he has. Through connections with the investigation firm for which he used to work, Simo is hired by Helen Bessolo to investigate the death of her son, actor George Reeves. Reeves was best known for his title role in Adventures of Superman (1952), a role which he always despised, in part since it typecast him as a \"cartoon\", despite it bringing him a certain fame. His June 16, 1959 death by a single gunshot wound while in his bedroom in his Los Angeles home was ruled a suicide by the police, the death which occurred when the house was filled with people. Reeves' story is told in part in flashback as Simo, who is trying to make a name for himself with this case, talks to or tries to talk to some of the players involved, most specifically the wife of MGM General Manager E.J. Mannix, Toni Mannix, with who Reeves was having a relatively open and gift-lucrative affair (she bought him that house), and Reeves' fiancèe at the time of his death, Lenore Lemmon, an aspiring actress who some felt didn't love Reeves (or visa versa). As Simo proceeds with his high-profile investigation, he learns that someone doesn't want him snooping around. Through the process, Simo evaluates his own professional and personal life, the latter which includes a somewhat strained relationship with his wife and son.", "genres": ["Biography", "Crime", "Drama"], "imdb": {"id": 427969, "rating": 6.5, "votes": 28004}, "languages": ["English", "Spanish"], "lastupdated": "2015-08-20 01:15:16.470000000", "metacritic": 62, "num_mflix_comments": 4, "plot": "A detective examines the mysterious death of George Reeves, TV's Superman.", "poster": "https://m.media-amazon.com/images/M/MV5BMTc4ODQ2OTI5NF5BMl5BanBnXkFtZTcwMDIyNjYzMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1157673600000, "runtime": 126, "title": "Hollywoodland", "tomatoes": {"boxOffice": "$14.3M", "consensus": "More than a movie star murder mystery, Hollywoodland takes it slow in order to reveal the intriguing details of the rise and fall of superstar fame.", "critic": {"meter": 69, "numReviews": 179, "rating": 6.5}, "dvd": 1170720000000, "fresh": 123, "lastUpdated": 1439835051000, "production": "Focus Features", "rotten": 56, "viewer": {"meter": 47, "numReviews": 77499, "rating": 3}, "website": "http://www.hollywoodlandmovie.com"}, "type": "movie", "writers": ["Paul Bernbaum"], "year": 2006}