{"_id": "573a13b6f29313caabd47a5c", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Hayden Panettiere", "Solange Knowles", "Gustavo Carr", "Emme Rylan"], "countries": ["USA"], "directors": ["Steve Rash"], "fullplot": "Britney Allen is living the dream -- the cheerleader's dream. At the elite seaside campus of Pacific Vista High School, Britney is captain of the cheerleading squad and the envy of everyone at school -- including one overly-ambitious teammate. When Britney hears about a forthcoming audition for a top cheer squad to appear in recording star Rihanna's upcoming television special, she is determined that her Pirates cheer squad will capture the coveted spot. But Britney's life turns from cheer-topia to cheer-tastrophe when her father's job takes her family to Crenshaw Heights, a multi-ethnic working-class neighborhood east of Los Angeles. At her new school, Britney is viewed with suspicion by most of the students, especially by Camille, the overly confident and acerbic leader of the Crenshaw Heights Warriors cheerleading squad. No one is more surprised than Camille, however, when Britney proves herself and secures a spot on the Warriors' cheer squad. Britney and her new teammates work feverishly to prepare for the audition for Rihanna, incorporating some edgy new moves into their performance. Now the pressure is on, as the Warriors find themselves locked in a high-stakes cheer-off with Pacific Vista, Britney's old school! During the no-holds-barred fight to the finish, friendships, loyalties and talents are tested -- but only one team can come out on top.", "genres": ["Comedy", "Sport"], "imdb": {"id": 490822, "rating": 5.7, "votes": 13087}, "languages": ["English"], "lastupdated": "2015-09-15 05:02:08.790000000", "plot": "A transfer student to a rough high school tries joining the cheer-leading squad and she not only faces off against the head cheerleader, but against her former school in preparation for a cheer-off competition.", "poster": "https://m.media-amazon.com/images/M/MV5BMTMxMjk3MzIyMl5BMl5BanBnXkFtZTcwODAyNjMzMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1154995200000, "runtime": 99, "title": "Bring It On: All or Nothing", "tomatoes": {"dvd": 1154908800000, "lastUpdated": 1440353619000, "production": "Universal Studios Home Video", "viewer": {"meter": 70, "numReviews": 246881, "rating": 3.3}}, "type": "movie", "writers": ["Alyson Fouse"], "year": 2006}