{"_id": "573a13c3f29313caabd697ac", "awards": {"nominations": 12, "text": "Nominated for 1 Golden Globe. Another 2 wins & 12 nominations.", "wins": 3}, "cast": ["Kiefer Sutherland", "Cherry Jones", "Bob Gunton", "Colm Feore"], "countries": ["USA"], "directors": ["Jon Cassar"], "fullplot": "Set 18 months where Season 6 of '24' left off, former government agent Jack Bauer is in a self-imposed exile in the fictitious African country of Sangala where he hopes to escape from a U.S. investigation of him for his past methods, and to run from his past. Bauer works at a mission school for orphaned children run by his friend Carl Benton. The country is at the mercy of a rogue warlord general named Juma who is plotting a coup to overthrow the government and his right-hand man Colonel Dubaku, is abducting orphan boys and forcibly recruiting them into Juma's army. Bauer and Benton must work together to save the dozen or so boys and try to get them out of the country before Juma takes over. Meanwhile in Washington D.C., it is Inauguration Day where the outgoing President Noah Daniels is handing over the presidency to the first female president Allison Taylor (Cherry Jones). Hearing about the coup, Daniels wants to evacuate the country before it falls to the rogue general, while Taylor thinks otherwise. Elsewhere, Taylor's son Roger and his fiancèe Samantha get wind of information from a friend about suspicious money transactions where he works at a local brokerage firm. But neither he or Roger are aware that a corrupt corporate mogul, Jonas Hodges, is plotting with General Juma to overthrow the government for monetary purposes and will do anything to keep his nefarious plans under wraps.", "genres": ["Action", "Adventure", "Crime"], "imdb": {"id": 813980, "rating": 7.5, "votes": 19505}, "languages": ["English"], "lastupdated": "2015-09-11 19:49:02.460000000", "num_mflix_comments": 1, "plot": "Former federal agent Jack Bauer confronts African dictator Benjamin Juma, whose forces have been ordered to capture the children Bauer oversees for malicious military training.", "poster": "https://m.media-amazon.com/images/M/MV5BZGQzNTU4M2MtNTliMC00YTliLTlmMmYtZDQ3NTQ4N2YwMDdmXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_SY1000_SX677_AL_.jpg", "rated": "TV-14", "released": 1227398400000, "runtime": 84, "title": 24, "tomatoes": {"critic": {"meter": 100, "numReviews": 8, "rating": 7.2}, "dvd": 1227398400000, "fresh": 8, "lastUpdated": 1440612197000, "production": "Fox Network", "rotten": 0, "viewer": {"meter": 67, "numReviews": 6131, "rating": 3.7}}, "type": "movie", "writers": ["Joel Surnow (creator)", "Robert Cochran (creator)", "Howard Gordon"], "year": 2008}