{"_id": "573a13a3f29313caabd0ebbb", "awards": {"nominations": 11, "text": "2 wins & 11 nominations.", "wins": 2}, "cast": ["Julie Andrews", "Anne Hathaway", "Hector Elizondo", "Heather Matarazzo"], "countries": ["USA"], "directors": ["Garry Marshall"], "fullplot": "Mia Thermopolis is the average teenager - sweet, a little geeky and pretty much invisible to everyone with the exception of her mother, best friend Lilly and Lilly's older brother Michael. Making it through high school without throwing up is a challenge in itself for Mia, so it doesn't come as welcome news when her estranged grandmother shows up out of the blue and calmly informs her that she is in fact the heir to the throne of a European country called Genovia. Suddenly Mia's life is thrown into complete overload. She's being taught about scarves, waves and pears in order to become a perfect princess, she gets a makeover and a tough looking yet sweet bodyguard/limo driver called Joe. Things get out of hand when the media gets a hold of the story and suddenly Mia is thrust into the spotlight in both the newspapers and in school. On top of all that Mia has a choice to make. She must decide by Genovia's Independence Day Ball whether she longs to relinquish her claim on the throne or to become the princess and heir to the throne and father and grandmother want her to be.", "genres": ["Comedy", "Family", "Romance"], "imdb": {"id": 247638, "rating": 6.2, "votes": 83215}, "languages": ["English", "Dutch", "Italian"], "lastupdated": "2015-08-31 00:20:15.840000000", "metacritic": 52, "num_mflix_comments": 408, "plot": "Mia Thermopolis has just found out that she is the heir apparent to the throne of Genovia. With her friends Lilly and Michael Moscovitz in tow, she tries to navigate through the rest of her 16th year.", "poster": "https://m.media-amazon.com/images/M/MV5BMzcwYjEwMzEtZTZmMi00ZGFhLWJhZjItMDAzNDVkNjZmM2U5L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "G", "released": 996796800000, "runtime": 115, "title": "The Princess Diaries", "tomatoes": {"boxOffice": "$107.8M", "consensus": "A charming, if familiar, makeover movie for young teenage girls.", "critic": {"meter": 47, "numReviews": 113, "rating": 5.2}, "dvd": 1008633600000, "fresh": 53, "lastUpdated": 1442250923000, "production": "Walt Disney Pictures", "rotten": 60, "viewer": {"meter": 68, "numReviews": 756863, "rating": 3.2}, "website": "http://disney.go.com/disneypictures/diaries/index.html"}, "type": "movie", "writers": ["Meg Cabot (novel)", "Gina Wendkos (screenplay)"], "year": 2001}