{"_id": "573a13b5f29313caabd44f69", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Jeff Goldblum", "Willem Dafoe", "Derek Jacobi", "Ayelet Zurer"], "countries": ["Germany", "USA", "Israel"], "directors": ["Paul Schrader"], "fullplot": "\"Adam Resurrected\" follows the story of Adam Stein, a charismatic patient at a mental institution for Holocaust survivors in Israel, 1961. He reads minds and confounds his doctors, lead by Nathan Gross. Before the war, in Berlin, Adam was an entertainer--cabaret impresario, circus owner, magician, musician--loved by audiences and Nazis alike until he finds himself in a concentration camp, confronted by Commandant Klein. Adam survives the camp by becoming the Commandant's \"dog\", entertaining him while his wife and daughter are sent off to die. Years later we find him at the Institute. One day, Adam smells something, hears a sound. \"Who brought a dog in here?\" he asks Gross. Gross denies there is a dog but Adam finds him--a young boy raised in a basement on a chain. Adam and the boy see and recognize each other as dogs--and their journey begins. \"Adam Resurrected\" is the story of a man who once was a dog who meets a dog who once was a boy.", "genres": ["Drama", "War"], "imdb": {"id": 479341, "rating": 6.3, "votes": 2957}, "languages": ["English"], "lastupdated": "2015-08-22 00:54:50.423000000", "metacritic": 58, "num_mflix_comments": 2, "plot": "In the aftermath of WWII, a former circus entertainer who was spared from the gas chamber becomes the ringleader at an asylum for Holocaust survivors.", "poster": "https://m.media-amazon.com/images/M/MV5BZjg4M2E3OTItMTU4ZS00YTM5LWI3ZWEtMjU4YjhjNTJkMWI0XkEyXkFqcGdeQXVyNDkzNTM2ODg@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1229040000000, "runtime": 106, "title": "Adam Resurrected", "tomatoes": {"consensus": "Such an unusual tale might have made for a compelling drama, but Adam Resurrected suffers from narrative confusion and an emotional detachment at its core.", "critic": {"meter": 35, "numReviews": 37, "rating": 5.2}, "dvd": 1253577600000, "fresh": 13, "lastUpdated": 1440185276000, "production": "Bleiberg Entertainment", "rotten": 24, "viewer": {"meter": 45, "numReviews": 879, "rating": 3.1}}, "type": "movie", "writers": ["Yoram Kaniuk (novel)", "Noah Stollman (screenplay)"], "year": 2008}