{"_id": "573a13d9f29313caabda9158", "awards": {"nominations": 6, "text": "Nominated for 2 Primetime Emmys. Another 1 win & 6 nominations.", "wins": 3}, "cast": ["Hayley Atwell", "Rufus Sewell", "Michelle Dockery", "Michael Gambon"], "countries": ["UK", "Germany"], "directors": ["Edward Hall"], "fullplot": "1976:- Ruth Gilmartin visits her mother Sally in rural Cambridgeshire and is amazed to learn she is a Russian refugee born Eva Delectorskaya, recruited as a spy by the British in 1939. After narrowly escaping death in the Netherlands Eva is sent to America to seduce the married Mason Harding, an adviser to the president, to find out if the Americans intend joining the war, a mission she successfully accomplishes. However a second assignment is to supply a map to American agents supposedly outlining a planned German invasion of the States but Eva spots errors in the map, informing her spy master and lover Lucas Romer and other colleagues. Though the map fools the president Eva survives an attempt to kill her and, as her fellow spies die one by one,is convinced she was betrayed. Even in the 1970s, years after the event, she believes her life is in danger and shocks Ruth by buying a shotgun for her protection. She gets Ruth to contact Romer, posing as a journalist interested in wartime espionage, which allows 'Sally' to follow and locate Romer's home address. The two women pay him a visit and the identity of the traitor is revealed after more than thirty years.", "genres": ["Drama", "Romance"], "imdb": {"id": 2241676, "rating": 7.2, "votes": 1734}, "languages": ["English"], "lastupdated": "2015-08-27 00:27:13.243000000", "num_mflix_comments": 1, "plot": "A young woman finds out that her mother worked as a spy for the British Secret Service during World War II and has been on the run ever since.", "poster": "https://m.media-amazon.com/images/M/MV5BMGMwYTRmMTMtODIyZS00NDJmLWE3M2ItNmJlMDUyNGRiMGEyXkEyXkFqcGdeQXVyMzcyNjQwODE@._V1_SY1000_SX677_AL_.jpg", "released": 1431648000000, "runtime": 180, "title": "Restless", "tomatoes": {"lastUpdated": 1442265790000, "production": "Endor Productions", "viewer": {"numReviews": 6, "rating": 3}}, "type": "movie", "writers": ["William Boyd (by)"], "year": 2012}