{"_id": "573a13b6f29313caabd4716b", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Bipasha Basu", "Kay Kay Menon", "Raj Babbar", "Rajat Kapoor"], "countries": ["India"], "directors": ["Madhur Bhandarkar"], "fullplot": "There is no looking back for Vinay Sehgal and the Sehgal Group of Industries when their candidate is selected as the Central Finance Minister, and soon they are invited to Delhi to liaise with an international company to manufacture and distribute a bottling plant. Their competitors, the Marwah Group of Industries, led by Dharmesh Marwah, are dismayed, but manage to win the best entrepreneur award, and a state contract for bottling a mint-based soft drink. Vinay instructs his team to find out, by hook or crook, what the details are of this plan, and a senior employee, Nishigandha Dasgupta, uses her charms to seduce Sehgal's groups employee, Pervez Merchant, and gets the details from him. This gives Vinay the edge over Dharmesh and he quickly announces \"Just Chill\" a mint-based cold drink, and he hands over this project to his wife's brother, Ritesh Shahani, who is also the live-in spouse of Nishigandha. Watch what happens when Dharmesh finds out that about the leak in his Group, and that \"Just Chill\" contains high levels of contaminants that would adversely effect the health of it's consumers, especially children and pregnant women. But in a nation like India where drinking polluted water is a way of life, will the politicians be motivated enough to take any action?", "genres": ["Drama"], "imdb": {"id": 488381, "rating": 6.6, "votes": 1342}, "languages": ["Hindi"], "lastupdated": "2015-08-21 00:32:20.657000000", "num_mflix_comments": 2, "plot": "Two corporate giants compete in order to recklessly maximize their respective profits.", "poster": "https://m.media-amazon.com/images/M/MV5BMjIyNzgxOTM4MF5BMl5BanBnXkFtZTcwNjkwMTg4Mw@@._V1_SY1000_SX677_AL_.jpg", "released": 1152230400000, "title": "Corporate", "tomatoes": {"dvd": 1159833600000, "lastUpdated": 1440966146000, "production": "Sahara One", "viewer": {"meter": 59, "numReviews": 1017, "rating": 3.4}, "website": "http://www.corporatethefilm.com/"}, "type": "movie", "writers": ["Madhur Bhandarkar (screenplay)", "Ajay Monga (screenplay)", "Sandeep Nath (lyrics)", "Niranjan Patwardhan (additional screenplay)", "Manoj Tyagi (screenplay)"], "year": 2006}