{"_id": "573a1394f29313caabcdf65b", "awards": {"nominations": 1, "text": "Nominated for 1 Oscar. Another 4 wins & 1 nomination.", "wins": 5}, "cast": ["Machiko Kyè", "Mitsuko Mito", "Kinuyo Tanaka", "Masayuki Mori"], "countries": ["Japan"], "directors": ["Kenji Mizoguchi"], "fullplot": "In the beginning of the springtime in the period of the Japanese Civil Wars of the Sixteenth Century in Lake Biwa in the Province of Omi, the family man farmer and craftsman Genjurè travels to Nagahama to sell his wares and makes a small fortune. His neighbor Tobei that is a fool man dreams on becoming a samurai, but he can not afford to buy the necessary outfit. The greedy Genjurè and Tobei work together manufacturing clay potteries, expecting to sell the pieces and enrich; however, their wives Miyage and Ohama are worried about the army of the cruel Shibata that is coming to their village and they warn their ambitious husbands. Their village is looted but the families flee and survive; Genjurè and Tobei decide to travel by boat with their wives and baby to sell the wares in a bigger town. When they meet another boat that was attacked by pirates, Genjurè decides to leave his wife and son on the bank of the river, promising to return in ten days. Genjurè, Tobei and Ohama raise a large amount but Tobei leaves his wife to buy the samurai outfit and seek fame and fortune. Meanwhile the female aristocratic Lady Wakasa and her servant ask Genjurè to bring her shopping to her fancy Kutsuki House. Sooner Genjurè and Tobei discover the price they have to pay for their ambition.", "genres": ["Drama", "Fantasy", "Mystery"], "imdb": {"id": 46478, "rating": 8.2, "votes": 12938}, "languages": ["Japanese"], "lastupdated": "2015-08-11 00:01:22.983000000", "plot": "A fantastic tale of war, love, family and ambition set in the midst of the Japanese Civil Wars of the sixteenth century.", "poster": "https://m.media-amazon.com/images/M/MV5BNWRhYTZjMzUtYWJkOC00YjNmLWFmMzctNjI1MjFjOWQ3MmU1XkEyXkFqcGdeQXVyMTIyNzY1NzM@._V1_SY1000_SX677_AL_.jpg", "rated": "APPROVED", "released": -483408000000, "runtime": 96, "title": "Ugetsu", "tomatoes": {"consensus": "With its thought-provoking themes, rich atmosphere, and brilliant direction, Kenji Mizoguchi's Ugetsu monogatari is a towering classic of world cinema.", "critic": {"meter": 100, "numReviews": 22, "rating": 9.4}, "dvd": 1131408000000, "fresh": 22, "lastUpdated": 1440094059000, "production": "Edward Harrison", "rotten": 0, "viewer": {"meter": 94, "numReviews": 6591, "rating": 4.3}}, "type": "movie", "writers": ["Matsutarè Kawaguchi (adaptation)", "Hisakazu Tsuji (idea)", "Akinari Ueda (stories)", "Yoshikata Yoda (screenplay)"], "year": 1953}