{"_id": "573a13dbf29313caabdaebf2", "awards": {"nominations": 15, "text": "7 wins & 15 nominations.", "wins": 7}, "cast": ["Evelyne Brochu", "Sabrina Ouazani", "Sivan Levy", "Yousef 'Joe' Sweid"], "countries": ["Canada", "France"], "directors": ["Anaès Barbeau-Lavalette"], "fullplot": "Chloe is a young Canadian doctor who divides her time between Ramallah, where she works with the Red Crescent, and Jerusalem, where she lives next door to her friend Ava, a young Israeli soldier. Increasingly sensitive to the conflict, Chloe goes daily through the checkpoint between the two cities to get to the refugee camp where she monitors the pregnancies of young women. As she becomes friends with Rand, one of her patients, Chloe learns more about life in the occupied territories and gets to spend some time with Rand's family. Torn between the two sides of the conflict, Chloe tries as best she can to build bridges between her friends but suffers from remaining a perpetual foreigner to both sides. Following up her acclaimed debut-feature Le ring, filmmaker Anais Barbeau-Lavalette delivers with Inch'Allah the moving tale a young woman's encounter with war and its everyday life. Avoiding any political agenda, Chloe's story questions how one can internalize a foreign conflict without incurring any scars of their own.", "genres": ["Drama"], "imdb": {"id": 2336960, "rating": 6.9, "votes": 1799}, "languages": ["English", "French", "Arabic", "Hebrew"], "lastupdated": "2015-09-07 00:53:32.113000000", "metacritic": 47, "num_mflix_comments": 1, "plot": "A Canadian doctor finds her sympathies sorely tested while working in the conflict ravaged Palestinian territories.", "poster": "https://m.media-amazon.com/images/M/MV5BMTYwNzIxMjY5NF5BMl5BanBnXkFtZTcwODMwODY0OA@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1376611200000, "runtime": 102, "title": "Inch'Allah", "tomatoes": {"boxOffice": "$0.5M", "critic": {"meter": 56, "numReviews": 18, "rating": 6.2}, "dvd": 1386028800000, "fresh": 10, "lastUpdated": 1442432483000, "production": "Entertainment One", "rotten": 8, "viewer": {"meter": 60, "numReviews": 538, "rating": 3.6}, "website": "http://www.inchallah-lefilm.com/"}, "type": "movie", "writers": ["Anaès Barbeau-Lavalette (screenplay)"], "year": 2012}