{"_id": "573a13cff29313caabd8aa18", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Byron J. Brochmann", "Alex Castro", "Pauline Egan", "Jeronimo Garcia"], "countries": ["Australia"], "directors": ["Gregory McQualter"], "fullplot": "Zheng Zhou is the most feared warrior from the Shaolin Dynasty in China. His fighting and weapons skills are legendary. But when his parents are killed and sister kidnapped, he turns to a life of drugs and crime that will almost kill him. With the help of Hong Kong's notorious Dragon Triad syndicate, Colombia's biggest drugs cartel hatches an elaborate plan to traffic two tonnes of crack cocaine through the Port of Miami in America and ultimately into Australia and China. But when the partnership turns sour after the Cartel holds a Triad family member hostage, the Triads recruit Zhou to rescue the girl and kill the Colombians. What ensues is a bloodied street war across three countries. Zhou turns international Hitman with an arsenal of hi-tech surveillance devices, explosives, high powered weaponry and an array of fighting skills dating back fifteen hundred years. But just as Zhou rescues the hostage and takes control of the entire drugs shipment, the Triads and Colombians re-ignite their partnership with a view to having him killed. As the hunter becomes the hunted, Zhou finds he has no-where to run and no-where to hide. That is until fate steps in and a Shaolin Monk from his past not only saves his life, but changes his world forever.", "genres": ["Action", "Thriller"], "imdb": {"id": 1753521, "rating": 3.2, "votes": 483}, "languages": ["English"], "lastupdated": "2015-09-15 05:16:01.430000000", "num_mflix_comments": 2, "plot": "A Colombian drugs cartel joins forces with a group of Hong Kong Triads and the hottest Hitman on the planet, to ship two tonnes of cocaine into Australia and China.", "poster": "https://m.media-amazon.com/images/M/MV5BMTU3Nzk5MDQxMl5BMl5BanBnXkFtZTcwNjI0NDkwOA@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1346112000000, "title": "Blood Money", "tomatoes": {"lastUpdated": 1435861261000, "viewer": {"numReviews": 3, "rating": 2.2}}, "type": "movie", "writers": ["Gregory McQualter"], "year": 2012}