{"_id": "573a139df29313caabcf9647", "awards": {"nominations": 20, "text": "12 wins & 20 nominations.", "wins": 12}, "cast": ["Don McKellar", "Sandra Oh", "Roberta Maxwell", "Robin Gammell"], "countries": ["Canada", "France"], "directors": ["Don McKellar"], "fullplot": "It's 18:00 in a somewhat deserted Toronto on the last day before the scheduled end of the world at midnight, the end which has been known now for months. Most people are treating midnight as a matter-of-fact event with little sense of panic. In fact, many are celebrating this last day. Most have very specific wants for this last day and will do whatever they need to to make those wants happen. And some, such as Duncan and Donna with the gas company, are working, ensuring that the masses are served and comfortable during the final hours. The Wheeler family are marking the last day by having a Christmas party, although sullen adult son Patrick, his thoughts in part stemming from being recently widowed, has made it clear he wants to be alone in his own home at the end. Patrick's wants may be in jeopardy when a woman named Sandra - Duncan's wife - lands on his doorstep. Sandra is stranded, trying to make it across town to her own home so that she and Duncan can carry out their own last night pact at the stroke of midnight. As Patrick tries to help Sandra on his own, mostly unsuccessfully, they try to enlist the assistance of various people, including Patrick's best friend Craig, who has his own sexually oriented last day list of tasks. As Sandra goes on her quest, Duncan himself faces his own issues while waiting for his wife. But as midnight approaches, some can't fulfill their planned destiny so have to make some quick improvisations, while the priority of others changes.", "genres": ["Comedy", "Drama", "Romance"], "imdb": {"id": 156729, "rating": 7.3, "votes": 7930}, "languages": ["English", "French"], "lastupdated": "2015-08-18 00:48:31.093000000", "metacritic": 65, "num_mflix_comments": 1, "plot": "A group of very different individuals with different ideas of how to face the end come together as the world is expected to end in six hours at the turn of the century.", "poster": "https://m.media-amazon.com/images/M/MV5BNWU0NDE5NzAtM2FjNC00NzRhLWFlOTItOWUzYjZkNzViOTZhXkEyXkFqcGdeQXVyNTM0NTU5Mg@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 909100800000, "runtime": 95, "title": "Last Night", "tomatoes": {"consensus": "An engrossing, poignant film, Last Night examines the end of the world through humorous and thought-provoking dialogue.", "critic": {"meter": 84, "numReviews": 49, "rating": 7.2}, "dvd": 954201600000, "fresh": 41, "lastUpdated": 1439922576000, "production": "Lions Gate Film", "rotten": 8, "viewer": {"meter": 85, "numReviews": 7590, "rating": 3.8}}, "type": "movie", "writers": ["Don McKellar"], "year": 1998}