{"_id": "573a13dbf29313caabdae31c", "awards": {"nominations": 2, "text": "1 win & 2 nominations.", "wins": 1}, "cast": ["Ji-won Ha", "Doona Bae", "Ye-ri Han", "Yoon Yeong Choi"], "countries": ["South Korea"], "directors": ["Hyeon-seong Moon"], "fullplot": "\"As One\" is the cinematic retelling of the first ever post-war Unified Korea sports team, hastily formed to participate in the 41st World Table Tennis Championships in 1991. Following the North Korean mid-air bombing of Korean Air Flight 858 in 1987, a Summit was held between North and South Korea to defuse the extreme tension on the peninsula. The summit ended with the agreement to form a unified Korean sports team; and table tennis, being highly visible and world-class in both countries, was chosen as the symbolic unifier. Summarily, the first-ever unified North-South team under the simple aegis \"KOREA\" was formed to compete in the 1991 World Table Tennis Championships in Chiba, Japan. \"As One\" recounts these dramatic events where especially two world-class players who had only ever met across the table as die-hard opponents must suddenly become a true partners and teammates in time for the biggest stage of the World Championships. Putting aside their individual ambitions, these women have to summon every ounce of grit and grace to defeat a dominating Chinese team that is vying for its 9th consecutive World Championship title.", "genres": ["Drama", "Sport"], "imdb": {"id": 2328503, "rating": 7.2, "votes": 569}, "languages": ["Korean", "Japanese"], "lastupdated": "2015-09-07 00:42:19.973000000", "plot": "\"As One\" is the cinematic retelling of the first ever post-war Unified Korea sports team, hastily formed to participate in the 41st World Table Tennis Championships in 1991. Following the ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTY4MTQzNTQyM15BMl5BanBnXkFtZTcwNjAzMzM5Nw@@._V1_SY1000_SX677_AL_.jpg", "released": 1336003200000, "runtime": 127, "title": "As One", "tomatoes": {"lastUpdated": 1429035382000, "production": "CJ Entertainment", "viewer": {"meter": 73, "numReviews": 68, "rating": 3.8}}, "type": "movie", "writers": ["Yeong-ah Yoo (screenplay)", "Seong-hwi Kwon (screenplay)"], "year": 2012}