{"_id": "573a13abf29313caabd23f43", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Julia Stiles", "Luke Mably", "Ben Miller", "Miranda Richardson"], "countries": ["USA", "Czech Republic"], "directors": ["Martha Coolidge"], "fullplot": "At the University of Wisconsin in Madison, Paige, a pre-med student and a farm girl from Manitowoc, meets Eddie, a fellow student from Denmark, whom she first dislikes but later accepts, likes, and loves. Paige takes Eddie to her home for the Thanksgiving weekend. Paparazzi find and photograph the couple, and Paige learns that Eddie is truly Crown Prince Edvard. Failing health causes King Haraald to abdicate in favor of Edvard, so Eddie returns to Copenhagen, then Paige follows her heart to Copenhagen, where Edvard warmly welcomes her, takes her to the castle, and introduces her to the royal family. Queen Rosalind first expresses opposition to Paige but later relents; King Haraald soon warms to her; Edvard proposes, Paige accepts, and he gives her a ring. However, Paige recalls her previous dream of going to Doctors Without Borders, so she breaks off and returns to school. Still, though, Edvard shows up at Paige's graduation and suggests an alternate plan.", "genres": ["Comedy", "Romance"], "imdb": {"id": 337697, "rating": 5.9, "votes": 29274}, "languages": ["English", "Danish", "German"], "lastupdated": "2015-08-19 00:11:53.437000000", "metacritic": 47, "plot": "At college Paige meets Eddie, a fellow student from Denmark, whom she first dislikes but later accepts, likes, and loves; he proves to be Crown Prince Edvard. Paige follows him to Copenhagen, and he follows her back to school with a plan.", "poster": "https://m.media-amazon.com/images/M/MV5BYTllMGQzZGQtNzZmMy00ZjA2LWExNzMtYjViNGU4YzRmNGE2L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 1080864000000, "runtime": 111, "title": "The Prince and Me", "tomatoes": {"boxOffice": "$28.1M", "consensus": "A bland, fluffy, and predictable bit of wish fulfillment.", "critic": {"meter": 28, "numReviews": 120, "rating": 4.8}, "dvd": 1092096000000, "fresh": 34, "lastUpdated": 1440439433000, "production": "Paramount Pictures", "rotten": 86, "viewer": {"meter": 59, "numReviews": 193604, "rating": 3.1}, "website": "http://www.princeandme.com/"}, "type": "movie", "writers": ["Mark Amin (story)", "Katherine Fugate (story)", "Jack Amiel (screenplay)", "Michael Begler (screenplay)", "Katherine Fugate (screenplay)"], "year": 2004}