{"_id": "573a13b9f29313caabd4f670", "awards": {"nominations": 11, "text": "2 wins & 11 nominations.", "wins": 2}, "cast": ["Bar Belfer", "Yonatan Bar-Or", "Yuval Mendelson", "Rinat Matatov"], "countries": ["Israel"], "directors": ["Oded Davidoff"], "fullplot": "Through the streets of Jerusalem two teenagers' stories will unite to tell the summer adventure of their lives. Tamar is an amazingly talented but very quiet and insecure girl, who leaves behind her home and all she knows, changing herself unrecognizably -from her looks to her attitude- to brace herself for a dangerous mission to help a loved-one. Asaf, a clumsy, naive, and very shy boy working a boring summer job at City Hall, is given quite a mission himself : to take an uncontrollable stray dog from the pound, put it on a leash, and let it lead him back to its owners to be fined. The dog -Dinkah leads Asaf through the city to the people and places that will tell him about Dinka's owner -Tamar and her sudden disappearance. The more stories Asaf hears about this extraordinary girl, the more he falls for her, and as he and Dinkah continue their journey Asaf becomes aware that Tamar is in grave danger. Feeling he knows her, and knowing he loves her Asaf is determined to find Tamar and rescue her from her own rescue mission. This movie tells a beautiful story based on the novel by David Grossman, about growing up and finding the strength to overcome your fears, the meaning of true friendship, and best of all, finding someone to love, someone to hold, someone to run with...", "genres": ["Adventure", "Drama"], "imdb": {"id": 834955, "rating": 7.3, "votes": 475}, "languages": ["Hebrew"], "lastupdated": "2015-05-19 02:02:26.647000000", "num_mflix_comments": 1, "plot": "Through the streets of Jerusalem two teenagers' stories will unite to tell the summer adventure of their lives. Tamar is an amazingly talented but very quiet and insecure girl, who leaves ...", "released": 1152748800000, "runtime": 118, "title": "Someone to Run With", "tomatoes": {"lastUpdated": 1439233820000, "production": "Cinephil", "viewer": {"meter": 85, "numReviews": 352, "rating": 3.9}}, "type": "movie", "writers": ["David Grossman (novel)", "Noah Stollman"], "year": 2006}