{"_id": "573a13d8f29313caabda6305", "awards": {"nominations": 3, "text": "5 wins & 3 nominations.", "wins": 5}, "cast": ["Joghis Seudin Arias", "Julio Cèsar Roble", "Floralba Achicanoy", "David Fernando Guacas"], "countries": ["Colombia", "France", "Mexico"], "directors": ["William Vega"], "fullplot": "Having nowhere else to turn, a teenager named Alicia, following the deaths of her parents by unknown guerrillas in a war-torn region of Columbia, is able to track down her paternal Uncle èscar for a place to live if only temporarily, he who didn't even know she existed and who had not seen Alicia's parents for quite some time. He agrees, with one stipulation being that she stay out of his son Freddy's room, Freddy who no longer lives there. èscar lives at La Sirga, a run down guest house nestled in the mountains and on the shores of Laguna De La Cocha. It is barely inhabitable and which impoverished èscar does not have the money to repair. Despite the probability that any tourists stopping by anytime soon is remote at best due in part to the war, Alicia, to do her part, starts to help make repairs along with èscar's housekeeper Flora, while èscar largely spends his time down at the harbor trying to set-up a trout farm with his friends at the cooperative. Alicia also befriends Mirichis, the young man who works transporting goods up and down the lake. Life at La Sirga takes a turn with the mysterious return of Freddy, who may or may not know of some ominous goings-on which threaten their existence.", "genres": ["Drama"], "imdb": {"id": 2191612, "rating": 6.7, "votes": 373}, "languages": ["Spanish"], "lastupdated": "2015-07-30 00:08:36.253000000", "num_mflix_comments": 1, "plot": "A Colombian refugee tries to rebuild her life at a guest house located on the shores of a great lake in the Andes.", "poster": "https://m.media-amazon.com/images/M/MV5BMTcwMDAzNjAyM15BMl5BanBnXkFtZTgwMTgyMDg0MDE@._V1_SY1000_SX677_AL_.jpg", "released": 1366761600000, "runtime": 88, "title": "The Towrope", "tomatoes": {"dvd": 1375660800000, "lastUpdated": 1441303557000, "production": "Film Movement", "viewer": {"meter": 74, "numReviews": 47, "rating": 3.6}}, "type": "movie", "writers": ["William Vega"], "year": 2012}