{"_id": "573a13a7f29313caabd1acc4", "awards": {"nominations": 46, "text": "Nominated for 3 Oscars. Another 28 wins & 46 nominations.", "wins": 31}, "cast": ["Paddy Considine", "Samantha Morton", "Sarah Bolger", "Emma Bolger"], "countries": ["Ireland", "UK"], "directors": ["Jim Sheridan"], "fullplot": "Following the tragic death of their five-year-old son Frankie, Irish couple Johnny and Sarah Sullivan and their remaining two offspring, 10 year old Christy Sullivan and 5 year old Ariel Sullivan, emigrate illegally to the United States via Canada with little in their pockets. Their final destination is Manhattan where Johnny hopes to work as a stage actor. They move into a unit in a run town tenement housed primarily with drug addicts, transvestites and one tenant coined \"the man who screams\". They do whatever they can to eke out a supportive family environment in this difficult situation, the support which ultimately extends to those around them, most specifically \"the screamer\" who turns out to be an African-American artist named Mateo with AIDS. But the memory of Frankie hangs over the family in good and bad ways, especially as Sarah learns she's pregnant. Christy, who records their life's goings-on with her beloved camcorder, believes that the angel of Frankie has granted her three wishes, which she guards until absolutely needed.", "genres": ["Drama"], "imdb": {"id": 298845, "rating": 7.8, "votes": 35373}, "languages": ["English", "Spanish", "Irish"], "lastupdated": "2015-08-13 00:46:35.207000000", "metacritic": 76, "num_mflix_comments": 1, "plot": "A family of Irish immigrants adjust to life on the mean streets of Hell's Kitchen while also grieving the death of a child.", "poster": "https://m.media-amazon.com/images/M/MV5BOGY1YmUzN2MtNDQ3NC00Nzc4LWI5M2EtYzUwMGQ4NWM4NjE1XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1076025600000, "runtime": 105, "title": "In America", "tomatoes": {"boxOffice": "$15.3M", "consensus": "A rich and moving story about an immigrant family adjusting to life in New York.", "critic": {"meter": 89, "numReviews": 173, "rating": 7.7}, "dvd": 1084233600000, "fresh": 154, "lastUpdated": 1440182429000, "production": "Fox Searchlight Pictures", "rotten": 19, "viewer": {"meter": 91, "numReviews": 34518, "rating": 3.8}, "website": "http://www2.foxsearchlight.com/inamerica/"}, "type": "movie", "writers": ["Jim Sheridan", "Naomi Sheridan", "Kirsten Sheridan"], "year": 2002}