{"_id": "573a13ebf29313caabdd19d5", "awards": {"nominations": 3, "text": "2 wins & 3 nominations.", "wins": 2}, "cast": ["Bridey Elliott", "Clare McNulty", "Neil Casey", "Alysia Reiner"], "countries": ["USA"], "directors": ["Sarah-Violet Bliss", "Charles Rogers"], "fullplot": "Fort Tilden: New York City's secluded seaside nirvana where, like flies to honey, Brooklyn's hip millennial set flocks on sweltering weekend afternoons for unbridled summertime indulgence. Amidst the vexing stagnation of quarter-life crises, Allie (Clare McNulty) struggles to prepare for the Peace Corps, while Harper (Bridey Elliot) awaits checks from her father to fund her artistic dreams. But the two friends quickly shun responsibilities for the day when a pair of good-looking guys invites them along for a carefree Fort Tilden afternoon. As the two young women board their fixed-gear bicycles and embark on a lengthy journey to the beach, they quickly realize that, akin to their confusing, transitioning lives, they neither know where they're going nor how they plan to get there. The debut feature film of directors Sarah-Violet Bliss and Charles Rogers - and showcasing the comedic versatility of Clare McNulty and Bridey Elliott as Allie and Harper - \"Fort Tilden\" is a hilariously insightful and recognizable look at the consequences of extended adolescence.", "genres": ["Comedy"], "imdb": {"id": 3457734, "rating": 5.3, "votes": 337}, "languages": ["English"], "lastupdated": "2015-08-19 00:03:19.640000000", "metacritic": 71, "num_mflix_comments": 2, "plot": "A comedy about Allie and Harper and their needlessly difficult journey to the beach.", "poster": "https://m.media-amazon.com/images/M/MV5BMjEwODMzMzkxN15BMl5BanBnXkFtZTgwNzY3NDgyNjE@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1439510400000, "runtime": 98, "title": "Fort Tilden", "type": "movie", "writers": ["Sarah-Violet Bliss (story)", "Sarah-Violet Bliss", "Brian Lannin (story)", "Charles Rogers (story)", "Charles Rogers"], "year": 2014}