{"_id": "573a13aaf29313caabd21888", "awards": {"nominations": 6, "text": "6 wins & 6 nominations.", "wins": 6}, "cast": ["Halle Berry", "Benjamin Bratt", "Sharon Stone", "Lambert Wilson"], "countries": ["USA"], "directors": ["Pitof"], "fullplot": "Catwoman is the story of shy, sensitive artist Patience Philips, a woman who can't seem to stop apologizing for her own existence. She works as a graphic designer for Hedare Beauty, a mammoth cosmetics company on the verge of releasing a revolutionary anti-aging product. When Patience inadvertently happens upon a dark secret her employer is hiding, she finds herself in the middle of a corporate conspiracy. What happens next changes Patience forever. In a mystical twist of fate, she is transformed into a woman with the strength, speed, agility and ultra-keen senses of a cat. With her newfound prowess and feline intuition, Patience becomes Catwoman, a sleek and stealthy creature balancing on the thin line between good and bad. Like any wildcat, she's dangerous, elusive and untamed. Her adventures are complicated by a burgeoning relationship with Tom Lone, a cop who has fallen for Patience but cannot shake his fascination with the mysterious Catwoman, who appears to be responsible for a string of crime sprees plaguing the city.", "genres": ["Action"], "imdb": {"id": 327554, "rating": 3.3, "votes": 81721}, "languages": ["English", "Spanish"], "lastupdated": "2015-09-17 01:24:36.103000000", "metacritic": 27, "num_mflix_comments": 1, "plot": "A shy woman, endowed with the speed, reflexes, and senses of a cat, walks a thin line between criminal and hero, even as a detective doggedly pursues her, fascinated by both of her personas.", "poster": "https://m.media-amazon.com/images/M/MV5BMjA4MzM0NDAzOF5BMl5BanBnXkFtZTcwMDY3MDYyMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1090540800000, "runtime": 104, "title": "Catwoman", "tomatoes": {"boxOffice": "$40.2M", "consensus": "Halle Berry is the lone bright spot, but even she can't save this laughable action thriller.", "critic": {"meter": 9, "numReviews": 194, "rating": 3.1}, "dvd": 1106006400000, "fresh": 17, "lastUpdated": 1442346559000, "production": "Warner Bros. Pictures", "rotten": 177, "viewer": {"meter": 18, "numReviews": 273972, "rating": 2.2}, "website": "http://catwoman.warnerbros.com/"}, "type": "movie", "writers": ["Bob Kane (characters)", "Theresa Rebeck (story)", "John D. Brancato (story)", "Michael Ferris (story)", "John D. Brancato (screenplay)", "Michael Ferris (screenplay)", "John Rogers (screenplay)"], "year": 2004}