{"_id": "573a13bff29313caabd5f204", "awards": {"nominations": 2, "text": "4 wins & 2 nominations.", "wins": 4}, "cast": ["Avinoam Blumenkrantz", "Benni Adega", "Edna Fanta", "Oksana Sokol"], "countries": ["Israel"], "directors": ["Mushon Salmona"], "fullplot": "The film is named after the local football stadium located in the town of Be'er Sheva in southern Israel. Vasermil tells the story of three teenagers who live in the same tough neighborhood, growing up in an unforgiving environment, pinning their hopes on football as a way out. Shlomi lives with his widowed mother, little sister, and step-father and works as a pizza delivery boy. Adiel, of Ethiopian descent, has to look after his young brother and sick mother. Dima, a new immigrant from Russia, has a father who is unemployed and a mother who works as a cleaning lady. The three teens are recruited by the coach of the local football team to take part in the Be'er Sheva open youth championship, held, traditionally on Independence Day at the Vasermil stadium . Learning to work together as a team is the key to success in the tournament and success in the tournament means getting noticed by the scouts of the local football empire - Hapoel Be'er Sheva. In order to win the tournament they will have to play as a team, overcome their differences, get over their sense of inferiority and prejudice.", "genres": ["Drama"], "imdb": {"id": 1124001, "rating": 7.1, "votes": 82}, "languages": ["Hebrew", "Amharic", "Swahili", "Russian"], "lastupdated": "2015-09-14 12:55:53.583000000", "num_mflix_comments": 1, "plot": "The film is named after the local football stadium located in the town of Be'er Sheva in southern Israel. Vasermil tells the story of three teenagers who live in the same tough neighborhood...", "poster": "https://m.media-amazon.com/images/M/MV5BMTc1MDczOTUzNV5BMl5BanBnXkFtZTgwOTEyMDY0MDE@._V1_SY1000_SX677_AL_.jpg", "released": 1193270400000, "runtime": 93, "title": "Vasermil", "tomatoes": {"lastUpdated": 1441131355000, "production": "Transfax Film Productions", "viewer": {"meter": 50, "numReviews": 19, "rating": 2.2}}, "type": "movie", "writers": ["Mushon Salmona"], "year": 2007}