{"_id": "573a13a6f29313caabd183d8", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Coralie Revel", "Sabrina Seyvecou", "Roger Miremont", "Fabrice Deville"], "countries": ["France"], "directors": ["Jean-Claude Brisseau"], "fullplot": "Two young women find themselves struggling to survive in Paris, street-wise Nathalie, a stripper, and naève Sandrine, a barmaid. Together, they discover that sex can be used to their advantage, and pleasure. Both find positions in the office of a large bank, where bored, under-stimulated, prey are easy pickings. After making their way though several layers of executives at the bank, with destructive, and lucrative, results, they approach Christophe, scion to the bank director. What they don't know is that Christophe is a manipulative voyeur, whose last two lovers set themselves on fire when he rejected them. A connoisseur of high-class orgies, Christophe is only interested in new talent to satisfy the appetites of all whom he controls. In Christophe, the girls have found an opponent who knows all their wiles, and will challenge their simple under-class friendship with levels of jealousy and ecstasy that they have never experienced before. Will they survive?", "genres": ["Comedy", "Drama", "Fantasy"], "imdb": {"id": 287963, "rating": 6.1, "votes": 3488}, "languages": ["French"], "lastupdated": "2015-08-31 00:53:19.513000000", "metacritic": 55, "plot": "Two young women find themselves struggling to survive in Paris, street-wise Nathalie, a stripper, and naève Sandrine, a barmaid. Together, they discover that sex can be used to their ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTg5NTc1NTI3MF5BMl5BanBnXkFtZTgwNDU5NTY2MDE@._V1_SY1000_SX677_AL_.jpg", "rated": "UNRATED", "released": 1034726400000, "runtime": 115, "title": "Secret Things", "tomatoes": {"consensus": "Pretentious and trashy.", "critic": {"meter": 49, "numReviews": 49, "rating": 5.6}, "dvd": 1101168000000, "fresh": 24, "lastUpdated": 1442165438000, "production": "First Run Features", "rotten": 25, "viewer": {"meter": 38, "numReviews": 505, "rating": 3}, "website": "http://www.firstrunfeatures.com/cs_secretthings.html"}, "type": "movie", "writers": ["Jean-Claude Brisseau"], "year": 2002}