{"_id": "573a139af29313caabcf0e42", "awards": {"nominations": 22, "text": "Nominated for 4 Oscars. Another 21 wins & 22 nominations.", "wins": 25}, "cast": ["Helena Bonham Carter", "Linus Roache", "Alex Jennings", "Charlotte Rampling"], "countries": ["USA", "UK"], "directors": ["Iain Softley"], "fullplot": "Kate Croy's mother was born to wealth and privilege, but she threw it all away to marry Kate's father, a penniless opium addict who admits to having stolen from his wife. After her mother's death, Kate is offered an opportunity to return to the life her mother gave up. There is a condition, however: Kate must sever all of her old ties, not only to her father, but also to her lover, the muck-raking journalist Merton Densher, whom she has promised marriage. Kate reluctantly agrees to this, and in the meantime becomes friendly with \"the world's richest orphan,\" Millie Theale, an American making the Grand Tour. Desperate to see Kate, Merton crashes a party that she and Millie are attending, and Millie is attracted to him. When Kate learns that Millie is dying, she comes up with a plan to have her cake and eat it too...but all does not go as planned.", "genres": ["Drama", "Romance"], "imdb": {"id": 120520, "rating": 7.2, "votes": 8445}, "languages": ["English"], "lastupdated": "2015-09-14 10:39:03.423000000", "metacritic": 73, "plot": "An impoverished woman who has been forced to choose between a privileged life with her wealthy aunt and her journalist lover, befriends an American heiress. When she discovers the heiress is attracted to her own lover and is dying, she sees a chance to have both the privileged life she cannot give up and the lover she cannot live without.", "poster": "https://m.media-amazon.com/images/M/MV5BMGY5ZmZiOTgtMWEzYS00NmNkLTk2MTUtNTg3YjliNDg0NmUzXkEyXkFqcGdeQXVyMTAwMzUyOTc@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 878860800000, "runtime": 102, "title": "The Wings of the Dove", "tomatoes": {"critic": {"meter": 86, "numReviews": 29, "rating": 7.8}, "dvd": 937267200000, "fresh": 25, "lastUpdated": 1440612857000, "production": "Miramax", "rotten": 4, "viewer": {"meter": 79, "numReviews": 5518, "rating": 3.6}}, "type": "movie", "writers": ["Henry James (novel)", "Hossein Amini (screenplay)"], "year": 1997}