{"_id": "573a13a9f29313caabd2086a", "awards": {"nominations": 11, "text": "Nominated for 1 BAFTA Film Award. Another 1 win & 11 nominations.", "wins": 2}, "cast": ["Anne Reid", "Peter Vaughan", "Anna Wilson-Jones", "Daniel Craig"], "countries": ["UK"], "directors": ["Roger Michell"], "fullplot": "Toots and May's marriage is one of Toots being dependent on his wife. Shortly after Toots and May arrive in London to visit with their grown children Bobby and Paula and their respective children, Toots falls ill and dies. Toots' death brings to the surface the underlying strain that has always existed between May and both of her two children, and the unhappy lives they have all led. Now specifically with Paula, May is disapproving of her relationship with a construction worker named Darren. Not only does May think his occupation makes him beneath Paula, he's also a married man. Darren is in an unsatisfying marriage but doesn't want to leave it if only because of his son. Even after May gets to know and like Darren, she still encourages Paula to break up with him. The issue is is that May herself has fallen in love with Darren, the two who begin a sexual relationship. What will ultimately happen between May and Darren also depends on Darren, who is floundering in his own life and doesn't really know what he wants or even if he did how to get it. What will happen may also depend on Paula if she finds out what's going on.", "genres": ["Drama", "Romance"], "imdb": {"id": 323298, "rating": 6.9, "votes": 3427}, "languages": ["English"], "lastupdated": "2015-08-22 00:52:56.593000000", "metacritic": 72, "num_mflix_comments": 3, "plot": "A grandmother has a passionate affair with a man half her age, who is also sleeping with her daughter.", "poster": "https://m.media-amazon.com/images/M/MV5BMTM4Mzk4ODU1Ml5BMl5BanBnXkFtZTcwMzkxOTUyMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1087516800000, "runtime": 112, "title": "The Mother", "tomatoes": {"boxOffice": "$0.8M", "consensus": "Reid gives a fearless, realistic performance in depicting an older woman's sexual blossoming.", "critic": {"meter": 77, "numReviews": 88, "rating": 7}, "dvd": 1097539200000, "fresh": 68, "lastUpdated": 1438886590000, "production": "Sony Pictures Classics", "rotten": 20, "viewer": {"meter": 62, "numReviews": 3073, "rating": 3.3}, "website": "http://www.sonyclassics.com/themother/"}, "type": "movie", "writers": ["Hanif Kureishi"], "year": 2003}