{"_id": "573a13a4f29313caabd10b57", "awards": {"nominations": 7, "text": "6 wins & 7 nominations.", "wins": 6}, "cast": ["Marisa Paredes", "Eduardo Noriega", "Federico Luppi", "Fernando Tielve"], "countries": ["Spain", "Mexico", "Argentina"], "directors": ["Guillermo del Toro"], "fullplot": "It is 1939, the end of three years of bloody civil war in Spain, and General Franco's right-wing Nationalists are poised to defeat the left-wing Republican forces. A ten-year-old boy named Carlos, the son of a fallen Republican war hero, is left by his tutor in an orphanage in the middle of nowhere. The orphanage is run by a curt but considerate headmistress named Carmen and a kindly Professor Casares, both of whom are sympathetic to the doomed Republican cause. Despite their concern for him, and his gradual triumph over the usual schoolhouse bully, Carlos never feels completely comfortable in his new environment. First of all, there was that initial encounter with the orphanage's nasty caretaker, Jacinto, who reacts even more violently when anyone is caught looking around a particular storage room the one with the deep well. Second, and more inexplicable, is the presence of a ghost, one of the former occupants of the orphanage named Santi. Not long after Carlos' arrival, Santi latches onto Carlos, badgering him incessantly at night and gloomily intoning, \"Many of you will die.\" As if that wasn't enough to keep the orphanage's occupants in an unrelenting state of terror, there's the un-exploded bomb that dominates the orphanage's courtyard, still ticking away; With the orphanage left defenseless by its isolation, and the swift progression of Franco's troops, the ghost's prediction seems depressingly accurate. Nevertheless, with every step of the plot, it becomes apparent that the ghost's predictions as to who (or what) will die, the real source of danger and even the definition of death itself may be more ambiguous than first thought.", "genres": ["Drama", "Horror"], "imdb": {"id": 256009, "rating": 7.5, "votes": 43442}, "languages": ["Spanish"], "lastupdated": "2015-08-18 01:17:25.860000000", "metacritic": 78, "num_mflix_comments": 3, "plot": "After Carlos, a 12-year-old whose father has died in the Spanish Civil War, arrives at an ominous boy's orphanage he discovers the school is haunted and has many dark secrets that he must uncover.", "poster": "https://m.media-amazon.com/images/M/MV5BZTI3MDcwZGItZDMwNS00ZDBjLWEwOGEtMWEyMWUxNDlkYzBjL2ltYWdlXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 987724800000, "runtime": 106, "title": "The Devil's Backbone", "tomatoes": {"consensus": "Creepily atmospheric and haunting, The Devil's Backbone is both a potent ghost story and an intelligent political allegory.", "critic": {"meter": 92, "numReviews": 117, "rating": 7.6}, "dvd": 1024963200000, "fresh": 108, "lastUpdated": 1440355044000, "production": "Sony Pictures Classics", "rotten": 9, "viewer": {"meter": 89, "numReviews": 34023, "rating": 3.9}, "website": "http://www.sonyclassics.com/devilsbackbone/index.htm"}, "type": "movie", "writers": ["Guillermo del Toro", "Antonio Trashorras", "David Muèoz"], "year": 2001}