{"_id": "573a139ff29313caabcff82f", "awards": {"nominations": 9, "text": "1 win & 9 nominations.", "wins": 1}, "cast": ["Giovanni Ribisi", "Vin Diesel", "Nia Long", "Nicky Katt"], "countries": ["USA"], "directors": ["Ben Younger"], "fullplot": "Seth Davis is a college dropout running an illegal casino from his rented apartment. Driven by his domineering fathers disapproval at his illegitimate existence and his desire for serious wealth, Seth suddenly finds himself seduced by the opportunity to interview as a trainee stock broker from recent acquaintance Greg (Nicky Katt). Walking into the offices of JT Marlin, a small time brokerage firm on the outskirts of New York - Seth gets an aggressive cameo performance from Jay (Ben Affleck) that sets the tone for a firm clearly placing money above all else. Seth's fractured relationship with his father and flirtatious glances from love interest Abbie (Nia Long) are enough to keep Seth motivated in his new found career. As he begins to excel and develop a love for the hard sale and high commission, a few chance encounters leads Seth to question the legitimacy of the firms operations - placing him once again at odds with his father and what remains of his morality. With homages to Wall Street, and Glengarry Glen Ross, it's a decent debut feature for Ben Younger who's script exposes a truly sinister side of an already immoral business.", "genres": ["Crime", "Drama", "Thriller"], "imdb": {"id": 181984, "rating": 7, "votes": 38997}, "languages": ["English", "Russian"], "lastupdated": "2015-08-30 03:18:32.707000000", "metacritic": 63, "num_mflix_comments": 1, "plot": "A college dropout gets a job as a broker for a suburban investment firm, which puts him on the fast track to success, but the job might not be as legitimate as it sounds.", "poster": "https://m.media-amazon.com/images/M/MV5BYWQ2NDY3NjQtMTY3NS00M2VhLThlOTQtOGE4NzczY2RlYzg3XkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 950832000000, "runtime": 120, "title": "Boiler Room", "tomatoes": {"consensus": "Its ending is disappointingly tidy, but Boiler Room boasts just enough sharp writing and brisk pacing to make getting there worthwhile.", "critic": {"meter": 67, "numReviews": 99, "rating": 6.4}, "dvd": 963273600000, "fresh": 66, "lastUpdated": 1442340428000, "production": "New Line Home Entertainment", "rotten": 33, "viewer": {"meter": 78, "numReviews": 46489, "rating": 3.4}, "website": "http://www.boilerroommovie.com"}, "type": "movie", "writers": ["Ben Younger"], "year": 2000}