{"_id": "573a13c4f29313caabd6e3a3", "awards": {"nominations": 8, "text": "7 wins & 8 nominations.", "wins": 7}, "cast": ["Nadia Salamanca", "Ventura Alvarez", "Iris Corliss", "Cory Rouse"], "countries": ["USA"], "directors": ["Jason Shumway", "Matt Shumway"], "fullplot": "Floating dead in space, transport ship Genesis becomes an unsolvable mystery. All hands on board have been killed. What began as a simple transport mission for the crew of the Genesis, ends with not only their bloodshed, but the loss of an important military prisoner. The people of earth are in a time of crisis. They are waging war against a far superior opponent, an alien race called the Cnidarians. After a bloody assault on a military ship, the Vendetta, USSM special forces were able to capture their first Cnidarian prisoner, code named 71099. But commonly known through out the fleet as Ediolon, the phantom. Realizing that a military transport would be too obvious of a target to their enemy, the USSM enlisted the freelance ship Genesis, commanded by Nathaniel J Rhys to secretly transport the prisoner to the high security prison located on Mars' moon Demos. The ship never arrived. General Rothman immediately launches an investigation team, and is determined to get to the bottom of this mystery, for one of the dead was his niece, Kyleigh. He will not let her death be in vain. Even with all its efforts, what happened on this voyage is unclear to the investigation team. All are dead, but how, and why? Has earth lost its chance take an advantage in their losing war? Watch closely and see if you can discover the enigma of this doomed mission.", "genres": ["Short", "Sci-Fi"], "imdb": {"id": 1365598, "rating": 5.3, "votes": 164}, "languages": ["English"], "lastupdated": "2015-08-04 01:17:36.023000000", "num_mflix_comments": 1, "plot": "Floating dead in space, transport ship Genesis becomes an unsolvable mystery. All hands on board have been killed. What began as a simple transport mission for the crew of the Genesis, ends...", "poster": "https://m.media-amazon.com/images/M/MV5BMTgyNzAzNTkwOV5BMl5BanBnXkFtZTcwNzI3MzI2Mg@@._V1_SY1000_SX677_AL_.jpg", "released": 1291939200000, "runtime": 42, "title": "Enigma", "tomatoes": {"lastUpdated": 1442086585000, "production": "Frontier Studios", "viewer": {"numReviews": 0, "rating": 0}}, "type": "movie", "writers": ["Jason Shumway", "Matt Shumway"], "year": 2009}