{"_id": "573a13b5f29313caabd44acd", "awards": {"nominations": 5, "text": "1 win & 5 nominations.", "wins": 1}, "cast": ["Jim Sturgess", "Kevin Spacey", "Kate Bosworth", "Aaron Yoo"], "countries": ["USA"], "directors": ["Robert Luketic"], "fullplot": "Ben Campbell is a young, highly intelligent, student at M.I.T. in Boston who strives to succeed. Wanting a scholarship to transfer to Harvard School of Medicine with the desire to become a doctor, Ben learns that he cannot afford the $300,000 for the four to five years of schooling as he comes from a poor, working-class background. But one evening, Ben is introduced by his unorthodox math professor Micky Rosa into a small but secretive club of five. Students Jill, Choi, Kianna, and Fisher, who are being trained by Professor Rosa of the skill of card counting at blackjack. Intrigued by the desire to make money, Ben joins his new friends on secret weekend trips to Las Vegas where, using their skills of code talk and hand signals, they have Ben make hundreds of thousands of dollars in winning blackjack at casino after casino. Ben only wants to make enough money for the tuition to Harvard and then back out. But as fellow card counter, Jill Taylor, predicts, Ben becomes corrupted by greed and his arrogance at winning which lets his feelings get in the way, and it also puts Professor Rosa, as well as the group, on the radar of a brutal casino security enforcer, named Cole Williams, who holds a personal grudge of some kind against Rosa which threatens to undo everything the students have learned and earned.", "genres": ["Action", "Biography", "Crime"], "imdb": {"id": 478087, "rating": 6.8, "votes": 180623}, "languages": ["English"], "lastupdated": "2015-09-04 00:01:27.413000000", "metacritic": 48, "num_mflix_comments": 3, "plot": "\"21\" is the fact-based story about six MIT students who were trained to become experts in card counting and subsequently took Vegas casinos for millions in winnings.", "poster": "https://m.media-amazon.com/images/M/MV5BMjAyNTU5OTcxOV5BMl5BanBnXkFtZTcwMDEyNjM2MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1206662400000, "runtime": 123, "title": 21, "tomatoes": {"boxOffice": "$81.2M", "consensus": "21 could have been a fascinating study had it not supplanted the true story on which it is based with mundane melodrama.", "critic": {"meter": 36, "numReviews": 165, "rating": 5.2}, "dvd": 1216684800000, "fresh": 59, "lastUpdated": 1441908693000, "production": "Sony/Columbia Pictures", "rotten": 106, "viewer": {"meter": 66, "numReviews": 367054, "rating": 3.6}, "website": "http://www.sonypictures.com/movies/21/"}, "type": "movie", "writers": ["Peter Steinfeld (screenplay)", "Allan Loeb (screenplay)", "Ben Mezrich (book)"], "year": 2008}