{"_id": "573a139ef29313caabcfc35e", "awards": {"nominations": 7, "text": "1 win & 7 nominations.", "wins": 1}, "cast": ["Nis Bank-Mikkelsen", "Alan Rickman", "Terry Jones", "Sèren Sètter-Lassen"], "countries": ["Germany", "Ireland", "Denmark"], "directors": ["Stefan Fjeldmark", "Michael Hegner", "Greg Manwaring"], "fullplot": "Siblings; Fly & Stella together with their child genius cousin Chuck Charles, encounter reclusive biologist/chemist Proffesor MacKrill/Mac Krell while out on the docks fishing only to become cut off by the tide coming in separating them from the shoreline. Seeking refuge, they stumble across his secluded island hideaway laboratory, to discover MacKrill/Mac Krell has found away to change humans into sea-life and back again. Stella mistaking this fish potion for lemonade drinks some and is turned into a starfish, her older brother none the wiser chucks her out into the ocean, only to learn from the video cameras the awful truth. Out searching for her in a boat guilty Fry knowing how futile this action is drinks the potion and dives in after her (changing into Californian Linefish in the process) leaving the Professor and Chuck on-board as an storm brews overhead. Unable to stand the batter waves, their craft sinks along with the antidote and Chuck has to drink the liquid to prevent himself from drowning (ending up as a jellyfish), with MacKrill/Mac Krell warning that unless they drink the antidote in within 48 hours they'll be stuck as fish forever. Now these three find themselves stranded in the ocean in a desperate search to find that antidote. However on the seabed their antidote has fallen into the fins of the ruthless pilot-fish Joe...whose exposure to it has increased his intellect, making him power-mad with no intention of letting this stroke of fortune desert him.", "genres": ["Animation", "Adventure", "Comedy"], "imdb": {"id": 168856, "rating": 5.8, "votes": 3758}, "languages": ["English", "Danish"], "lastupdated": "2015-08-30 00:04:41.663000000", "plot": "Three children accidentally get turned into fish after drinking a potion made by an eccentric scientist. The kids end up in the sea, with one problem. They must find and drink the antidote within 48 hours, or forever remain as fish.", "poster": "https://m.media-amazon.com/images/M/MV5BMTI2OTc5MzcwNF5BMl5BanBnXkFtZTcwMTAwOTUxMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "G", "released": 993772800000, "runtime": 80, "title": "A Fish Tale", "tomatoes": {"dvd": 1157414400000, "lastUpdated": 1442085481000, "viewer": {"meter": 45, "numReviews": 6502, "rating": 2.9}}, "type": "movie", "writers": ["Tracy J. Brown (additional dialogue and scenario)", "Stefan Fjeldmark (original story)", "Stefan Fjeldmark (screenplay)", "Karsten Kiilerich (original story)", "Karsten Kiilerich (screenplay)", "John Stefan Olsen (screenplay)"], "year": 2000}