{"_id": "573a13a4f29313caabd11bf7", "awards": {"nominations": 1, "text": "9 wins & 1 nomination.", "wins": 9}, "cast": ["Harvey Keitel", "Stellan Skarsgèrd", "Moritz Bleibtreu", "Birgit Minichmayr"], "countries": ["France", "UK", "Germany", "Austria"], "directors": ["Istvèn Szabè"], "fullplot": "A tale based on the life of Wilhelm Furtwangler, the controversial conductor of the Berlin Philharmonic whose tenure coincided with the controversial Nazi era. One of the most spectacular and renowned conductors of the 30s, Furtwangler's reputation rivaled that of Toscanini's. After the war, he was investigated as part of the Allies' de-Nazification programme. In the bombed-out Berlin of the immediate post-war period, the Allies slowly bring law and order--and justice--to bear on an occupied Germany. An American major is given the Furtwangler file, and is told to find everything he can and to prosecute the man ruthlessly. Tough and hard-nosed, Major Steve Arnold sets out to investigate a world of which he knows nothing. Orchestra members vouch for Furtwangler's morality--he did what he could to protect Jewish players from his orchestra. To the Germans, deeply respectful of their musical heritage, Furtwangler was a demigod; to Major Arnold, he is just a lying, weak-willed Nazi.", "genres": ["Drama", "Music", "War"], "imdb": {"id": 260414, "rating": 7.2, "votes": 2706}, "languages": ["English", "Russian", "French", "German"], "lastupdated": "2015-08-11 00:20:07.453000000", "metacritic": 61, "num_mflix_comments": 2, "plot": "A tale based on the life of Wilhelm Furtwangler, the controversial conductor of the Berlin Philharmonic whose tenure coincided with the controversial Nazi era. One of the most spectacular ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTY0NjA0NTk4M15BMl5BanBnXkFtZTcwNDkzODYyMQ@@._V1_SY1000_SX677_AL_.jpg", "released": 1015459200000, "runtime": 108, "title": "Taking Sides", "tomatoes": {"lastUpdated": 1437415598000, "viewer": {"numReviews": 66, "rating": 2.2}}, "type": "movie", "writers": ["Ronald Harwood (play)", "Ronald Harwood (screenplay)"], "year": 2001}