{"_id": "573a13b9f29313caabd4f2a3", "awards": {"nominations": 1, "text": "1 win & 1 nomination.", "wins": 1}, "cast": ["Ryan Reynolds", "An Nguyen", "Matthew Mason", "Rick Derby"], "countries": ["Germany", "UK", "USA", "France"], "directors": ["Adam Brooks"], "fullplot": "Romantic comedy: Will Hayes, a 30-something Manhattan dad is in the midst of a divorce when his 10 year old daughter, Maya, starts to question him about his life before marriage. Maya wants to know absolutely everything about how her parents met and fell in love. Will's story begins in 1992, as a young, starry-eyed aspiring politician who moves to New York from Wisconsin in order to work on the Clinton campaign. For Maya, Will relives his past as a idealistic young man learning the ins and outs of big city politics, and recounts the history of his romantic relationships with three very different women. On the campaign, Will's best buddy is Russell McCormack. They not only have similar political aspirations, they share the same type of girl problems, too. Will hopelessly attempts a \"PG\" version of his story for his daughter ad changes the names so Maya has to guess who he finally married. Is her mother Will's college sweetheart, the dependable girl next-door Emily? Is she his longtime best friend and confidante, the apolitical April? Or is she the free-spirited but ambitious journalist? As Maya puts together the pieces of her dad's romantic puzzle, she begins to understand that love is not so simple or easy. And as Will tells her his tale, Maya helps him to understand that it's definitely never too late to go back...and maybe even possible to find a happy ending.", "genres": ["Comedy", "Drama", "Romance"], "imdb": {"id": 832266, "rating": 7.2, "votes": 120900}, "languages": ["English"], "lastupdated": "2015-09-05 00:30:42.910000000", "metacritic": 59, "plot": "A political consultant tries to explain his impending divorce and past relationships to his 11-year-old daughter.", "poster": "https://m.media-amazon.com/images/M/MV5BMTc1Mzc1ODMxMF5BMl5BanBnXkFtZTcwNDY1MzU1MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1202947200000, "runtime": 112, "title": "Definitely, Maybe", "tomatoes": {"boxOffice": "$32.0M", "consensus": "With a clever script and charismatic leads, Definitely, Maybe is a refreshing entry into the romantic comedy genre.", "critic": {"meter": 71, "numReviews": 144, "rating": 6.5}, "dvd": 1214265600000, "fresh": 102, "lastUpdated": 1442086103000, "production": "Universal Pictures", "rotten": 42, "viewer": {"meter": 71, "numReviews": 139423, "rating": 3.5}, "website": "http://www.definitelymaybemovie.com"}, "type": "movie", "writers": ["Adam Brooks"], "year": 2008}