{"_id": "573a13a5f29313caabd15d60", "awards": {"nominations": 2, "text": "1 win & 2 nominations.", "wins": 1}, "cast": ["Rick Kavanian", "Axel Stein", "Eva Habermann", "Christoph M. Ohrt"], "countries": ["Germany"], "directors": ["Mathias Dinter"], "fullplot": "The Austrian Alps, some years ago. While playing, young Tèrlich falls unconscious onto a duck nest and is carried away forever by the small river. Sixteen years later, Germany, in the Ruhrpott, to be exact: Orphan Tèrlich and his friend Josch are working their civil service, yet cause so much chaos that they decide to flee instead of being forced into the army. Tèrlich accidentally stumbles across some information about his origin and decides to go to Klein Ischgl in Austria. Upon arrival, Josch and Tèrlich find Ischgl to be a center for après ski parties, and drink hard to blend in. Klein Ischgl actually turns out to be a stone-age-like townlet (9 inhabitants) up the mountain, and Tèrlichs grandfather, who runs the place, even resists to electricity and indoor plumbing. While Tèrlich rediscovers his roots (and his affection for Heidi), Josch finds out that evil entrepreneur Tronald Dump plans to blow the mountain to smithereens in order to erect a plastic mountain with a ski resort where you never can get hurt. Josch now has to convince Tèrlich about the evil intentions of Dump fast, only has there just been quite a fight between the two lifelong friends.", "genres": ["Comedy"], "imdb": {"id": 277703, "rating": 3.2, "votes": 897}, "languages": ["German"], "lastupdated": "2015-06-29 00:56:09.780000000", "num_mflix_comments": 1, "plot": "Two friends who are doing civil service flee to the Austrian Alps to escape being forced into the army. While there, one of them rediscovers his past and they realise that it's going to be more fun than they thought.", "poster": "https://m.media-amazon.com/images/M/MV5BODIzOTFjYzktYjg3Mi00ZTA0LTgwNjMtYWYxY2U2YzczOGU4L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzA3Njg4MzY@._V1_SY1000_SX677_AL_.jpg", "released": 1014249600000, "runtime": 83, "title": "Feuer, Eis & Dosenbier", "tomatoes": {"critic": {"meter": 42, "numReviews": 38, "rating": 4.9}, "dvd": 1024963200000, "fresh": 16, "lastUpdated": 1441994864000, "production": "Cowboy Pictures", "rotten": 22, "viewer": {"meter": 33, "numReviews": 1337, "rating": 2.9}, "website": "http://www.cowboybi.com/final/index.html"}, "type": "movie", "writers": ["Mathias Dinter", "Martin Ritzenhoff"], "year": 2002}