{"_id": "573a13bdf29313caabd59fcb", "awards": {"nominations": 23, "text": "9 wins & 23 nominations.", "wins": 9}, "cast": ["Priyanka Chopra", "Hrithik Roshan", "Amitabh Bachchan", "Kangana Ranaut"], "countries": ["India"], "directors": ["Rakesh Roshan"], "fullplot": "After defeating the villainous Dr. Siddhant Arya, and bringing his father Rohit back from the dead, Krrish continued fighting against evil and saving innocent lives. Now Krishna is living a happily married life with Priya, while Rohit is using his scientific brilliance to benefit society. And Krrish is everyone's favorite superhero saviour. Unknown to them, a dark force is growing in another part of the world. Kaal, an evil genius, is selfishly misusing his powers to spread fear, death and destruction. And he is being assisted by an army of very dangerous beings, which he has created himself. Not long after Kaal's plans are put into action, both Rohit and Krrish find themselves faced with a crisis of epic proportions, which only they can resolve, together. But when they finally cross paths with Kaal and his army, neither of them is prepared for what lies ahead. Kaal not only brings the world to the brink of disaster, he also puts the strength and love of Krishna and his family to the test.", "genres": ["Romance", "Sci-Fi"], "imdb": {"id": 1029231, "rating": 5.5, "votes": 14291}, "languages": ["Hindi", "Telugu", "Tamil"], "lastupdated": "2015-09-17 03:00:05.920000000", "plot": "Krrish and his scientist father have to save the world and their own family from an evil man named Kaal and his team of human-animal mutants led by the ruthless Kaya. Will they succeed? How?", "poster": "https://m.media-amazon.com/images/M/MV5BMjI0MzU3MTM1Ml5BMl5BanBnXkFtZTgwOTk2MjQ0MDE@._V1_SY1000_SX677_AL_.jpg", "released": 1383264000000, "runtime": 152, "title": "Krrish 3", "tomatoes": {"boxOffice": "$2.2M", "dvd": 1421020800000, "lastUpdated": 1441911303000, "production": "Eros Entertainment", "viewer": {"meter": 52, "numReviews": 1983, "rating": 3.3}, "website": "http://www.krrish-3.com/"}, "type": "movie", "writers": ["Rakesh Roshan (story)", "Robin Bhatt (screenplay)", "Honey Irani (screenplay)", "Irfan Kamal (screenplay)", "Akarsh Khurana (screenplay)", "Rakesh Roshan (screenplay)", "Sanjay Masoom (dialogue)", "David Benullo (story)"], "year": 2013}