{"_id": "573a13c8f29313caabd7821e", "awards": {"nominations": 0, "text": "2 wins.", "wins": 2}, "countries": ["Tanzania", "USA"], "directors": ["Eliaichi Kimaro"], "fullplot": "Eliaichi Kimaro is a mixed-race, first-generation American with a Tanzanian father and Korean mother. When her retired father moves back to Tanzania, Eliaichi begins a project that evocatively examines the intricate fabric of multiracial identity, and grapples with the complex ties that children have to the cultures of their parents. Kimaro decides to document her father's path back to his family and Chagga culture. In the process, she struggles with her own relationship to Tanzania, and learns more about the heritage that she took for granted as a child. Yet as she talks to more family members, especially her aunts, she uncovers a cycle of violence that resonates with her work and life in the United States. When Kimaro speaks with her parents about the oppression her aunts face, she faces a jarring disconnect between immigrant generations on questions of patriarchy and violence. \"One reason this film works,\" notes Tikkun Magazine, \"is that Kimaro situates her own personal family history within a social, historical, and political context of African decolonization, transnational relations, race, class, and gender politics.\" With poignant personal reflection and an engaging visual style, A Lot Like You draws the viewer into a journey that is filled with rich, multifaceted stories and history. \"A moving personal essay on family and diversity\" (Seattle Weekly), the film raises questions about the cultures we inherit and the cultures we choose to pass down, and reveals how simply bearing witness to another's truth telling can break silences that have lasted lifetimes.", "genres": ["Documentary", "Biography", "Drama"], "imdb": {"id": 1504978, "rating": 8.2, "votes": 33}, "languages": ["English"], "lastupdated": "2015-05-02 00:06:33.760000000", "num_mflix_comments": 1, "plot": "When Eliaichi's retired father moves back to Tanzania, she begins a film project that examines the intricate fabric of multiracial identity, and grapples with the complex ties that children have to the cultures of their parents.", "poster": "https://m.media-amazon.com/images/M/MV5BMTYwODgyMDE1Ml5BMl5BanBnXkFtZTcwOTQxNjUyOQ@@._V1_SY1000_SX677_AL_.jpg", "released": 1332892800000, "runtime": 80, "title": "A Lot Like You", "tomatoes": {"lastUpdated": 1423934715000, "viewer": {"numReviews": 0, "rating": 0}}, "type": "movie", "writers": ["Eric Frith", "Eliaichi Kimaro"], "year": 2012}