{"_id": "573a1394f29313caabcdf5ec", "awards": {"nominations": 4, "text": "Won 1 Oscar. Another 2 wins & 4 nominations.", "wins": 3}, "cast": ["William Holden", "Don Taylor", "Otto Preminger", "Robert Strauss"], "countries": ["USA"], "directors": ["Billy Wilder"], "fullplot": "It's a dreary Christmas 1944 for the American POWs in Stalag 17. For the men in Barracks 4, all sergeants, have to deal with a grave problem - there seems to be a security leak. The Germans always seem to be forewarned about escapes and in the most recent attempt the two men, Manfredi and Johnson, walked straight into a trap and were killed. For some in Barracks 4, especially the loud-mouthed Duke, the leaker is obvious: J.J. Sefton, a wheeler-dealer who doesn't hesitate to trade with the guards and who has acquired goods and privileges that no other prisoner seems to have. Sefton denies giving the Germans any information and makes it quite clear that he has no intention of ever trying to escape. He plans to ride out the war in what little comfort he can arrange, but it doesn't extend to spying for the Germans. As tensions mount and a mob mentality takes root, it becomes obvious that Sefton will have to find the real snitch if he is to have any peace and avoid the beatings Duke and others have inflicted on him.", "genres": ["Comedy", "Drama", "War"], "imdb": {"id": 46359, "rating": 8.1, "votes": 41468}, "languages": ["English", "German", "Russian"], "lastupdated": "2015-09-14 05:38:23.060000000", "plot": "When two escaping American World War II prisoners are killed, the German POW camp barracks black marketeer, J.J. Sefton, is suspected of being an informer.", "poster": "https://m.media-amazon.com/images/M/MV5BNDMyNGU0NjUtNTIxMC00ZmU2LWE0ZGItZTdkNGVlODI2ZDcyL2ltYWdlXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": -517363200000, "runtime": 120, "title": "Stalag 17", "tomatoes": {"consensus": "Stalag 17 survives the jump from stage to screen with flying colors, thanks to Billy Wilder's typically sterling direction and a darkly funny script.", "critic": {"meter": 97, "numReviews": 34, "rating": 8.4}, "dvd": 945129600000, "fresh": 33, "lastUpdated": 1439837843000, "production": "Paramount Home Video", "rotten": 1, "viewer": {"meter": 93, "numReviews": 12936, "rating": 4.2}}, "type": "movie", "writers": ["Billy Wilder (written for the screen by)", "Edwin Blum (written for the screen by)", "Donald Bevan (based on the play by)", "Edmund Trzcinski (based on the play by)"], "year": 1953}