{"_id": "573a1398f29313caabceb299", "awards": {"nominations": 4, "text": "11 wins & 4 nominations.", "wins": 11}, "cast": ["Randall Adams", "David Harris", "Gus Rose", "Jackie Johnson"], "countries": ["USA"], "directors": ["Errol Morris"], "fullplot": "Errol Morris's unique documentary dramatically re-enacts the crime scene and investigation of a police officer's murder in Dallas, Texas. Briefly, a drifter (Randall Adams) ran out of gas and was picked up by a 16-year-old runaway (David Harris). Later that night, they drank some beer, smoked some marijuana, and went to the movies. Then, their stories diverged. Adams claimed that he left for his motel, where he was staying with his brother, and went to sleep. Harris, however, said that they were stopped by police late that night, and Adams suddenly shot the officer approaching their car. The film shows the audience the evidence gathered by the police, who were under extreme pressure to clear the case. It strongly makes a point that the circumstantial evidence was very flimsy. In fact, it becomes apparent that Harris was a much more likely suspect and was in the middle of a crime spree, eventually ending up on Death Row himself for the later commission of other crimes. Morris implies that the DA's and the judge's desire for the death penalty in this case (for which Harris would have been ineligible because of his youth) made Adams a scapegoat on whom to pin this heinous crime.", "genres": ["Documentary", "Crime", "Mystery"], "imdb": {"id": 96257, "rating": 8.1, "votes": 13118}, "languages": ["English"], "lastupdated": "2015-08-21 00:07:03.313000000", "metacritic": 79, "num_mflix_comments": 1, "plot": "A film that successfully argued that a man was wrongly convicted for murder by a corrupt justice system in Dallas County, Texas.", "poster": "https://m.media-amazon.com/images/M/MV5BMTE3MTViMDUtNjkxYy00NWY2LTg5MzEtYjFiNzRkMTgwYTJmXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 588470400000, "runtime": 103, "title": "The Thin Blue Line", "tomatoes": {"critic": {"meter": 100, "numReviews": 14, "rating": 9}, "dvd": 1122336000000, "fresh": 14, "lastUpdated": 1440094167000, "production": "HBO Video", "rotten": 0, "viewer": {"meter": 90, "numReviews": 8108, "rating": 4.1}}, "type": "movie", "writers": ["Errol Morris"], "year": 1988}