{"_id": "573a13a6f29313caabd16a16", "awards": {"nominations": 8, "text": "8 nominations.", "wins": 0}, "cast": ["Fardeen Khan", "Ravi Baswani", "Kannu Gill", "Sonali Kulkarni"], "countries": ["India"], "directors": ["Rajat Mukherjee"], "fullplot": "Ria Jaiswal lives a very wealthy lifestyle along with her mom and dad. As she is the only child in this family, her parents dot on her and give in to her every wish. As a child she saw a toy on TV and asked her dad to get it. When he told her that he was unable to do, she stopped speaking and eating - until her dad somehow managed to get the toy from America. Subsequently, Ria's mom passed away. Years later, Ria has now grown up to be a very attractive young woman. She meets with Jai, a photographer from Style Magazine, she models and is very attracted to him. She tells her dad that she wants to get married and goes to Jai's house to get him to meet her dad. When she reaches his house in Lokhandwala Complex, she finds out that he is already married to a woman named Geeta, and very much in love with her. A betrayed Ria, unable to get Jai out of her mind, obsesses over him - and decides that he and she are meant for each other - and sets about to carry her task - to force Jai to accept her - by hook or by crook.", "genres": ["Thriller"], "imdb": {"id": 281102, "rating": 5.7, "votes": 526}, "languages": ["Hindi"], "lastupdated": "2015-08-23 00:24:48.923000000", "num_mflix_comments": 4, "plot": "Ria Jaiswal lives a very wealthy lifestyle along with her mom and dad. As she is the only child in this family, her parents dot on her and give in to her every wish. As a child she saw a ...", "poster": "https://m.media-amazon.com/images/M/MV5BOTExMWJmMjMtNjhiYy00MWE2LTg2YjEtNmIzZDBmNjgwOWEzXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY1000_SX677_AL_.jpg", "released": 988329600000, "title": "Pyaar Tune Kya Kiya...", "tomatoes": {"dvd": 996624000000, "lastUpdated": 1438023549000, "production": "Eros Entertainment", "viewer": {"meter": 36, "numReviews": 352, "rating": 3.2}}, "type": "movie", "writers": ["Rajat Mukherjee (screenplay)"], "year": 2001}