{"_id": "573a139ef29313caabcfe547", "awards": {"nominations": 14, "text": "7 wins & 14 nominations.", "wins": 7}, "cast": ["Tim Allen", "Sigourney Weaver", "Alan Rickman", "Tony Shalhoub"], "countries": ["USA"], "directors": ["Dean Parisot"], "fullplot": "The sci-fi television series \"Galaxy Quest\", which took place aboard the intergalactic spaceship NSEA Protector, starred Jason Nesmith as suave Commander Peter Quincy Taggert, Gwen DeMarco as sexy communications person Lt. Tawny Madison (a role which consisted solely of repeating what the computer stated, much to Gwen's annoyance), Shakespearean trained Sir Alexander Dane as alien Dr. Lazarus, Fred Kwan as engineer Tech Sgt. Chen, and Tommy Webber as child gunner Laredo. Eighteen years after the series last aired, it lives on in the hearts of its rabid fans. However, it lives on in infamy for its stars, who have not been able to find meaningful acting work since. Their current lives revolve around cashing in on however those roles will afford, which usually entails attending fan conventions or worse, such as shopping mall openings. Only Jason seems to relish his lot in life, until he finds out that his co-stars detest him because of his superior attitude as \"the Commander\", and much of the public considers him a laughing stock. Their lives change when Jason is approached by who he thinks are convention fans asking for help. They are in reality an alien race called Thermians, led by Mathesar, who have modeled their existence after the series, which they believe to be real. When Jason and then the rest of his co-stars (along with Guy Fleegman, who was killed off before the opening credits in only one episode) go along with the Thermians, Jason's co-stars who believe they are off to yet another paying gig, they learn that they have to portray their roles for real. Without screenwriters to get them to a happy and heroic ending, they have to trust that their play acting will work, especially in dealing with the Thermian's nemesis, General Sarris. Guy in particular fears that he will go the way his character did on the series. But when they run across technical issues that they as actors didn't care anything about during the filming of the series and thus now don't know how to deal with, they need to find someone who should know what to do.", "genres": ["Adventure", "Comedy", "Sci-Fi"], "imdb": {"id": 177789, "rating": 7.3, "votes": 114358}, "languages": ["English"], "lastupdated": "2015-09-10 17:44:56.760000000", "metacritic": 70, "num_mflix_comments": 1, "plot": "The alumni cast of a space opera television series have to play their roles as the real thing when an alien race needs their help.", "poster": "https://m.media-amazon.com/images/M/MV5BNmZlNTY5YjQtZTU5ZC00MzcyLWI1NDMtNjA0ZjQxMmQwYjJmL2ltYWdlXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 946080000000, "runtime": 102, "title": "Galaxy Quest", "tomatoes": {"consensus": "Intelligent and humorous satire with an excellent cast -- no previous Trekkie knowledge needed to enjoy this one.", "critic": {"meter": 90, "numReviews": 115, "rating": 7.2}, "dvd": 957225600000, "fresh": 103, "lastUpdated": 1441907098000, "production": "DreamWorks SKG", "rotten": 12, "viewer": {"meter": 78, "numReviews": 222626, "rating": 3.1}, "website": "http://www.amazon.com/exec/obidos/subst/video/misc/dreamworks/galaxy-quest/gq-home.html/103-6831095-1845408"}, "type": "movie", "writers": ["David Howard (story)", "David Howard (screenplay)", "Robert Gordon (screenplay)"], "year": 1999}