{"_id": "573a13cef29313caabd873a9", "awards": {"nominations": 5, "text": "6 wins & 5 nominations.", "wins": 6}, "cast": ["Joyce McKinney", "Peter Tory", "Troy Williams", "Jackson Shaw"], "countries": ["USA"], "directors": ["Errol Morris"], "fullplot": "Tabloid stories centered on the activities of Joyce McKinney, a former beauty queen with a self-reported IQ of 168, over her life are presented. Beyond her beauty pageant days, McKinney first hit the tabloid pages in Britain in what was largely coined \"The Case of the Manacled Mormon\". As reported by McKinney in interviews, she, a southern Christian originally from North Carolina, got involved with a group of Mormons in her pursuit of true love, without knowing they were Mormons or anything about Mormonism. She fell in love with one of those Mormons, Kirk Anderson, the two who were to be married. After he disappeared without saying anything to her, she, with the help of a private investigator and some male friends and new acquaintances, tracked him down in England where he was being brainwashed by Mormon elders, that brainwashing which included the notion of sex with and marriage to her, a non-Mormon, as taboo. He left with her voluntarily, she who took him away to a secluded cottage to do whatever required to get him back to the non-brainwashed Kirk she knew, which included chaining him down to a bed and having sex with him several times over the course of a few days. She was eventually charged with kidnapping among other charges, the case against her led by the Mormon church. Tabloid reporters were also involved, not so much to uncover the truth, but dig into other aspects of her life, including activities which allowed her to fund this mission of finding and retrieving Kirk, this information which in turn affected the case and its reporting. Beyond this case, McKinney, several years later, again hit the tabloids with regard to a story about her dog, Booger, which in turn renewed interest in the manacled Mormon case. In the end, McKinney vows to tell the complete side of her story through a book, which has become more difficult for her to write out of circumstance as time has gone on.", "genres": ["Documentary"], "imdb": {"id": 1704619, "rating": 7.1, "votes": 4658}, "languages": ["English", "Korean"], "lastupdated": "2015-08-17 00:27:17.923000000", "metacritic": 74, "plot": "A documentary on a former Miss Wyoming who is charged with abducting and imprisoning a young Mormon Missionary.", "poster": "https://m.media-amazon.com/images/M/MV5BMTY5ODAwMjcwMl5BMl5BanBnXkFtZTcwMzc5NzA2NQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1320969600000, "runtime": 87, "title": "Tabloid", "tomatoes": {"boxOffice": "$0.7M", "consensus": "It's far from his most thought-provoking work, but Tabloid finds Errol Morris as smart, spirited, and engaging as ever.", "critic": {"meter": 91, "numReviews": 115, "rating": 7.6}, "dvd": 1320105600000, "fresh": 105, "lastUpdated": 1442510417000, "production": "IFC Films", "rotten": 10, "viewer": {"meter": 72, "numReviews": 11014, "rating": 3.5}, "website": "http://tabloidmovie.com/"}, "type": "movie", "year": 2010}