{"_id": "573a13b4f29313caabd415e6", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Scott Aaronson", "Brian Lloyd", "Sarah McGuire", "Brianna Berman"], "countries": ["USA"], "directors": ["Kate Robbins"], "fullplot": "In a lonely road in Wucaipa, something attacks the driver of a car and her blind friend Tammy. They have a car accident; Tammy survives and is sent to the Wucaipa General Hospital. Meanwhile, a high school basketball team fights with the opponents in the square and the captain Matt with a broken leg, and his injured friends Joey and Brian are sent to the same hospital. Tammy is near death and asks the candy striper nurse Janine to kiss her. While kissing as a gesture of sympathy, an alien invades the mouth of Janine and infects her; she infects others nurses, clerks, doctors and patients, initiating an exponential virus outbreak in the hospital. Joey's sister Cherie that has a crush on Matt stays with them in the hospital. When Joey is infected by a hot nurse during the night, he has webbing on the face and rush, and Matt asks Cherie to call his girlfriend Krystal to help them to leave the hospital. But the place is under quarantine and the candy stripers need sugar to procreate a breed of alien.", "genres": ["Horror", "Sci-Fi"], "imdb": {"id": 463935, "rating": 2.9, "votes": 1062}, "languages": ["English"], "lastupdated": "2015-08-15 01:02:21.973000000", "plot": "In a lonely road in Wucaipa, something attacks the driver of a car and her blind friend Tammy. They have a car accident; Tammy survives and is sent to the Wucaipa General Hospital. ...", "poster": "https://m.media-amazon.com/images/M/MV5BNTg1MjUwMzM2OF5BMl5BanBnXkFtZTcwMzUyOTIzMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1151366400000, "runtime": 89, "title": "Candy Stripers", "tomatoes": {"dvd": 1151366400000, "lastUpdated": 1440097035000, "production": "Crackle Movies", "viewer": {"meter": 21, "numReviews": 1412, "rating": 2.5}}, "type": "movie", "writers": ["Jill Garson", "Kate Robbins"], "year": 2006}