{"_id": "573a13c1f29313caabd63b5c", "awards": {"nominations": 5, "text": "2 wins & 5 nominations.", "wins": 2}, "cast": ["Jamie Foxx", "Gerard Butler", "Colm Meaney", "Bruce McGill"], "countries": ["USA"], "directors": ["F. Gary Gray"], "fullplot": "Clyde Shelton's family is brutally murdered. The ones responsible are caught. However, because of improper procedure, the D.A., Nick Rice only has circumstantial evidence. So he decides to get one of them to testify against the other. When Shelton learns of this, he is not happy. Ten years later, the one who was convicted is being executed but something goes wrong; his execution goes awry and he suffers. They learn that someone tampered with the machine. And the other one is found dead, killed in a gruesome manner. Rice suspects Shelton, so he has him picked up. At first, Shelton agrees to a plea agreement with Rice but changes his mind. It appears that Shelton is not done, it appears he blames the whole system and is declaring war on it going after everyone involved with his family's case. So Rice has to stop him but Shelton is way ahead of him.", "genres": ["Crime", "Drama", "Thriller"], "imdb": {"id": 1197624, "rating": 7.4, "votes": 200068}, "languages": ["English"], "lastupdated": "2015-08-31 00:00:50.653000000", "metacritic": 34, "num_mflix_comments": 2, "plot": "A frustrated man decides to take justice into his own hands after a plea bargain sets one of his family's killers free. He targets not only the killer but also the district attorney and others involved in the deal.", "poster": "https://m.media-amazon.com/images/M/MV5BMTMyODY1NTg1N15BMl5BanBnXkFtZTcwMTUyODI4Mg@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1255651200000, "runtime": 109, "title": "Law Abiding Citizen", "tomatoes": {"boxOffice": "$73.3M", "consensus": "Unnecessarily violent and unflinchingly absurd, Law Abiding Citizen is plagued by subpar acting and a story that defies reason.", "critic": {"meter": 25, "numReviews": 156, "rating": 4.3}, "dvd": 1266278400000, "fresh": 39, "lastUpdated": 1442079148000, "production": "Overture Films", "rotten": 117, "viewer": {"meter": 75, "numReviews": 516152, "rating": 4}, "website": "http://www.lawabidingcitizenfilm.com/"}, "type": "movie", "writers": ["Kurt Wimmer"], "year": 2009}