{"_id": "573a13b0f29313caabd35268", "awards": {"nominations": 11, "text": "4 wins & 11 nominations.", "wins": 4}, "cast": ["Bill Murray", "Julie Delpy", "Heather Simms", "Brea Frazier"], "countries": ["USA", "France"], "directors": ["Jim Jarmusch"], "fullplot": "The resolutely single Don Johnston has just been dumped by his latest lover, Sherry. Don resigns himself to being alone yet again and left to his own devices. Instead, he is compelled to reflect on his past when he receives by mail a mysterious pink letter. It is from an anonymous former lover and informs him that he has a 19-year-old son who may now be looking for his father. Don is urged to investigate this \"mystery\" by his closest friend and neighbor, Winston, an amateur sleuth and family man. Hesitant to travel at all, Don nonetheless embarks on a cross-country trek in search of clues from four former flames. Unannounced visits to each of these unique women hold new surprises for Don as he haphazardly confronts both his past and, consequently, his present.", "genres": ["Comedy", "Drama", "Mystery"], "imdb": {"id": 412019, "rating": 7.2, "votes": 77084}, "languages": ["English"], "lastupdated": "2015-09-11 00:01:34.823000000", "metacritic": 79, "plot": "As the extremely withdrawn Don Johnston is dumped by his latest woman, he receives an anonymous letter from a former lover informing him that he has a son who may be looking for him. A freelance sleuth neighbor moves Don to embark on a cross-country search for his old flames in search of answers.", "poster": "https://m.media-amazon.com/images/M/MV5BMTQ4OTk1MTYxM15BMl5BanBnXkFtZTcwMTYwNjAzMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1125014400000, "runtime": 106, "title": "Broken Flowers", "tomatoes": {"boxOffice": "$13.6M", "consensus": "Bill Murray's subtle and understated style complements director Jim Jarmusch's minimalist storytelling in this quirky, but deadpan comedy.", "critic": {"meter": 88, "numReviews": 186, "rating": 7.5}, "dvd": 1136246400000, "fresh": 163, "lastUpdated": 1442081025000, "production": "Focus Features", "rotten": 23, "viewer": {"meter": 70, "numReviews": 94784, "rating": 3.3}, "website": "http://www.brokenflowersmovie.com/"}, "type": "movie", "writers": ["Jim Jarmusch", "Bill Raden (inspired by an idea from)", "Sara Driver (inspired by an idea from)"], "year": 2005}