{"_id": "573a1392f29313caabcd9f00", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Paul Robeson", "Dudley Digges", "Frank H. Wilson", "Fredi Washington"], "countries": ["USA"], "directors": ["Dudley Murphy", "William C. de Mille"], "fullplot": "At a Baptist prayer meeting, the preacher leads a prayer for Brutus Jones, who is leaving to become a railway porter. Jones joins the congregation in a spiritual. Once on the train, Jeff, a porter, shows Jones the ropes. Jones secretly takes up with Jeff's girl, Undine. He makes some money in a deal with a rich businessman on the train. Jones proves to be a cunning manipulator and a good liar. In a crap game, Jones stabs Jeff over a pair of loaded dice. Now doing hard labour, Jones kills a white prison guard and escapes. Shovelling coal on a ship in the Caribbean, Jones swims to an island. He is brought before the island's ruler, where Smithers, a crooked white trader, buys his freedom. Jones schemes his way into a partnership in Smithers' business, then finally control of the entire island through a touch of witchcraft, or so it seems. Brutus declares himself to be The Emperor Jones... Smithers reports on the unrest that Jones' rule is causing. One morning, the palace is empty of servants. As rebel drums beat, Jones flees into the forest where he is haunted by visions from his past...", "genres": ["Drama"], "imdb": {"id": 23985, "rating": 6.5, "votes": 609}, "languages": ["English"], "lastupdated": "2015-06-23 00:15:38.917000000", "plot": "Unscrupulously ambitious Brutus Jones escapes from jail after killing a guard and through bluff and bravado finds himself the emperor of a Caribbean island.", "poster": "https://m.media-amazon.com/images/M/MV5BMTQ5NzQ2ODY3Nl5BMl5BanBnXkFtZTgwNzIyMzQwMjE@._V1_SY1000_SX677_AL_.jpg", "rated": "PASSED", "released": -1144195200000, "runtime": 72, "title": "The Emperor Jones", "tomatoes": {"critic": {"meter": 83, "numReviews": 6, "rating": 7.4}, "dvd": 1069718400000, "fresh": 5, "lastUpdated": 1439577718000, "production": "American Pop Classics", "rotten": 1, "viewer": {"meter": 56, "numReviews": 427, "rating": 3.3}}, "type": "movie", "writers": ["Eugene O'Neill (play)", "DuBose Heyward (screenplay)"], "year": 1933}