{"_id": "573a13c5f29313caabd6e7a4", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Iko Uwais", "Sisca Jessica", "Christine Hakim", "Mads Koudal"], "countries": ["Indonesia"], "directors": ["Gareth Evans"], "fullplot": "In Minangkabau, West Sumatera, Yuda a skilled practitioner of Silat Harimau is in the final preparations to begin his \"Merantau\" a century's old rites-of-passage to be carried out by the community's young men that will see him leave the comforts of his idyllic farming village and make a name for himself in the bustling city of Jakarta. After a series of setbacks leave Yuda homeless and uncertain about his new future, a chance encounter results in him defending the orphaned Astri from becoming the latest victim of a European human trafficking ring led by the wildly psychotic, Ratger and his right-hand man Lars. With Ratger injured in the mèlèe and seeking both his \"merchandise\" and bloody retribution, Yuda's introduction to this bustling city is a baptism of fire as he is forced to go on the run with Astri and her younger brother Adit as all the pimps and gangsters that inhabit the night hound the streets chasing their every step. With escape seemingly beyond their grasp, Yuda has no choice but to face his attackers in an adrenaline charged, jaw-dropping finale.", "genres": ["Action", "Drama"], "imdb": {"id": 1368116, "rating": 6.8, "votes": 6775}, "languages": ["Indonesian", "English"], "lastupdated": "2015-08-18 01:00:36", "num_mflix_comments": 1, "plot": "In Minangkabau, West Sumatera, Yuda a skilled practitioner of Silat Harimau is in the final preparations to begin his \"Merantau\" a century's old rites-of-passage to be carried out by the ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTc4NDM3MDg4OV5BMl5BanBnXkFtZTcwNTM3ODc4Mg@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1257379200000, "runtime": 134, "title": "Merantau", "tomatoes": {"dvd": 1315267200000, "lastUpdated": 1440096647000, "production": "Pt. Merantau Films", "viewer": {"meter": 62, "numReviews": 2729, "rating": 3.5}}, "type": "movie", "writers": ["Gareth Evans", "Daiwanne Ralie (translation)"], "year": 2009}