{"_id": "573a13b6f29313caabd474d7", "awards": {"nominations": 18, "text": "Nominated for 1 Oscar. Another 5 wins & 18 nominations.", "wins": 6}, "cast": ["Peter O'Toole", "Leslie Phillips", "Beatrice Savoretti", "Philip Fox"], "countries": ["UK"], "directors": ["Roger Michell"], "fullplot": "Maurice Russell, once a great actor, is now living in London in the twilight of his life. Those of his generation remember him fondly, while those in the younger generations have no idea who he is. He spends most of his time hanging out with his friends Ian, also an actor, and Donald, or visiting with his wife Valerie for who he has great affection but with who he no longer lives. His acting career is virtually over, he only taking roles on the odd occasion when he needs the money. Ian has decided to invite his young great-niece Jessie from the provinces to come and stay with him, basically to act as his caregiver in case he falls ill, but also to be his companion. He envisions listening to Bach with her and her cooking him food to which he is accustomed. Jessie's stay is nothing as he envisions. She doesn't know how to cook, she drinks all his alcohol, and she has unrealistic visions of what she will accomplish in her life. Maurice, however, sees in Jessie, a person who can help him recapture part of his youth and vigor, including more fully realizing his thoughts of sex. Maurice calls her Venus, after one of his favorite paintings. As Maurice and Jessie spend more time together, they use each other to get what they want. But it isn't until Maurice approaches the end of his life will either understand if what they have is true friendship.", "genres": ["Comedy", "Drama", "Romance"], "imdb": {"id": 489327, "rating": 7.1, "votes": 10813}, "languages": ["English"], "lastupdated": "2015-09-16 06:10:50.827000000", "metacritic": 82, "num_mflix_comments": 4, "plot": "Life for a pair of veteran actors gets turned upside down after they meet a brash teenager.", "poster": "https://m.media-amazon.com/images/M/MV5BMTQ1ODQ4MDg0OV5BMl5BanBnXkFtZTcwOTk5NDQ0MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1171584000000, "runtime": 95, "title": "Venus", "tomatoes": {"boxOffice": "$3.3M", "consensus": "Audiences may attend to witness Peter O'Toole's Oscar-worthy performance, but they'll also be treated to a humane, tender exploration of maturing with both dignity and irreverence.", "critic": {"meter": 89, "numReviews": 149, "rating": 7.3}, "dvd": 1179792000000, "fresh": 132, "lastUpdated": 1441218961000, "production": "Miramax Films", "rotten": 17, "viewer": {"meter": 74, "numReviews": 11266, "rating": 3.6}, "website": "http://www.venus-themovie.com/"}, "type": "movie", "writers": ["Hanif Kureishi"], "year": 2006}