{"_id": "573a13aaf29313caabd22342", "awards": {"nominations": 38, "text": "Nominated for 1 Oscar. Another 11 wins & 38 nominations.", "wins": 12}, "cast": ["Eric Sykes", "Timothy Spall", "David Tennant", "Daniel Radcliffe"], "countries": ["UK", "USA"], "directors": ["Mike Newell"], "fullplot": "Harry's fourth year at Hogwarts is about to start and he is enjoying the summer vacation with his friends. They get the tickets to The Quidditch World Cup Final but after the match is over, people dressed like Lord Voldemort's 'Death Eaters' set a fire to all the visitors' tents, coupled with the appearance of Voldemort's symbol, the 'Dark Mark' in the sky, which causes a frenzy across the magical community. That same year, Hogwarts is hosting 'The Triwizard Tournament', a magical tournament between three well-known schools of magic : Hogwarts, Beauxbatons and Durmstrang. The contestants have to be above the age of 17, and are chosen by a magical object called Goblet of Fire. On the night of selection, however, the Goblet spews out four names instead of the usual three, with Harry unwittingly being selected as the Fourth Champion. Since the magic cannot be reversed, Harry is forced to go with it and brave three exceedingly difficult tasks.", "genres": ["Adventure", "Family", "Fantasy"], "imdb": {"id": 330373, "rating": 7.6, "votes": 346759}, "languages": ["English", "French"], "lastupdated": "2015-09-12 00:02:01.107000000", "metacritic": 81, "num_mflix_comments": 359, "plot": "Harry finds himself mysteriously selected as an under-aged competitor in a dangerous tournament between three schools of magic.", "poster": "https://m.media-amazon.com/images/M/MV5BMTI1NDMyMjExOF5BMl5BanBnXkFtZTcwOTc4MjQzMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1132272000000, "runtime": 157, "title": "Harry Potter and the Goblet of Fire", "tomatoes": {"boxOffice": "$290.0M", "consensus": "The main characters are maturing, and the filmmakers are likewise improving on their craft; vibrant special effects and assured performances add up to what is the most complex yet of the Harry Potter films.", "critic": {"meter": 88, "numReviews": 246, "rating": 7.5}, "dvd": 1141689600000, "fresh": 217, "lastUpdated": 1442079868000, "production": "Warner Bros. Pictures", "rotten": 29, "viewer": {"meter": 74, "numReviews": 34148873, "rating": 3.4}, "website": "http://harrypotter.warnerbros.com/gobletoffire/"}, "type": "movie", "writers": ["Steve Kloves (screenplay)", "J.K. Rowling (novel)"], "year": 2005}