{"_id": "573a13bff29313caabd5fec3", "awards": {"nominations": 6, "text": "6 wins & 6 nominations.", "wins": 6}, "cast": ["Rafael Morais", "Daniel Duval", "Joana de Verona", "Beatriz Batarda"], "countries": ["Portugal"], "directors": ["Marco Martins"], "fullplot": "In a house, the last trace of a Lisbon that has long disappeared, Guilherme and Sofia grow up sharing experiences and slowly discovering their sexuality. Guilherme, sheltered in a female universe, unable to deal with the uncorresponded love of his sister and her relationships with other boys, ends up running away. After the death of his grandmother Clara, Guilherme refugees himself in his father's house, who is immersed in a almost autistic world, which leaves him increasingly isolated. Guilherme discovers that life can not be held in a perfect circle and returns home. When the twins finally meet, they rediscover the sexual tension that surrounded them since the beginning, and love finally takes shape. \"How To Draw a Perfect Circle\" is intimate and silent in style, offering the pleasure of exploring the limits, creating a closed, claustrophobic universe, innocent and contagious in the simplicity of its emotions, where everyday situations become at times brutal, cruel, yet infused with a strangely perverse beauty.", "genres": ["Drama"], "imdb": {"id": 1138478, "rating": 5.9, "votes": 389}, "languages": ["Portuguese", "French"], "lastupdated": "2015-08-18 00:35:33.860000000", "num_mflix_comments": 2, "plot": "Guilherme and Sofia, brother and sister, grow up sharing experiences and slowly discovering their sexuality. The thing that Sofia doesn't know is how far Guilherme will go to keep her inside his own perverse, dark and perfect circle.", "poster": "https://m.media-amazon.com/images/M/MV5BMzc0NDE4MjE2OF5BMl5BanBnXkFtZTcwMzc0NDU4Mw@@._V1_SY1000_SX677_AL_.jpg", "released": 1273104000000, "runtime": 122, "title": "How to Draw a Perfect Circle", "tomatoes": {"lastUpdated": 1437071860000, "viewer": {"numReviews": 11, "rating": 3.6}}, "type": "movie", "writers": ["Marco Martins", "Gonèalo M. Tavares"], "year": 2009}