{"_id": "573a13a8f29313caabd1cf59", "awards": {"nominations": 1, "text": "2 wins & 1 nomination.", "wins": 2}, "cast": ["Thibault Seitz", "Maurice Lamy", "Emmanuelle Seigner", "Vittoria Scognamiglio"], "countries": ["France"], "directors": ["Franèois Hanss"], "fullplot": "Laura Bartelli is a stripper in a French bar. She retires after a moody landscape architect named Marco Tisserand asks her to abandon her life and share his. However, after her red Volkswagen runs off the road en route to the rendezvous, she ends up scarred and comatose in a hospital. Marco stays at her bedside. After some months, she awakens in a world of silence and gradually begins her new life with Marco, which is filled with affection and tenderness. She begins to love herself as much as she loves Marco. They have a son, Jeannot. Laura's deafness is more an irritation than an impediment and six years pass in family harmony. However, when Jeannot displays an unusual dysfunction at school, she goes to see a psychologist in Lyon, and shows a photograph of her son with his father. The psychologist recognizes Marco as a former university student colleague and tells her that he is a doctor a doctor with a past and even darker intentions for her and their child.", "genres": ["Thriller"], "imdb": {"id": 308131, "rating": 6.1, "votes": 601}, "languages": ["French"], "lastupdated": "2015-06-21 00:02:05.177000000", "num_mflix_comments": 1, "plot": "Laura Bartelli is a stripper in a French bar. She retires after a moody landscape architect named Marco Tisserand asks her to abandon her life and share his. However, after her red ...", "poster": "https://m.media-amazon.com/images/M/MV5BMjAyOTY0MzM2NV5BMl5BanBnXkFtZTgwMjM2NTAzMTE@._V1_SY1000_SX677_AL_.jpg", "released": 1051056000000, "runtime": 101, "title": "Body to Body", "tomatoes": {"dvd": 1029196800000, "lastUpdated": 1431713996000, "viewer": {"meter": 0, "numReviews": 56, "rating": 1.4}}, "type": "movie", "writers": ["Arthur-Emmanuel Pierre"], "year": 2003}