{"_id": "573a13a8f29313caabd1c4a4", "awards": {"nominations": 39, "text": "Nominated for 1 Oscar. Another 33 wins & 39 nominations.", "wins": 34}, "cast": ["Chris Ambrose", "Joey Krajcar", "Josh Hutcherson", "Cameron Carter"], "countries": ["USA"], "directors": ["Shari Springer Berman", "Robert Pulcini"], "fullplot": "Harvey Pekar is file clerk at the local VA hospital. His interactions with his co-workers offer some relief from the monotony, and their discussions encompass everything from music to the decline of American culture to new flavors of jellybeans and life itself. At home, Harvey fills his days with reading, writing and listening to jazz. His apartment is filled with thousands of books and LPs, and he regularly scours Cleveland's thrift stores and garage sales for more, savoring the rare joy of a 25-cent find. It is at one of these junk sales that Harvey meets Robert Crumb, a greeting card artist and music enthusiast. When, years later, Crumb finds international success for his underground comics, the idea that comic books can be a valid art form for adults inspires Harvey to write his own brand of comic book. An admirer of naturalist writers like Theodore Dreiser, Harvey makes his American Splendor a truthful, unsentimental record of his working-class life, a warts-and-all self portrait. First published in 1976, the comic earns Harvey cult fame throughout the 1980s and eventually leads him to the sardonic Joyce Barber, a partner in a Delaware comic book store who end ups being Harvey's true soul mate as they experience the bizarre byproducts of Harvey's cult celebrity stature.", "genres": ["Biography", "Comedy", "Drama"], "imdb": {"id": 305206, "rating": 7.5, "votes": 40321}, "languages": ["English"], "lastupdated": "2015-09-04 00:23:46.477000000", "metacritic": 90, "num_mflix_comments": 1, "plot": "An original mix of fiction and reality illuminates the life of comic book hero everyman Harvey Pekar.", "poster": "https://m.media-amazon.com/images/M/MV5BMjA0MjYxNjY1MV5BMl5BanBnXkFtZTcwNDkwMjAwMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1063324800000, "runtime": 101, "title": "American Splendor", "tomatoes": {"boxOffice": "$6.0M", "consensus": "Exhilarating both stylistically and for its entertaining, moving portrayal of an everyman, American Splendor is a portrait of a true underground original.", "critic": {"meter": 94, "numReviews": 181, "rating": 8.3}, "dvd": 1224288000000, "fresh": 170, "lastUpdated": 1440353159000, "production": "Fine Line Features", "rotten": 11, "viewer": {"meter": 86, "numReviews": 44077, "rating": 3.7}, "website": "http://www.americansplendormovie.com/main.html"}, "type": "movie", "writers": ["Harvey Pekar (comic book series American Splendor)", "Joyce Brabner (comic book series Our Cancer Year)", "Shari Springer Berman", "Robert Pulcini"], "year": 2003}