{"_id": "573a13aaf29313caabd219c8", "awards": {"nominations": 8, "text": "Nominated for 4 Primetime Emmys. Another 4 nominations.", "wins": 0}, "cast": ["Ioan Gruffudd", "Robert Lindsay", "Paul McGann", "Greg Wise"], "countries": ["UK"], "directors": ["Andrew Grieve"], "fullplot": "The war with France has been over for a year and Horatio Hornblower finds himself on land. With his ship, the Retribution, laid up and his promotion to Commander rescinded as a result, he finds himself a poor Lieutenant in a peace time navy. He has taken to playing cards to make a living. Luck presents itself in the form Sir Edward Pellew, his mentor and former commanding officer. Horatio soon finds himself again promoted to Commander and in charge of a sloop, the HMS Hotspur. He recruits his old shipmate Lt. Bush as his first officer, along with Matthews and Stiles. His task is to transport a French officer to the coast but once ashore, Horatio discovers the French amassing an invasion force. Once again at war, the men of the Hotspur are tasked to lead an advance force against a shore battery ahead of the British fleet. Hornblower soon realizes he has a traitor among his crew. In his personal life, he has to deal with the lovely Maria, his landlady's daughter who has taken quite a liking to him", "genres": ["Adventure", "Drama", "War"], "imdb": {"id": 327890, "rating": 8.2, "votes": 2180}, "languages": ["English"], "lastupdated": "2015-08-05 00:24:31.083000000", "num_mflix_comments": 2, "plot": "Hornblower is given a dangerous mission to deliver an emigre French nobleman to a secret rendezvous near Brest while coping with enemy agents in his own ranks.", "poster": "https://m.media-amazon.com/images/M/MV5BMjAzMjYwMDIwNl5BMl5BanBnXkFtZTcwMjY1MjQyMQ@@._V1_SY1000_SX677_AL_.jpg", "released": 1070323200000, "runtime": 125, "title": "Horatio Hornblower 3", "tomatoes": {"dvd": 1071100800000, "lastUpdated": 1434133933000, "viewer": {"meter": 93, "numReviews": 600, "rating": 4.2}}, "type": "movie", "writers": ["C.S. Forester (novel)", "Niall Leonard (screenplay)"], "year": 2003}