{"_id": "573a1395f29313caabce1ec2", "awards": {"nominations": 5, "text": "Nominated for 1 Oscar. Another 6 wins & 5 nominations.", "wins": 7}, "cast": ["Cary Grant", "Audrey Hepburn", "Walter Matthau", "James Coburn"], "countries": ["USA"], "directors": ["Stanley Donen"], "fullplot": "Regina Lampert, a Paris based American, has decided to divorce her Swiss husband, Charles Lampert, because of the secrets and lies that have pervaded their marriage, she coming to the conclusion that she no longer loves him and really knows nothing about him. Before she can make that request to Charles, he is found dead, seemingly pushed off a Paris to Bordeaux train. While Regina was on holiday in Megève, Charles sold all their possessions making $250,000 in the process, and seemed to be on his way to the coast to leave the country for South America probably for good. The money, however, was not among his possessions on the train, those possessions which are returned to Regina. Regina further learns from Hamilton Bartholomew of the CIA that they were after him, Charles Lampert only the primary alias he has been using of late. During WWII, Charles, a member of the Office of Strategic Services (OSS), absconded with $250,000 worth of their gold bars that were destined for the French Resistance. The US government wants that money back. Charles had a few partners in crime among the OSS, namely four men: Tex Panthollow, Leopold Gideon, Herman Scobie and Carson Dyle. Besides Dyle who died in the war, Regina knows the other three men are still alive, as she recognized them from a photograph as the three unknown men who attended Charles' funeral. They are now after her as they also want the money which they believe she has, and will kill to get it. She knows nothing about the money, but realizes that it is her duty to find it to return it to its rightful owner, namely the US government, and that it may save her life from Charles' partners. Clues to the money's whereabouts may be among those possessions Charles had on the train. Coming to Regina's aid is Peter Joshua, a man she met while she was in Megève. As Peter helps her, she quickly falls in love with him, and he seemingly with her. Shortly thereafter, she also comes to the realization that Peter is keeping as many secrets as Charles did, and as such he is a person she perhaps should not be trusting.", "genres": ["Comedy", "Mystery", "Romance"], "imdb": {"id": 56923, "rating": 8, "votes": 45898}, "languages": ["English", "French", "German", "Italian"], "lastupdated": "2015-09-02 00:35:00.897000000", "num_mflix_comments": 1, "plot": "Romance and suspense in Paris, as a woman is pursued by several men who want a fortune her murdered husband had stolen. Who can she trust?", "poster": "https://m.media-amazon.com/images/M/MV5BMTA0Y2UyMDUtZGZiOS00ZmVkLTg3NmItODQyNTY1ZjU1MWE4L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": -191721600000, "runtime": 113, "title": "Charade", "tomatoes": {"critic": {"meter": 92, "numReviews": 36, "rating": 8.1}, "dvd": 876787200000, "fresh": 33, "lastUpdated": 1442510432000, "production": "Madacy Entertainment", "rotten": 3, "viewer": {"meter": 92, "numReviews": 42305, "rating": 4.1}}, "type": "movie", "writers": ["Peter Stone (screenplay)", "Peter Stone (story)", "Marc Behm (story)"], "year": 1963}