{"_id": "573a1395f29313caabce27ef", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Soumitra Chatterjee", "Madhabi Mukherjee", "Haradhan Bannerjee", "Santi Chatterjee"], "countries": ["India"], "directors": ["Satyajit Ray"], "fullplot": "Amitabha Roy (Soumitra Chatterjee), a sriptwriter has a breakdown near a tea-estate and he is offered a place to stay by the estate manager (Haradhan Banerjee) at his bungalow. When he reaches, Amitabha finds out that the manager is married to his ex-girlfriend, Karuna (Madhabi Mukherjee). The manager has invited Amitabha to assuage his own boredom # and fails to notice the uneasiness between his wife and the guest. The plot unfolds over a period of approximately one-day when they have dinner, breakfast and go for a picnic # and small gestures rekindle Amitabha's memories. Through a series of flashbacks, he remembers their first meeting, courtship and separation (which was solely because of his lack of courage to make a commitment). Amitabha's current affluence and his suspicion of Karuna's unhappiness leads him to propose to Karuna once again but she is inclined to believe that the time to muster up courage has gone past.", "genres": ["Drama", "Romance"], "imdb": {"id": 59348, "rating": 7.8, "votes": 613}, "languages": ["Bengali", "Hindi"], "lastupdated": "2015-08-22 00:54:29.470000000", "plot": "Amitabha Roy (Soumitra Chatterjee), a sriptwriter has a breakdown near a tea-estate and he is offered a place to stay by the estate manager (Haradhan Banerjee) at his bungalow. When he ...", "poster": "https://m.media-amazon.com/images/M/MV5BYTNjN2JlMWQtOGMyMi00NWY0LWE2YzctMzhlZjZhMjQ1MDY0XkEyXkFqcGdeQXVyNTgyNTA4MjM@._V1_SY1000_SX677_AL_.jpg", "released": -146880000000, "runtime": 74, "title": "The Coward", "tomatoes": {"dvd": 1170720000000, "lastUpdated": 1440615878000, "production": "R.D.Banshal & Co.", "viewer": {"meter": 86, "numReviews": 193, "rating": 4.1}}, "type": "movie", "writers": ["Premendra Mitra (story)", "Satyajit Ray (screenplay)"], "year": 1965}