{"_id": "573a13cef29313caabd8745d", "awards": {"nominations": 7, "text": "7 nominations.", "wins": 0}, "cast": ["Ajith Kumar", "Arjun", "Trisha Krishnan", "Premgi Amaren"], "countries": ["India"], "directors": ["Venkat Prabhu"], "fullplot": "Mankatha is a racy and adrenaline-rushing story of a Maharashtra police officer Vinayak Mahadevan (Ajith) who is suspended for helping a smuggler to escape from police encounter. He starts leading life in his own way. He falls for Sanjana (Trisha), daughter of an influential local goon Arumuga Chettiyar (Jayaprakash) in Mumbai. A tough cop Prithvi (Arjun) takes charge to end betting scandal in IPL cricket in Mumbai. Arumuga uses his links with dons in Mumbai tries to route through his old theatre, a cash of over Rs 500 crore to be used in betting. Sumanth (Vaibhav), a goon working for Arumuga Chettiyarplans to take away the booty with the help of his friends Ganesh (Ashwin), Mahanth (Mahanth), who owns a bar in Mumbai and Prem (Premji), a IIT graduate. Vinayak joins the race. he promises to help them and divide it between them. Trouble starts after they take away the cash. Both Arumugha Chettiyar and police are now on their heels. Meanwhile, Mahanth and Prem escape with the cash. It all upto Vinayak now. The battle shifts between him and Prithvi.", "genres": ["Action", "Crime", "Thriller"], "imdb": {"id": 1705772, "rating": 7.5, "votes": 7581}, "languages": ["Tamil"], "lastupdated": "2015-09-03 00:31:19.523000000", "num_mflix_comments": 1, "plot": "Vinayak and his 4 team members rob a booty of 500 crores INR. Trouble starts when two of the team betrays them.", "poster": "https://m.media-amazon.com/images/M/MV5BNmRjN2E2MTUtMmVkNC00MzEzLTkzODgtZTM0NzI0ZDJkM2YyXkEyXkFqcGdeQXVyODIwMDI1NjM@._V1_SY1000_SX677_AL_.jpg", "released": 1314748800000, "runtime": 155, "title": "Mankatha", "tomatoes": {"lastUpdated": 1439664774000, "production": "Bharat Creations", "viewer": {"meter": 50, "numReviews": 55, "rating": 3.4}}, "type": "movie", "writers": ["Venkat Prabhu"], "year": 2011}