{"_id": "573a13b5f29313caabd426eb", "awards": {"nominations": 15, "text": "20 wins & 15 nominations.", "wins": 20}, "cast": ["Kang-ho Song", "Hie-bong Byeon", "Hae-il Park", "Doona Bae"], "countries": ["South Korea"], "directors": ["Joon-ho Bong"], "fullplot": "The film revolves around Park Hee-bong, a man in his late 60s. He runs a small snack bar on the banks of the Han River and lives with his two sons, one daughter, and one granddaughter. The Parks seem to lead a quite ordinary and peaceful life, but maybe they are a bit poorer than the average Seoulite. Hee-bong's elder son Gang-du is an immature and incompetent man in his 40s, whose wife left home long ago. Nam-il is the youngest son, an unemployed grumbler, and daughter Nam-joo is an archery medalist and member of the national team. One day, an unidentified monster suddenly appears from the depths of the Han River and spreads panic and death, and Gang-du's daughter Hyun-seo is carried off by the monster and disappears. All of the family members are in a great agony because they lost someone very dear to them. But when they find out she is still alive, they resolve to save her.", "genres": ["Horror", "Sci-Fi"], "imdb": {"id": 468492, "rating": 7, "votes": 63580}, "languages": ["Korean", "English"], "lastupdated": "2015-08-28 00:03:17.393000000", "metacritic": 85, "plot": "A monster emerges from Seoul's Han River and focuses its attention on attacking people. One victim's loving family does what it can to rescue her from its clutches.", "poster": "https://m.media-amazon.com/images/M/MV5BMTYyNTAwOTUyNl5BMl5BanBnXkFtZTYwODY0MTQ3._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1175212800000, "runtime": 120, "title": "The Host", "tomatoes": {"boxOffice": "$2.0M", "consensus": "As populace pleasing as it is intellectually satisfying, The Host combines scares, laughs, and satire into a riveting, monster movie.", "critic": {"meter": 92, "numReviews": 146, "rating": 7.7}, "dvd": 1185235200000, "fresh": 135, "lastUpdated": 1442510355000, "production": "Magnolia Pictures", "rotten": 11, "viewer": {"meter": 72, "numReviews": 176245, "rating": 3.4}, "website": "http://www.hostmovie.com/"}, "type": "movie", "writers": ["Joon-ho Bong (screenplay)", "Won-jun Ha (screenplay)", "Chul-hyun Baek (screenplay)"], "year": 2006}