{"_id": "573a13bff29313caabd5e38c", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Javier Beltrèn", "Robert Pattinson", "Matthew McNulty", "Marina Gatell"], "countries": ["UK", "Spain"], "directors": ["Paul Morrison"], "fullplot": "In 1922, Madrid is wavering on the edge of change as traditional values are challenged by the dangerous new influences of Jazz, Freud and the avant-garde. Salvador Dali arrives at the university; 18 years old and determined to become a great artist. His bizarre blend of shyness and rampant exhibitionism attracts the attention of two of the university's social elite - Federico Garcia Lorca and Luis Bunel. Salvador is absorbed into their youthfully decadent group and for a time Salvador, Luis and Federico become a formidable trio, the most ultra-modern group in Madrid. However as time passes, Salvador feels and increasingly strong pull towards the charismatic Federico - who is himself oblivious of the attentions he is getting from his beautiful writer friend, Magdalena. In the face of his friends' preoccupations - and Federico's growing renown as a poet - Luis sets off for Paris in search of his own artistic success. Federico and Salvador spend the holiday in the sea-side town of Cadaques. Both the idyllic surroundings and the warmth of the Dali family sweep Federico off his feet. Salvador and Frederico draw closer, sharing their deepest beliefs, inspirations and secrets, convinced that they have found a kind of friendship not dreamed of by others. It is more that a meeting of the minds; it is a fusion of souls.", "genres": ["Biography", "Drama", "Romance"], "imdb": {"id": 1104083, "rating": 6.6, "votes": 7012}, "languages": ["English", "Spanish"], "lastupdated": "2015-09-12 00:30:08.403000000", "metacritic": 41, "plot": "About the young life and loves of artist Salvador Dalè, filmmaker Luis Buèuel and writer Federico Garcèa Lorca.", "poster": "https://m.media-amazon.com/images/M/MV5BMTgxOTM0NjcyOV5BMl5BanBnXkFtZTcwMDE0MDAwMg@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1241740800000, "runtime": 112, "title": "Little Ashes", "tomatoes": {"boxOffice": "$0.4M", "consensus": "It has a beautiful cast, but Little Ashes suffers from an uneven tone and a surplus of unintentionally silly moments.", "critic": {"meter": 24, "numReviews": 68, "rating": 4.1}, "dvd": 1264464000000, "fresh": 16, "lastUpdated": 1441912728000, "production": "Regent Releasing", "rotten": 52, "viewer": {"meter": 48, "numReviews": 79190, "rating": 3}, "website": "http://www.littleashes-themovie.com/"}, "type": "movie", "writers": ["Philippa Goslett"], "year": 2008}