{"_id": "573a13a1f29313caabd07070", "awards": {"nominations": 0, "text": "2 wins.", "wins": 2}, "cast": ["Urmila Matondkar", "Aftab Shivdasani", "Dalip Tahil", "Smita Jaykar"], "countries": ["India"], "directors": ["Ram Gopal Varma"], "fullplot": "Krishnakant Mathur (Aftab Shivdasani) alias \"kittu\", works in a restaurant, which is located right opposite the bunglow of famous movie actress, Mallika (Urmilla Matondkar). Kittu, simply put, is only a fan, but is smitten by Mallika, almost to the point of obsession. He does get to meet her at Mehboob Studios, and speak with Mallika herself. Before he could finish speaking with her, he is rudely interrupted by Tolluram, Manisha's uncle (Govind Namdeo), who insults and humiliates him and tells him to leave. Kittu is confused at this, and gets appalled and concerned about Mallika, when he learns that her life is being controlled by her uncle, aunt and cousin sister. One day he witnesses her uncle beating her up, he breaks into her house, assaults the uncle, and abducts Mallika. The next day, there is furore in the media when everyone learns that an actress has been abducted. The police get involved. Kittu decides to take Mallika to his home to his parents, and does so. He hides her in his house, but decides not to tell anyone in his family about Mallika. How long will Kittu succeed in doing this? Is this what Mallika wants, or is she being taken advantage of again? How long will a famous actress hide out without anyone else coming to know her?", "genres": ["Fantasy", "Musical", "Romance"], "imdb": {"id": 214931, "rating": 5.5, "votes": 625}, "languages": ["Hindi"], "lastupdated": "2015-08-18 00:26:49.330000000", "num_mflix_comments": 2, "plot": "Krishnakant Mathur (Aftab Shivdasani) alias \"kittu\", works in a restaurant, which is located right opposite the bunglow of famous movie actress, Mallika (Urmilla Matondkar). Kittu, simply ...", "poster": "https://m.media-amazon.com/images/M/MV5BODIyZDFmZDMtNTljMC00NWM3LWFkYTAtMWM0MGUyMDQzYTRkXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY1000_SX677_AL_.jpg", "released": 939945600000, "runtime": 153, "title": "Mast", "tomatoes": {"dvd": 943920000000, "lastUpdated": 1439835012000, "viewer": {"meter": 44, "numReviews": 287, "rating": 2.9}}, "type": "movie", "writers": ["Ramesh Khatkar (dialogue)", "Ramesh Khatkar (screenplay)", "Ramesh Khatkar (story)", "Vinod Ranganathan (dialogue)", "Vinod Ranganathan (screenplay)", "Vinod Ranganathan (story)"], "year": 1999}