{"_id": "573a13b7f29313caabd491ca", "awards": {"nominations": 8, "text": "Won 2 Oscars. Another 30 wins & 8 nominations.", "wins": 32}, "cast": ["Al Gore", "Billy West"], "countries": ["USA"], "directors": ["Davis Guggenheim"], "fullplot": "Director Davis Guggenheim eloquently weaves the science of global warming with Mr. Gore's personal history and lifelong commitment to reversing the effects of global climate change.è A longtime advocate for the environment, Gore presents a wide array of facts and information in a thoughtful and compelling way.è \"Al Gore strips his presentations of politics, laying out the facts for the audience to draw their own conclusions in a charming, funny and engaging style, and by the end has everyone on the edge of their seats, gripped by his haunting message,\" said Guggenheim.è An Inconvenient Truth is not a story of despair but rather a rallying cry to protect the one earth we all share.è \"It is now clear that we face a deepening global climate crisis that requires us to act boldly, quickly, and wisely,\" said Gore.", "genres": ["Documentary"], "imdb": {"id": 497116, "rating": 7.5, "votes": 62388}, "languages": ["English"], "lastupdated": "2015-09-14 18:06:12.317000000", "metacritic": 75, "num_mflix_comments": 2, "plot": "A documentary on Al Gore's campaign to make the issue of global warming a recognized problem worldwide.", "poster": "https://m.media-amazon.com/images/M/MV5BOTg3NjYxMjM5OF5BMl5BanBnXkFtZTcwMzQzMDA0MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 1151625600000, "runtime": 96, "title": "An Inconvenient Truth", "tomatoes": {"boxOffice": "$23.7M", "consensus": "While global warming is a hotly-debated subject, what everyone on both sides can agree upon is that, if real, it's a very bad thing. Since losing the 2000 presidential election to George W. Bush, former Vice President Al Gore has busied himself by being an outspoken figure against this potential environmental disaster. As much about the man as about greenhouse gases, this candid, powerful and informative documentary illuminates some of the myths surrounding both of its subjects equally well.", "critic": {"meter": 93, "numReviews": 159, "rating": 7.7}, "dvd": 1164067200000, "fresh": 148, "lastUpdated": 1439836428000, "production": "Paramount Classics", "rotten": 11, "viewer": {"meter": 78, "numReviews": 119131, "rating": 3.6}, "website": "http://www.climatecrisis.net/"}, "type": "movie", "year": 2006}