{"_id": "573a13c5f29313caabd6eb79", "awards": {"nominations": 0, "text": "14 wins.", "wins": 14}, "cast": ["Sermet Yesil", "Tèrkè Turan", "Serkan Keskin", "Hakan Altuntas"], "countries": ["Turkey", "Bulgaria"], "directors": ["Reha Erdem"], "fullplot": "A strange man with otherworldly talents becomes both a friend and a pariah in a small Turkish town in this drama from writer and director Reha Erdem. Yahya is nearly in a panic when his young son falls into the river on a wintry day and looks lifeless when he's pulled from the water. But a stranger appears out of nowhere and takes the boy in his arms, and suddenly the child is breathing and perfectly healthy again. Yahya and his teenage daughter Neptun are grateful to the stranger, who they discover is named Kosmos, and they bring him into town, where they offer to find him a place to stay. But Kosmos, who often prefers to communicate in inarticulate noises, doesn't care for his new accommodations, and he develops a bad reputation for his habit of stealing things, his strange diet (consisting entirely of sweets), and his desire to bed as many women as possible, including Neptun. Kosmos is on the verge of being driven from the village when it's discovered that he can heal himself at will, and others as well; folks eager to have their loved ones made well again struggle to put up with Kosmos's strange ways in exchange for having a man of his talents in the community.", "genres": ["Drama", "Fantasy"], "imdb": {"id": 1371574, "rating": 7.3, "votes": 2714}, "languages": ["Turkish"], "lastupdated": "2015-09-15 05:14:10.130000000", "num_mflix_comments": 1, "plot": "A strange man with otherworldly talents becomes both a friend and a pariah in a small Turkish town in this drama from writer and director Reha Erdem. Yahya is nearly in a panic when his ...", "poster": "https://m.media-amazon.com/images/M/MV5BMjEwODdjNjUtNGVjYy00YWUxLTk0NjEtY2MwNTUwZTYyOGQ3XkEyXkFqcGdeQXVyNDA0NjY3Mzc@._V1_SY1000_SX677_AL_.jpg", "released": 1271376000000, "runtime": 122, "title": "Kosmos", "tomatoes": {"critic": {"meter": 58, "numReviews": 12, "rating": 5.1}, "fresh": 7, "lastUpdated": 1441134791000, "rotten": 5, "viewer": {"meter": 74, "numReviews": 78, "rating": 3.8}}, "type": "movie", "writers": ["Reha Erdem"], "year": 2010}