{"_id": "573a13a4f29313caabd12407", "awards": {"nominations": 2, "text": "1 win & 2 nominations.", "wins": 1}, "cast": ["Sarah Polley", "Brendan Fletcher", "Sean McCann", "Shirley Douglas"], "countries": ["Canada"], "directors": ["John Greyson"], "fullplot": "Set in Sarnia, Ontario in 1991, teenage Beatrice is a cashier at a supermarket. One night while waiting in line at a drugstore, she notices a large lump on the back of the bald head of a boy her own age. Intrigued, she follows him and he eventually and reluctantly introduces himself as Henry, explaining the lump is a malignant tumor causing his rare form of cancer. They fall in love, their passion intensified by Henry's impending surgery and the strong possibility of his death. Meanwhile, Bea and Hank have been married for 40 years with two adult children and live for the sole purpose of hurting each other. Their love burned out long ago; they're bored, bitter, depressed, and argue constantly. With nothing left but routine and resentment, Hank decides to buy a retirement home without consulting Bea, and she gets back at him by incurring financially ruinous construction and decorating expenses. Both couples are one and the same, at the beginning and end of their relationship, simultaneously existing in the same time period as if the 40 intervening years never happened and they've been stuck in time.", "genres": ["Drama"], "imdb": {"id": 262560, "rating": 6.6, "votes": 187}, "languages": ["English"], "lastupdated": "2015-08-22 00:04:19.923000000", "num_mflix_comments": 2, "plot": "Story of the same couple, first in their teenage years and then in their twilight years, paradoxically set in the same time during the backdrop of the Gulf War in the Middle East.", "released": 987811200000, "runtime": 111, "title": "The Law of Enclosures", "tomatoes": {"lastUpdated": 1437849200000, "viewer": {"meter": 40, "numReviews": 83, "rating": 3.2}}, "type": "movie", "writers": ["John Greyson", "Dale Peck (novel)"], "year": 2000}