{"_id": "573a13daf29313caabdab4be", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Antonio Banderas", "Eric Bauza", "Tim Conway", "Eddie Deezen"], "countries": ["USA"], "directors": ["Paul Tibbitt"], "fullplot": "During a fight between the Krusty Krab and Plankton, the secret formula disappears and all of Bikini Bottom goes into a terrible apocalypse. The Bikini Bottomites go crazy and they all believe that Spongebob and Plankton stole the secret formula. The two new teammates create a time machine to get the secret formula before it disappears and also go to some weird places along the way including a time paralex where they meet a time wizard named Bubbles who is a dolphin. The two later get to the time when the formula disappeared and take it back to the present day time. They then realized that it's a fake formula Plankton made when he was taking the real one and the Bikini Bottomites try to destroy Spongebob (Plankton runs away) Spongebob smells Krabby patties and so does everyone else so the Bikini Bottomites follow it (instead of destroying Spongebob) and they arrive at the bank of the surface. Everyone except Spongebob, Patrick, Mr. Krabs, Squidward, Sandy, and a stowaway Plankton go back home while the six characters that stayed are greeted by Bubbles who takes them to the surface where a pirate is selling Krabby Patties. The team learns that they can write in a magic book and it'll make whatever they write in it become true. They decide to turn themselves into superheroes and battle the pirate. Meanwhile, Plankton writes himself as a superhero too.", "genres": ["Animation", "Adventure", "Comedy"], "imdb": {"id": 2279373, "rating": 6.1, "votes": 25884}, "languages": ["English"], "lastupdated": "2015-08-25 00:04:02.603000000", "metacritic": 62, "num_mflix_comments": 1, "plot": "When a diabolical pirate above the sea steals the secret Krabby Patty formula, SpongeBob and his nemesis Plankton must team up in order to get it back.", "poster": "https://m.media-amazon.com/images/M/MV5BMjYyNDczNTE0MF5BMl5BanBnXkFtZTgwNjkzNDYxMzE@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 1423180800000, "runtime": 92, "title": "The SpongeBob Movie: Sponge Out of Water", "tomatoes": {"consensus": "The SpongeBob Movie: Sponge Out of Water won't win over many viewers who aren't fans of the show, but for the converted, it's another colorful burst of manic fun.", "critic": {"meter": 78, "numReviews": 92, "rating": 6.5}, "dvd": 1433203200000, "fresh": 72, "lastUpdated": 1441905767000, "production": "Paramount Pictures", "rotten": 20, "viewer": {"meter": 55, "numReviews": 49498, "rating": 3.4}, "website": "http://www.spongebobmovie.com/"}, "type": "movie", "writers": ["Glenn Berger (screenplay)", "Jonathan Aibel (screenplay)", "Stephen Hillenburg (story)", "Paul Tibbitt (story)", "Stephen Hillenburg (series \"SpongeBob SquarePants\")"], "year": 2015}