{"_id": "573a13a4f29313caabd11fab", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Jason Mewes", "Kevin Smith", "Ben Affleck", "Jeff Anderson"], "countries": ["USA"], "directors": ["Kevin Smith"], "fullplot": "Jay and Silent Bob Strike Back is a tale of adventure on the open road. When Dante and Randal (of Clerks fame) get a restraining order to keep the punchy Jay and his hetero life-mate, Silent Bob, from selling drugs in front of the Quick Stop convenience store, their lives are suddenly empty. They find new purpose when their friend, Brodie, informs them a movie is being made featuring two infamous characters based on their likenesses. After visiting one of the creators of the Bluntman and Chronic, Holden McNeil, they set out to get what fat movie cash they deserve and hopefully put an end to people slandering them on the Internet. Along the way, they learn the rules of the road from a hitchhiking George Carlin, ride with a group of gorgeous jewel thieves, and incur the wrath of a hapless wildlife marshal for liberating an orangutan named Suzanne. The quest takes them from New Jersey to Hollywood where a showdown involving the police, the jewel thieves, and the Bluntman and Chronic filmmakers will decide the fate of Suzanne, Jay, Silent Bob, and their good names.", "genres": ["Comedy"], "imdb": {"id": 261392, "rating": 6.9, "votes": 122155}, "languages": ["English"], "lastupdated": "2015-09-11 00:46:47.517000000", "metacritic": 51, "plot": "The comic 'Bluntman and Chronic' is based on real-life stoners Jay and Silent Bob, so when they get no profit from a big-screen adaptation they set out to wreck the movie.", "poster": "https://m.media-amazon.com/images/M/MV5BY2EyYWEwZmQtZWU0Yy00M2Y3LThiZTktOTQxZDUxY2ZjOTYwXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 998611200000, "runtime": 104, "title": "Jay and Silent Bob Strike Back", "tomatoes": {"boxOffice": "$29.9M", "consensus": "Fans can expect a good laugh as the cast from Smith's previous films reunite for Jay and Silent Bob's last bow. The loose plotting and crude language may be too much for others though.", "critic": {"meter": 53, "numReviews": 150, "rating": 5.7}, "dvd": 1014681600000, "fresh": 80, "lastUpdated": 1442163793000, "production": "Dimension Films", "rotten": 70, "viewer": {"meter": 75, "numReviews": 303398, "rating": 3.4}, "website": "http://newsaskew.com/va5"}, "type": "movie", "writers": ["Kevin Smith (characters)", "Kevin Smith"], "year": 2001}