{"_id": "573a13b1f29313caabd36073", "awards": {"nominations": 0, "text": "4 wins.", "wins": 4}, "cast": ["Lisa Ann Walter", "Kurtwood Smith", "Mason Gamble", "J.P. Manoux"], "countries": ["USA"], "directors": ["Mike Meiners"], "fullplot": "Dee Dee Rutherford has never been able to figure out what her father, Bill, wants from her. Like oil and water they've lived essentially separate lives for the past 15 years-Bill running his Fortune 500 company from the city and Dee Dee on the dole, chasing an endless series of outlandish adventures from his summer home. Now, on the eve of his retirement, Bill finds he's got one piece of unfinished business: to finally make an upstanding woman of his brash, neglected, and undisciplined daughter. But in laying down the law, he learns Dee Dee's capable of a lot more than he ever knew and soon finds his tactics are punishing him more than her. As Dee Dee struggles to placate her father she's confronted by the reality that she 'doesn't know how to be anybody else' but her complicated, unrefined, unsinkable, adventure-seeking self. In the end, each drives the other to the same surprising discovery of what it is Bill really wants.", "genres": ["Comedy"], "imdb": {"id": 415739, "rating": 6.8, "votes": 143}, "languages": ["English"], "lastupdated": "2015-08-13 00:00:46.630000000", "num_mflix_comments": 3, "plot": "An eccentric socialite with an knack for pulling off hopelessly wild adventures struggles when she finds herself disowned by her millionaire father and abandoned by her teenage son.", "poster": "https://m.media-amazon.com/images/M/MV5BMTY1MjcyNDIxMV5BMl5BanBnXkFtZTcwMzE0NTcyMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "runtime": 81, "title": "The Trouble with Dee Dee", "tomatoes": {"dvd": 1230595200000, "lastUpdated": 1439838833000, "production": "Cinemetro Films", "viewer": {"meter": 33, "numReviews": 33, "rating": 3.2}, "website": "http://www.deedeerutherfordmovie.com/"}, "type": "movie", "writers": ["Bob Brown (story)", "Mike Meiners"], "year": 2005}