{"_id": "573a13e7f29313caabdc6d63", "awards": {"nominations": 4, "text": "2 wins & 4 nominations.", "wins": 2}, "cast": ["Filippo Timi", "Jaouher Brahim Ben Fredj", "Dragos Costantin Toma", "Gabriel De Glaudi"], "countries": ["Italy"], "directors": ["Mirko Locatelli"], "fullplot": "Antonio and Pietro, a man and his child, alone in Milan to fight against illness. Pietro has a brain cancer, to move from South to North Italy seems to be a chance, maybe salvation. Jaber, fifteen years old, lives in Milan with a group of fellow countrymen. He's just arrived in Europe, with other immigrants escaping from North Africa, and from the clashes born with Arab Spring. The hospital, a city within a city, where everyone is forced to remain: Antonio to heal Pietro, Jaber to assist Youssef, his best friend. The disease is the pretext for a meeting between Antonio and Jaber, two scared and lonely souls, \"foreign bodies\" that are facing pain, insecurity and illegal employment, which will be setting of a changing story. Antonio will experience on his own skin, that pain has no distinctions of color, language, origin, religion or social status. And when for Antonio and Pietro will come the time to come back home, Jaber will seems less foreigner than before, the departure will be violent, their farewell so painful, suffered and unexpected.", "genres": ["Drama", "Family"], "imdb": {"id": 3107708, "rating": 6, "votes": 30}, "languages": ["Italian", "Arabic"], "lastupdated": "2015-04-12 00:13:02.350000000", "num_mflix_comments": 4, "plot": "Antonio and his son Pietro, alone in Milan to face cancer. Jaber, just fifteen, in Italy with a group of fellow countrymen. They will meet each others in the hospital. The disease is the pretext for a meeting.", "released": 1396483200000, "runtime": 98, "title": "Foreign Bodies", "tomatoes": {"lastUpdated": 1421387049000, "viewer": {"meter": 100, "numReviews": 1, "rating": 0}}, "type": "movie", "writers": ["Mirko Locatelli", "Giuditta Tarantelli"], "year": 2013}