{"_id": "573a13b7f29313caabd4ada8", "awards": {"nominations": 1, "text": "2 wins & 1 nomination.", "wins": 2}, "cast": ["Zack Bazzi", "Duncan Domey", "Ben Flanders", "Mike Moriarty"], "countries": ["USA"], "directors": ["Deborah Scranton"], "fullplot": "Straight from the front lines in Iraq, THE WAR TAPES is the first war movie filmed by soldiers themselves. These soldiers bypassed Pentagon supervised media to share their experience like never before. Funnier, spicier, and more gut wrenching than news reports, this is Operation Iraqi Freedom as filmed by Sergeant Steve Pink, Sergeant Zack Bazzi and Specialist Mike Moriarty. Steve is a wisecracking carpenter who aspires to be a writer. Zack is a Lebanese-American university student who loves to travel and is fluent in Arabic. Mike is a father who seeks honor and redemption. Each leaves a woman behind - a girlfriend, a mother and a wife. Through their candid footage, these men open their hearts and take us on an unforgettable journey, capturing camaraderie and humor along with the brutal and terrifying experiences they face. These soldiers got the story that 2,700 embedded reporters never could.", "genres": ["Documentary", "War"], "imdb": {"id": 775566, "rating": 7.3, "votes": 1117}, "languages": ["English", "Arabic"], "lastupdated": "2015-08-22 01:07:31.187000000", "metacritic": 77, "plot": "Called up for service in Iraq, several members of the National Guard were given digital video cameras. This film, edited from their footage, provides a perspective on a complex and troubled conflict.", "poster": "https://m.media-amazon.com/images/M/MV5BMTQ4OTYwODk4Ml5BMl5BanBnXkFtZTcwNTU2NzgzMQ@@._V1_SY1000_SX677_AL_.jpg", "released": 1146268800000, "runtime": 97, "title": "The War Tapes", "tomatoes": {"consensus": "Candid, eye-opening footage gives viewers a close-up -- and educational -- look at the experiences of American soldiers in Iraq, a viewpoint not normally seen.", "critic": {"meter": 98, "numReviews": 64, "rating": 7.9}, "dvd": 1177372800000, "fresh": 63, "lastUpdated": 1439320206000, "production": "SenArt Films", "rotten": 1, "viewer": {"meter": 82, "numReviews": 1745, "rating": 3.9}, "website": "http://www.thewartapes.com/"}, "type": "movie", "year": 2006}