{"_id": "573a13c3f29313caabd6af86", "awards": {"nominations": 3, "text": "1 win & 3 nominations.", "wins": 1}, "cast": ["Sean Penn", "Holt McCallany", "Wade Williams", "James Landry Hèbert"], "countries": ["USA"], "directors": ["Ruben Fleischer"], "fullplot": "It's 1949 Los Angeles, and gangster Mickey Cohen has moved in, with the intention of controlling all criminal activity in the city. He has bought local judges and police, and no one is willing to cross him or testify against him. Everyone except Seargant John O'Mara, a former World War II soldier, whose goal is to settle with his family in a peaceful Los Angeles. Police Chief William Parker decides to form a special unit whose mission is to take down Cohen, and chooses O'Mara to lead the unit. O'Mara chooses 4 cops and asks another cop and vet, Jerry Wooters to join him but Wooters is not interested. But when he witnesses the murder of a young boy by Cohen's people, he joins them, and they decide to take apart Cohen's organization. Cohen wonders if a rival is going after him, but eventually he realizes it's the cops.", "genres": ["Action", "Crime", "Drama"], "imdb": {"id": 1321870, "rating": 6.8, "votes": 162356}, "languages": ["English"], "lastupdated": "2015-08-22 00:21:35.750000000", "metacritic": 40, "num_mflix_comments": 3, "plot": "It's 1949 Los Angeles, the city is run by gangsters and a malicious mobster, Mickey Cohen. Determined to end the corruption, John O'Mara assembles a team of cops, ready to take down the ruthless leader and restore peace to the city.", "poster": "https://m.media-amazon.com/images/M/MV5BMTcwMjAyMTUzMl5BMl5BanBnXkFtZTcwODgxNzk1OA@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1357862400000, "runtime": 113, "title": "Gangster Squad", "tomatoes": {"boxOffice": "$46.0M", "consensus": "Though it's stylish and features a talented cast, Gangster Squad suffers from lackluster writing, underdeveloped characters, and an excessive amount of violence.", "critic": {"meter": 31, "numReviews": 195, "rating": 5}, "dvd": 1366675200000, "fresh": 61, "lastUpdated": 1442077863000, "production": "Warner Bros.", "rotten": 134, "viewer": {"meter": 57, "numReviews": 127712, "rating": 3.5}, "website": "http://gangstersquad.warnerbros.com/"}, "type": "movie", "writers": ["Will Beall", "Paul Lieberman (book)"], "year": 2013}