{"_id": "573a1396f29313caabce4b49", "awards": {"nominations": 3, "text": "Nominated for 5 Oscars. Another 6 wins & 3 nominations.", "wins": 11}, "cast": ["Diana Ross", "Billy Dee Williams", "Richard Pryor", "James T. Callahan"], "countries": ["USA"], "directors": ["Sidney J. Furie"], "fullplot": "Born Elinore Harris, Billie Holiday had a difficult teen and young adulthood period, which included working in brothels, both as a cleaning woman and a prostitute, and being raped. Through this difficulty, she dreamed of becoming a jazz singer. She got her initial singing break when she applied at a Harlem club that was looking for a dancer, but where she got hired as a singer. There, she met and fell in love with the suave Louis McKay. After this initial break, Billie wanted her singing career to move to the mainstream clubs in downtown Manhattan. She took a risk when she agreed to be the lead singer for the Reg Hanley Band, a primarily white group, who convinced her that she would have to make her mark in regional tours before her Manhattan dream could happen. As Billie tried to advance her career, pressures of life, including being a black woman, led to her not so secret substance abuse (especially of heroin), not so secret because of her increasingly erratic behavior, both on stage and off. As those around her, including Louis, worked to support Billie emotionally to get off drugs, Billie faced other issues, such as open narcotic use being a criminal offense, which in combination with the effects of the heroin use itself could be Billie's downfall despite her singing talent.", "genres": ["Biography", "Drama", "Music"], "imdb": {"id": 68828, "rating": 7.1, "votes": 2593}, "languages": ["English"], "lastupdated": "2015-09-15 03:47:22.157000000", "plot": "The story of the troubled life and career of the legendary Jazz singer, Billie Holiday.", "poster": "https://m.media-amazon.com/images/M/MV5BN2I4NjY5OGYtNjMyNS00Nzg4LTg3ZjEtZTc1YjMyNjhkOTRmXkEyXkFqcGdeQXVyMTMxMTY0OTQ@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 87696000000, "runtime": 144, "title": "Lady Sings the Blues", "tomatoes": {"critic": {"meter": 75, "numReviews": 12, "rating": 6.7}, "dvd": 1131408000000, "fresh": 9, "lastUpdated": 1440527817000, "production": "Paramount Pictures", "rotten": 3, "viewer": {"meter": 87, "numReviews": 7896, "rating": 3.9}}, "type": "movie", "writers": ["Chris Clark (screenplay)", "Suzanne De Passe (screenplay)", "William Dufty (book)", "Billie Holiday (book)", "Terence McCloy (screenplay)"], "year": 1972}