{"_id": "573a13c0f29313caabd62b70", "awards": {"nominations": 28, "text": "Won 1 BAFTA Film Award. Another 25 wins & 28 nominations.", "wins": 26}, "cast": ["Sam Rockwell", "Kevin Spacey", "Dominique McElligott", "Rosie Shaw"], "countries": ["UK"], "directors": ["Duncan Jones"], "fullplot": "Sam Bell has a three year contract to work for Lunar Industries. For the contract's entire duration, he is the sole employee based at their lunar station. His primary job responsibility is to harvest and periodically rocket back to Earth supplies of helium-3, the current clean and abundant fuel used on Earth. There is no direct communication link available between the lunar station and Earth, so his only direct real-time interaction is with GERTY, the intelligent computer whose function is to attend to his day to day needs. With such little human contact and all of it indirect, he feels that three years is far too long to be so isolated; he knows he is beginning to hallucinate as the end of his three years approaches. All he wants is to return to Earth to be with his wife Tess and their infant daughter Eve, who was born just prior to his leaving for this job. With two weeks to go, he gets into an accident at one of the mechanical harvesters and is rendered unconscious. Injured, he awakens back at the station in the infirmary, he assumes assisted by GERTY. GERTY tells him that a rescue team named Eliza will come to the station to clean up the aftermath of the accident. After his recuperation, he takes an unauthorized trip back to the broken harvester, where he makes an unexpected discovery. Because of his find, he begins to doubt his sanity, then his true identity, then the company and GERTY's willingness to do what is best for him. Because of his resulting beliefs, his sole mission becomes how to get back to Earth on his own.", "genres": ["Drama", "Sci-Fi"], "imdb": {"id": 1182345, "rating": 8, "votes": 233645}, "languages": ["English", "Spanish"], "lastupdated": "2015-09-04 00:01:26.053000000", "metacritic": 67, "plot": "Astronaut Sam Bell has a quintessentially personal encounter toward the end of his three-year stint on the Moon, where he, working alongside his computer, GERTY, sends back to Earth parcels of a resource that has helped diminish our planet's power problems.", "poster": "https://m.media-amazon.com/images/M/MV5BMTgzODgyNTQwOV5BMl5BanBnXkFtZTcwNzc0NTc0Mg@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1247184000000, "runtime": 97, "title": "Moon", "tomatoes": {"boxOffice": "$4.8M", "consensus": "Boosted by Sam Rockwell's intense performance, Moon is a compelling work of science-fiction, and a promising debut from director Duncan Jones.", "critic": {"meter": 89, "numReviews": 186, "rating": 7.5}, "dvd": 1263254400000, "fresh": 166, "lastUpdated": 1442079467000, "production": "Sony Pictures Classics", "rotten": 20, "viewer": {"meter": 88, "numReviews": 97270, "rating": 4}, "website": "http://www.moon-movie.com"}, "type": "movie", "writers": ["Duncan Jones (story)", "Nathan Parker"], "year": 2009}