{"_id": "573a13dbf29313caabdaf37f", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Liam Neeson", "Maria Bello", "Mila Kunis", "Kim Basinger"], "countries": ["Belgium", "USA", "France", "UK", "Germany"], "directors": ["Paul Haggis"], "fullplot": "Michael (Liam Neeson) is a Pulitzer Prize-winning fiction author who has holed himself up in a hotel suite in Paris to finish his latest book. He recently left his wife, Elaine (Kim Basinger), and is having a tempestuous affair with Anna (Olivia Wilde), an ambitious young journalist who wants to write and publish fiction. At the same time, Scott (Adrien Brody), a shady American businessman, is in Italy to steal designs from fashion houses. Hating everything Italian, Scott wanders into the Cafè American\" in search of something familiar to eat. There, he meets Monika (Moran Atias), a beautiful Roma woman, who is about to be reunited with her young daughter. When the money she has saved to pay her daughter's smuggler is stolen, Scott feels compelled to help. They take off together for a dangerous town in Southern Italy, where Scott starts to suspect that he is the patsy in an elaborate con game. Julia (Mila Kunis), an ex-soap opera actress, is caught in a custody battle for her 6 year-old son with her ex-husband Rick (James Franco), a famous New York artist. With her support cut off and her legal costs ruinous, Julia is reduced to working as a maid in the same upscale boutique hotel where she was once a frequent guest. Julia's lawyer Theresa (Maria Bello) has secured Julia one final chance to change the court's mind and be reunited with the child she loves. Rick's current girlfriend Sam (Loan Chabanol) is a compassionate onlooker.", "genres": ["Drama", "Romance"], "imdb": {"id": 2343793, "rating": 6.4, "votes": 16379}, "languages": ["English", "Italian"], "lastupdated": "2015-09-05 00:38:34.837000000", "metacritic": 38, "num_mflix_comments": 1, "plot": "Three interlocking love stories involving three couples in three cities: Rome, Paris, and New York.", "poster": "https://m.media-amazon.com/images/M/MV5BMjAwNTk0OTczNV5BMl5BanBnXkFtZTgwNTI3NDE2MTE@._V1._CR29,29,953,1442_SX178_AL_.jpg", "rated": "R", "released": 1415923200000, "runtime": 137, "title": "Third Person", "tomatoes": {"boxOffice": "$1.0M", "consensus": "Third Person finds writer-director Paul Haggis working with a stellar cast and a worthy premise; unfortunately, he fails to fashion a consistently compelling movie out of the intriguing ingredients at his disposal.", "critic": {"meter": 23, "numReviews": 100, "rating": 4.4}, "dvd": 1412035200000, "fresh": 23, "lastUpdated": 1441907585000, "production": "Sony Pictures Classics", "rotten": 77, "viewer": {"meter": 34, "numReviews": 5910, "rating": 2.8}, "website": "http://www.sonyclassics.com/thirdperson/"}, "type": "movie", "writers": ["Paul Haggis (screenplay)"], "year": 2013}