{"_id": "573a13bef29313caabd5d328", "awards": {"nominations": 1, "text": "1 win & 1 nomination.", "wins": 1}, "cast": ["Frank Vincent", "Kathrine Narducci", "Mike Starr", "Stacy Keach"], "countries": ["USA"], "directors": ["Brian Caunter"], "fullplot": "The Chicago Outfit was the most powerful organized crime syndicate of the 20th century, and Lou Marazano (Frank Vincent) was their deadliest hit man. Twenty years after his most notorious wave of hits Lou is a relic, his legend obscured, his talents forgotten, and his glory days over. When a high-profile union representative is arrested for tax fraud, the Outfit's top boss (Armand Assante) orders a string of key witnesses silenced before the government can uncover a vast conspiracy involving police officers, city officials, and mob affiliates. Lou sees the job as an opportunity to finance his retirement and leave Chicago with his girlfriend (Kathrine Narducci). But when relentless detectives (Danny Goldring & Stacy Keach) begin nipping at his heels, and the acting street boss (Mike Starr) decides to revoke Lou's membership to the Outfit, Lou must prove he is worthy of being the Outfit's most deadly hit man - a title he held more than twenty years ago.", "genres": ["Action", "Adventure", "Crime"], "imdb": {"id": 1085382, "rating": 6, "votes": 690}, "languages": ["English"], "lastupdated": "2015-08-22 00:04:59.407000000", "num_mflix_comments": 1, "plot": "The fates of an aging hitman and a washed up detective become entwined when one last job leads to one last chance to settle an old score.", "poster": "https://m.media-amazon.com/images/M/MV5BMTg4NTQ2MjM4M15BMl5BanBnXkFtZTcwNDgyMDg3NA@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "runtime": 94, "title": "Chicago Overcoat", "tomatoes": {"lastUpdated": 1440355212000, "production": "Film Option International", "viewer": {"numReviews": 3, "rating": 0}}, "type": "movie", "writers": ["John Bosher (screenplay)", "John Bosher (story)", "Brian Caunter (screenplay)", "Brian Caunter (story)", "Andrew Dowd (screenplay)", "Josh Staman (screenplay)"], "year": 2009}