{"_id": "573a1397f29313caabce85cb", "awards": {"nominations": 16, "text": "Won 1 Oscar. Another 10 wins & 16 nominations.", "wins": 11}, "cast": ["Jack Lemmon", "Sissy Spacek", "Melanie Mayron", "John Shea"], "countries": ["USA"], "directors": ["Costa-Gavras"], "fullplot": "In September1973, in Chile, the American journalist Charles Horman arrives in Valparaiso with his friend Terry Simon to meet his wife Beth and bring her back to New York with him. However, they are surprised by the military coup d'ètat sponsored by the US Government to replace President Salvador Allende and Charles is arrested by the military force. His father Ed Horman, a conservative businessman from New York, arrives in Chile to seek out his missing son with Beth. He goes to the American Consulate to meet the Consul that promises the best efforts to find Charles while the skeptical Beth does not trust on the word of the American authorities. The nationalism and confidence of Ed in his government changes when he finds the truth about what happened with his beloved son.", "genres": ["Drama", "History", "Mystery"], "imdb": {"id": 84335, "rating": 7.8, "votes": 12503}, "languages": ["English", "Spanish"], "lastupdated": "2015-08-31 00:07:18.140000000", "num_mflix_comments": 1, "plot": "When an idealistic writer disappears during the Right Wing military coup in 1973 Chile, his wife and American businessman father try to find him.", "poster": "https://m.media-amazon.com/images/M/MV5BMGJmOGZiN2YtYWI2MS00ZGQzLWEwMmQtZTdiYjFjOWFiZDg4XkEyXkFqcGdeQXVyMTAwMzUyOTc@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 384739200000, "runtime": 122, "title": "Missing", "tomatoes": {"consensus": "Thanks in large part to strong performances by Sissy Spacek and Jack Lemmon, Missing is both a gripping character exploration and an effective political thriller.", "critic": {"meter": 96, "numReviews": 28, "rating": 7.6}, "dvd": 1101168000000, "fresh": 27, "lastUpdated": 1442340701000, "production": "Universal Pictures", "rotten": 1, "viewer": {"meter": 85, "numReviews": 5238, "rating": 3.8}}, "type": "movie", "writers": ["Costa-Gavras (screenplay)", "Donald Stewart (screenplay)", "Thomas Hauser (based on the book: \"Missing\")"], "year": 1982}