{"_id": "573a13b4f29313caabd4100e", "awards": {"nominations": 2, "text": "2 nominations.", "wins": 0}, "cast": ["Colin Firth", "Ben Kingsley", "Aishwarya Rai Bachchan", "Peter Mullan"], "countries": ["UK", "Italy", "France", "Tunisia"], "directors": ["Doug Lefler"], "fullplot": "Circa 460 A.D. Mira was born in a warrior-family in Kerala, India, was well versed in martial arts and self-defense, so much so that she was recruited by the Spanish royalty and re-located to Constantinople. From there she was instructed to assist Roman Commander Aurelius to plan the escape of 12-year old Romulus Augustus Caesar from a prison in Capri after his parents had been killed by the leader of the Alliance in turmoil-stricken Rome that has seen the deaths of five emperors in five years. Mira, Aurelius, and a Priest, Ambrosinius, along with a handful of loyal soldiers were successful in the escape plan and deliver Romulus to Roman Senator Nestor. What the crew do not realize is that their task is not over yet, for Nestor is all set to betray Romulus, leaving them with no alternative but to flee to Britannia, where they will be forced to confront a seemingly invincible Vortygn, whose main aim is to obtain a powerful sword that was meant for defense and defeat, and also ensure the death of Romulus at any and all costs.", "genres": ["Action", "Adventure", "Fantasy"], "imdb": {"id": 462396, "rating": 5.4, "votes": 27569}, "languages": ["English"], "lastupdated": "2015-08-31 00:13:42.810000000", "metacritic": 37, "num_mflix_comments": 1, "plot": "As the Roman empire crumbles, young Romulus Augustus flees the city and embarks on a perilous voyage to Britain to track down a legion of supporters.", "poster": "https://m.media-amazon.com/images/M/MV5BNmJhOTMyMTMtMDc0Yi00YTg2LWE0MWUtYWY0OTBmZTMzMmU2XkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1187308800000, "runtime": 102, "title": "The Last Legion", "tomatoes": {"boxOffice": "$125.8M", "consensus": "With miscast leads and unoriginal, uninspired dialogue, The Last Legion pales in comparison to the recent cinematic epics it invokes.", "critic": {"meter": 16, "numReviews": 55, "rating": 4.1}, "dvd": 1197936000000, "fresh": 9, "lastUpdated": 1439920926000, "production": "The Weinstein Company", "rotten": 46, "viewer": {"meter": 34, "numReviews": 94697, "rating": 2.9}, "website": "http://www.lastlegion-movie.com/"}, "type": "movie", "writers": ["Jez Butterworth (screenplay)", "Tom Butterworth (screenplay)", "Carlo Carlei (story)", "Peter Rader (story)", "Valerio Manfredi (story)"], "year": 2007}