{"_id": "573a13d9f29313caabdaa738", "awards": {"nominations": 8, "text": "3 wins & 8 nominations.", "wins": 3}, "cast": ["Iko Uwais", "Arifin Putra", "Tio Pakusodewo", "Oka Antara"], "countries": ["Indonesia", "USA"], "directors": ["Gareth Evans"], "fullplot": "He thought it was over. After fighting his way out of a building filled with gangsters and madmen - a fight that left the bodies of police and gangsters alike piled in the halls - rookie Jakarta cop Rama thought it was done and he could resume a normal life. He couldn't have been more wrong. Formidable though they may have been, Rama's opponents in that fateful building were nothing more than small fish swimming in a pond much larger than he ever dreamed possible. And his triumph over the small fry has attracted the attention of the predators farther up the food chain. His family at risk, Rama has only one choice to protect his infant son and wife: He must go undercover to enter the criminal underworld himself and climb through the hierarchy of competing forces until it leads him to the corrupt politicians and police pulling the strings at the top of the heap. And so Rama begins a new odyssey of violence, a journey that will force him to set aside his own life and history and take on a new identity as the violent offender \"Yuda.\" In prison he must gain the confidence of Uco - the son of a prominent gang kingpin - to join the gang himself, laying his own life on the line in a desperate all-or-nothing gambit to bring the whole rotten enterprise to an end.", "genres": ["Action", "Crime", "Thriller"], "imdb": {"id": 2265171, "rating": 8, "votes": 73217}, "languages": ["Indonesian", "Japanese", "English"], "lastupdated": "2015-09-01 00:19:56.333000000", "metacritic": 71, "num_mflix_comments": 2, "plot": "Only a short time after the first raid, Rama goes undercover with the thugs of Jakarta and plans to bring down the syndicate and uncover the corruption within his police force.", "poster": "https://m.media-amazon.com/images/M/MV5BMTg5MTE2NjA4OV5BMl5BanBnXkFtZTgwMTUyMjczMTE@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1397174400000, "runtime": 150, "title": "The Raid 2", "tomatoes": {"boxOffice": "$2.6M", "consensus": "Although its high-energy plot and over-the-top violence may play better with genre aficionados, The Raid 2 definitely delivers more of everything audiences loved about its predecessor.", "critic": {"meter": 79, "numReviews": 157, "rating": 7.3}, "dvd": 1404777600000, "fresh": 124, "lastUpdated": 1442081187000, "production": "Sony Pictures Classics", "rotten": 33, "viewer": {"meter": 87, "numReviews": 23160, "rating": 4.2}, "website": "http://www.sonyclassics.com/theraid2/"}, "type": "movie", "writers": ["Gareth Evans"], "year": 2014}