{"_id": "573a13d4f29313caabd97f42", "awards": {"nominations": 5, "text": "5 nominations.", "wins": 0}, "cast": ["Kareena Kapoor", "Arjun Rampal", "Randeep Hooda", "Shahana Goswami"], "countries": ["India"], "directors": ["Madhur Bhandarkar"], "fullplot": "After his incredible run of women-centric films from Chandni Bar, Page 3, Satta and Corporate to the blockbuster Fashion, Madhur Bhandarkar now turns his lens inwards and presents his most ambitious work yet - Heroine. The film is based on the life and times of a superstar heroine from the dream factory we call 'Bollywood'. The film is a daring, shocking, glamorous, scandalous behind the scenes account of the reality behind the world of glitz and glamour that our film stars inhabit. For a country obsessed with films and film stars, Heroine will take audiences on a voyeuristic journey to see what really goes on behind the closed doors of make up rooms and vanity vans. It will give them a chance to go beyond the gorgeous smiles and politically correct quotes, to see what really happens in the lives of India's sweethearts. The bitching and the politics, the secrets and the lies, the incredible highs of fame and the lonely depths of failure.", "genres": ["Drama"], "imdb": {"id": 1949548, "rating": 5.1, "votes": 2894}, "languages": ["Hindi"], "lastupdated": "2015-09-17 04:46:15.827000000", "num_mflix_comments": 1, "plot": "A female superstar struggles through the trials and tribulations of being a Bollywood actress.", "poster": "https://m.media-amazon.com/images/M/MV5BNjM1ODI0YTctNDc2Ni00MmEzLWE4MGUtNzBmNWI5ZWNhZmYwXkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 1348185600000, "runtime": 149, "title": "Heroine", "tomatoes": {"lastUpdated": 1438889722000, "production": "UTV Communications", "viewer": {"meter": 30, "numReviews": 1939, "rating": 2.7}, "website": "http://www.utvgroup.com/motion-pictures/coming-soon/heroine.html"}, "type": "movie", "writers": ["Madhur Bhandarkar", "Niranjan Iyengar", "Anuradha Tiwari"], "year": 2012}