{"_id": "573a13b1f29313caabd368e5", "awards": {"nominations": 6, "text": "Nominated for 1 Golden Globe. Another 1 win & 6 nominations.", "wins": 2}, "cast": ["Dong-gun Jang", "Hiroyuki Sanada", "Cecilia Cheung", "Nicholas Tse"], "countries": ["China", "South Korea", "USA"], "directors": ["Kaige Chen"], "fullplot": "When the world was young, laid a Kingdom between the Land of Snow and the Barbarian Territory where gods and men lived side by side and promises were lies. When the poor and starving orphaned girl Qingcheng meets the Goddess Manshen, she accepts to become the wealthy beauty of beauties with the curse that she would lose every man she loves, unless three things happen: snow falls in the spring, time moves backwards and the dead comes back to life. Years later, the slave Kunlun helps the Great General Master of the Crimson Armor Guangming to defeat a barbarian army with almost seven times more warriors, and Kunlun becomes his slave. When Guangming is wounded, he asks Kunlun to wear his armor and save the king from the cruel Duke of the North Wuhuan that put the Imperial City under siege with his army. However, Kunlun kills the king to save Princess Qingcheng and promises her to never let her die. Princess Qingcheng falls in love for the man of the crimson armor that she believes is General Guangming. When Snow Wolf saves Kunlun and brings him to the Land of Snow, he recollects his childhood when his mother and sister were killed by the evil Wuhuan. Kunlun decides to return to the Kingdom to face Wuhuan and fight for his love.", "genres": ["Action", "Drama", "Fantasy"], "imdb": {"id": 417976, "rating": 5.6, "votes": 8023}, "languages": ["Mandarin"], "lastupdated": "2015-08-20 00:00:37.687000000", "metacritic": 53, "num_mflix_comments": 1, "plot": "Empowered by the love of a slave (Jang), a royal concubine (Cheung) is given the chance to make an extraordinary decision.", "poster": "https://m.media-amazon.com/images/M/MV5BMmIzOGU3NDMtOTk1My00MDI5LWE3MzMtNDE4ZTk0ODUwNTM3XkEyXkFqcGdeQXVyNzI1NzMxNzM@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1146787200000, "runtime": 121, "title": "The Promise", "tomatoes": {"boxOffice": "$0.6M", "consensus": "An incoherent plot and ridiculously obvious CGI effects doom this effort from the usually outstanding Chinese director Chen Kaige.", "critic": {"meter": 31, "numReviews": 77, "rating": 5.2}, "dvd": 1176854400000, "fresh": 24, "lastUpdated": 1440440460000, "production": "Warner Independent Pictures", "rotten": 53, "viewer": {"meter": 44, "numReviews": 23772, "rating": 2.9}, "website": "http://wip.warnerbros.com/promise/"}, "type": "movie", "writers": ["Kaige Chen", "Tan Cheung"], "year": 2005}