{"_id": "573a139af29313caabcf0394", "awards": {"nominations": 2, "text": "2 nominations.", "wins": 0}, "cast": ["John Mahoney", "Edward Burns", "Michael McGlone", "Maxine Bahns"], "countries": ["USA"], "directors": ["Edward Burns"], "fullplot": "How do siblings deal with each other in their targets? This is the question tackled in this movie. Blue-collared Mickey drives a New York taxicab since the breakup with his promiscuous ex-fiancèe Heather two years ago. His younger, white-collared brother, Francis, cannot let Mickey forget the tragedy of the \"hairy ass\": (Mickey's image of his apartment floor of the guy having sex with Heather after walking in on them). Finding relief in driving his cab, Mickey meets an art student named Hope whom he marries after knowing her for only 24 hours. Mickey also meets his old lover Heather, and learns more about life itself as taxi fares in the course of a summer. Francis, a young Wall Street corporate raider, unhappy in his marriage to Renee and led by his infidelity, continues his shots at Mickey throughout the film, only to find himself a plot device that lends humor and lessons about marriage and brotherhood when he meets and starts an dangerous affair with Heather, despite Mickey's warnings that Heather is a gold-digging nymphomaniac who goes through sexual partners as often as a person changes clothes. Given Mickey's frame of reference on the past and his bride of 24 hours, it is no wonder that the two brothers, along with their father, an ego-eccentric and emotionally bereft bigot and a hard-core chauvinist who does not allow women aboard his fishing boat, learn about the strength of women, and their own lives.", "genres": ["Comedy", "Drama", "Romance"], "imdb": {"id": 117628, "rating": 6.1, "votes": 13376}, "languages": ["English"], "lastupdated": "2015-08-30 01:00:12.243000000", "num_mflix_comments": 1, "plot": "The love lives of two brothers, Mickey and Francis, interconnect as Francis cheats on his wife with Mickey's ex-girlfriend, while Mickey impulsively marries a stranger.", "poster": "https://m.media-amazon.com/images/M/MV5BMTI1MDA1MjM0OV5BMl5BanBnXkFtZTcwMjE0MDYxMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 840758400000, "runtime": 96, "title": "She's the One", "tomatoes": {"critic": {"meter": 61, "numReviews": 51, "rating": 5.8}, "dvd": 970531200000, "fresh": 31, "lastUpdated": 1440872949000, "production": "Twentieth Century Fox Home Entertainment", "rotten": 20, "viewer": {"meter": 41, "numReviews": 13879, "rating": 2.9}}, "type": "movie", "writers": ["Edward Burns"], "year": 1996}