{"_id": "573a1398f29313caabceac7f", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Carl Weathers", "Craig T. Nelson", "Vanity", "Sharon Stone"], "countries": ["USA"], "directors": ["Craig R. Baxley"], "fullplot": "Jericho \"Action\" Jackson is a Detroit police sergeant who was demoted from lieutenant for almost tearing the arm off of sexually violent sociopath Sean Dellaplane, whose father is Peter Dellaplane, a major car manufacturer. But Dellaplane himself is violent as well. Dellaplane kills his wife Patrice by shooting her. And then he plants her body in Jackson's apartment, framing Jackson. Dellaplane won't miss Patrice very much, because he has a drug-addicted mistress named Sydney Ash. He keeps Sydney hooked with a free supply of heroin. Jackson suspects Dellaplane of masterminding a murder spree against local officials from the auto workers' union. Dellaplane's mission is to gain a political power base and choose the next president of the United States. Because of what happened to Dellaplane's son Sean, Dellaplane has taken a particular dislike to Jackson. Jackson gets Sydney's help in going after Dellaplane.", "genres": ["Action", "Comedy", "Crime"], "imdb": {"id": 94612, "rating": 5.1, "votes": 7050}, "languages": ["English"], "lastupdated": "2015-08-20 00:24:08.470000000", "num_mflix_comments": 2, "plot": "Vengence drives a tough Detroit cop to stay on the trail of a power hungry auto magnate who's systematically eliminating his competition.", "poster": "https://m.media-amazon.com/images/M/MV5BZWFhNmI3OWQtOTU5Zi00ODA3LWExNjctMTllZWE2ZGE3ZTA1XkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 571622400000, "runtime": 96, "title": "Action Jackson", "tomatoes": {"critic": {"meter": 10, "numReviews": 10, "rating": 3.2}, "dvd": 926985600000, "fresh": 1, "lastUpdated": 1440440330000, "production": "Lorimar Film Entertainment", "rotten": 9, "viewer": {"meter": 32, "numReviews": 11008, "rating": 2.7}}, "type": "movie", "writers": ["Robert Reneau"], "year": 1988}