{"_id": "573a13bef29313caabd5ca4a", "awards": {"nominations": 8, "text": "2 wins & 8 nominations.", "wins": 2}, "cast": ["Devon Bostick", "Rachel Blanchard", "Louca Tassone", "Kenneth Welsh"], "countries": ["Canada"], "directors": ["Atom Egoyan"], "fullplot": "Simon, a Toronto high school student, has been raised by his maternal Uncle Tom since Simon's parents, Rachel and Sami, died in a car accident eight years ago. Tom, a tow truck driver, decided to move to the city into Rachel's house and assume the mortgage, something he could ill afford, largely not to disrupt Simon's life, but equally to get away from his and Rachel's father, Morris, an openly bigoted man. That upbringing has made Tom a sullen and angry man. Morris only recently passed away. Rachel and Sami met when she, a violinist, brought her instrument in to be serviced, Sami the repairman. Simon now owns his mother's expensive violin, which Tom would like to sell to help pay the mortgage and Simon's imminent university tuition. One day at school, Simon's French teacher Sabine reads a French newspaper story from several years ago as a translation exercise for the class, the story about a pregnant woman traveling to Israel, her then boyfriend who, unknown to her, planted a bomb in her luggage intended to blow up while the airplane was in flight, meaning that if it was not caught before departure, which it was, it would have killed her and their unborn child. Because Simon interestingly translates the story from the perspective of him being that unborn child now a teenager, Sabine, who is also the school's drama teacher, asks Simon to flesh out the story as a play, either in French or English. Simon begins to pedal the story widely as his reality, in other words that the woman in question truly was his mother Rachel and the bomber truly was who ended up being his Palestinian father, Sami, which may or may not in fact be true. Simon, Sabine and Tom all have to make decisions surrounding this issue, which they do to help their individual self deal with his or her own reality of the situation.", "genres": ["Drama", "Romance"], "imdb": {"id": 1074929, "rating": 6.3, "votes": 2688}, "languages": ["English", "French", "Hebrew"], "lastupdated": "2015-09-16 03:41:51.337000000", "metacritic": 64, "num_mflix_comments": 3, "plot": "For his French-class assignment, a high school student weaves his family history in a news story involving terrorism, and goes on to invite an Internet audience in on the resulting controversy.", "poster": "https://m.media-amazon.com/images/M/MV5BMTMxNzU1MjExNl5BMl5BanBnXkFtZTcwNTkxNDAyMg@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1240531200000, "runtime": 100, "title": "Adoration", "tomatoes": {"boxOffice": "$93.5k", "consensus": "A complex and thought-provoking work, Atom Egoyan's Adoration works well as both mystery and engaging drama.", "critic": {"meter": 62, "numReviews": 99, "rating": 6.1}, "dvd": 1243641600000, "fresh": 61, "lastUpdated": 1441045284000, "production": "Sony Pictures Classics", "rotten": 38, "viewer": {"meter": 50, "numReviews": 2151, "rating": 3.2}, "website": "http://www.sonyclassics.com/adoration"}, "type": "movie", "writers": ["Atom Egoyan"], "year": 2008}