{"_id": "573a13cff29313caabd89dc9", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Supriya Pathak", "Anang Desai", "Rajeev Mehta", "Nimisha Vakharia"], "countries": ["India"], "directors": ["Aatish Kapadia"], "fullplot": "Narrated through the two wise kids of the hilariously madcap Parekh family, namely Jacky and Chakki. Khichdi - The movie is about a hare brained dream of a snail brained bunch of lovable losers. Hansa's brother Himanshu has born a ridiculous ambition that is to have a memorable legendary love story. It's all together another matter that he is not in love with anyone and neither is he capable of getting any sensible girl smitten to him. But as Babuji over wisely says that for every idiotic Praful there is an even more idiotic Hansa made, his prophecy turns out to be true. Parminder, Himanshu's neighbor falls in love with Himanshu for no logical reason and the 2 get engaged to get married. That's when this ridiculous story line takes a ridiculous turn. Himanshu realizes on the eve of the wedding that the impending ceremony would mean impending doom to his desire to have a legendary love story. For nothing interesting ever happened in his love story to make it memorable. It was a simple non happening take with a boring happy ending. No resistance, no conflict, no separation, no sad song, no climax nothing. And so our gifted dumb family sets out to stall the wedding. And then begins their journey to create all those missing stages in Himanshu's love story in order to make it legendary. How, in this hilariously hare brained process, they make a mess of everything and how at the incredibly ridiculous climax Himanshu eventually manages to win his love back, makes up the story of Khichdi The Movie.", "genres": ["Comedy", "Drama", "Family"], "imdb": {"id": 1738293, "rating": 7.1, "votes": 974}, "languages": ["Hindi"], "lastupdated": "2015-08-19 00:25:57.673000000", "num_mflix_comments": 1, "plot": "In order to immortalize his love, a groom decides to create conflict between his and his to-be bride's families.", "released": 1285891200000, "title": "Khichdi: The Movie", "tomatoes": {"lastUpdated": 1439495361000, "viewer": {"meter": 33, "numReviews": 48, "rating": 2.9}}, "type": "movie", "writers": ["Aatish Kapadia (screenplay)"], "year": 2010}