{"_id": "573a13cef29313caabd87e20", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["George Griffith", "Matthew Lillard", "Jeffrey Doornbos", "Samantha Lemole"], "countries": ["USA"], "directors": ["George Griffith"], "fullplot": "Written by veteran strip club bathroom attendant, George Griffith, From The Head paints unflinching portraits of the men and women who people the dysfunctional family of the strip club, and their affect on the psyche of its resident bathroom attendant. Meshing a journalist's perspective with a dramatic flair, Griffith has crafted a truly independent screenplay. The story unfolds in real time, and is told from Shoes' perspective. If there's a dollar to be made, he doesn't leave the bathroom. And if Shoes doesn't leave, neither does the viewer. Through years of meticulous journaling, Griffith secretly recorded hours of conversations with customers. The result is a fascinating exploration of the host/parasite relationships that are cultivated in this underbelly of Broadway. With disarming authenticity, Griffith uncovers glimpses of wisdom in the unlikeliest of characters. While the rest of the world tramples through the tourist traps above ground, take the journey down the long stairs, and step behind the curtain, to see how those on the fringe are living.", "genres": ["Drama"], "imdb": {"id": 1714051, "rating": 7.8, "votes": 59}, "languages": ["English"], "lastupdated": "2015-09-02 00:18:50.850000000", "plot": "Written by veteran strip club bathroom attendant, George Griffith, From The Head paints unflinching portraits of the men and women who people the dysfunctional family of the strip club, and...", "poster": "https://m.media-amazon.com/images/M/MV5BMTU5MzY2NjgwN15BMl5BanBnXkFtZTcwMjI2MTQ1Nw@@._V1_SY1000_SX677_AL_.jpg", "released": 1308873600000, "runtime": 95, "title": "From the Head", "tomatoes": {"dvd": 1373932800000, "lastUpdated": 1440698656000, "production": "Breaking Glass Pictures", "viewer": {"meter": 88, "numReviews": 74, "rating": 3.9}, "website": "http://www.FromTheHead.com"}, "type": "movie", "writers": ["George Griffith"], "year": 2011}