{"_id": "573a1394f29313caabcdfeaa", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Romy Schneider", "Karlheinz Bèhm", "Magda Schneider", "Uta Franz"], "countries": ["Austria"], "directors": ["Ernst Marischka"], "fullplot": "The young Emperor Franz Joseph is on his way to his summer residence at Ischl, where his birthday will be celebrated with a big party. His mother, Archduchess Sophie, has decided that he shall marry her niece Princess Helene of Bayern, and that the engagement shall be proclaimed at the ball. Franz Joseph doesn't know Helene yet, but his mother has already prepared everything. To avoid suspicions of what is going on, her sister, Duchess Ludovika of Bavaria, brings not only Princess Helene, called Nènè, to the ball, but also the somewhat younger Princess Elisabeth, called Sissi. Archduchess Sophie is particular about strict etiquette at the court, and dislikes her niece Sissi, who is a free spirit, just as her father, Duke Max of Bavaria. To keep Sissi inactive, her room in Ischl is locked from outside, but Sissi escapes through a window. She goes to the wood, and when she is fishing in a river, the Emperor Franz Joseph passes by in his royal carriage. He is immediately enamored by Sissi, who doesn't reveal her true identity. When Franz Joseph recognizes Sissi at the ball the same evening, he defies his mother, and proclaims that Sissi will become his wife and the new Empress of Austria.", "genres": ["Comedy", "Drama", "History"], "imdb": {"id": 48624, "rating": 7, "votes": 4990}, "languages": ["German"], "lastupdated": "2015-09-07 01:08:08.380000000", "plot": "In the first of a trilogy of movies about Elisabeth \"Sissi\" of Austria, the young vibrant princess catches the eye of her sister's fiancè, Emperor Franz Josef.", "poster": "https://m.media-amazon.com/images/M/MV5BMjdhNTBjMmMtZmVlNi00NWRhLWEwNjItM2ZjYzkzMzhhNDZhXkEyXkFqcGdeQXVyNDE5MTU2MDE@._V1_SY1000_SX677_AL_.jpg", "released": -442713600000, "runtime": 102, "title": "Sissi", "type": "movie", "writers": ["Ernst Marischka"], "year": 1955}