{"_id": "573a13d2f29313caabd93221", "awards": {"nominations": 5, "text": "1 win & 5 nominations.", "wins": 1}, "cast": ["Judy Davis", "Flavio Parenti", "Roberto Benigni", "Alison Pill"], "countries": ["USA", "Italy", "Spain"], "directors": ["Woody Allen"], "fullplot": "In Rome, the America tourist Hayley meets the local lawyer Michelangelo on the street and soon they fall in love with each other. Hayley's parents, the psychiatrist Phyllis and the retired music producer Jerry, travel to Rome to meet Michelangelo and his parents. When Jerry listens to Michelangelo's father Giancarlo singing opera in the shower, he is convinced that he is a talented opera singer. But there is a problem: Giancarlo can only sing in the shower. The couple Antonio and Milly travel to Rome to meet Antonio's relatives that belong to the high society. Milly goes to the hairdresser while Antonio waits for her in the room. Milly gets lost in Rome and the prostitute Anna mistakenly goes to Antonio's room. Out of the blue, his relatives arrive in the room and they believe Anna is Antonio's wife. Meanwhile the shy Milly meets her favorite actor Luca Salta (Antonio Albanese) and goes to his hotel room \"to discuss about movies\". One day, the middle-class clerk Leopoldo becomes a celebrity and is hunted by the paparazzo. A couple of days later, he is forgotten by the media. The American architect John travels to Rome with his wife and feels nostalgic since he lived in the city thirty years ago when he was a student. He meets the student of architecture Jack, who lives on the same street that John had lived, and he invited to drink a coffee at his house. Jack lives with his girlfriend Sally (Greta Gerwig) that invites her best friend Monica to stay with them in their house. But soon Jack has a crush on Monica.", "genres": ["Comedy", "Romance"], "imdb": {"id": 1859650, "rating": 6.3, "votes": 61946}, "languages": ["English", "Italian"], "lastupdated": "2015-09-07 00:19:58.977000000", "metacritic": 54, "num_mflix_comments": 4, "plot": "The lives of some visitors and residents of Rome and the romances, adventures and predicaments they get into.", "poster": "https://m.media-amazon.com/images/M/MV5BMTcwNTg4MDMxM15BMl5BanBnXkFtZTcwNjAzMzY3Nw@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1341532800000, "runtime": 112, "title": "To Rome with Love", "tomatoes": {"boxOffice": "$16.7M", "consensus": "To Rome With Love sees Woody Allen cobbling together an Italian postcard of farce, fantasy, and comedy with only middling success.", "critic": {"meter": 44, "numReviews": 165, "rating": 5.4}, "dvd": 1358208000000, "fresh": 72, "lastUpdated": 1442252604000, "production": "Sony Pictures Classics", "rotten": 93, "viewer": {"meter": 40, "numReviews": 29377, "rating": 3}, "website": "http://www.toromewithlove.com"}, "type": "movie", "writers": ["Woody Allen"], "year": 2012}