{"_id": "573a1395f29313caabce254c", "awards": {"nominations": 1, "text": "Nominated for 2 Oscars. Another 10 wins & 1 nomination.", "wins": 12}, "cast": ["Eiji Okada", "Kyèko Kishida", "Hiroko Itè", "Kèji Mitsui"], "countries": ["Japan"], "directors": ["Hiroshi Teshigahara"], "fullplot": "Jumpei Niki, a Tokyo based entomologist and educator, is in a poor seaside village collecting specimens of sand insects. As it is late in the day and as he has missed the last bus back to the city, some of the local villagers suggest that he spend the night there, they offering to find him a place to stay. That place is the home of a young woman, whose house is located at the bottom of a sand pit accessible only by ladder. He later learns that the woman's husband and child died in a sandstorm, their undiscovered bodies buried somewhere near the house. The next morning as he tries to leave, he finds that the ladder is gone - he realizing that the ladder he climbed down was a rope ladder which is anchored above the pit - meaning that he is trapped with the young woman as the walls of the pit are sand with no grip. He also realizes that this entrapment was the villagers and the young woman's plan for him to stay there permanently to be her helper in the never-ending task of digging out the sand, which if not done will swallow them alive. They are dependent upon the villagers to help remove the sand, but also for their rations including water. He learns that the sand is the young woman's life, and that she knows or wants no other life. Thus, it is no use either to blackmail or kill her as she is willing to live and die by this life, and as such he will surely die if she is dead. His life tasks become to figure out a way to escape while co-exist with the woman in what he considers their prison. As time goes on, he also learns that there are other tasks which will consume him.", "genres": ["Drama", "Thriller"], "imdb": {"id": 58625, "rating": 8.4, "votes": 10142}, "languages": ["Japanese"], "lastupdated": "2015-09-13 00:34:56.640000000", "plot": "An entomologist searching for insects by the seaside is trapped by local villagers into living with a widow whose life task is digging up sand for them. He eventually develops strong feelings for her as his hope for escape dims.", "poster": "https://m.media-amazon.com/images/M/MV5BN2RlNTlkYTAtZDY2My00OGI0LWE1OTEtNmY1NDU2YTU0MGUxXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": -163641600000, "runtime": 123, "title": "Woman in the Dunes", "tomatoes": {"critic": {"meter": 100, "numReviews": 25, "rating": 8.7}, "dvd": 946944000000, "fresh": 25, "lastUpdated": 1442079536000, "production": "Criterion Collection", "rotten": 0, "viewer": {"meter": 93, "numReviews": 5194, "rating": 4.3}}, "type": "movie", "writers": ["Kèbè Abe (novel)", "Kèbè Abe (screenplay)", "Eiko Yoshida (scripter)"], "year": 1964}