{"_id": "573a13def29313caabdb6e51", "awards": {"nominations": 6, "text": "Nominated for 1 Oscar. Another 10 wins & 6 nominations.", "wins": 11}, "cast": ["Nasser Al Aulaqi", "Saleha Al Aulaqi", "Muqbal Al Kazemi", "Abdul Rahman Barman"], "countries": ["USA"], "directors": ["Rick Rowley"], "fullplot": "Dirty Wars follows investigative reporter Jeremy Scahill, author of the international bestseller Blackwater, into the hidden world of America's covert wars, from Afghanistan to Yemen, Somalia, and beyond. Part action film and part detective story, Dirty Wars is a gripping journey into one of the most important and underreported stories of our time. What begins as a report on a deadly U.S. night raid in a remote corner of Afghanistan quickly turns into a global investigation of the secretive and powerful Joint Special Operations Command (JSOC). As Scahill digs deeper into the activities of JSOC, he is pulled into a world of covert operations unknown to the public and carried out across the globe by men who do not exist on paper and will never appear before Congress. In military jargon, JSOC teams \"find, fix, and finish\" their targets, who are selected through a secret process. No target is off limits for the \"kill list,\" including U.S. citizens.", "genres": ["Documentary", "Crime", "Drama"], "imdb": {"id": 2532528, "rating": 7.5, "votes": 6859}, "languages": ["English", "Pushto", "Somali", "Dari", "Arabic"], "lastupdated": "2015-09-11 00:01:23.447000000", "metacritic": 76, "plot": "Investigative journalist Jeremy Scahill is pulled into an unexpected journey as he chases down the hidden truth behind America's expanding covert wars.", "poster": "https://m.media-amazon.com/images/M/MV5BMTUyOTYwNDUyMV5BMl5BanBnXkFtZTcwNzQwOTU1OQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 1382054400000, "runtime": 87, "title": "Dirty Wars", "tomatoes": {"boxOffice": "$0.4M", "consensus": "Some viewers may find fault with director Rick Rowley's filmmaking methods, but they aren't distracting enough to keep Dirty Wars from serving as a terribly compelling argument against elements of American foreign policy.", "critic": {"meter": 85, "numReviews": 67, "rating": 7.4}, "dvd": 1381795200000, "fresh": 57, "lastUpdated": 1442085575000, "production": "IFC Films", "rotten": 10, "viewer": {"meter": 74, "numReviews": 3451, "rating": 3.8}, "website": "http://dirtywars.org/"}, "type": "movie", "writers": ["David Riker", "Jeremy Scahill"], "year": 2013}