{"_id": "573a13d2f29313caabd91fb7", "awards": {"nominations": 12, "text": "7 wins & 12 nominations.", "wins": 7}, "cast": ["Weiwei Ai", "Dan Ai", "Lao Ai", "Lee Ambrozy"], "countries": ["USA"], "directors": ["Alison Klayman"], "fullplot": "AI WEIWEI: NEVER SORRY is the first feature-length film about the internationally renowned Chinese artist and activist, Ai Weiwei. In recent years, Ai has garnered international attention as much for his ambitious artwork as his political provocations. AI WEIWEI: NEVER SORRY examines this complex intersection of artistic practice and social activism as seen through the life and art of China's preeminent contemporary artist. From 2008 to 2010, Beijing-based journalist and filmmaker Alison Klayman gained unprecedented access to Ai Weiwei. Klayman documented Ai's artistic process in preparation for major museum exhibitions, his intimate exchanges with family members and his increasingly public clashes with the Chinese government. Klayman's detailed portrait of the artist provides a nuanced exploration of contemporary China and one of its most compelling public figures.", "genres": ["Documentary"], "imdb": {"id": 1845773, "rating": 7.6, "votes": 3019}, "languages": ["English", "Mandarin"], "lastupdated": "2015-09-15 03:22:14.147000000", "metacritic": 81, "num_mflix_comments": 3, "plot": "A documentary that chronicles artist and activist Ai Weiwei as he prepares for a series of exhibitions and gets into an increasing number of clashes with the Chinese government.", "poster": "https://m.media-amazon.com/images/M/MV5BMjE4NjEwNDAyN15BMl5BanBnXkFtZTcwNDk5MTIxOA@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1339632000000, "runtime": 91, "title": "Ai Weiwei: Never Sorry", "tomatoes": {"boxOffice": "$0.5M", "critic": {"meter": 97, "numReviews": 76, "rating": 8}, "dvd": 1354492800000, "fresh": 74, "lastUpdated": 1442336937000, "production": "IFC Films", "rotten": 2, "viewer": {"meter": 87, "numReviews": 5209, "rating": 4.1}, "website": "http://aiweiweineversorry.com/"}, "type": "movie", "writers": ["Alison Klayman"], "year": 2012}