{"_id": "573a1398f29313caabceae0b", "awards": {"nominations": 7, "text": "10 wins & 7 nominations.", "wins": 10}, "cast": ["Freda Dowie", "Pete Postlethwaite", "Angela Walsh", "Dean Williams"], "countries": ["UK", "West Germany"], "directors": ["Terence Davies"], "fullplot": "The second film in Terence Davies's autobiographical series ('Trilogy', 'The Long Day Closes') is an impressionistic view of a working-class family in 1940s and 1950s Liverpool, based on Davies's own family. The first part, 'Distant Voices', opens with grown siblings Eileen (Angela Walsh), Maisie (Lorraine Ashbourne) and Tony (Dean Williams), and their mother (Freda Dowie) arranged in mourning clothes before the photograph of their smiling father (Pete Postlethwaite). Soon after, the family poses in a similar tableau, but for a happier occasion - Eileen's wedding. While relatives sing at her reception, Eileen hysterically grieves for her dad, and recalls happy times of her youth. Tony and Maisie's memories, however, are more troubled. Davies intermingles and contrasts scenes like the family peacefully lighting candles in church with the brutal man beating his wife and terrorizing his young children. In 'Still Lives', set (and filmed) two years later, the siblings are settled in life, but not all happily. For Eileen, relief from her drab existence comes only when singing at the pub. With his skillfully composed frames and evocative use of music in place of dialogue, Davies creates a lovely, affecting photo album of a troubled family wrestling with the complexity of love.", "genres": ["Drama"], "imdb": {"id": 95037, "rating": 7.5, "votes": 2186}, "languages": ["English"], "lastupdated": "2015-09-17 02:22:52.863000000", "plot": "The second film in Terence Davies's autobiographical series ('Trilogy', 'The Long Day Closes') is an impressionistic view of a working-class family in 1940s and 1950s Liverpool, based on ...", "poster": "https://m.media-amazon.com/images/M/MV5BNDNiZGE1YzQtZDczNy00Yjk1LTk5ZWUtZWU4MmNiY2RiZGQxXkEyXkFqcGdeQXVyMTA0MjU0Ng@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 603676800000, "runtime": 85, "title": "Distant Voices, Still Lives", "tomatoes": {"consensus": "Bracingly original and beautifully composed, Distant Voices, Still Lives is an invigorating period drama that finds director Terence Davies in peak form.", "critic": {"meter": 79, "numReviews": 33, "rating": 8.2}, "fresh": 26, "lastUpdated": 1442336832000, "production": "Film Four International", "rotten": 7, "viewer": {"meter": 83, "numReviews": 865, "rating": 4.1}}, "type": "movie", "writers": ["Terence Davies"], "year": 1988}