{"_id": "573a13bff29313caabd5e3dd", "awards": {"nominations": 4, "text": "2 wins & 4 nominations.", "wins": 2}, "cast": ["Michael Reynolds", "Chris Reynolds", "Shauna Malloy", "Dave DiCicco"], "countries": ["UK"], "directors": ["Oliver Hodge"], "fullplot": "Imagine a home that heats itself, that provides its own water, hat grows its own food. Imagine that it needs no expensive technology, that it recycles its own waste, that it has its own power source. And now imagine that it can be built anywhere, by anyone, out of the things society throws away. Thirty years ago, architect Michael Reynolds imagined just such a home - then set out to build it. A visionary in the classic American mode, Reynolds has been fighting ever since to bring his concept to the public. He believes that in an age of ecological instability and impending natural disaster, his buildings can - and will - change the way we live. Shot over three years in the USA, India and Mexico, Garbage Warrior is a feature-length documentary film telling the epic story of maverick architect Michael Reynolds, his crew of renegade house builders from New Mexico, and their fight to introduce radically different ways of living. A snapshot of contemporary geo-politics and an inspirational tale of triumph over bureaucracy, Garbage Warrior is above all an intimate portrait of an extraordinary individual and his dream of changing the world.", "genres": ["Documentary"], "imdb": {"id": 1104694, "rating": 7.8, "votes": 624}, "languages": ["English"], "lastupdated": "2015-08-09 00:03:56.740000000", "plot": "Imagine a home that heats itself, that provides its own water, hat grows its own food. Imagine that it needs no expensive technology, that it recycles its own waste, that it has its own ...", "released": 1211500800000, "runtime": 86, "title": "Garbage Warrior", "tomatoes": {"critic": {"meter": 80, "numReviews": 5, "rating": 6.6}, "dvd": 1226361600000, "fresh": 4, "lastUpdated": 1441130582000, "rotten": 1, "viewer": {"meter": 86, "numReviews": 525, "rating": 4.1}, "website": "http://www.garbagewarrior.com/"}, "type": "movie", "year": 2007}