{"_id": "573a13a8f29313caabd1d53c", "awards": {"nominations": 6, "text": "6 nominations.", "wins": 0}, "cast": ["John Cusack", "Ray Liotta", "Amanda Peet", "John Hawkes"], "countries": ["USA"], "directors": ["James Mangold"], "fullplot": "Malcolm Rivers has been convicted as the perpetrator of several murders and is sentenced to death. An eleventh hour defense by his lawyers and psychiatrist that Malcolm is insane based on new evidence has resulted in them meeting with the prosecutors and the judge to discuss if the verdict should be overturned. Meanwhile, on a dark night during a torrential rainstorm in the Nevada desert, a series of chain reaction events results in several people needing to stay at an out of the way motel managed by Larry. They are: ex-cop now limo driver Ed, and his client Caroline, a diva of a once famous actress; quiet adolescent Timmy, his stepfather George, and his mother Alice, who was seriously injured when Ed accidentally ran over her as she watched George change their flat tire; prostitute Paris, who was the unwitting cause of George's flat tire; newlyweds Lou and Ginny, whose marriage is based on a lie; and Police Officer Rhodes, who was en route escorting prisoner Robert to his new institution. They all can't leave the area because of washed out roads, all the other businesses around the motel are closed because of the storm, and all communication in and out is not functioning also because of the storm. One by one, they are murdered, the murderer leaving a calling card of a motel room key, starting with the room 10 key and working his way presumably to the room 1 key when the last person will be dead. Those still alive band somewhat together under Officer Rhodes and Ed's direction to find out which of the eleven is the murderer, and if, based on one of their theories, that they were brought to the motel by some force by the murderer as his intended targets. Whether those still alive can discover who the murderer is, discover why he has chosen to kill them, and be able to subdue him may well determine Malcolm's fate.", "genres": ["Mystery", "Thriller"], "imdb": {"id": 309698, "rating": 7.3, "votes": 164712}, "languages": ["English"], "lastupdated": "2015-09-16 06:31:28.073000000", "metacritic": 64, "num_mflix_comments": 3, "plot": "Stranded at a desolate Nevada motel during a nasty rain-storm, ten strangers become acquainted with each other when they realize that they're being killed off one by one.", "poster": "https://m.media-amazon.com/images/M/MV5BMjE2NzgyNDYzNl5BMl5BanBnXkFtZTYwODM2Nzc2._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1051228800000, "runtime": 90, "title": "Identity", "tomatoes": {"boxOffice": "$51.5M", "consensus": "Identity is a film that will divide audiences -- the twists of its plot will either impress or exasperate you.", "critic": {"meter": 62, "numReviews": 170, "rating": 6.4}, "dvd": 1125964800000, "fresh": 105, "lastUpdated": 1441992002000, "production": "Columbia Pictures", "rotten": 65, "viewer": {"meter": 75, "numReviews": 189878, "rating": 3.4}, "website": "http://www.sonypictures.com/movies/identity"}, "type": "movie", "writers": ["Michael Cooney"], "year": 2003}