{"_id": "573a13b5f29313caabd42575", "awards": {"nominations": 6, "text": "4 wins & 6 nominations.", "wins": 4}, "cast": ["Riz Ahmed", "Farhad Harun", "Waqar Siddiqui", "Arfan Usman"], "countries": ["UK"], "directors": ["Mat Whitecross", "Michael Winterbottom"], "fullplot": "In 2001, four Pakistani Britons, Ruhal Ahmed, Asif Iqbal and Shafiq Rasul and another friend, Monir, travel to Pakistan for a wedding and in a urge of idealism, decide to see the situation of war torn Afganistan which is being bombed by the American forces in retaliation for the 9/11 terrorist attacks. Once there, with the loss of Monir in the wartime chaos, they are captured by Northern Alliance fighters. They are then handed them over the American forces who transport them to the prison camps at the Guantanamo Bay base in Cuba. What follows is three years of relentless imprisonment, interrogations and torture to make them submit to blatantly wrong confessions to being terrorists. In the midst of this abuse, the three struggle to keep their spirits up in that face of this grave injustice.", "genres": ["Documentary", "Drama", "War"], "imdb": {"id": 468094, "rating": 7.5, "votes": 10222}, "languages": ["English", "Urdu"], "lastupdated": "2015-08-19 00:31:27.860000000", "metacritic": 64, "num_mflix_comments": 1, "plot": "Part drama, part documentary, The Road to Guantènamo focuses on the Tipton Three, a trio of British Muslims who were held in Guantanamo Bay for two years until they were released without charge.", "poster": "https://m.media-amazon.com/images/M/MV5BMTQ2Njk1NDg0MV5BMl5BanBnXkFtZTcwMzQ2MTMzMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1141862400000, "runtime": 95, "title": "The Road to Guantanamo", "tomatoes": {"boxOffice": "$0.2M", "consensus": "A gut-wrenching and riveting docu-drama that serves as a stinging indictment of U.S. military justice in an era of ever-increasing scrutiny.", "critic": {"meter": 86, "numReviews": 95, "rating": 7.1}, "dvd": 1161648000000, "fresh": 82, "lastUpdated": 1439835715000, "production": "Roadside Attractions", "rotten": 13, "viewer": {"meter": 82, "numReviews": 27001, "rating": 3.4}, "website": "http://www.roadtoguantanamomovie.com/"}, "type": "movie", "year": 2006}