{"_id": "573a13d3f29313caabd96c9b", "awards": {"nominations": 3, "text": "1 win & 3 nominations.", "wins": 1}, "cast": ["Nichola Burley", "Martin McCann", "Charlene McKenna", "Ciarèn McMenamin"], "countries": ["UK", "Ireland"], "directors": ["Kieron J. Walsh"], "fullplot": "Jump follows the lives of four twenty-something's whose lives collide one fateful New Year's Eve in a night of fast talk, wild coincidence and intrigue. The unseen yet crucial occurrence of this tale is the strange disappearance of Eddie Kelly, which hangs over the city like a dark cloud. Kelly's 'disappearance' at the hands of crime boss Frank Feeney's men links our four main characters, triggering a sequence of events which ultimately has life changing consequences for each of them. Feeney's daughter Greta is severely depressed and is intent on taking her own life. Pearse is on a mission to get answers about his missing brother Eddie and will stop at nothing until he gets to the truth. Johnny, a small time crook who works for Feeney, and Marie, a frustrated shop assistant, are both looking for a fresh start. Greta and Pearse meet each other in extraordinary circumstances on a bridge overlooking the city. Greta is there to Jump and Pearse has been beaten and dangled off the bridge by Feeney's henchmen for asking difficult questions about his brother's disappearance. In their short, magnetic time together they become kindred spirits on the cusp of love before fate and circumstance take over. A wayward corpse and the busy intrigue of New Year's Eve all compose the jigsaw puzzle of this out of sequence, multi-stranded story. And as the night's events expertly fall into place, Jump weaves an existential portrait of our characters' lives as their hopes, fears and secrets are revealed.", "genres": ["Drama"], "imdb": {"id": 1927067, "rating": 6.4, "votes": 231}, "languages": ["English"], "lastupdated": "2015-08-27 00:22:29.540000000", "num_mflix_comments": 2, "plot": "Crime boss daughter Greta is rescued from suicide by stranger Pearse on New Year's Eve, a night that will change both their lives forever.", "poster": "https://m.media-amazon.com/images/M/MV5BMTUzMDg4NjYwMF5BMl5BanBnXkFtZTcwNjI2OTM0OA@@._V1_SY1000_SX677_AL_.jpg", "released": 1339113600000, "runtime": 81, "title": "Jump", "tomatoes": {"lastUpdated": 1440180160000, "production": "Breaking Glass Pictures", "viewer": {"meter": 53, "numReviews": 24, "rating": 3.3}}, "type": "movie", "writers": ["Steve Brookes (screenplay)", "Kieron J. Walsh (screenplay)"], "year": 2012}