{"_id": "573a1393f29313caabcdd8c7", "awards": {"nominations": 0, "text": "Nominated for 1 Oscar. Another 7 wins.", "wins": 8}, "cast": ["Aldo Fabrizi", "Anna Magnani", "Marcello Pagliero", "Vito Annichiarico"], "countries": ["Italy"], "directors": ["Roberto Rossellini"], "fullplot": "The location: Nazi occupied Rome. As Rome is classified an open city, most Romans can wander the streets without fear of the city being bombed or them being killed in the process. But life for Romans is still difficult with the Nazi occupation as there is a curfew, basic foods are rationed, and the Nazis are still searching for those working for the resistance and will go to any length to quash those in the resistance and anyone providing them with assistance. War worn widowed mother Pina is about to get married to her next door neighbor Francesco. Despite their situation - Pina being pregnant, and Francesco being an atheist - Pina and Francesco will be wed by Catholic priest Don Pietro Pelligrini. The day before the wedding, Francesco's friend, Giorgio Manfredi, who Pina has never met, comes looking for Francesco as he, working for the resistance, needs a place to hide out. For his latest mission, Giorgio also requests the assistance of Don Pietro, who is more than willing as he sees such work as being in the name of God. Don Pietro's position also provides him with access to where others are not able. Giorgio's girlfriend, Marina, a cabaret performer, doesn't even know where Giorgio is in hiding. Both Pina and Marina take measures to improve their lives under this difficult situation, those actions in combination which have tragic consequences.", "genres": ["Drama", "War"], "imdb": {"id": 38890, "rating": 8.1, "votes": 15085}, "languages": ["Italian", "German", "Latin"], "lastupdated": "2015-09-15 05:02:27.580000000", "num_mflix_comments": 1, "plot": "The location: Nazi occupied Rome. As Rome is classified an open city, most Romans can wander the streets without fear of the city being bombed or them being killed in the process. But life ...", "poster": "https://m.media-amazon.com/images/M/MV5BNGI0MmY1NTMtMTFmZS00Y2NkLTgyZDktMTFkNDZlOTc4YWU3XkEyXkFqcGdeQXVyMjgyNjk3MzE@._V1_SY1000_SX677_AL_.jpg", "rated": "APPROVED", "released": -765676800000, "runtime": 103, "title": "Rome, Open City", "tomatoes": {"critic": {"meter": 100, "numReviews": 38, "rating": 9.2}, "dvd": 876873600000, "fresh": 38, "lastUpdated": 1441307503000, "production": "Criterion Collection", "rotten": 0, "viewer": {"meter": 92, "numReviews": 5958, "rating": 4.2}}, "type": "movie", "writers": ["Sergio Amidei (screenplay)", "Federico Fellini (collaboration on screenplay)", "Roberto Rossellini (collaboration on screenplay)", "Sergio Amidei (story)", "Alberto Consiglio (additional material)", "Roberto Rossellini (additional material)"], "year": 1945}