{"_id": "573a13abf29313caabd24fd6", "awards": {"nominations": 8, "text": "Nominated for 1 Oscar. Another 25 wins & 8 nominations.", "wins": 26}, "cast": ["Arnold Friedman", "Elaine Friedman", "David Friedman", "Seth Friedman"], "countries": ["USA"], "directors": ["Andrew Jarecki"], "fullplot": "In the late 1980's, the Friedmans - father and respected computer and music teacher Arnold Friedman, mother and housewife Elaine Friedman, and their three grown sons, David Friedman, Seth Friedman and Jesse Friedman - of Great Neck, Long Island, are seemingly your typical middle class American family. They all admit that the marriage was by no means close to being harmonious - Arnold and Elaine eventually got divorced - but the sons talk of their father, while also not being always there for them, as being a good man. This faèade of respectability masks the fact that Arnold was buying and distributing child pornography. Following a sting operation to confirm this fact, the authorities began to investigate Arnold for sexual abuse of the minor-aged male students of his computer classes, which he held in the basement of the family home. Based on interviews with the students, not only was Arnold charged with and ultimately convicted of multiple counts of sodomy and sexual abuse of these boys but so was eighteen year old Jesse, who was mentioned by many as the aggressor of the two in the acts. Arnold admitted that he is a pedophile, but that he did not abuse the boys in his class as charged and convicted. The trial process brought out the dysfunction that previously existed within the family. But the issue of Arnold and Jesse's guilt of these acts is hotly debated among the family, among the authorities, among the media and among the students of the computer classes.", "genres": ["Documentary", "Biography"], "imdb": {"id": 342172, "rating": 7.9, "votes": 17160}, "languages": ["English"], "lastupdated": "2015-09-04 00:29:41.397000000", "metacritic": 90, "num_mflix_comments": 1, "plot": "Documentary on the Friedmans, a seemingly typical, upper-middleclass Jewish family whose world is instantly transformed when the father and his youngest son are arrested and charged with shocking and horrible crimes.", "poster": "https://m.media-amazon.com/images/M/MV5BMTIwOTY2NzU3NV5BMl5BanBnXkFtZTcwOTU5MDYyMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 1058486400000, "runtime": 107, "title": "Capturing the Friedmans", "tomatoes": {"boxOffice": "$2.8M", "consensus": "A haunting depiction of a disintegrating family, and a powerful argument on the elusiveness of truth.", "critic": {"meter": 97, "numReviews": 147, "rating": 8.4}, "dvd": 1075161600000, "fresh": 143, "lastUpdated": 1441994874000, "production": "Magnolia", "rotten": 4, "viewer": {"meter": 89, "numReviews": 9404, "rating": 3.9}, "website": "http://www.capturingthefriedmans.com"}, "type": "movie", "year": 2003}