{"_id": "573a13a0f29313caabd05983", "awards": {"nominations": 3, "text": "5 wins & 3 nominations.", "wins": 5}, "cast": ["Hildigunn Eyèfinsdèttir", "Sigri Mitra Gaèni", "Johan Dalsgaard", "Elin K. Mouritsen"], "countries": ["Denmark", "Faroe Islands"], "directors": ["Katrin Ottarsdèttir"], "fullplot": "After having lived for a number of year's abroad, the two friends Rannvè and Barba return for a visit to their native country, the Faroe Islands. They feel that they have outgrown the small island community, present themselves in outrageous colourful clothing and with a superior attitude to all things Faroes. The real purpose of their visit is to solve unfinished family matters, but they soon loose the grip, and find themselves fleeing the answers they came looking for. The girls are \"rescued\" by Rèni, a local fisherman, who gives them a lift in his old Ford Granada, decorated with zebra covers, flower lights and a stuffed crocodile in the back. On their journey up north they meet, among others, a fallen rock-singer, missionary grandparents, thirsty wedding guests and a Jesus wannabe. Rèni is constantly running errands, there is always someone he has to meet. Who is this silent, shy man? What is his curious business? And why does he get more bruised after each errand? The short route north develops into a long roundabout, across the islands. Skeletons start popping out of the closet. This is a film about hypocrisy, broken dreams, unfortunate fate, and finding oneself. The story is told with a mixture of sadness and satirical humour, just like life so often presents itself.", "genres": ["Comedy", "Drama"], "imdb": {"id": 208783, "rating": 6.5, "votes": 436}, "languages": ["Faroese", "Danish", "English", "French"], "lastupdated": "2015-08-29 00:12:20.030000000", "num_mflix_comments": 4, "plot": "After having lived for a number of year's abroad, the two friends Rannvè and Barba return for a visit to their native country, the Faroe Islands. They feel that they have outgrown the small...", "poster": "https://m.media-amazon.com/images/M/MV5BMjAxOTc2MTMzNl5BMl5BanBnXkFtZTcwNTgxNDQzMQ@@._V1_SY1000_SX677_AL_.jpg", "released": 933292800000, "runtime": 97, "title": "Bye Bye Bluebird", "tomatoes": {"lastUpdated": 1436813282000, "viewer": {"meter": 57, "numReviews": 172, "rating": 3.6}}, "type": "movie", "writers": ["Katrin Ottarsdèttir"], "year": 1999}