{"_id": "573a13a8f29313caabd1d0cc", "awards": {"nominations": 11, "text": "2 wins & 11 nominations.", "wins": 2}, "cast": ["Tony Grisoni", "Philip A. Patterson", "Renè Cleitman", "Terry Gilliam"], "countries": ["UK", "USA"], "directors": ["Keith Fulton", "Louis Pepe"], "fullplot": "Director Terry Gilliam is the latest filmmaker to try and bring Miguel de Cervantes y Saavedra's \"Don Quixote de la Mancha\" to the big screen, the movie to be called The Man Who Killed Don Quixote. Before filming even begins, Gilliam, who has moved from Hollywood studio to European financing, will have to scale back his vision as his budget has been slashed from $40 million to $32 million, still astronomical by European standards. But Gilliam is a dreamer, much like his title character, and his vision for the movie is uncompromising, meaning with the reduced budget that there is no margin for error and that some of his department heads may have to achieve miracles with their allotted moneys. During pre-production and actual filming, what Gilliam does not foresee is contractual and health issues with his actors, and the effects of Mother Nature. The question is does Gilliam have a Plan B if/when things go wrong.", "genres": ["Documentary"], "imdb": {"id": 308514, "rating": 7.4, "votes": 9034}, "languages": ["English", "Spanish", "French"], "lastupdated": "2015-08-21 00:03:29.673000000", "metacritic": 74, "num_mflix_comments": 1, "plot": "Terry Gilliam's doomed attempt to get his film, The Man Who Killed Don Quixote, off the ground.", "poster": "https://m.media-amazon.com/images/M/MV5BMTcyMDU0MjkxOV5BMl5BanBnXkFtZTYwMjkzMjc2._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1028246400000, "runtime": 89, "title": "Lost in La Mancha", "tomatoes": {"consensus": "A remarkable behind-the-scenes look at a movie that wasn't, Lost in La Mancha is an incisive, entertaining document of the difficulties inherent in the moviemaking process.", "critic": {"meter": 94, "numReviews": 99, "rating": 7.5}, "dvd": 1056412800000, "fresh": 93, "lastUpdated": 1441131292000, "production": "IFC Films", "rotten": 6, "viewer": {"meter": 77, "numReviews": 15918, "rating": 3.6}, "website": "http://www.smart.co.uk/lostinlamancha/"}, "type": "movie", "year": 2002}