{"_id": "573a13caf29313caabd7bf14", "awards": {"nominations": 19, "text": "9 wins & 19 nominations.", "wins": 9}, "cast": ["Vanessa Paradis", "Kevin Parent", "Hèlène Florent", "Evelyne Brochu"], "countries": ["Canada", "France"], "directors": ["Jean-Marc Vallèe"], "fullplot": "A love story about people separated by time and place but connected in profound and mysterious ways. Atmospheric, fantastical, tragic and hopeful, the film chronicles the parallel fates of Jacqueline, a young mother with a disabled son in 1960s Paris, and Antoine, a recently divorced, successful DJ in present day Montreal. What binds the two stories together is love - euphoric, obsessive, tragic, youthful, timeless love. In 1960s Paris, a working class woman gives birth to her first child, Laurent - a Down Syndrome son. Undaunted she embraces the challenge of raising her beloved offspring as normally as one would any other child. Her husband abandons them both. She bravely brushes this additional hiccup aside as Laurent replaces her spouse as the perfect man of her dreams. As Laurent approaches school age Jacqueline's aplomb becomes obsessive and cloying. Her increasingly self-destructive attachment to her son is raised to a fever pitch when, at the age of seven, he meets a Down Syndrome girl (Vèronique) and experiences his first crush. His sudden desire for independence, and his attraction to Vèra, are the catalysts that transform Jacqueline from a loving mother into something resembling a lover scorned. What emerges is a love triangle of potentially tragic proportions. In 21st century Montreal, a forty year old divorcèe, Carole, is trying to restart her life after her divorce, two years earlier, from Antoine, a devastatingly handsome, successful touring DJ. Soul mates who've been a couple since the age of fifteen, their divorce is a schism that might prove impossible for either of them to put in the past. Making the transition even more difficult for Carole is the fact that her two daughters, one teen, one tween, are about to gain a stepmother, a stunningly beautiful, heartbreaking blonde, a woman about to \"steal\" away the perfect man of her dreams. The young girls are being cruelly pulled in two different directions, Antoine's father, a recovering alcoholic, seems to side with his ex-daughter-in-law, and Carole is succumbing to fits of depression and potentially dangerous bouts of sleepwalking. What emerges is a love triangle of potentially tragic proportions.", "genres": ["Drama", "Romance"], "imdb": {"id": 1550312, "rating": 7.4, "votes": 9663}, "languages": ["French"], "lastupdated": "2015-08-23 00:01:12.657000000", "metacritic": 53, "plot": "A love story between a man and woman. And between a mother and her son. A mystical and fantastical odyssey on love.", "poster": "https://m.media-amazon.com/images/M/MV5BMTgyOTExNzM1Ml5BMl5BanBnXkFtZTcwMDExMzY2Ng@@._V1_SY1000_SX677_AL_.jpg", "released": 1321574400000, "runtime": 120, "title": "Cafè de Flore", "tomatoes": {"critic": {"meter": 63, "numReviews": 52, "rating": 6.4}, "dvd": 1389657600000, "fresh": 33, "lastUpdated": 1442085340000, "production": "Adopt Films", "rotten": 19, "viewer": {"meter": 75, "numReviews": 3911, "rating": 3.8}, "website": "http://www.cafedeflorelefilm.com/"}, "type": "movie", "writers": ["Jean-Marc Vallèe"], "year": 2011}