{"_id": "573a13e0f29313caabdba77e", "awards": {"nominations": 3, "text": "2 wins & 3 nominations.", "wins": 2}, "cast": ["Reese Witherspoon", "Arnold Oceng", "Ger Duany", "Emmanuel Jal"], "countries": ["Kenya", "India", "USA"], "directors": ["Philippe Falardeau"], "fullplot": "Four Sudanese children are orphaned after their village is massacred in the Second Sudanese Civil War. Consequently, they make an arduous and dangerous trek through the plains, enduring hardship, death and sacrifice all the way until they reach safety in a refugee camp in Ethiopia. Years later, these youths are among 3600 selected for resettlement in America, only to have the one girl among them sent to Boston, while the three boys must to make a new life in Kansas City. Together, these young men must adjust to an alien culture even as the emotional baggage of their past haunts them. However, these newcomers, and their new friends like employment counselor Carrie Davis, strive to understand each other in this new home, as they make peace with their histories in a challenge that will change all their lives.", "genres": ["Drama"], "imdb": {"id": 2652092, "rating": 7.4, "votes": 15017}, "languages": ["English"], "lastupdated": "2015-09-04 00:02:21.943000000", "metacritic": 65, "num_mflix_comments": 1, "plot": "A group of Sudanese refugees given the chance to resettle in America arrive in Kansas City, Missouri, where their encounter with an employment agency counselor forever changes all of their lives.", "poster": "https://m.media-amazon.com/images/M/MV5BMjA0Njc1MzA4MF5BMl5BanBnXkFtZTgwODc1MjUwMjE@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1415923200000, "runtime": 110, "title": "The Good Lie", "tomatoes": {"boxOffice": "$2.7M", "consensus": "The Good Lie sacrifices real-life nuance in order to turn its true story into a Hollywood production, but the results still add up to a compelling, well-acted, and deeply moving drama.", "critic": {"meter": 88, "numReviews": 80, "rating": 6.7}, "dvd": 1429747200000, "fresh": 70, "lastUpdated": 1440527051000, "production": "Warner Bros. Pictures", "rotten": 10, "viewer": {"meter": 82, "numReviews": 21361, "rating": 4}, "website": "http://www.thegoodliemovie.com/"}, "type": "movie", "writers": ["Margaret Nagle"], "year": 2014}