{"_id": "573a13c2f29313caabd66795", "awards": {"nominations": 5, "text": "3 wins & 5 nominations.", "wins": 3}, "cast": ["Steve Evets", "Eric Cantona", "Stephanie Bishop", "Gerard Kearns"], "countries": ["UK", "France", "Italy", "Belgium", "Spain"], "directors": ["Ken Loach"], "fullplot": "Eric Bishop, a middle-aged postman working for the Manchester sorting office, is going through a dreadful crisis. For starters, his second life companion has not resurfaced although she was released from prison a few months ago. He is left alone with two stepsons to look after, which is no bed of roses since the two teens disrespect him and keep disobeying him. To make matters worse, Ryan, the older boy, fascinated by Zac, a dangerous gangster, has accepted to hide his gun in Eric's house. On the other hand, he is asked by Sam, his student daughter who has a newborn baby,to get back in touch with Lily, his separated wife. Now, Eric left her not long after she gave back to their daughter. As a result Eric panics... Having lost all his bearings, Eric Bishop soliloquizes face to the poster of his idol, another Eric, French footballer Eric Cantona, when the latter appears just like the genie out of Aladdin's lamp. Through a series of aphorisms peculiar to him, the footballer-philosopher will help remorse-ridden desperate Eric Bishop to get by.", "genres": ["Comedy", "Drama", "Fantasy"], "imdb": {"id": 1242545, "rating": 7.2, "votes": 12288}, "languages": ["English", "French"], "lastupdated": "2015-08-23 00:39:43", "metacritic": 66, "num_mflix_comments": 2, "plot": "Eric, a football fanatic postman whose life is descending into crisis, receives some life coaching from the famously philosophical Eric Cantona.", "poster": "https://m.media-amazon.com/images/M/MV5BNjk1Mjk1NDk4NF5BMl5BanBnXkFtZTcwMDg1MDczMw@@._V1_SY1000_SX677_AL_.jpg", "released": 1243382400000, "runtime": 116, "title": "Looking for Eric", "tomatoes": {"consensus": "Ken Loach's latest is an uplifting, entertaining and amusing socio-drama featuring a match-winning performance from Eric Cantona.", "critic": {"meter": 85, "numReviews": 97, "rating": 7.1}, "dvd": 1255305600000, "fresh": 82, "lastUpdated": 1441130540000, "production": "IFC Films", "rotten": 15, "viewer": {"meter": 78, "numReviews": 9462, "rating": 3.7}, "website": "http://www.lookingforericmovie.co.uk/"}, "type": "movie", "writers": ["Paul Laverty (screenplay)"], "year": 2009}