{"_id": "573a13cdf29313caabd83cbf", "awards": {"nominations": 18, "text": "Nominated for 1 Oscar. Another 7 wins & 18 nominations.", "wins": 8}, "cast": ["Eric Schlosser", "Richard Lobb", "Vince Edwards", "Carole Morison"], "countries": ["USA"], "directors": ["Robert Kenner"], "fullplot": "The current method of raw food production is largely a response to the growth of the fast food industry since the 1950s. The production of food overall has more drastically changed since that time than the several thousand years prior. Controlled primarily by a handful of multinational corporations, the global food production business - with an emphasis on the business - has as its unwritten goals production of large quantities of food at low direct inputs (most often subsidized) resulting in enormous profits, which in turn results in greater control of the global supply of food sources within these few companies. Health and safety (of the food itself, of the animals produced themselves, of the workers on the assembly lines, and of the consumers actually eating the food) are often overlooked by the companies, and are often overlooked by government in an effort to provide cheap food regardless of these negative consequences. Many of the changes are based on advancements in science and technology, but often have negative side effects.The products made have been shown in several studies to enlarge male sexual organs and increase male breast size. The answer that the companies have come up with is to throw more science at the problems to bandage the issues but not the root causes. The global food supply may be in crisis with lack of biodiversity, but can be changed on the demand side of the equation.", "genres": ["Documentary"], "imdb": {"id": 1286537, "rating": 7.9, "votes": 39285}, "languages": ["English"], "lastupdated": "2015-09-11 11:46:21.980000000", "metacritic": 80, "plot": "An unflattering look inside America's corporate controlled food industry.", "poster": "https://m.media-amazon.com/images/M/MV5BZGNhYTA1ODMtY2M5Yy00MTYwLWFlZmEtNDM4M2I4ZTI2ZmVmXkEyXkFqcGdeQXVyNTA4NzY1MzY@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 1248998400000, "runtime": 94, "title": "Food, Inc.", "tomatoes": {"boxOffice": "$4.2M", "consensus": "An eye-opening expose of the modern food industry, Food, Inc. is both fascinating and terrifying, and essential viewing for any health-conscious citizen.", "critic": {"meter": 96, "numReviews": 106, "rating": 7.7}, "dvd": 1257206400000, "fresh": 102, "lastUpdated": 1442427951000, "production": "Magnolia Pictures", "rotten": 4, "viewer": {"meter": 86, "numReviews": 74146, "rating": 3.9}, "website": "http://www.foodincmovie.com/"}, "type": "movie", "writers": ["Robert Kenner", "Elise Pearlstein", "Kim Roberts"], "year": 2008}