{"_id": "573a13aaf29313caabd2203b", "awards": {"nominations": 33, "text": "Nominated for 7 Oscars. Another 6 wins & 33 nominations.", "wins": 13}, "cast": ["David McCullough", "Jeff Bridges", "Paul Vincent O'Connor", "Chris Cooper"], "countries": ["USA"], "directors": ["Gary Ross"], "fullplot": "It's the Depression, and everyone needs to hold onto a dream to get them through the bad times. Car maker Charles Howard is no different, he who is trying to rebuild his life after the tragic death of his only child and the resulting end of his first marriage. With second wife Marcela at his side, Charles wants to get into horse racing and ends up with a team of underdogs who are also chasing their own dream. The first is trainer Tom Smith, who has a natural instinct to spot the capabilities of horses. The second is the horse Tom chooses for Charles, Seabiscuit, an unconventional choice as despite his pedigreed lineage, Seabiscuit is small at fifteen and a half hands tall with a slight limp. But Tom can see something in Seabiscuit's nature to make him a winner, if only Seabiscuit can be retrained from his inbred losing ways. And third is the jockey they decide to hire, Johnny \"Red\" Pollard, so nicknamed because of his hair color. Like Tom, Red has always shown a natural way with horses, but a difficult upbringing due solely to the Depression has made Red an angry young man, which has gotten him into trouble both on and off the track. And he is large for a jockey, and thus he always feels the need to battle the weight issue. Another common trait between Tom, Seabiscuit and Red is that they have been called crazy by those in traditional horse racing circles. Against the odds, Seabiscuit, with his human team behind him, does show his winning abilities and captures the imagination of all those others wanting to believe in a dream. But Seabiscuit's victories are at smaller races. As such, Charles aims high and wants Seabiscuit to race Triple Crown winner War Admiral, who by all accounts is a winner and should be a winner. If given the chance to race against War Admiral (whose owner doesn't want to race as he feels he has nothing to prove), will Seabiscuit and his team continue to keep the dreams of the common Americans alive? Through the good and the bad, especially as Red and Seabiscuit face mirroring problems, they all have to decide what is in their collective best interest.", "genres": ["Drama", "History", "Sport"], "imdb": {"id": 329575, "rating": 7.3, "votes": 55251}, "languages": ["English"], "lastupdated": "2015-09-05 00:28:16.300000000", "metacritic": 72, "plot": "True story of the undersized Depression-era racehorse whose victories lifted not only the spirits of the team behind it but also those of their nation.", "poster": "https://m.media-amazon.com/images/M/MV5BMWVmMmE1YzItNGUyZS00MzgwLWFhNzYtYjM4ZTJmZDVjNmNmL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1059091200000, "runtime": 140, "title": "Seabiscuit", "tomatoes": {"boxOffice": "$120.1M", "consensus": "A life-affirming, if saccharine, epic treatment of a spirit-lifting figure in sports history.", "critic": {"meter": 77, "numReviews": 201, "rating": 7.1}, "dvd": 1071532800000, "fresh": 155, "lastUpdated": 1442079085000, "production": "Universal Pictures", "rotten": 46, "viewer": {"meter": 76, "numReviews": 118018, "rating": 3.3}, "website": "http://www.seabiscuitonline.com/"}, "type": "movie", "writers": ["Laura Hillenbrand (book)", "Gary Ross (screenplay)"], "year": 2003}