{"_id": "573a1395f29313caabce1a6a", "awards": {"nominations": 9, "text": "Nominated for 1 Oscar. Another 8 nominations.", "wins": 0}, "cast": ["Doris Day", "Stephen Boyd", "Jimmy Durante", "Martha Raye"], "countries": ["USA"], "directors": ["Charles Walters"], "fullplot": "It's the early 1900's. The Wonder Circus is a traveling circus owned and operated by Anthony Wonder - who performs as a clown - and his daughter Kitty Wonder - who performs as an aerialist and trick rider. Although Kitty loves her Pop as she and all the other circus performers call her father, she hates his gambling addiction which is placing the circus deep in debt. They and their employees treat the circus like one big family, especially Lulu the fortune teller who wants to be Mrs. Wonder, but the employees may only be so loyal if they aren't getting paid. As such, many of the performers leave or threaten to leave to join the Wonder Circus' main competitor, the Noble Circus owned by the power and money hungry John Noble. Although Pop and Kitty don't want anyone to leave their employ, the only act that they will never let go is Jumbo, their trained elephant, who Noble had tried to buy in the past. As many performers leave, into their midst comes circus Jack-of-all-trades Sam Rawlins. Kitty is reluctant to hire Sam because she wants loyal people working for them instead of someone like Sam who she sees as a \"sunshiner\", a career circus employee who moves from gig to gig. Pop has no such reservation and hires him. Despite still being somewhat suspicious of Sam's motivations since she figures he could get more money working for Noble with his vast array of circus skills, Kitty starts to fall in love with Sam, and he with her, despite his attempts to feign disinterest. Indeed, Sam is hiding a secret about himself and his reason for being with the show. That secret may jeopardize his standing with the Wonders if they ever found out - even if Sam begins to have second thoughts about his reasons for joining them - and jeopardize the entire Wonder Circus itself which includes Jumbo's life.", "genres": ["Comedy", "Musical", "Romance"], "imdb": {"id": 55797, "rating": 6.3, "votes": 923}, "languages": ["English"], "lastupdated": "2015-09-16 12:00:56.510000000", "num_mflix_comments": 2, "plot": "A Debt-ridden circus is saved by an well-meaning but inept publicity man Pop Wonder.", "poster": "https://m.media-amazon.com/images/M/MV5BMTQxNzgwNjU3OF5BMl5BanBnXkFtZTgwNzAzMDIxMTE@._V1_SY1000_SX677_AL_.jpg", "rated": "G", "released": -221875200000, "runtime": 123, "title": "Billy Rose's Jumbo", "tomatoes": {"dvd": 1114473600000, "lastUpdated": 1441134860000, "production": "MGM Home Entertainment", "viewer": {"meter": 58, "numReviews": 2030, "rating": 3.2}}, "type": "movie", "writers": ["Ben Hecht (book)", "Charles MacArthur (book)", "Sidney Sheldon (screenplay)"], "year": 1962}