{"_id": "573a13d4f29313caabd99806", "awards": {"nominations": 3, "text": "3 nominations.", "wins": 0}, "cast": ["Oscar Isaac", "Viggo Mortensen", "Kirsten Dunst", "Daisy Bevan"], "countries": ["UK", "France", "USA"], "directors": ["Hossein Amini"], "fullplot": "1962. A glamorous American couple, the charismatic Chester MacFarland (Mortensen) and his alluring younger wife Colette (Dunst), arrive in Athens by boat via the Corinth Canal. While sightseeing at the Acropolis they encounter Rydal (Isaac), a young, Greek-speaking American who is working as a tour guide, scamming tourists on the side. Drawn to Colette's beauty and impressed by Chester's wealth and sophistication, Rydal gladly accepts their invitation to dinner. However, all is not as it seems with the MacFarlands and Chester's affable exterior hides darker secrets. When Rydal visits the couple at their exclusive hotel, Chester presses him to help move the body of a seemingly unconscious man who he claims attacked him. In the moment, Rydal agrees but as events take a more sinister turn he finds himself compromised and unable to pull himself free. His increasing infatuation with the vulnerable and responsive Colette gives rise to Chester's jealousy and paranoia, leading to a tense and dangerous battle of wits between the two men.", "genres": ["Romance", "Thriller"], "imdb": {"id": 1976000, "rating": 6.2, "votes": 18372}, "languages": ["English", "Greek", "Turkish"], "lastupdated": "2015-08-19 00:28:59.033000000", "metacritic": 66, "plot": "A thriller centered on a con artist, his wife, and a stranger who flee Athens after one of them is caught up in the death of a private detective.", "poster": "https://m.media-amazon.com/images/M/MV5BMTcxMjE0NjY1NV5BMl5BanBnXkFtZTgwMzU0NTYxMTE@._V1._CR29,32,1351,1987_SY264_CR0,0,178,264_AL_.jpg", "rated": "PG-13", "released": 1409184000000, "runtime": 96, "title": "The Two Faces of January", "tomatoes": {"boxOffice": "$0.5M", "consensus": "With striking visuals, complex characters, and Hitchcockian plot twists, The Two Faces of January offers a pleasantly pungent treat for fans of romantic thrillers.", "critic": {"meter": 82, "numReviews": 105, "rating": 6.9}, "dvd": 1421107200000, "fresh": 86, "lastUpdated": 1442430046000, "production": "Magnolia Pictutures", "rotten": 19, "viewer": {"meter": 47, "numReviews": 13535, "rating": 3.2}, "website": "http://www.magpictures.com/twofacesofjanuary/"}, "type": "movie", "writers": ["Hossein Amini", "Patricia Highsmith (based on the novel by)"], "year": 2014}