{"_id": "573a13a7f29313caabd1bda0", "awards": {"nominations": 9, "text": "7 wins & 9 nominations.", "wins": 7}, "cast": ["Robert Evans", "Eddie Albert", "Peter Bart", "Charlie Bluhdorn"], "countries": ["USA"], "directors": ["Nanette Burstein", "Brett Morgen"], "fullplot": "This documentary captures the life story of legendary Hollywood producer and studio chief Robert Evans. The first actor to ever to run a film studio, Robert Evans' film career started in 1956, poolside at the Beverly Hills Hotel. His good looks, charm and overwhelming confidence captured the eye of screen legend Norma Shearer, who offered him a film role. After a glamorous--but short-lived--career as a movie star, Evans tried out producing. At the age of 34, with no producing credits to his name, he landed a job as chief of production at Paramount Pictures. Evans ran the studio from 1966-1974. During his tenure, he was responsible for such revolutionary films as The Godfather, Rosemary's Baby, Love Story, The Odd Couple, Harold and Maude and Chinatown. By the early '80s, the Golden Boy of Hollywood was losing his luster. After a failed marriage to Ali MacGraw, a cocaine bust and rumored involvement with the Cotton Club murder, he disappeared into near-obscurity. Only through tremendous will and uncanny luck did he once again rise as the kid who stays in the picture.", "genres": ["Documentary", "Biography"], "imdb": {"id": 303353, "rating": 7.4, "votes": 5841}, "languages": ["English"], "lastupdated": "2015-09-02 00:48:57.320000000", "metacritic": 75, "num_mflix_comments": 1, "plot": "Documentary about legendary Paramount producer Robert Evans (the film shares the same name as Evans's famous 1994 autobiography).", "poster": "https://m.media-amazon.com/images/M/MV5BMTk4OTE1NTg0Nl5BMl5BanBnXkFtZTcwNjkzNjYyMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1029456000000, "runtime": 93, "title": "The Kid Stays in the Picture", "tomatoes": {"lastUpdated": 1440612472000, "viewer": {"numReviews": 44, "rating": 0}}, "type": "movie", "writers": ["Robert Evans (book)", "Brett Morgen (adaptation)"], "year": 2002}