{"_id": "573a13b6f29313caabd47009", "awards": {"nominations": 0, "text": "2 wins.", "wins": 2}, "cast": ["Jerry Banks", "Jill Bennett", "Jamie Blake", "Emily A. Burton"], "countries": ["USA"], "directors": ["Lee Friedlander"], "fullplot": "Ever have an identity crisis? Tell a little white lie here and there, just to make everyone happy? Well, Alex Houston has got you beat, hands down. After telling her fiancè, Dana, that her entire family is dead, Manhattanite Alex whisks off to her childhood home in South Carolina to serve as bridesmaid at her high-maintenance, estranged sister Jeannie's wedding. As she tries not to steal Jeannie's thunder by telling her family that a) she's engaged, and b) the man she's going to marry is a Jewish African American, things get a little mixed up. For starters, Alex's sharp-tongued, mischievous best friend Jonathan unwittingly starts a rumor at the wedding that Alex is gay and Dana is a woman. When her family reacts in a surprisingly supportive way, Alex decides to go with it. It's easier than telling the truth, right? But when Alex and Jonathan decide to hire sexy lesbian Risa to act as her lover when Jeannie comes to visit Alex in New York, things really start to get out of hand. Director Lee Friedlander follows up her award-winning 2004 film \"Girl Play\" with this witty, farcical romp that explores the sometimes comically bumbling way in which we come out to the people we love - whether we're gay or straight. As she becomes increasingly entangled in her web of lies, Alex struggles to come to terms with her fiancè, her family and most of all herself along the way.", "genres": ["Comedy", "Romance"], "imdb": {"id": 488023, "rating": 6.2, "votes": 636}, "languages": ["English"], "lastupdated": "2015-08-27 00:46:16.023000000", "plot": "Ever have an identity crisis? Tell a little white lie here and there, just to make everyone happy? Well, Alex Houston has got you beat, hands down. After telling her fiancè, Dana, that her ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTI1OTc5ODY0MV5BMl5BanBnXkFtZTcwMzYzNTg0MQ@@._V1_SY1000_SX677_AL_.jpg", "runtime": 96, "title": "Out at the Wedding", "tomatoes": {"dvd": 1234828800000, "lastUpdated": 1441911756000, "production": "Goff-Kellam Productions", "viewer": {"meter": 51, "numReviews": 498, "rating": 3.3}, "website": "http://www.outatthewedding.com/"}, "type": "movie", "writers": ["Paula Goldberg"], "year": 2007}