{"_id": "573a13bef29313caabd5bb08", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Armin Mueller-Stahl", "Iris Berben", "Jessica Schwarz", "August Diehl"], "countries": ["Germany"], "directors": ["Heinrich Breloer"], "fullplot": "In the 1840s, Lèbeck is a dominating commercial town on the Baltic coast, and the Buddenbrooks are among the town's first families. Consul Jean Buddenbrook has two sons, Thomas and Christian, and one daughter, Antonia, called Tony. Even though he dearly loves them, he expects his children to sacrifice personal happiness for the sake of the company if necessary. The first to learn this is Tony, who is married off to Hamburgian businessman Bendix Grènlich. Her brothers have meanwhile learned the trade in Amsterdam and London respectively. Crushed by Tony's marriage disaster and several unlucky transactions, Jean Buddenbrook makes over the business to his eldest, Thomas. Thomas marries the dutch heiress Gerda, who is a passionate violin player. But Thomas never forgets his first love, a flower girl. After having spent time in Valparaiso, Christian returns to Lèbeck, too. Thomas soon learns that his brother is much more interested in the theatre and actress Aline than in the company, which causes a rift between the brothers. Seeing that she can't heal it, their mother admonishes them to at least conceal it from the public.", "genres": ["Drama"], "imdb": {"id": 1058601, "rating": 5.8, "votes": 1159}, "languages": ["German"], "lastupdated": "2015-08-10 00:35:05.330000000", "num_mflix_comments": 2, "plot": "In the 1840s, Lèbeck is a dominating commercial town on the Baltic coast, and the Buddenbrooks are among the town's first families. Consul Jean Buddenbrook has two sons, Thomas and ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTQ1Njk2NTIyMl5BMl5BanBnXkFtZTcwNTkwNTgyMg@@._V1_SY1000_SX677_AL_.jpg", "released": 1230163200000, "runtime": 151, "title": "Buddenbrooks", "tomatoes": {"dvd": 1176163200000, "lastUpdated": 1440613056000, "production": "Warner Bros. Pictures", "viewer": {"meter": 39, "numReviews": 285, "rating": 3.1}, "website": "http://wwws.warnerbros.de/buddenbrooks/"}, "type": "movie", "writers": ["Thomas Mann (novel)", "Heinrich Breloer (screenplay)", "Horst Kènigstein (screenplay)"], "year": 2008}