{"_id": "573a13a4f29313caabd0fc4d", "awards": {"nominations": 4, "text": "1 win & 4 nominations.", "wins": 1}, "cast": ["Ben Affleck", "James Gandolfini", "Christina Applegate", "Catherine O'Hara"], "countries": ["USA"], "directors": ["Mike Mitchell"], "fullplot": "It's the Christmas season. Wealthy Chicago ad executive Drew Latham has long avoided the family traditions of Christmas, but has dreaded being alone on the actual day. So when his tropical Christmas vacation with girlfriend Missy Vangilder falls through with Missy breaking up with him in the process, Drew, in going through some self-therapy, decides what he really needs is to relive the memorable Christmases from his childhood, which includes spending time with his parents and younger brother. As that is not possible, he decides to rent a family, namely ones he's never met before, the Valcos - husband and wife Tom and Christine and their teenaged son Brian - who now live in Drew's childhood home in suburban Chicago. Tom initially wants nothing to do with Drew until an exorbitant sum of money is involved, all written in a contract which expires at the end of Christmas day. What Drew is initially unaware of, or what he chooses to remain ignorant about, is that the Valcos are going through their own family problems, which are only exacerbated by Drew's presence. For the Valcos, the questions become whether they can endure Drew's stay until the end of Christmas day, and if they can if the money will solve their family problems. In the process, Drew may come to an admission to himself of what he wants in life and perhaps how best to achieve it. The achieving it may be difficult if he doesn't fully know that life, and as external forces come into play to complicate matters.", "genres": ["Comedy", "Romance"], "imdb": {"id": 252028, "rating": 5.3, "votes": 15974}, "languages": ["English", "Spanish"], "lastupdated": "2015-08-19 00:40:19.923000000", "metacritic": 19, "plot": "A lonely, obnoxious young millionaire pays a family to spend Christmas with him.", "poster": "https://m.media-amazon.com/images/M/MV5BMTcwMTI4MTY3Ml5BMl5BanBnXkFtZTcwOTUzMjcyMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1098403200000, "runtime": 91, "title": "Surviving Christmas", "tomatoes": {"boxOffice": "$11.2M", "consensus": "Surviving Christmas is unpleasant characters attacking each other for 90 minutes before delivering a typical, hollow anti-consumerist message", "critic": {"meter": 7, "numReviews": 112, "rating": 3}, "dvd": 1103587200000, "fresh": 8, "lastUpdated": 1441048534000, "production": "Dreamworks", "rotten": 104, "viewer": {"meter": 28, "numReviews": 28355, "rating": 2.6}, "website": "http://www.survivingchristmas-themovie.com/"}, "type": "movie", "writers": ["Deborah Kaplan (story)", "Harry Elfont (story)", "Deborah Kaplan (screenplay)", "Harry Elfont (screenplay)", "Jennifer Ventimilia (screenplay)", "Joshua Sternin (screenplay)"], "year": 2004}