{"_id": "573a1397f29313caabce6864", "awards": {"nominations": 0, "text": "Nominated for 1 Oscar. Another 2 wins.", "wins": 3}, "cast": ["Bob Newhart", "Eva Gabor", "Geraldine Page", "Joe Flynn"], "countries": ["USA"], "directors": ["John Lounsbery", "Wolfgang Reitherman", "Art Stevens"], "fullplot": "When a bottle containing a plea for help from a little girl named Penny makes its way to the Rescue Aid Society, a mouse organization in the basement of the United Nations building dedicated to the rescue and well-being of anyone in need, it is up to the brave mouse Miss Bianca and her chosen partner, the shy janitor Bernard, to rescue the girl. Searching for clues at Penny's home at Morningside Orphanage in New York City, the two mice discover that the girl has been kidnapped by the evil pawn shop owner Madame Medusa and her companion Mr. Snoops. On the back of Orville the albatross, Miss Bianca and Bernard travel to the terrifyingly gloomy Devil's Bayou where they learn the shocking truth: the innocent young girl is being forced down into a dangerous, dark underground pirate's cave where she must find the Devil's Eye, the world's largest diamond and Madame Medusa's greatest obsession. Before returning safely home, Miss Bianca, Bernard, and Penny will have to combat Madame Medusa's two ferocious pet alligators Brutus and Nero with the help of Ellie Mae and Evinrude the dragonfly, as well as survive the raging tides inside the horrible pirate's cave.", "genres": ["Animation", "Adventure", "Family"], "imdb": {"id": 76618, "rating": 6.9, "votes": 38083}, "languages": ["English"], "lastupdated": "2015-08-20 00:39:07.627000000", "num_mflix_comments": 3, "plot": "Two mice of the Rescue Aid Society search for a little girl kidnapped by unscrupulous treasure hunters.", "poster": "https://m.media-amazon.com/images/M/MV5BZjkxZjg5Y2QtMjczMy00OTg1LThlZjktZTUwZmZkNDNjMDNkXkEyXkFqcGdeQXVyMjA0MDQ0Mjc@._V1_SY1000_SX677_AL_.jpg", "rated": "G", "released": 235785600000, "runtime": 78, "title": "The Rescuers", "tomatoes": {"consensus": "Featuring superlative animation, off-kilter characters, and affectionate voice work by Bob Newhart and Eva Gabor, The Rescuers represents a bright spot in Disney's post-golden age.", "critic": {"meter": 83, "numReviews": 29, "rating": 6.6}, "dvd": 1053388800000, "fresh": 24, "lastUpdated": 1442079568000, "production": "Walt Disney Pictures", "rotten": 5, "viewer": {"meter": 68, "numReviews": 79321, "rating": 3.3}}, "type": "movie", "writers": ["Margery Sharp (suggested by \"The Rescuers\" and \"Miss Bianca\" by)", "Larry Clemmons (story)", "Ken Anderson (story)", "Frank Thomas (story)", "Vance Gerry (story)", "David Michener (story)", "Ted Berman (story)", "Fred Lucky (story)", "Burny Mattinson (story)", "Dick Sebast (story)"], "year": 1977}