{"_id": "573a13baf29313caabd50d56", "awards": {"nominations": 3, "text": "10 wins & 3 nominations.", "wins": 10}, "cast": ["Ozen Ozkan", "Ali Bey Kayali", "Elit Iscan", "Bèlent Emin Yarar"], "countries": ["Turkey"], "directors": ["Reha Erdem"], "fullplot": "A small, poor village leaning over high rocky mountains, facing the immense sea, flanked by olive yards. Villagers are simple and diligent people who struggle to cope with a harsh nature. They earn their living, on a daily survival basis, out of the earth and of a few animals they feed. Just like the animals and trees around them, they have the knowledge of their temporary existence, hence a sober resignation prevails. They live according to the rhythm of the earth, air and water, day and night and seasons. The daily time is divided into five parts by the sound of the call to prayer. Every day, all human events are lived through within these five time slices. In child raising, grownups go on with the practice they have experienced by their parents. They expose their love awkwardly and consider beating a favorable method. Fathers always prefer one of their sons. Mothers command their daughters ruthlessly. èmer, Yakup and Yildiz, three children of about 12,13 years old, just between childhood and youth, are the prominent characters in this movie of five times. èmer, the son of the imam, wishes hopelessly for the death of his father. When he understands that wishful thinking does not have any concrete results, he begins to search for childish ways to kill his father. He shares his guilty thoughts with his friend Yakup. Children study in the village school consisting of only one classroom. Families show their gratitude to the young woman teacher by giving her presents -the bread they cook themselves, the milk of their own sheep. Yakup is in love with his teacher. He hides his guilty feelings even from his best friend èmer. When some day he sees his father spying the teacher, he dreams, like Yakup, of killing his father. Yildiz both studies and tries to manage the household works imposed by her own mother. She tries to be a mother for her baby brother. On the other hand, she learns with irritation about the secrets of the relationship between men and women. Five times elapse. Children, oscillating between rage and guilt, grow up slowly. èmer gives up killing his father. Stuck between love and hate, he cries desperately.", "genres": ["Drama"], "imdb": {"id": 855729, "rating": 7.4, "votes": 2651}, "languages": ["Turkish"], "lastupdated": "2015-07-13 00:20:55.010000000", "num_mflix_comments": 1, "plot": "A small, poor village leaning over high rocky mountains, facing the immense sea, flanked by olive yards. Villagers are simple and diligent people who struggle to cope with a harsh nature. ...", "poster": "https://m.media-amazon.com/images/M/MV5BNjU1NjI1MjEyNl5BMl5BanBnXkFtZTgwOTgzMTA2MDE@._V1_SY1000_SX677_AL_.jpg", "released": 1200009600000, "runtime": 111, "title": "Times and Winds", "tomatoes": {"consensus": "Lilting and meditative, Reha Erdem's story of three adolescents in rural Turkey captivates with intimate details and long takes of the endless countryside.", "critic": {"meter": 87, "numReviews": 39, "rating": 7.1}, "dvd": 1216080000000, "fresh": 34, "lastUpdated": 1442165359000, "production": "Kino International", "rotten": 5, "viewer": {"meter": 81, "numReviews": 860, "rating": 3.8}}, "type": "movie", "writers": ["Reha Erdem"], "year": 2006}