{"_id": "573a13b5f29313caabd4397a", "awards": {"nominations": 24, "text": "Nominated for 1 Oscar. Another 15 wins & 24 nominations.", "wins": 16}, "cast": ["Yun-Fat Chow", "Li Gong", "Jay Chou", "Ye Liu"], "countries": ["Hong Kong", "China"], "directors": ["Yimou Zhang"], "fullplot": "China, Later Tang Dynasty, 10th Century. On the eve of the Chong Yang Festival, golden flowers fill the Imperial Palace. The Emperor (Chow Yun Fat) returns unexpectedly with his second son, Prince Jai (Jay Chou). His pretext is to celebrate the holiday with his family, but given the chilled relations between the Emperor and the ailing Empress (Gong Li), this seems disingenuous. For many years, the Empress and Crown Prince Wan (Liu Ye), her stepson, have had an illicit liaison. Feeling trapped, Prince Wan dreams of escaping the palace with his secret love Chan (Li Man), the Imperial Doctor's daughter. Meanwhile, Prince Jai, the faithful son, grows worried over the Empress's health and her obsession with golden chrysanthemums. Could she be headed down an ominous path? The Emperor harbors equally clandestine plans; the Imperial Doctor (Ni Dahong) is the only one privy to his machinations. When the Emperor senses a looming threat, he relocates the doctor's family from the Palace to a remote area. While they are en route, mysterious assassins attack them. Chan and her mother, Jiang Shi (Chen Jin) are forced back to the palace. Their return sets off a tumultuous sequence of dark surprises. Amid the glamour and grandeur of the festival, ugly secrets are revealed. As the Imperial Family continues its elaborate charade in a palatial setting, thousands of golden armored warriors charge the palace. Who is behind this brutal rebellion? Where do Prince Jai's loyalties lie? Between love and desire, is there a final winner? Against a moonlit night, thousands of chrysanthemum blossoms are trampled as blood spills across the Imperial Palace.", "genres": ["Drama", "Romance"], "imdb": {"id": 473444, "rating": 7, "votes": 34766}, "languages": ["Mandarin"], "lastupdated": "2015-08-28 00:41:11.940000000", "metacritic": 70, "num_mflix_comments": 2, "plot": "During China's Tang dynasty the emperor has taken the princess of a neighboring province as wife. She has borne him two sons and raised his eldest. Now his control over his dominion is complete, including the royal family itself.", "poster": "https://m.media-amazon.com/images/M/MV5BYjdmN2E4YmEtZTIzMy00ZDA1LTllY2UtNjQ5NTgyNjkxYWUyL2ltYWdlXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1168560000000, "runtime": 114, "title": "Curse of the Golden Flower", "tomatoes": {"boxOffice": "$6.5M", "consensus": "Melodrama, swordplay, and CG armies -- fans of martial arts epic will get what they bargain for, though the baroque art direction can be both mesmerizing and exhaustively excessive.", "critic": {"meter": 66, "numReviews": 122, "rating": 6.4}, "dvd": 1174953600000, "fresh": 81, "lastUpdated": 1440877266000, "production": "Sony Classic Pictures", "rotten": 41, "viewer": {"meter": 65, "numReviews": 50877, "rating": 3.5}, "website": "http://www.sonyclassics.com/curseofthegoldenflower/"}, "type": "movie", "writers": ["Yu Cao (play)", "Yimou Zhang"], "year": 2006}