{"_id": "573a139af29313caabcf0f30", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Dolph Lundgren", "Bruce Payne", "Claire Stansfield", "Ian Roberts"], "countries": ["South Africa", "USA"], "directors": ["Keoni Waxman"], "fullplot": "Torn from today's headlines \"Sweepers\" is a non-stop, action-packed thriller set in war ravaged Angola. Christian Erickson is a leader in the Humanitarian Order of Chivalry on assignment in Angola with his team of 'sweepers' who are attempting to clear land mines from around rural villages where villagers and children are being maimed and killed daily. During one sweeping operation, Christian's 11 year-old son Johnny follows his father to a mine field and during a rebel attack is killed when he steps on a land mine. Back in America, a terrorist attack at the home of a US senator utilizes a new super advanced A-6 land-mine smuggled in from Angola. Bomb squad expert Michelle Flynn, who watched her fiance die in the attack, is sent on a covert operation to Angola to recover an A-6 mine, so that the political intrigue behind its manufacture can be revealed. Michelle joins forces with two army mine sweepers, Jack Trask and Ray Gunn but their mission turns deadly when Jack and Ray are killed as the very land mine they had retrieved blew their helicopter apart, leaving Michelle alone and stranded in Angola. Having witnessed Christian, drunk in a local bar, stand up to the local thug Yager who terrorizes villagers with land mines in order to protect his diamond mining and smuggling rackets, Michelle seeks out his help. Together they retrieve an infamous A-6 land mine from the same field where Christian's son was killed. In their quest to find the source of the deadly new land mines, Michelle and Christian uncover a devious plot to ship a trainload of the mines to the US. In an explosive showdown, Christian and Michelle battle Yager's thugs in a 'to-the-death' fight through diamond mines and tortuous jungle until they finally uncover the real and most unsuspected villain behind the deadly scheme.", "genres": ["Action", "Adventure", "Drama"], "imdb": {"id": 120851, "rating": 3.5, "votes": 1241}, "languages": ["English"], "lastupdated": "2015-08-26 00:12:23.103000000", "num_mflix_comments": 2, "plot": "A humanitarian minesweeping operation in Angola uncovers a covert operation that is planting new and deadly mines.", "poster": "https://m.media-amazon.com/images/M/MV5BZWIzYmFlNjMtZTY1Yi00OWVlLWI1N2UtNjQwZGMzY2I2YTg5XkEyXkFqcGdeQXVyMDEwMjgxNg@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 918259200000, "runtime": 96, "title": "Sweepers", "tomatoes": {"dvd": 946944000000, "lastUpdated": 1438541441000, "production": "Sony Pictures Home Entertainment", "viewer": {"meter": 22, "numReviews": 1343, "rating": 2.7}}, "type": "movie", "writers": ["Kevin Bernhardt (screenplay)", "Kevin Bernhardt (story)", "Keoni Waxman (screenplay)"], "year": 1998}