{"_id": "573a1393f29313caabcdd414", "awards": {"nominations": 0, "text": "Nominated for 1 Oscar. Another 2 wins.", "wins": 3}, "cast": ["Arletty", "Jean-Louis Barrault", "Pierre Brasseur", "Pierre Renoir"], "countries": ["France"], "directors": ["Marcel Carnè"], "fullplot": "This tale centers around the love between Baptiste, a theater mime, and Claire Reine, an actress and otherwise woman-about-town who calls herself Garance. Garance, in turn, is loved by three other men: Frederick, a pretentious actor; Lacenaire, a conniving thief; and Count Edouard of Montray. The story is further complicated by Nathalie, an actress who is in love with Baptiste. Garance and Baptiste meet when Garance is falsely accused of stealing a man's watch. Garance is forced to enter the protection of Count Edouard when she is innocently implicated in a crime committed by Lacenaire. In the intervening years of separation, both Garance and Baptiste become involved in loveless relationships with the Count and Nathalie, respectively. Baptiste is the father of a son. Returning to Paris, Garance finds that Baptiste has become a famous mime actor. Nathalie sends her child to foil their meeting, but Baptiste and Garance manage one night together. Lacenaire murders Edouard. In the last scenes, Garance is returning to Edouard's hotel and disaster as Baptiste struggles after her through crowds of merrymakers, many dressed as his famous character.", "genres": ["Drama", "Romance"], "imdb": {"id": 37674, "rating": 8.3, "votes": 13430}, "languages": ["French"], "lastupdated": "2015-08-19 00:05:17.937000000", "plot": "The theatrical life of a beautiful courtesan and the four men who love her.", "poster": "https://m.media-amazon.com/images/M/MV5BOTgzZWIxNGYtNzE3OC00NjJlLThlMDgtYzgxZTUzOWQ2MGJkL2ltYWdlXkEyXkFqcGdeQXVyNzE3NzY5NTM@._V1_SY1000_SX677_AL_.jpg", "rated": "APPROVED", "released": -729907200000, "runtime": 190, "title": "Children of Paradise", "tomatoes": {"consensus": "Strong performances abound, and Carne's wit and grace are evident in this masterful (if long) French epic.", "critic": {"meter": 97, "numReviews": 35, "rating": 9.2}, "dvd": 1011657600000, "fresh": 34, "lastUpdated": 1442336616000, "production": "Home Vision Entertainment", "rotten": 1, "viewer": {"meter": 95, "numReviews": 7418, "rating": 4.4}}, "type": "movie", "writers": ["Jacques Prèvert (scenario and dialogue)"], "year": 1945}