{"_id": "573a139af29313caabcf0a86", "awards": {"nominations": 15, "text": "Nominated for 1 Oscar. Another 8 wins & 15 nominations.", "wins": 9}, "cast": ["Kevin Kline", "Joan Cusack", "Tom Selleck", "Matt Dillon"], "countries": ["USA"], "directors": ["Frank Oz"], "fullplot": "All of Greenleaf, Indiana is watching this year's telecast of the Oscars as Hollywood heartthrob and local boy made good Cameron Drake has been nominated for his first ever Best Actor Oscar for his latest movie role as a gay soldier. Cameron's high school English teacher Howard Brackett is overjoyed when Cameron wins the award and mentions Howard's contribution in his acting life. That joy turns to horror when Cameron mentions to the worldwide audience that Howard is gay, especially horrific to Howard as he is engaged to fellow teacher Emily Montgomery, a woman with self-esteem issues as she had battled weight issues most of her life before she lost seventy-five pounds for the wedding. Howard's life is totally disrupted as Hollywood media descends on Greenleaf in order to get Howard's story. The rest of Greenleaf also openly wonders if Howard is indeed gay, as he exhibits many stereotypical gay tendencies, such as being neat, and loving music, dancing, poetry and Barbra Streisand. His cause is not helped in that his and Emily's relationship has not yet been consummated. The one person not concerned is Emily, who trusts Howard. As Howard continues to deny being gay to his family, friends and colleagues, he begins to examine himself hypercritically if only because if others believe he's gay, there may be some merit to the claim, as well as because of an incident that occurs with Hollywood reporter Peter Malloy, who is doing a week-long piece on Howard leading up to his and Emily's wedding. But Cameron Drake may be able to provide some overall perspective to what is happening to Howard and the frenzy he has caused.", "genres": ["Comedy"], "imdb": {"id": 119360, "rating": 6.3, "votes": 30950}, "languages": ["English"], "lastupdated": "2015-08-21 00:06:29.453000000", "metacritic": 70, "plot": "A midwestern teacher questions his sexuality after a former student makes a comment about him at the Academy Awards.", "poster": "https://m.media-amazon.com/images/M/MV5BNDZkMjVhZmItMmIyNC00OWYyLWFmZWQtMzIzZWZhY2QyMjZiXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 874627200000, "runtime": 90, "title": "In & Out", "tomatoes": {"consensus": "It doesn't always find comfortable ground between broad comedy and social commentary, but lively performances -- especially from Kevin Kline and Joan Cusack -- enrich In & Out's mixture of laughs and sexual tolerance.", "critic": {"meter": 72, "numReviews": 50, "rating": 6.8}, "dvd": 908841600000, "fresh": 36, "lastUpdated": 1439835273000, "production": "Paramount", "rotten": 14, "viewer": {"meter": 51, "numReviews": 38728, "rating": 2.9}}, "type": "movie", "writers": ["Paul Rudnick"], "year": 1997}