{"_id": "573a13e0f29313caabdbbb67", "awards": {"nominations": 15, "text": "Nominated for 1 Golden Globe. Another 2 wins & 15 nominations.", "wins": 3}, "cast": ["Dominic West", "Helena Bonham Carter", "Greg Hicks", "Jeff Mash"], "countries": ["UK"], "directors": ["Richard Laxton"], "fullplot": "Film star Elizabeth Taylor invites her ex-husband - twice over - Richard Burton to her fiftieth birthday party where, as a recovering alcoholic, he refuses to get drunk with her. He does however consider her suggestion that they star in a stage revival of the play 'Private Lives'. As they announce the project the press speculate on a romantic reconciliation. With a new girlfriend and the prospect of playing king Lear Burton is not happy with the project, especially with Taylor's pill-popping and her lack of stage experience, which causes problems at rehearsal. The play opens to a critical trashing but is popular with audiences, chiefly, again to Burton's chagrin, because they want to see Taylor and, when she is ill, numbers dwindle and the show is put on hold. After a two month run , with a projected tour, the curtain comes down and Taylor tells Burton she has always loved him and still does. A year later however his old life-style catches up with him and he is dead.", "genres": ["Biography", "Drama"], "imdb": {"id": 2709784, "rating": 6.5, "votes": 1256}, "languages": ["English"], "lastupdated": "2015-08-26 01:29:11.180000000", "plot": "Legendary acting duo and husband and wife, Richard Burton and Elizabeth Taylor prepare for a 1983 theatrical production of the play, \"Private Lives\".", "poster": "https://m.media-amazon.com/images/M/MV5BMjAzMDI5MjE0NV5BMl5BanBnXkFtZTgwNjU2MjgxMTE@._V1_SY1000_SX677_AL_.jpg", "released": 1381881600000, "runtime": 83, "title": "Burton and Taylor", "tomatoes": {"critic": {"meter": 100, "numReviews": 11, "rating": 9.4}, "dvd": 1391472000000, "fresh": 11, "lastUpdated": 1442082183000, "production": "BBC", "rotten": 0, "viewer": {"meter": 60, "numReviews": 193, "rating": 3.4}, "website": "http://www.bbc.co.uk/programmes/p01c8jm8"}, "type": "movie", "writers": ["William Ivory", "Noel Coward (extracts from the play \"Private Lives\")", "Alexander Walker (additional research material from the book \"Elizabeth\")"], "year": 2013}