{"_id": "573a13b1f29313caabd35b5b", "awards": {"nominations": 6, "text": "6 nominations.", "wins": 0}, "cast": ["Ayad Akhtar", "Firdous Bamji", "Nandana Sen", "Sarita Choudhury"], "countries": ["USA"], "directors": ["Joseph Castelo"], "fullplot": "Sayeed Choudhury was born Pakistan but has immigrated to the U.S.A., where he now lives in New York with his wife, Farida; a school-going daughter, Rasheeda; a school-going son, Ali; and unmarried sister, Duri. One morning Farida hears a knock on the door, Ali opens it and there is Sayeed's childhood friend, Hassan, who is welcomed with open arms by the family. Hassan informs them that he is going to be hired soon in the States and he is invited to spend a few days with the Choudhury family. Duri, who has a Caucasian boyfriend, Mike, is also thrilled to meet Hassan and openly shows her attraction to him. Ali also takes an instant liking to Hassan, and is taught the true values of Islam, and when one Muslim hurts, then the pain is felt by Muslims worldwide. Sayeed is quite content with the American way of life and feels secure and comfortable especially when he sees Germans, Jews, Muslims, Catholics, and non-believers living in harmony and doing business with each other. Sayeed will soon find out that Hassan has different ideas about America, a country paralyzed in fear, a nation of tyranny, hatred, greed, domination, & war. He also believes that Non-Muslims are Jaheels. Sayeed will also find out that Hassan is in the States for a deadly reason - on a suicide mission to bomb Grand Central Station. Watch what happens when Hassan leaves the house after a confrontation with Sayeed, and whether or not he will be successful in carrying out his deadly mission.", "genres": ["Drama"], "imdb": {"id": 414344, "rating": 7, "votes": 1116}, "languages": ["English"], "lastupdated": "2015-09-15 03:47:23.093000000", "metacritic": 61, "num_mflix_comments": 2, "plot": "A Pakistani involved in a planned attack in New York City experiences a crisis of conscience.", "poster": "https://m.media-amazon.com/images/M/MV5BMTc5OTQ1ODg2M15BMl5BanBnXkFtZTcwNDc4OTEzMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1128038400000, "runtime": 90, "title": "The War Within", "tomatoes": {"consensus": "The War Within attempts to get into the mind of a terrorist, and the result is believable and unsettling.", "critic": {"meter": 72, "numReviews": 58, "rating": 6.6}, "dvd": 1138665600000, "fresh": 42, "lastUpdated": 1440960581000, "production": "Magnolia Pictures", "rotten": 16, "viewer": {"meter": 65, "numReviews": 864, "rating": 3.6}, "website": "http://www.warwithinmovie.com"}, "type": "movie", "writers": ["Ayad Akhtar", "Joseph Castelo", "Tom Glynn"], "year": 2005}