{"_id": "573a1397f29313caabce7261", "awards": {"nominations": 2, "text": "Nominated for 2 Oscars. Another 5 wins & 2 nominations.", "wins": 7}, "cast": ["Robert Duvall", "Blythe Danner", "Michael O'Keefe", "Lisa Jane Persky"], "countries": ["USA"], "directors": ["Lewis John Carlino"], "fullplot": "In 1962, the Marine Corps family, the Meechums - parents Lieutenant Colonel Wilbur \"Bull\" Meechum and Lillian Meechum, and their four children Ben Meechum, Mary Anne Meechum, Karen Meechum and Matthew Meechum - are moving like they do most years, this time to Beaufort, South Carolina. Bull - nicknamed \"the Great Santini\" - is known as a great pilot, but has gotten into much trouble in the past for his sophomoric behavior. He runs his family much as a military commander, where they are all to obey his orders without question. Everything he does within the family context he reasons is to build character, but in reality everything ends up being about him. The oldest Ben, approaching manhood, is the one of his offspring who has the greatest issue with his father. Ben wants his respect, but isn't sure if he really loves him. As Ben goes through his senior year in high school, his attempts to play varsity basketball and an incident between black Toomer Smalls - his friend and their cook Arrabella Smalls' son - and racist Red Petus may forever change the dynamic between father and son.", "genres": ["Drama"], "imdb": {"id": 79239, "rating": 7.2, "votes": 4187}, "languages": ["English"], "lastupdated": "2015-08-07 00:24:18.070000000", "num_mflix_comments": 2, "plot": "As he approaches manhood, Ben Meechum struggles to win the approval of his demanding alpha male father, an aggressively competitive, but frustrated marine pilot.", "poster": "https://m.media-amazon.com/images/M/MV5BMGQwZjA0ZTgtZTMzYy00Y2FiLWJhZGUtNGI0MzEzYmFhNmZjXkEyXkFqcGdeQXVyNTc1NTQxODI@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 309744000000, "runtime": 115, "title": "The Great Santini", "tomatoes": {"critic": {"meter": 94, "numReviews": 18, "rating": 7.9}, "dvd": 943315200000, "fresh": 17, "lastUpdated": 1436296613000, "production": "Warner Home Video", "rotten": 1, "viewer": {"meter": 77, "numReviews": 2882, "rating": 3.6}}, "type": "movie", "writers": ["Pat Conroy (novel)", "Lewis John Carlino (written for the screen by)"], "year": 1979}