{"_id": "573a1393f29313caabcdd69f", "awards": {"nominations": 1, "text": "1 win & 1 nomination.", "wins": 1}, "cast": ["Anna Magnani", "Amedeo Nazzari", "Carla Del Poggio", "Carlo Campanini"], "countries": ["Italy"], "directors": ["Alberto Lattuada"], "fullplot": "Ernesto ritorna dalla prigionia in Germania, alla fine della Seconda Guerra mondiale. E' solo, la casa distrutta, la mamma morta, la sorella scomparsa. La ritrova in un bordello, durante la colluttazione che nasce con lo sfruttatore la ragazza rimane uccisa e l'uomo viene spinto da Ernesto nella tromba delle scale. Ferito e inseguito dalla polizia si rifugia in casa di una prostituta che è a capo di una banda di rapinatori. Diventa amante della donna e capo della banda, ma il ricavato delle imprese lo elargisce in atti benefici che i compagni disapprovano. Un giorno, mentre con assalta una macchina con i complici, Ernesto viene denunciato alla polizia dalla stessa prostituta che vuole vendicarsi di una offesa subita. Potrebbe salvarsi, ma rinuncia a mettersi in salvo per portare a casa la bambina di un suo ex compagno che si trovava nella macchina assalita. Non rispondendo all'alt intimatogli dagli agenti, viene colpito a morte dagli stessi.", "genres": ["Crime", "Drama"], "imdb": {"id": 38327, "rating": 6.9, "votes": 125}, "languages": ["Italian", "German", "English"], "lastupdated": "2015-08-10 00:30:37.033000000", "num_mflix_comments": 2, "plot": "Ernesto ritorna dalla prigionia in Germania, alla fine della Seconda Guerra mondiale. E' solo, la casa distrutta, la mamma morta, la sorella scomparsa. La ritrova in un bordello, durante la...", "released": -733449600000, "runtime": 78, "title": "The Bandit", "tomatoes": {"dvd": 1138665600000, "lastUpdated": 1440613246000, "viewer": {"meter": 69, "numReviews": 162, "rating": 3.8}}, "type": "movie", "writers": ["Alberto Lattuada (story)", "Oreste Biancoli (screenplay)", "Mino Caudana (screenplay)", "Ettore Maria Margadonna (screenplay)", "Alberto Lattuada (screenplay)", "Tullio Pinelli (screenplay)", "Piero Tellini (screenplay)"], "year": 1946}