{"_id": "573a13c3f29313caabd6b522", "awards": {"nominations": 7, "text": "6 wins & 7 nominations.", "wins": 6}, "cast": ["Zac Efron", "Taylor Schilling", "Blythe Danner", "Riley Thomas Stewart"], "countries": ["USA"], "directors": ["Scott Hicks"], "fullplot": "Logan is a marine serving in Iraq. While there, he finds a photo of a girl with \"keep safe\" written on the back. He is admiring it when his unit is attacked. He survives and credits the photo for saving him. He tries to find the owner but can't, assuming he was killed. When he goes back to the States, he finds it difficult to adjust and is still haunted by what happened. Analyzing the photo, he finds in the background a landmark that tells him she is in Louisiana. He then goes there and finds her. He learns her name is Beth. He tries to tell her what happened but can't get the words out. She assumes he's there to apply for the job they advertised looking for someone to help at her family's business, a dog kennel. He says yes but at first she gets an uneasy feeling from him but her grandmother decides to give him a chance. It isn't long that he makes a connection with her son. He then discovers that it was her brother who had the picture only he doesn't remember him. He sees that her brother's death has a profound effect on her. Eventually they get close which makes her grandmother happy but not her ex who is a deputy sheriff who's always threatening to take their son away from her.", "genres": ["Drama", "Romance"], "imdb": {"id": 1327194, "rating": 6.5, "votes": 66004}, "languages": ["English"], "lastupdated": "2015-08-23 00:06:07.030000000", "metacritic": 39, "num_mflix_comments": 3, "plot": "A Marine travels to Louisiana after serving three tours in Iraq and searches for the unknown woman he believes was his good luck charm during the war.", "poster": "https://m.media-amazon.com/images/M/MV5BMTg5NDk3MjAzMF5BMl5BanBnXkFtZTcwMjUyNzExNw@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1334880000000, "runtime": 101, "title": "The Lucky One", "tomatoes": {"boxOffice": "$60.4M", "consensus": "While it provides the requisite amount of escapist melodrama, The Lucky One ultimately relies on too many schmaltzy clichès to appeal to anyone not already familiar with the Nicholas Sparks formula.", "critic": {"meter": 20, "numReviews": 141, "rating": 4.2}, "dvd": 1346112000000, "fresh": 28, "lastUpdated": 1442167566000, "production": "Warner Bros. Pictures", "rotten": 113, "viewer": {"meter": 67, "numReviews": 193308, "rating": 3.7}, "website": "http://theluckyonemovie.warnerbros.com/index.html"}, "type": "movie", "writers": ["Will Fetters (screenplay)", "Nicholas Sparks (novel)"], "year": 2012}