{"_id": "573a13a1f29313caabd08014", "awards": {"nominations": 5, "text": "Nominated for 2 Golden Globes. Another 7 wins & 5 nominations.", "wins": 9}, "cast": ["Armand Assante", "Rachel Ward", "Bryan Brown", "Jacqueline McKenzie"], "countries": ["Australia", "USA"], "directors": ["Russell Mulcahy"], "fullplot": "Well, the world has finally managed to blow itself up. Only Australia has been spared from nuclear destruction and a gigantic wave of radiation is floating in on the breezes. Only two months are left. One American sub located in the Pacific has survived and is met with disdain by the Australians when it arrives. All of the calculations of Australia's most renowned scientist says the country is at doomsday - get ready. However, one of his rivals say that is incorrect. He believes that a 1000 people can be relocated into the northern hemisphere, where his assumptions indicate the radiation levels may be lower. The American Captain is asked to take a mission to the north to determine which scientist is right (and along the way check out the devastation in Alaska and California - seemingly all bodies and vehicles were disintegrated). However, before the mission, all kinds of bland soap opera relationships are played out. Brown and his ex-fiancèe battle it out in a love-hate relationship. Meanwhile she also takes a liking to Assante, who is divided in his loyalties to his men and his love for his now-dead wife and children.", "genres": ["Drama", "Sci-Fi"], "imdb": {"id": 219224, "rating": 7.1, "votes": 2967}, "languages": ["English"], "lastupdated": "2015-08-15 00:13:14.770000000", "plot": "Well, the world has finally managed to blow itself up. Only Australia has been spared from nuclear destruction and a gigantic wave of radiation is floating in on the breezes. Only two ...", "poster": "https://m.media-amazon.com/images/M/MV5BMjA3MTI1OTU3OV5BMl5BanBnXkFtZTcwMzUxNjAyMQ@@._V1_SY1000_SX677_AL_.jpg", "released": 959472000000, "runtime": 195, "title": "On the Beach", "tomatoes": {"critic": {"meter": 60, "numReviews": 5, "rating": 5.7}, "dvd": 1136332800000, "fresh": 3, "lastUpdated": 1440443518000, "production": "Artisan Entertainment", "rotten": 2, "viewer": {"meter": 68, "numReviews": 1011, "rating": 3.5}}, "type": "movie", "writers": ["Nevil Shute (novel)", "John Paxton", "David Williamson (teleplay)", "Bill Kerby (teleplay)"], "year": 2000}