{"_id": "573a13d3f29313caabd95b55", "awards": {"nominations": 2, "text": "2 nominations.", "wins": 0}, "cast": ["Dong-won Kang", "Duek-mun Choi", "Jeong Eun-Chae", "Soo Go"], "countries": ["South Korea"], "directors": ["Min-suk Kim"], "fullplot": "After losing his job at a scrap metal yard, Kyu-Nam finds a new job at a small pawn shop named Utopia. He is immediately drawn to the family atmosphere at Utopia, working with his new boss Jung-Sik and boss's daughter Young-Sook. Unfortunately for Kyu-Nam, his moment of happiness will only be fleeting. Cho-In lived through a brutal childhood. He has had to use a prosthetic leg since an early age, grew up with an abusive father and lived with a mother who at one point attempted to kill her own son out of despair. Cho-In also possesses an awe-inspiring supernatural gift. Cho-In can control other people's minds when they are within his field of sight. One fateful day, Cho-In walks into the Utopia pawn shop to steal whatever money exists in the safe. Not expecting much resistance, Cho-In is surprised to find one man at the Utopia pawn shop is able to break free from his mind control abilities. That man is Kyu-Nam. Cho-In then resorts to killing the owner of pawn shop to make his escape. All of this is captured on CCTV. An epic battle will soon occur between these two people with supernatural abilities and nothing to lose.", "genres": ["Action", "Sci-Fi", "Thriller"], "imdb": {"id": 1900891, "rating": 6.3, "votes": 972}, "languages": ["Korean"], "lastupdated": "2015-09-17 04:38:56.237000000", "plot": "Cho-In can control other people's minds when they are within his field of sight.Except one man.", "poster": "https://m.media-amazon.com/images/M/MV5BMTYzOTI2NTY0MF5BMl5BanBnXkFtZTgwMjIyNjAzMTE@._V1_SY1000_SX677_AL_.jpg", "released": 1289347200000, "runtime": 100, "title": "Haunters", "tomatoes": {"critic": {"meter": 94, "numReviews": 16, "rating": 6.9}, "dvd": 1413158400000, "fresh": 15, "lastUpdated": 1438630560000, "production": "Olive Films", "rotten": 1, "viewer": {"meter": 74, "numReviews": 346, "rating": 3.7}}, "type": "movie", "writers": ["Min-suk Kim"], "year": 2010}