{"_id": "573a139af29313caabcf0f60", "awards": {"nominations": 7, "text": "1 win & 7 nominations.", "wins": 1}, "cast": ["Matt Damon", "Bill Pullman", "John Leguizamo", "Nathan Lane"], "countries": ["USA"], "directors": ["Don Bluth", "Gary Goldman", "Art Vitello"], "fullplot": "In the year 3028 A.D., Earth is being attacked by the Drej, which are aliens made of pure energy! The Drej mother-ship destroys Earth with an energy beam just as hundreds of space vehicles manage to escape with the last of mankind aboard! One of the escapees is Sam's young son Cale, who carries with him a ring given to him by his father. Fifteen years later, Cale works on a salvage station, eking out a rough life and hating his father for having disappeared aboard the Titan so long ago. Without a home planet, surviving humans have been reduced to outer space drifters and are constantly bullied and looked down on by other space-faring races. A human captain named Joseph Korso and his pilot Akima seek out Cale and explain that he must help them find the Titan which contains a mechanism that will create a new Earth and therefore unite all of humanity. Meanwhile, the Drej wants to find the Titan so that they can destroy it. With Korso's help, Cale discovers that the ring his father gave to him contains a genetically encoded map to the Titan, and thus begins his race across the universe with Korso and his ship and crew, including Preed, a wisecracking rat-like humanoid, Gune, an eccentric, green-skinned scientist, and Stith, a tough, hard-as-nails weapons expert who resembles something of a kangaroo. Before long, Cale and Akima finds out that Korso is searching for the Titan in order to hand it over to the Drej.", "genres": ["Animation", "Action", "Adventure"], "imdb": {"id": 120913, "rating": 6.6, "votes": 50111}, "languages": ["English", "Mandarin"], "lastupdated": "2015-08-24 00:22:53.837000000", "metacritic": 48, "plot": "A young man learns that he has to find a hidden Earth ship before an enemy alien species does in order to secure the survival of humanity.", "poster": "https://m.media-amazon.com/images/M/MV5BYTVkYTAyZDMtYzNmYi00OTkyLTg3M2ItNmE0MDZkNmY3Y2I3XkEyXkFqcGdeQXVyNjU2MDUzMjY@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 961113600000, "runtime": 94, "title": "Titan A.E.", "tomatoes": {"consensus": "Great visuals, but the story feels like a cut-and-paste job of other sci-fi movies.", "critic": {"meter": 52, "numReviews": 99, "rating": 5.7}, "dvd": 983836800000, "fresh": 51, "lastUpdated": 1442081586000, "production": "20th Century Fox", "rotten": 48, "viewer": {"meter": 60, "numReviews": 68993, "rating": 3.2}, "website": "http://www.afterearth.com"}, "type": "movie", "writers": ["Hans Bauer (story)", "Randall McCormick (story)", "Ben Edlund (screenplay)", "John August (screenplay)", "Joss Whedon (screenplay)"], "year": 2000}