{"_id": "573a13bcf29313caabd5696d", "awards": {"nominations": 1, "text": "2 wins & 1 nomination.", "wins": 2}, "cast": ["Morgan Spurlock", "George Bush", "Dick Cheney", "Daryl Isaacs"], "countries": ["France", "USA"], "directors": ["Morgan Spurlock"], "fullplot": "When Morgan Spurlock and his wife find out they are expecting a child in an unsafe world that faces multiple terrorist and environmental threats, Morgan decides to track down the world's most wanted and dangerous terrorist, Osama Bin Laden, undergoes self-defense training, takes all required medical shots, and sets out to travel to Morocco, Egypt, Jordan, Israel, Afghanistan, Pakistan amongst others to try and locate the man who has managed to elude the American army for nearly a decade. His fears, generated due to biased media coverage that Muslims and Arabs are hostile, are laid to rest when he does encounter friendly, and quite refreshingly well educated, hospitable, politically matured men and women, who are well aware of America's faulty 'foreign policy', and do not subscribe to Jihad nor to the Taliban nor Osama's terror-tactics. But he does encounter some hostility, quite ironically, in two of America's allies -- Israel and Saudi Arabia -- and it is on the soil of Pakistan -- his country's ally against the so-called War Against Terror -- that he eventually hopes to find Osama. The questions still remain: will he able to find him where many others have purportedly failed? And most importantly will he be allowed to remain alive after finding him?", "genres": ["Documentary", "Comedy", "War"], "imdb": {"id": 963208, "rating": 6.6, "votes": 5530}, "languages": ["English", "Arabic", "French"], "lastupdated": "2015-08-26 00:46:22.167000000", "metacritic": 45, "plot": "Morgan Spurlock tours the Middle East to discuss the war on terror with Arabic people.", "poster": "https://m.media-amazon.com/images/M/MV5BMjEzMTA2ODQ4NV5BMl5BanBnXkFtZTcwNzE4MjU2MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1210291200000, "runtime": 90, "title": "Where in the World Is Osama Bin Laden?", "tomatoes": {"boxOffice": "$0.3M", "consensus": "Morgan Sprulock's doc offers occasional insights but gets bogged down by the director/subject's gimmicky schtick.", "critic": {"meter": 38, "numReviews": 104, "rating": 4.9}, "dvd": 1219708800000, "fresh": 39, "lastUpdated": 1440267611000, "production": "The Weinstein Company", "rotten": 65, "viewer": {"meter": 52, "numReviews": 4142, "rating": 3.3}, "website": "http://www.whereisobl.com/"}, "type": "movie", "writers": ["Jeremy Chilnick (screenplay)", "Morgan Spurlock (screenplay)"], "year": 2008}