{"_id": "573a13b1f29313caabd37d43", "awards": {"nominations": 12, "text": "2 wins & 12 nominations.", "wins": 2}, "cast": ["Steve Coogan", "Rob Brydon", "Keeley Hawes", "Shirley Henderson"], "countries": ["UK"], "directors": ["Michael Winterbottom"], "fullplot": "Two actors, as their make up is applied, talk about the size of their parts. Then into the film: Laurence Sterne's unfilmable novel, Tristram Shandy, a fictive autobiography wherein the narrator, interrupted constantly, takes the entire story to be born. The film tracks between \"Shandy\" and behind the scenes. Size matters: parts, egos, shoes, noses. The lead's girlfriend, with their infant son, is up from London for the night, wanting sex; interruptions are constant. Scenes are shot, re-shot, and discarded. The purpose of the project is elusive. Fathers and sons; men and women; cocks and bulls. Life is amorphous, too full and too rich to be captured in one narrative.", "genres": ["Comedy", "Drama"], "imdb": {"id": 423409, "rating": 6.8, "votes": 10931}, "languages": ["English"], "lastupdated": "2015-08-17 00:40:18.767000000", "metacritic": 80, "plot": "Director Michael Winterbottom (Northam) attempts to shoot the adaptation of Laurence Sterne's essentially unfilmable novel, \"The Life and Opinions of Tristram Shandy, Gentleman.\"", "poster": "https://m.media-amazon.com/images/M/MV5BMTg2ODMwNTY3NV5BMl5BanBnXkFtZTcwMzczNjEzMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1137715200000, "runtime": 94, "title": "Tristram Shandy: A Cock and Bull Story", "tomatoes": {"boxOffice": "$1.1M", "consensus": "Though Laurence Sterne's novel was considered more or less impossible to successfully adapt to film, director Michael Winterbottom has done it in Tristram Shandy: A Cock and Bull Story, by making movie about the making of the movie. Stars Steve Coogan and Rob Brydon add madcap, knowing performances to the mix, and the result is a fun, postmodern romp, before there was any modern romp to post.", "critic": {"meter": 90, "numReviews": 123, "rating": 7.5}, "dvd": 1152576000000, "fresh": 111, "lastUpdated": 1440184010000, "production": "Picturehouse", "rotten": 12, "viewer": {"meter": 66, "numReviews": 22656, "rating": 3.3}, "website": "http://www.tristramshandymovie.com/"}, "type": "movie", "writers": ["Laurence Sterne (novel)", "Frank Cottrell Boyce (screenplay)"], "year": 2005}