{"_id": "573a13b0f29313caabd339a5", "awards": {"nominations": 1, "text": "10 wins & 1 nomination.", "wins": 10}, "cast": ["Hanni Lux", "Judith Haspel", "Anni Lampl", "Elisheva Susz"], "countries": ["Israel", "USA", "France", "Austria"], "directors": ["Yaron Zilberman"], "fullplot": "Watermarks is the story of the champion women swimmers of the legendary Jewish sports club, Hakoah Vienna. Hakoah (\"The Strength\" in Hebrew) was founded in 1909 in response to the notorious Aryan Paragraph, which forbade Austrian sports clubs from accepting Jewish athletes. Its founders were eager to popularize sport among a community renowned for such great minds as Freud, Mahler and Zweig, but traditionally alien to physical recreation. Hakoah rapidly grew into one of Europe's biggest athletic clubs, while achieving astonishing success in many diverse sports. In the 1930s Hakoah's best-known triumphs came from its women swimmers, who dominated national competitions in Austria. After the Anschluss, in 1938, the Nazis shut down the club, but the swimmers all managed to flee the country before the war broke out, thanks to an escape operation initiated by Hakoah's functionaries. Sixty-five years later, director Yaron Zilberman meets the members of the swimming team in their homes around the world, and arranges for them to have a reunion in their old swimming pool in Vienna, a journey that evokes memories of youth, femininity, and strengthens lifelong bonds. Told by the swimmers, now in their eighties, Watermarks is about a group of young girls with a passion to be the best.", "genres": ["Documentary", "History", "Sport"], "imdb": {"id": 405461, "rating": 7.3, "votes": 224}, "languages": ["English", "Hebrew", "German"], "lastupdated": "2015-07-06 08:05:49.597000000", "metacritic": 67, "plot": "The story of the Hakoah Vienna Jewish womens swim team of the 1930s, their forced separation, and their reunion decades later.", "poster": "https://m.media-amazon.com/images/M/MV5BMTI0MDIxMTM0N15BMl5BanBnXkFtZTcwNDMyNzcyMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "UNRATED", "released": 1102636800000, "runtime": 80, "title": "Watermarks", "tomatoes": {"consensus": "Watermarks is a moving and fascinating look at how the Nazi-fication of Germany in the 1930s affect a group of Jewish women swimmers.", "critic": {"meter": 96, "numReviews": 23, "rating": 7.5}, "dvd": 1133827200000, "fresh": 22, "lastUpdated": 1435609415000, "production": "Kino International", "rotten": 1, "viewer": {"meter": 93, "numReviews": 181, "rating": 4}, "website": "http://www.kino.com/watermarks/"}, "type": "movie", "writers": ["Ronen Dorfan (associate writer)", "Yonatan Israel (associate writer)", "Yaron Zilberman"], "year": 2004}