{"_id": "573a13b3f29313caabd3b7a7", "awards": {"nominations": 1, "text": "2 wins & 1 nomination.", "wins": 2}, "cast": ["Joseph Fiennes", "Dennis Haysbert", "Diane Kruger", "Patrick Lyster"], "countries": ["Germany", "France", "Belgium", "South Africa", "Italy", "UK", "Luxembourg"], "directors": ["Bille August"], "fullplot": "James Gregory once lived in a farm and had befriended a native youth, Bafana, and had even had a photograph taken with him. Years later, now married to Gloria and father of three children (Chris, Brett, and Natasha), James has nothing but shame and regret, as many South African Caucasians in the oppressive Apartheid-era ridiculed him, leading him to hate Africans. He seeks to redeem himself by spying on imprisoned African National Congress Leader, Nelson Mandela. In the restrictive high security prison his job is to censor all written and verbal communications between prisoners, their visitors, and correspondence. James is uncomfortable when he witnesses Caucasian police and security officers' brutality against civilians, including infants, and tries to understand why Nelson became a rebel. This leads him to examine the 'Freedom Charter', a banned document, reportedly known to incite violence against 'whites'. And when he does read this document, he changes his mind about Nelson's freedom struggle. Soon he, himself, will be alienated by his very own peers. Isolated, he receives death threats over the phone and has to face the trauma of the 'accidental' death of Brett. In addition, he and his family are kept under close watch by the security forces amidst tight economic sanctions by the international community, and growing unrest by the natives who continue their fight for equality, and freedom for Nelson Mandela.", "genres": ["Biography", "Drama", "History"], "imdb": {"id": 438859, "rating": 7.1, "votes": 9683}, "languages": ["English", "Xhosa"], "lastupdated": "2015-09-01 00:11:31.257000000", "plot": "GOODBYE BAFANA is the true story of a white South African racist whose life was profoundly altered by the black prisoner he guarded for twenty years. The prisoner's name was Nelson Mandela.", "poster": "https://m.media-amazon.com/images/M/MV5BNjlhNzg1OGUtY2U2MC00MWFkLTk4NDktNGFjNmViY2U2YjgxXkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1176249600000, "runtime": 118, "title": "The Color of Freedom", "tomatoes": {"lastUpdated": 1442337159000, "production": "A-Film Distribution", "viewer": {"meter": 81, "numReviews": 5258, "rating": 3.8}, "website": "http://www.goodbyebafana.com/"}, "type": "movie", "writers": ["Bille August", "Bob Graham (book)", "James Gregory (book)", "Greg Latter (adaptation)", "Greg Latter (screenplay)"], "year": 2007}