{"_id": "573a13c8f29313caabd76fc0", "awards": {"nominations": 3, "text": "3 nominations.", "wins": 0}, "cast": ["Jake T. Austin", "Steve Buscemi", "Loretta Devine", "Laurence Fishburne"], "countries": ["South Africa"], "directors": ["Anthony Silverston"], "fullplot": "A half-striped zebra is born into an insular, isolated herd obsessed with stripes. Rumors that the strange foal is cursed spread and, before long, he is blamed for the drought that sets into the Great Karoo. When even his father, the leader of the herd, blames him for the lack of rain and the subsequent death of his mother, the outcast zebra leaves the confines of his home knowing that he cannot survive in the herd without all his stripes. Khumba ventures beyond the fence - vulnerable to the ferocious Leopard, Phango, who controls the waterholes and terrorizes the animals in the Great Karoo. Khumba is rescued from an opportunistic wild dog by a quirky duo: a wildebeest and an ostrich. Mama V is a self-confessed free spirit who does not want to be the average stay-at-home mom, like other wildebeest. Ironically, she mothers Bradley, a flamboyant but insecure ostrich who overcompensates for his scraggily feathers. When a mystical mantis appears to the foal, drawing a map to what could be interpreted as either water or stripes, the duo join Khumba on his quest in the hope that their own search for a safe waterhole is over. On their journey, Khumba encounters a colorful range of characters including a migrating herd of Springbok in search of greener (and safer) pastures; a new age, bohemian community living safely within the confines of a luxurious national park; an endangered Riverine Rabbit who has survived extinction by mastering a myriad of skills ranging from impersonations to beat-boxing; a group of hysterical Dassies (rock-rabbits) who fanatically worship the Mighty Black Eagle and Nora, a loony, solitary Merino sheep living on an abandoned farm. Through these interactions, Khumba begins to learn that diversity is essential for survival and that one's difference can, in fact, be one's strength.", "genres": ["Animation", "Adventure", "Family"], "imdb": {"id": 1487931, "rating": 5.7, "votes": 3520}, "languages": ["English"], "lastupdated": "2015-08-31 00:06:21.327000000", "metacritic": 40, "num_mflix_comments": 1, "plot": "Rejected by his superstitious herd, a half-striped zebra embarks on a daring quest to earn his stripes but finds the courage and self-acceptance to save all the animals of the Great Karoo.", "poster": "https://m.media-amazon.com/images/M/MV5BMTQyNTgzODU1N15BMl5BanBnXkFtZTgwMjg4NjQxMDE@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 1382659200000, "runtime": 85, "title": "Khumba", "tomatoes": {"critic": {"meter": 44, "numReviews": 18, "rating": 4.8}, "dvd": 1394409600000, "fresh": 8, "lastUpdated": 1440267164000, "production": "Millenium Entertainment", "rotten": 10, "viewer": {"meter": 44, "numReviews": 674, "rating": 3.1}, "website": "http://www.triggerfish.co.za/khumba/"}, "type": "movie", "writers": ["Raffaella Delle Donne", "Anthony Silverston", "Jonathan Roberts (additional screenplay)", "Camilla Bubna-Kasteliz (script editor)", "Richelle Wilder (script consultant)", "Mike de Seve (additional dialogue)", "Dave Bejoya (additional dialogue)"], "year": 2013}