{"_id": "573a13b7f29313caabd4ad81", "awards": {"nominations": 3, "text": "3 nominations.", "wins": 0}, "cast": ["Michael Philip Del Rio", "Samuel Molina", "Rick Sepulveda", "Manny Perez"], "countries": ["USA"], "directors": ["Franc. Reyes"], "fullplot": "After the gangsters who killed his father come to settle a score, a teenage boy and his mother turn the tables on the killers - one Latino family's quest for honor and revenge as the hunted become the hunters. Wilson DeLeon, Jr. is an exceptional college student with an adoring girlfriend, doting mother and a future full of promise. He has never wanted for anything, and he has never been forced to stand his ground. But when ghosts from his mother's past come back to haunt his present, he must defend his family ... and quickly turn into the strong man his father prayed he'd become. Nothing could stop Wilson's mother, Millie, from protecting her two boys. Forced to flee her home after gangsters killed her husband, she made an oath to give her children only the best. But all that changes when an enemy from the past catches up with them. It's finally time to take action - and now, they're done running. Weapons at the ready, Wilson, Jr. and Millie prepare for a final showdown with the murderer who robbed him of a father and her of a husband. Now, in a battle fueled by family ties and blood feuds, it will become very clear what happens when anyone tries to come between this son and his mother.", "genres": ["Crime", "Drama", "Thriller"], "imdb": {"id": 775488, "rating": 5.5, "votes": 2118}, "languages": ["English"], "lastupdated": "2015-09-01 01:08:42.163000000", "metacritic": 40, "num_mflix_comments": 2, "plot": "When the thugs who killed his father come looking for him, a young Latino man and his mother flee from their home.", "poster": "https://m.media-amazon.com/images/M/MV5BMTY0MTc0MzQzN15BMl5BanBnXkFtZTcwNzg4NjI1MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1187913600000, "runtime": 108, "title": "Illegal Tender", "tomatoes": {"boxOffice": "$3.1M", "consensus": "Lackluster acting and a ridiculous plot make the over-the-top Illegal Tender an unrealistic bust.", "critic": {"meter": 15, "numReviews": 48, "rating": 4}, "dvd": 1197936000000, "fresh": 7, "lastUpdated": 1441993801000, "production": "Universal Pictures", "rotten": 41, "viewer": {"meter": 67, "numReviews": 5173, "rating": 3.7}, "website": "http://www.illegaltendermovie.net"}, "type": "movie", "writers": ["Franc. Reyes"], "year": 2007}