{"_id": "573a13c6f29313caabd71d61", "awards": {"nominations": 0, "text": "2 wins.", "wins": 2}, "cast": ["Kristen Bell", "Jamie Lee Curtis", "Sigourney Weaver", "Odette Annable"], "countries": ["USA"], "directors": ["Andy Fickman"], "fullplot": "As a teenager Marni was the kind of girl no guy would go near and would be tormented by the mean girls, and no one was meaner to her than Joana the head cheerleader. Years later, she's a successful woman with a good job. When she goes home for her brother's wedding she discovers that her brother is marrying Joana. And he doesn't know what she did to Marni. When they meet she wants Joana to apologize for the way she treated her but Joana feigns ignorance. When Marni tells her mother, Gail about her and Joana, Gail tells her to try and put it behind her. But when Gail meets Joana's aunt Mona, it turns that she's her old friend Ramona who was her friend in high school whom she had falling out with with years ago, and Gail is unaware what caused it. Gail feels like Mona is trying to thumb her success in her face. When Marni learns that Joana does remember her she sets to expose her to her brother.", "genres": ["Comedy", "Romance"], "imdb": {"id": 1414382, "rating": 5.8, "votes": 38363}, "languages": ["English"], "lastupdated": "2015-09-06 00:14:25.790000000", "metacritic": 28, "num_mflix_comments": 1, "plot": "When a young woman realizes her brother is about to marry the girl who bullied her in high school, she sets out to expose the fiancèe's true colors.", "poster": "https://m.media-amazon.com/images/M/MV5BMTM5MzkyMDY0MV5BMl5BanBnXkFtZTcwNDkxNDc1Mw@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 1285286400000, "runtime": 105, "title": "You Again", "tomatoes": {"boxOffice": "$25.7M", "critic": {"meter": 17, "numReviews": 93, "rating": 3.8}, "dvd": 1297123200000, "fresh": 16, "lastUpdated": 1442511067000, "production": "Touchstone Pictures", "rotten": 77, "viewer": {"meter": 43, "numReviews": 59267, "rating": 3.1}, "website": "http://www.YouAgain-TheMovie.com/"}, "type": "movie", "writers": ["Moe Jelline"], "year": 2010}