{"_id": "573a13bff29313caabd5f0a8", "awards": {"nominations": 12, "text": "4 wins & 12 nominations.", "wins": 4}, "cast": ["Alexandria M. Salling", "Connor Kramme", "Annette Bening", "Eileen Ryan"], "countries": ["USA", "Spain"], "directors": ["Rodrigo Garcèa"], "fullplot": "Almost forty years ago, a young girl of fourteen has sex, gets pregnant, and gives her baby up for adoption. Fast-forwarding to the present day, we meet three very different women, each of whom struggles to maintain control of their lives. There's Elizabeth, a smart and successful lawyer who uses her body to her advantage. Any time she feels that she doesn't have the upper hand, and cannot control the situation, she uses her sex appeal - whether that be starting a romance with her boss when she suspects he is trying to start one himself, or finding some way to control her overly friendly neighbor and husband. Karen, meanwhile, is a bitter health care professional who obviously has a lot of heart but never shows it. She gave up a daughter at the age of fourteen (wonderfully shown rather than told, she is the young girl and mother of Elizabeth), and has never gotten over it - her bitterness inspiring her to lash out at everyone around her - even the gentle man at work who is undeniably drawn to her. Finally, Lucy is a woman who has failed to conceive with her husband, so she turns to adoption to make the family she desires.", "genres": ["Drama", "Romance"], "imdb": {"id": 1121977, "rating": 7.2, "votes": 9170}, "languages": ["English"], "lastupdated": "2015-09-17 03:52:16.843000000", "metacritic": 64, "num_mflix_comments": 3, "plot": "A drama centered around three women: A 50-year-old woman, the daughter she gave up for adoption 35 years ago, and an African American woman looking to adopt a child of her own.", "poster": "https://m.media-amazon.com/images/M/MV5BMTg4NTM5MTE0N15BMl5BanBnXkFtZTcwOTM2MTgyMw@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1278028800000, "runtime": 125, "title": "Mother and Child", "tomatoes": {"boxOffice": "$1.1M", "consensus": "Though it occasionally veers into unnecessary melodrama, Mother and Child benefits from a stellar cast and writer-director Rodrigo Garcia's finely detailed, bravely unsentimental script.", "critic": {"meter": 78, "numReviews": 119, "rating": 6.6}, "dvd": 1292284800000, "fresh": 93, "lastUpdated": 1440094250000, "production": "Sony Pictures Classics", "rotten": 26, "viewer": {"meter": 76, "numReviews": 6771, "rating": 3.7}, "website": "http://www.sonyclassics.com/motherandchild/"}, "type": "movie", "writers": ["Rodrigo Garcèa"], "year": 2009}