{"_id": "573a1399f29313caabcec06f", "awards": {"nominations": 4, "text": "1 win & 4 nominations.", "wins": 1}, "cast": ["Maggie Cheung", "Siu-Kwong Chung", "Tan Lang Jachi Tian", "Waise Lee"], "countries": ["Hong Kong", "Taiwan"], "directors": ["Ann Hui"], "fullplot": "After the Sino-Japanese War, Kwei Dz, one of the family members of Japanese soldiers accepted a Chinese officer's proposal and remained in China. Later they had a daughter named Ann. The officer went to Hong Kong to work, leaving Kwei Dz and Ann in Macao. Kwei Dz, unable to communicate with her in-laws, much less accept their ways, became remorseful. Yet the worst problem she had was that Ann did not accept her as a mother. After Ann got a Master Degree in UK she went back to Hong Kong. Kwei Dz had been feeling very homesick for her mother country and decided to take Ann and return to Japan. In Japan, Ann began to understand her mother's pain because she did not understand Japan or the Japanese. Later a telegram from Canton arrived saying that Ann's grandfather had had a stroke. Upon seeing her to grandfather, Ann realized that, in spite of his now frail body, a body once tortured by Red Guards, he was so hopeful for China's future. Ann saw that China was now trying to find its own way in the midst of its self-inflicted turmoil.", "genres": ["Drama"], "imdb": {"id": 99927, "rating": 7.4, "votes": 254}, "languages": ["Cantonese", "Mandarin", "Japanese"], "lastupdated": "2015-08-15 00:51:45.647000000", "num_mflix_comments": 1, "plot": "After the Sino-Japanese War, Kwei Dz, one of the family members of Japanese soldiers accepted a Chinese officer's proposal and remained in China. Later they had a daughter named Ann. The ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTM4NTIyMzk1MV5BMl5BanBnXkFtZTYwNjkwOTk4._V1_SY1000_SX677_AL_.jpg", "released": 641174400000, "runtime": 100, "title": "Song of the Exile", "tomatoes": {"lastUpdated": 1435865026000, "production": "Kino International", "viewer": {"meter": 93, "numReviews": 210, "rating": 4.2}}, "type": "movie", "writers": ["Nien-Jen Wu"], "year": 1990}