{"_id": "573a13a4f29313caabd12a13", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Gwyneth Paltrow", "Christina Applegate", "Mark Ruffalo", "Candice Bergen"], "countries": ["USA"], "directors": ["Bruno Barreto"], "fullplot": "Donna Jensen was raised literally and figuratively on the wrong side of the trailer park in Silver Springs, Nevada. She always believed it was her destiny to get out of Silver Springs. After reading Sally Weston's book, Sally who is arguably the most famous now ex-flight attendant in the world, Donna believes the path to leaving Silver Springs is to become a flight attendant despite never having been on an airplane. After an initial bumpy start to this career, Donna shows a natural flair for the job, so much so that she applies to work for world class Royal Airlines, where Sally Weston mentors. After meeting Donna, Sally believes Donna is destined for flight attendant greatness, namely working first class in the New York-Paris flights. Donna believes in herself as a flight attendant, but has to overcome some obstacles, including flight attendant trainer John Witney, who has some hidden anger issues, and her friend Christine Montgomery who also wants to be a great flight attendant despite not having Donna's aptitude at it. In her path to the top of the profession, Donna also has to decide where Ted Stewart, the man with who she falls in love, fits in, he a law student based in the airline flight backwater of Cleveland.", "genres": ["Comedy", "Romance"], "imdb": {"id": 264150, "rating": 5.2, "votes": 19812}, "languages": ["English"], "lastupdated": "2015-08-31 00:42:04.187000000", "metacritic": 27, "plot": "A small-town woman tries to achieve her goal of becoming a flight attendant.", "poster": "https://m.media-amazon.com/images/M/MV5BMTg2MTk2MzkxNF5BMl5BanBnXkFtZTYwNjg0NTk5._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1048204800000, "runtime": 87, "title": "View from the Top", "tomatoes": {"boxOffice": "$15.5M", "consensus": "Uneven in tone and badly edited, A View From the Top wastes the talents of its cast and condescends to its characters.", "critic": {"meter": 14, "numReviews": 123, "rating": 3.7}, "dvd": 1063065600000, "fresh": 17, "lastUpdated": 1442255005000, "production": "Miramax Films", "rotten": 106, "viewer": {"meter": 33, "numReviews": 39324, "rating": 2.6}, "website": "http://www.miramax.com/viewfromthetop/index.html"}, "type": "movie", "writers": ["Eric Wald"], "year": 2003}