{"_id": "573a13d2f29313caabd92a21", "awards": {"nominations": 7, "text": "3 wins & 7 nominations.", "wins": 3}, "cast": ["Karen Miyama", "Yuka", "Daizaburo Arakawa", "Toshiyuki Nishida"], "countries": ["Japan"], "directors": ["Hiroyuki Okiura"], "fullplot": "Clinging to an unfinished letter written by her recently deceased father, young Momo moves with her mother from bustling Tokyo to the remote Japanese island of Shio. Upon their arrival, she begins to explore her new habitat, meeting local children and learning their routines and customs. However, it's not long before several bizarre occurrences crop up around the previously tranquil island. Orchards are found ransacked, prized trinkets start disappearing and, worst of all, each morning after her mother leaves for work, Momo hears strange mumblings coming from the attic of their home. Annoyed by these creepy goings-on and her mother's refusal to believe them, Momo embarks on a strange and supernatural adventure to discover the source of the mischief, which leads her to a trio of troublesome imps: the flatulent lizard Kawa, the childlike Mame and their hulking ogre leader Iwa. Momo also learns that her visit to the island is in some way connected to her father's mysterious letter.", "genres": ["Animation", "Drama", "Family"], "imdb": {"id": 1853614, "rating": 7.3, "votes": 2593}, "languages": ["Japanese"], "lastupdated": "2015-08-18 00:29:19.953000000", "metacritic": 65, "num_mflix_comments": 1, "plot": "Clinging to an unfinished letter written by her recently deceased father, young Momo moves with her mother from bustling Tokyo to the remote Japanese island of Shio. Upon their arrival, she...", "poster": "https://m.media-amazon.com/images/M/MV5BMjE1MTM3NTE4OF5BMl5BanBnXkFtZTgwMTEyODAzMjE@._V1_SY1000_SX677_AL_.jpg", "released": 1334966400000, "runtime": 120, "title": "A Letter to Momo", "tomatoes": {"consensus": "Sweet, sad, and visually striking, A Letter to Momo is a hand-drawn experience for animation fans to savor.", "critic": {"meter": 79, "numReviews": 29, "rating": 6.7}, "dvd": 1413849600000, "fresh": 23, "lastUpdated": 1440613061000, "production": "GKIDS", "rotten": 6, "viewer": {"meter": 77, "numReviews": 809, "rating": 3.7}, "website": "http://www.alettertomomo.com"}, "type": "movie", "writers": ["Hiroyuki Okiura (screenplay)"], "year": 2011}