{"_id": "573a13daf29313caabdad361", "awards": {"nominations": 6, "text": "2 wins & 6 nominations.", "wins": 2}, "cast": ["Bo-yeong Park", "Joong-ki Song", "Yeong-ran Lee", "Young-nam Jang"], "countries": ["South Korea"], "directors": ["Sung-hee Jo"], "fullplot": "An offer to buy her property brings elderly Kim Sun-yi back to the country cottage she briefly lived in during eventful times in her youth. With her granddaughter by her side, Sun-yi recalls meeting Cheol-su, not only a feral orphan from Korean war days but a mute boy genetically spliced with wolf DNA by a rogue scientist, now deceased. She effectively tames the unsocialized lad through dog obedience training, and he soon becomes more than a loyal companion, protecting her from the rude advances of her late father's business partner's ne'er-do-well, spoiled, self-centered son, Ji-tae, who fully expects Sun-yi to marry him someday. He would claim her as his own sooner than that if not for Cheol-su, who transforms into an unbeatable werewolf anytime someone threatens a member of his pack, leading Ji-tae to work towards a permanent solution to this problem.", "genres": ["Fantasy", "Romance"], "imdb": {"id": 2315152, "rating": 7.3, "votes": 2941}, "languages": ["Korean"], "lastupdated": "2015-08-06 00:27:52.570000000", "num_mflix_comments": 2, "plot": "Summoned by an unexpected phone call, an elderly woman visits the country cottage she lived in as a child. Memories of an orphan boy she knew 47 years ago come flooding back to her.", "poster": "https://m.media-amazon.com/images/M/MV5BMTQ5MjI0NDc1MV5BMl5BanBnXkFtZTgwNzkzMTAzMjE@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 1354233600000, "runtime": 122, "title": "A Werewolf Boy", "tomatoes": {"boxOffice": "$0.3M", "critic": {"meter": 100, "numReviews": 5, "rating": 7.2}, "dvd": 1376352000000, "fresh": 5, "lastUpdated": 1438025047000, "production": "CJ Entertainment", "rotten": 0, "viewer": {"meter": 83, "numReviews": 2740, "rating": 4.2}}, "type": "movie", "writers": ["Sung-hee Jo"], "year": 2012}