{"_id": "573a139af29313caabcef7fa", "awards": {"nominations": 9, "text": "Won 1 Golden Globe. Another 8 nominations.", "wins": 0}, "cast": ["Alec Baldwin", "Jessica Lange", "John Goodman", "Diane Lane"], "countries": ["USA"], "directors": ["Glenn Jordan"], "fullplot": "Set in the French Quarter of New Orleans during the restless years following World War Two, A STREETCAR NAMED DESIRE is the story of Blanche DuBois, a fragile and neurotic woman on a desperate prowl for someplace in the world to call her own. After being exiled from her hometown of Laurel, Mississippi for seducing a seventeen-year-old boy at the school where she taught English, Blanche explains her unexpected appearance on Stanley and Stella's (Blanche's sister) doorstep as nervous exhaustion. This, she claims, is the result of a series of financial calamities which have recently claimed the family plantation, Belle Reve. Suspicious, Stanley points out that \"under Louisiana's Napoleonic code what belongs to the wife belongs to the husband.\" Stanley, a sinewy and brutish man, is as territorial as a panther. He tells Blanche he doesn't like to be swindled and demands to see the bill of sale. This encounter defines Stanley and Blanche's relationship. They are opposing camps and Stella is caught in no-man's-land. But Stanley and Stella are deeply in love. Blanche's efforts to impose herself between them only enrages the animal inside Stanley. When Mitch -- a card-playing buddy of Stanley's -- arrives on the scene, Blanche begins to see a way out of her predicament. Mitch, himself alone in the world, reveres Blanche as a beautiful and refined woman. Yet, as rumors of Blanche's past in Laurel begin to catch up to her, her circumstances become unbearable.", "genres": ["Drama"], "imdb": {"id": 114565, "rating": 6.9, "votes": 826}, "languages": ["English"], "lastupdated": "2015-09-11 00:38:51.037000000", "num_mflix_comments": 1, "plot": "Set in the French Quarter of New Orleans during the restless years following World War Two, A STREETCAR NAMED DESIRE is the story of Blanche DuBois, a fragile and neurotic woman on a ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTI4NzM5NTc3NV5BMl5BanBnXkFtZTcwMDI0NDcxMQ@@._V1_SY1000_SX677_AL_.jpg", "released": 814924800000, "runtime": 156, "title": "A Streetcar Named Desire", "tomatoes": {"dvd": 1053993600000, "lastUpdated": 1438542760000, "viewer": {"meter": 60, "numReviews": 556, "rating": 3.2}}, "type": "movie", "writers": ["Tennessee Williams (play)"], "year": 1995}