{"_id": "573a1396f29313caabce4831", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Barbara Loden", "Michael Higgins", "Dorothy Shupenes", "Peter Shupenes"], "countries": ["USA"], "directors": ["Barbara Loden"], "fullplot": "In the coal mining region of Pennsylvania, Wanda Goronski is constantly drinking to shut out the problems in her life. Having deserted her husband and infant children, Wanda sleeps on her sister's couch - when she isn't sleeping with the latest man who bought her a drink - and is unemployed with no long term job prospect. Her drinking and her life in combination have made her an emotionless woman. Her life changes when she meets Norman Dennis in a bar. She initially believes he's the bartender, but in reality he's a petty criminal who just held up the bar in question. Even after she learns Mr. Dennis' occupation and despite he treating her poorly, she willingly goes along with him and his petty crimes as a way to get through life. Mr. Dennis, on the other hand, sees her as a conduit to bigger and better things. Although things don't turn out quite the way either of the two envision, Wanda does at least begin to feel once again.", "genres": ["Crime", "Drama"], "imdb": {"id": 67961, "rating": 7.1, "votes": 1138}, "languages": ["English"], "lastupdated": "2015-08-04 00:40:32.617000000", "num_mflix_comments": 1, "plot": "In the coal mining region of Pennsylvania, Wanda Goronski is constantly drinking to shut out the problems in her life. Having deserted her husband and infant children, Wanda sleeps on her ...", "poster": "https://m.media-amazon.com/images/M/MV5BOGZiMTczZGYtYmJhMy00ZDdhLWI2NWQtMTViNjAzMjY0MzgzXkEyXkFqcGdeQXVyNzgzODI1OTE@._V1_SY1000_SX677_AL_.jpg", "rated": "GP", "released": 1058313600000, "runtime": 102, "title": "Wanda", "tomatoes": {"critic": {"meter": 90, "numReviews": 10, "rating": 7.4}, "dvd": 1155600000000, "fresh": 9, "lastUpdated": 1440615243000, "rotten": 1, "viewer": {"meter": 73, "numReviews": 556, "rating": 3.8}}, "type": "movie", "writers": ["Barbara Loden"], "year": 1970}