{"_id": "573a13e0f29313caabdbb612", "awards": {"nominations": 0, "text": "2 wins.", "wins": 2}, "cast": ["Michael Shannon", "Nicholas Hoult", "Elle Fanning", "Kodi Smit-McPhee"], "countries": ["South Africa", "Ireland", "USA"], "directors": ["Jake Paltrow"], "fullplot": "Set in a near future when water has become the most precious and dwindling resource on the planet, one that dictates everything from the macro of political policy to the detailed micro of interpersonal family and romantic relationships. The land has withered into something wretched. The dust has settled on a lonely, barren planet. The hardened survivors of the loss of Earth's precious resources scrape and struggle. Ernest Holm Michael Shannon lives on this harsh frontier with his children, Jerome Kodi Smit-McPhee and Mary Elle Fanning. He defends his farm from bandits, works the supply routes, and hopes to rejuvenate the soil. But Mary's boyfriend, Flem Lever (Nicholas Hoult), has grander designs. He wants Ernest's land for himself, and will go to any length to get it. From writer/director Jake Paltrow comes a futuristic western, told in three chapters, which inventively layers Greek tragedy over an ethereal narrative that's steeped deeply in the values of the American West.", "genres": ["Action", "Drama", "Sci-Fi"], "imdb": {"id": 2693664, "rating": 5.9, "votes": 5612}, "languages": ["English"], "lastupdated": "2015-09-10 17:44:36.373000000", "metacritic": 47, "plot": "Set in the future when water is hard to find, a teenage boy sets out to protect his family and survive.", "poster": "https://m.media-amazon.com/images/M/MV5BNTk1NjE5MTc0NV5BMl5BanBnXkFtZTgwODc1MzE1MjE@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1413504000000, "runtime": 100, "title": "Young Ones", "tomatoes": {"consensus": "Visually compelling but narratively barren, Young Ones adds little to the dystopian Western genre.", "critic": {"meter": 41, "numReviews": 29, "rating": 5.2}, "dvd": 1421107200000, "fresh": 12, "lastUpdated": 1442427015000, "production": "Screen Media Ventures", "rotten": 17, "viewer": {"meter": 33, "numReviews": 1878, "rating": 2.9}, "website": "http://www.screenmedia.net/project/young-ones/"}, "type": "movie", "writers": ["Jake Paltrow"], "year": 2014}