{"_id": "573a13e3f29313caabdc0100", "awards": {"nominations": 2, "text": "1 win & 2 nominations.", "wins": 1}, "cast": ["Jon Favreau", "John Leguizamo", "Bobby Cannavale", "Emjay Anthony"], "countries": ["USA"], "directors": ["Jon Favreau"], "fullplot": "Carl Casper is an acclaimed chef with a family life that seems as decaying as his artistic freedom. Those frustrations boil over into a raucous viral-videoed public confrontation against a restaurant critic who panned his cooking of food that his boss ordered him to make against his instincts. Now with his career ruined, Carl's ex-wife offers an unorthodox solution in Miami: refit an old food truck to offer quality cooking on his own terms. Now with his young son, Percy, and old colleague, Martin, helping, Carl takes a working trip across America with that truck to rediscover his gastronomic passion. With Percy's tech savvy and Martin's enthusiasm, Carl finds that he is creating a traveling sensation on the way home. In doing so, Carl discovers he is serving up more than simply food, but also a deeper connection with his life and his family that is truly delicious in its own way.", "genres": ["Adventure", "Comedy", "Drama"], "imdb": {"id": 2883512, "rating": 7.3, "votes": 114046}, "languages": ["English", "Spanish"], "lastupdated": "2015-08-31 00:00:18.810000000", "metacritic": 68, "num_mflix_comments": 1, "plot": "A chef who loses his restaurant job starts up a food truck in an effort to reclaim his creative promise, while piecing back together his estranged family.", "poster": "https://m.media-amazon.com/images/M/MV5BMTY5NTYzNTA1M15BMl5BanBnXkFtZTgwODIwODU1MTE@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1401408000000, "runtime": 114, "title": "Chef", "tomatoes": {"consensus": "Chef's charming cast and sharp, funny script add enough spice to make this feel-good comedy a flavorful -- if familiar -- treat.", "critic": {"meter": 86, "numReviews": 169, "rating": 6.8}, "dvd": 1412035200000, "fresh": 146, "lastUpdated": 1439924198000, "production": "Open Road Films", "rotten": 23, "viewer": {"meter": 85, "numReviews": 55828, "rating": 4}, "website": "http://www.facebook.com/ChefTheFilm"}, "type": "movie", "writers": ["Jon Favreau"], "year": 2014}