{"_id": "573a13a6f29313caabd19d18", "awards": {"nominations": 7, "text": "3 wins & 7 nominations.", "wins": 3}, "cast": ["Amitabh Bachchan", "Sanjay Dutt", "Sunil Shetty", "Mahesh Manjrekar"], "countries": ["India"], "directors": ["Sanjay Gupta"], "fullplot": "On or about 12May00, a truck gets stolen in Los Angeles, and the Police bring in six men of South Asian origin for questioning. They are: Yashvardhan Rampal, known as 'Major' educated intelligent, unemployed, with an ailing wife who longs to return to India; Non-English speaking Jay Rehan, otherwise known as 'Ajju', a foul-mouthed, trigger-happy gangster; A out-of-work former nightclub bouncer, Marc Issak, whose girlfriend, Lisa, is a bar dancer, and who is known to get into fights due to his uncontrollable temper; A drug deal, Raj Yadav, otherwise known as Bali, foul-mouthed, womanizer, stutterer, and alcoholic; Bali's sidekick, Maqbool Haider, otherwise known as Mac; White-collared Anand Mathur, alias Andy, recently separated from his wife, Renu, and longing to get back together with his son, who he cannot get custody of due to financial problems. The six confer in a cell, cite woes that even though the Italians have their Mafia, the Colombians have their Cartels, but the East Indian criminal community is yet to forge a Bhai-type organization, resulting in their getting pulled-in as the usual suspects every time there is a crime involving a colored person. They plot to get back at the cops by robbing the American Services Bank, perhaps the only bank which has a majority of it's clientèle employed by the city police. They plan and carry out this caper quite successfully, but when they exit the bank, they find themselves surrounded by the Police. After a shoot-out, They do manage to escape and meet in a secret hideout, to not only share the loot, but also try and find out who betrayed them. Ajju abducts Police Interrogator, Detective MacQuarrie, and it is through him they learn that their informer is one of them - and they must find out his identity - kill him - then divide the loot amongst them and disperse. The only problem is the informer is not willing to come forward - and the gangsters end up suspecting each other and their respective motives.", "genres": ["Action", "Crime", "Drama"], "imdb": {"id": 294662, "rating": 6.5, "votes": 3277}, "languages": ["Hindi", "English"], "lastupdated": "2015-09-02 00:24:30.413000000", "metacritic": 41, "num_mflix_comments": 1, "plot": "Six bank robbers trying to pull off the perfect heist discover one of them is an undercover cop.", "poster": "https://m.media-amazon.com/images/M/MV5BN2FiZjY4YWYtNzU4Yy00YzAyLWJhMDMtNzEzNTU0Mjc3MDQ4XkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1040342400000, "runtime": 150, "title": "Kaante", "tomatoes": {"boxOffice": "$1.0M", "critic": {"meter": 83, "numReviews": 6, "rating": 6.4}, "dvd": 1080000000000, "fresh": 5, "lastUpdated": 1440094518000, "production": "Media Partners", "rotten": 1, "viewer": {"meter": 77, "numReviews": 2428, "rating": 3.7}}, "type": "movie", "writers": ["Sanjay Gupta", "Vinay", "Yash", "Milap Zaveri (dialogue)"], "year": 2002}