{"_id": "573a1397f29313caabce81e1", "awards": {"nominations": 2, "text": "2 nominations.", "wins": 0}, "cast": ["Michael Ironside", "Lee Grant", "Linda Purl", "William Shatner"], "countries": ["Canada"], "directors": ["Jean-Claude Lord"], "fullplot": "Deborah Ballin is a controversial middle-aged TV journalist, who is campaigning on air on behalf of a battered woman who murdered her abusive husband, claiming justifiable defense against the so-called victim. But her outspoken views championing women's rights incense one of the studio's cleaning staff, closet homicidal psycho (and misogynist) Colt Hawker whose deep seated despising all all things female occurred from seeing his Mother throwing boiling oil in the face of his abusive Father when he was a small child (and who's M.O. is to photograph victims he stabs as they're spasming to death). So much so that he decides there and then to shut her up...PERMANENTLY! Managing to beat her home, he soon dispatches her maid Francine, before turning his rage onto her as she come home (greeting her in only wearing her jewelry and make-up). Despite the brutal injuries he lashes out on her, she manages to survive and is rushed off to hospital. But undaunted he catches up to her in hospital and disguised as a florist... he enter the building to continue his mission to finish her off...along with anyone else who gets under his skin.", "genres": ["Horror", "Thriller"], "imdb": {"id": 83296, "rating": 5.5, "votes": 2257}, "languages": ["English"], "lastupdated": "2015-09-05 00:02:19.347000000", "plot": "A crazed, women-hating killer (Ironside) attacks journalist Deborah Ballin (Grant). When he discovers that his attack didn't kill Deborah, he comes to the hospital to finish what he started.", "poster": "https://m.media-amazon.com/images/M/MV5BOGE2N2RlMjUtMTFmMi00ODU5LTgxNDAtNzVlMDk1OTU1OTJkXkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 391392000000, "runtime": 103, "title": "Visiting Hours", "tomatoes": {"critic": {"meter": 8, "numReviews": 12, "rating": 3.6}, "dvd": 1145318400000, "fresh": 1, "lastUpdated": 1439665508000, "production": "Anchor Bay Entertainment", "rotten": 11, "viewer": {"meter": 24, "numReviews": 1300, "rating": 2.8}}, "type": "movie", "writers": ["Brian Taggert (screenplay)"], "year": 1982}