{"_id": "573a13d6f29313caabda065a", "awards": {"nominations": 2, "text": "2 wins & 2 nominations.", "wins": 2}, "cast": ["Mustafa Nadarevic", "Predrag Ejdus", "Meto Jovanovski", "Zafir Hadzimanov"], "countries": ["Serbia", "France", "Croatia"], "directors": ["Goran Paskaljevic"], "fullplot": "The story of a retired music professor, Misha Brankov, who under unusual circumstances discovers his true origins. At the place where once stood a Nazi concentration camp for Jews during World War II, a metal box filled with documents is found. It was buried by an inmate Isaac Weiss in the year 1941. The professor finds out that his real parents, the Weiss's, gave him away to their friends, the Brankovs, just before they were taken into the camp. Inside the box there is an unfinished musical score, called \"When day breaks\", composed by the inmate Isaac Weiss. Searching for the truth about himself and his origins, Misha discovers the little-known truth about Judenlager Semlin camp, one of the worst Nazi execution sites in the heart of contemporary Belgrade. At the same time, the professor's obsession is to complete the composition, started by his father, and to perform it on the site of the former camp... which he, after many vicissitudes, finally succeeds.", "genres": ["Drama"], "imdb": {"id": 2093153, "rating": 7.2, "votes": 391}, "languages": ["Serbian"], "lastupdated": "2015-08-21 00:26:21.267000000", "num_mflix_comments": 1, "plot": "The story of a retired music professor, Misha Brankov, who under unusual circumstances discovers his true origins. At the place where once stood a Nazi concentration camp for Jews during ...", "poster": "https://m.media-amazon.com/images/M/MV5BMjFjMTdmMGYtODg1Yy00MmU5LTk2ZTktOTdkNzE5NjMyODM0XkEyXkFqcGdeQXVyMjM5MTg4MjQ@._V1_SY1000_SX677_AL_.jpg", "released": 1356307200000, "runtime": 78, "title": "When Day Breaks", "tomatoes": {"lastUpdated": 1441134477000, "viewer": {"numReviews": 16, "rating": 3.6}}, "type": "movie", "writers": ["Filip David", "Goran Paskaljevic"], "year": 2012}