{"_id": "573a13dff29313caabdb7adb", "awards": {"nominations": 183, "text": "Won 4 Oscars. Another 206 wins & 183 nominations.", "wins": 210}, "cast": ["Michael Keaton", "Emma Stone", "Kenny Chin", "Jamahl Garrison-Lowe"], "countries": ["USA"], "directors": ["Alejandro Gonzèlez Ièèrritu"], "fullplot": "Actor Riggan Thomson is most famous for his movie role from over twenty years ago of the comic book superhero Birdman in the blockbuster movie of the same name and its two equally popular sequels. His association with the role took over his life, where Birdman is more renowned than \"Riggan Thomson\" the actor. Now past middle age, Riggan is trying to establish himself as a true artist by writing, directing, starring in and co-producing with his best friend Jake what is his Broadway debut, an adaptation of Raymond Carver's story, What We Talk About When We Talk About Love. He is staking his name, what little artistic reputation that comes with that name and his life savings on the project, and as such will do anything needed to make the play a success. As he and Jake go through the process of the previews toward opening night, Riggan runs into several issues: needing to find a replacement for the integral supporting male role the night before the first preview; hiring the talented Broadway name, Mike Shiner, for that role, Mike who ends up being difficult to work with and who may end up overshadowing Riggan in the play; having to deal potentially with a lawsuit based on one of his actions to ensure success; needing to be there for his daughter, Sam, who he has hired to be his production assistant and who has just come out of drug rehab; and pleasing the New York Times critic, Tabitha Dickinson, who wants to use any excuse to give the play a scathing review which in turn would close the show after the opening night performance. But Riggan's biggest problem may be his own insecurities, which are manifested by him constantly hearing what he believes to be the truth from the voice of his Birdman character, who he often battles both internally and externally.", "genres": ["Comedy", "Drama"], "imdb": {"id": 2562232, "rating": 7.8, "votes": 304963}, "languages": ["English"], "lastupdated": "2015-08-31 00:00:48.780000000", "metacritic": 88, "num_mflix_comments": 2, "plot": "Illustrated upon the progress of his latest Broadway play, a former popular actor's struggle to cope with his current life as a wasted actor is shown.", "poster": "https://m.media-amazon.com/images/M/MV5BODAzNDMxMzAxOV5BMl5BanBnXkFtZTgwMDMxMjA4MjE@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1415923200000, "runtime": 119, "title": "Birdman: Or (The Unexpected Virtue of Ignorance)", "tomatoes": {"boxOffice": "$42.3M", "consensus": "A thrilling leap forward for director Alejandro Gonzèlez Ièèrritu, Birdman is an ambitious technical showcase powered by a layered story and outstanding performances from Michael Keaton and Edward Norton.", "critic": {"meter": 92, "numReviews": 260, "rating": 8.5}, "dvd": 1424131200000, "fresh": 240, "lastUpdated": 1441904724000, "production": "Fox Searchlight", "rotten": 20, "viewer": {"meter": 78, "numReviews": 86731, "rating": 3.9}, "website": "http://www.birdmanthemovie.com/"}, "type": "movie", "writers": ["Alejandro Gonzèlez Ièèrritu", "Nicolès Giacobone", "Alexander Dinelaris", "Armando Bo", "Raymond Carver (play)"], "year": 2014}