{"_id": "573a13cdf29313caabd85ad2", "awards": {"nominations": 30, "text": "8 wins & 30 nominations.", "wins": 8}, "cast": ["Mia Wasikowska", "Nicole Kidman", "David Alford", "Matthew Goode"], "countries": ["UK", "USA"], "directors": ["Chan-wook Park"], "fullplot": "India Stoker (Mia Wasikowska) was not prepared to lose her father and best friend Richard (Dermot Mulroney) in a tragic auto accident. The solitude of her woodsy family estate, the peace of her tranquil town, and the unspoken somberness of her home life are suddenly upended by not only this mysterious accident, but by the sudden arrival of her Uncle Charlie (Matthew Goode), whom she never knew existed. When Charlie moves in with her and her emotionally unstable mother Evie (Nicole Kidman), India thinks the void left by her father's death is finally being filled by his closest bloodline. Soon after his arrival, India comes to suspect that this mysterious, charming man has ulterior motives. Yet instead of feeling outrage or horror, this friendless young woman becomes increasingly infatuated with him.", "genres": ["Drama", "Thriller"], "imdb": {"id": 1682180, "rating": 6.9, "votes": 77946}, "languages": ["English"], "lastupdated": "2015-09-07 00:21:22.287000000", "metacritic": 58, "plot": "After India's father dies, her Uncle Charlie, who she never knew existed, comes to live with her and her unstable mother. She comes to suspect this mysterious, charming man has ulterior motives and becomes increasingly infatuated with him.", "poster": "https://m.media-amazon.com/images/M/MV5BMjI3MTM5ODI5MV5BMl5BanBnXkFtZTcwMjE1Mzc4OA@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1362096000000, "runtime": 99, "title": "Stoker", "tomatoes": {"boxOffice": "$1.7M", "consensus": "Its script doesn't quite carry the dramatic heft of his earlier work, but Park Chan-wook's Stoker showcases his eye for sumptuous imagery and his affection for dark, atmospheric narratives populated by mysterious characters.", "critic": {"meter": 69, "numReviews": 182, "rating": 6.6}, "dvd": 1371513600000, "fresh": 125, "lastUpdated": 1442163867000, "production": "Fox Searchlight Pictures", "rotten": 57, "viewer": {"meter": 60, "numReviews": 22106, "rating": 3.4}, "website": "http://www.foxsearchlight.com/stoker/"}, "type": "movie", "writers": ["Wentworth Miller"], "year": 2013}