{"_id": "573a13b1f29313caabd36b22", "awards": {"nominations": 0, "text": "4 wins.", "wins": 4}, "cast": ["Elizabeth Ashley", "Jayce Bartok", "Bruce Dern", "Miriam Shor"], "countries": ["USA"], "directors": ["Mary Stuart Masterson"], "fullplot": "'The Cake Eaters' is a quirky, small town, ensemble drama that explores the lives of two interconnected families coming to terms with love in the face of loss. Living in rural America, The Kimbrough family is a normally odd bunch; Easy, the patriarch and local butcher, is grieving over the recent loss of his wife, Ceci, while hiding a secret ongoing affair for years; Beagle, his youngest son who was left to care for his ailing mother, works in the local high school cafeteria by day but has a burning passion inside that manifests itself through painting street signs; and the eldest son, Guy, has been away from the family for years while pursuing his rock star dream in the big city until the day he learns of his mother's passing and that he's missed the funeral. Upon Guy's return home, relationships between the characters begin to unravel; Beagle's pent up emotions connect with Georgia Kaminski, a terminally ill teenage girl wanting to experience love before it's too late; Easy's long time affair with Marg, Georgia's eccentric grandmother, is finally exposed to the Kimbrough children; and Guy discovers that, in his absence, his high school sweetheart, Stephanie, has moved on and started a family of her own. Through it all, The Kimbroughs and Kaminski's manage to establish a new beginning in the face of their greatest fears.", "genres": ["Comedy", "Drama", "Romance"], "imdb": {"id": 418586, "rating": 6.5, "votes": 5539}, "languages": ["English"], "lastupdated": "2015-08-20 01:13:57.813000000", "metacritic": 60, "plot": "Two families are brought together by the return of one family's son -- a reunion that conjures up old ghosts and issues that must be addressed.", "poster": "https://m.media-amazon.com/images/M/MV5BYzZkNTQ0YmItMzQ3OS00NWRjLTk1NTMtODE5YjYwNzFmNmI4XkEyXkFqcGdeQXVyMTMxMTY0OTQ@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1236902400000, "runtime": 86, "title": "The Cake Eaters", "tomatoes": {"consensus": "Though light on theme and craftsmanship, The Cake Eaters relies on fine performances and brisk direction to provide an affecting tale of small-town life.", "critic": {"meter": 64, "numReviews": 25, "rating": 6}, "dvd": 1237852800000, "fresh": 16, "lastUpdated": 1440181114000, "production": "7-57 Releasing", "rotten": 9, "viewer": {"meter": 48, "numReviews": 12557, "rating": 3.1}}, "type": "movie", "writers": ["Jayce Bartok (screenplay)"], "year": 2007}