{"_id": "573a13abf29313caabd23b60", "awards": {"nominations": 1, "text": "1 win & 1 nomination.", "wins": 1}, "cast": ["Byung-hun Lee", "Mi-yeon Lee", "Eol Lee", "Seon-yeong Park"], "countries": ["South Korea"], "directors": ["Young-hoon Park"], "fullplot": "Two brothers, Ho-jin and Dae-jin, were the only family they had. The older brother Ho-jin married Eun-soo, extending their family to three, and they all lived happy, tranquil days together. But one day, in spite of Ho-jin's objection, Dae-jin takes part in a car race finals. At the exact same time and in different places, both brothers get into a tragic accident and they both lose consciousness. One year later, a miracle unfolds when Dae-jin wakes up from his coma. But when he does, he claims that he's Ho-jin. After taking care of Dae-jin at the hospital, Eun-soo and Dae-jin go home and their life together begins. But Eun-soo is utterly confused as Dae-jin's way of talking, tastes and even habits are exactly like her husband's. Eun-soo has trouble accepting the fact that her husband's spirit has taken over Dae-jin's body, while Dae-jin tries to convince her that he's really her husband, Ho-jin. At first they live distantly from each other, but as time passes, they get closer. Eun-soo keeps noticing things about her husband from Dae-jin, but she persists on keeping a fine line between them as in-laws. Then Dae-jin weeps while recalling a memory that only Eun-soo and Ho-jin would know. Finally, Eun-soo breaks down the barrier she built, and accepts Dae-jin as her real husband. Feeling that it could've been a love lost forever, they begin a more passionate love, but the people around them look distastefully at their relationship.", "genres": ["Drama", "Mystery", "Romance"], "imdb": {"id": 336678, "rating": 7.2, "votes": 934}, "languages": ["Korean"], "lastupdated": "2015-08-10 00:47:53.113000000", "num_mflix_comments": 1, "plot": "Two brothers, Ho-jin and Dae-jin, were the only family they had. The older brother Ho-jin married Eun-soo, extending their family to three, and they all lived happy, tranquil days together....", "poster": "https://m.media-amazon.com/images/M/MV5BMTUzOTExMTAyNV5BMl5BanBnXkFtZTcwNDMyMjQzMQ@@._V1_SY1000_SX677_AL_.jpg", "released": 1034899200000, "runtime": 110, "title": "Addicted", "tomatoes": {"dvd": 1132012800000, "lastUpdated": 1441132158000, "viewer": {"meter": 75, "numReviews": 1337, "rating": 3.5}}, "type": "movie", "writers": ["Won-mi Byun", "Jae-young Kwak (adaptation)"], "year": 2002}