{"_id": "573a13cff29313caabd897e8", "awards": {"nominations": 9, "text": "1 win & 9 nominations.", "wins": 1}, "cast": ["Rani Mukerji", "Vidya Balan", "Myra Karn", "Neil Bhoopalam"], "countries": ["India"], "directors": ["Raj Kumar Gupta"], "fullplot": "Devastated when she is told that that her sister, Jessica Lall, is shot dead by Manish Bhardwaj, the son of Pramod, a Congress party Member of Parliament in Haryana, Delhi-based Sabrina Lall, in the company of her parents, attends the Court to view a charade that will lead to the acquittal of the accused and his accomplices seven years after the incident. Disillusioned by rampart police corruption and inefficiency; a stagnant British introduced legal system; the passing of her mother & the hospitalization of her father, she retreats unto herself. Then foul-mouthed NDTV employee, Meera Gaity, known for being more of an activist than a Journalist, takes an interest in this incident, and uncovers conspiracy & corruption that led to the accused' acquittals - leading to a near India-wide protest. While preparing herself to participate in a candle-lit procession at Delhi's India Gate, Meera will confront Sabrina and will come to know the reasons why the latter refuses to be involved in this situation any more.", "genres": ["Crime", "Drama", "Thriller"], "imdb": {"id": 1734110, "rating": 7.2, "votes": 6320}, "languages": ["Hindi", "English"], "lastupdated": "2015-08-21 00:40:03.453000000", "num_mflix_comments": 1, "plot": "A journalist, who is more of an activist teams up with the sister of a murdered model, as she gets interested in the case and wants to bring justice to her case.", "poster": "https://m.media-amazon.com/images/M/MV5BMTU4Mzk0NDY3OV5BMl5BanBnXkFtZTcwMjE1MTkyNA@@._V1_SY1000_SX677_AL_.jpg", "released": 1294358400000, "runtime": 136, "title": "No One Killed Jessica", "tomatoes": {"boxOffice": "$0.4M", "critic": {"meter": 60, "numReviews": 5, "rating": 6.2}, "dvd": 1299542400000, "fresh": 3, "lastUpdated": 1439752660000, "production": "UTV Communications", "rotten": 2, "viewer": {"meter": 67, "numReviews": 5623, "rating": 3.5}, "website": "http://www.noonekilledjessica.com/"}, "type": "movie", "writers": ["Amitabh Bhattacharya (lyrics)", "Raj Kumar Gupta (story)"], "year": 2011}