{"_id": "573a1397f29313caabce683c", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Arnold Schwarzenegger", "Lou Ferrigno", "Matty Ferrigno", "Victoria Ferrigno"], "countries": ["USA"], "directors": ["George Butler", "Robert Fiore"], "fullplot": "From Gold's Gym in Venice Beach California to the showdown in Pretoria, amateur and professional bodybuilders prepare for the 1975 Mr. Olympia and Mr. Universe contests in this part-scripted, part-documentary film. Five-time champion Arnold Schwarzenegger defends his Mr. Olympia title against Serge Nubret and the shy young deaf Lou Ferrigno, whose father is his coach; the ruthless champ psyches out the young lion. Sardinian Franco Columbu competes in the lightweight class; at home in Italy he solves a tight parking problem by lifting the car into place. Joe Weider is the marketer; Mike Katz and Ken Waller go for the title of Mr. Universe. Bodybuilding and a celebrity-to-be go mainstream.", "genres": ["Documentary", "Sport"], "imdb": {"id": 76578, "rating": 7.5, "votes": 13785}, "languages": ["English"], "lastupdated": "2015-09-06 00:11:13.697000000", "plot": "From Gold's Gym in Venice Beach California to the showdown in Pretoria, amateur and professional bodybuilders prepare for the 1975 Mr. Olympia and Mr. Universe contests in this ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTg2OTIwNTQ2OF5BMl5BanBnXkFtZTcwNTA4NDAwMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 260150400000, "runtime": 85, "title": "Pumping Iron", "tomatoes": {"consensus": "In addition to offering an enlightening early look into the world of future star/politician Arnold Schwarzenegger, Pumping Iron provides a witty and insightful overview of competitive bodybuilding.", "critic": {"meter": 96, "numReviews": 23, "rating": 7.3}, "dvd": 1068508800000, "fresh": 22, "lastUpdated": 1442258569000, "production": "LionsGate Entertainment", "rotten": 1, "viewer": {"meter": 84, "numReviews": 9537, "rating": 3.8}}, "type": "movie", "writers": ["Charles Gaines (book)", "George Butler (book)", "George Butler (conception)"], "year": 1977}