{"_id": "573a1399f29313caabceec02", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Greg Evigan", "Eugene Clark", "Torri Higginson", "Ray Jewers"], "countries": ["Canada", "USA"], "directors": ["William Shatner"], "fullplot": "After four years, Jake Cardigan is prematurely awoken from his fifteen year cryogenic punishment to a world very different than the one he knew. Much more than before 'Tek', the highly-addictive electronic designer narcotic of the 21st century, seems to be prevalent. His wife has divorced him and disappeared together with their son. He wants them back and he wants justice for those undercover policemen who were murdered by unknown conspirators which led to his imprisonment for a crime he did not commit. He links up with his ex-partner Sid Gomez, now also an ex-cop, and they go to work for the mysterious Bascom who owns and runs the giant Cosmos security corporation. Their first job is a seemingly easy missing persons case trying to locate a missing scientist who may have developed a crystal to destroy Tek chips. The more the two men investigate the more the dark and powerful forces of the hidden Tek lords are sent to thwart them. What is the connection between this case and his wrongful imprisonment four years ago? Will he ever be able to trace his lost family through the infinite twists and turns of this new technological age? In a race against time Jake struggles to come to terms with this new world where nothing is as it seems and his place within it.", "genres": ["Sci-Fi"], "imdb": {"id": 111385, "rating": 6, "votes": 522}, "languages": ["English"], "lastupdated": "2015-08-11 00:02:57.140000000", "num_mflix_comments": 1, "plot": "A television movie based on the futurist story by William Shatner.", "poster": "https://m.media-amazon.com/images/M/MV5BMTUxMzczMDIwOF5BMl5BanBnXkFtZTcwMzYwMjAzMQ@@._V1_SY1000_SX677_AL_.jpg", "released": 759283200000, "runtime": 97, "title": "TekWar", "tomatoes": {"dvd": 793324800000, "lastUpdated": 1431803151000, "viewer": {"meter": 33, "numReviews": 271, "rating": 3}}, "type": "movie", "writers": ["Alfonse Ruggiero (teleplay)", "Westbrook Claridge (teleplay)", "William Shatner (novel)"], "year": 1994}