{"_id": "573a1394f29313caabcdef07", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Nigel Patrick", "Roland Culver", "Alison Leggatt", "Charles Victor"], "countries": ["UK"], "directors": ["Harold French", "Pat Jackson", "Anthony Pelissier"], "fullplot": "The film is made from three short stories by W. Somerset Maugham. The first, \"The Ant and the Grasshopper\" concerns the trials and tribulations a ne'er-do-well brother, Tom Ramsey, puts his prim-and-proper businessman brother, George Ramsey through. The escapades that drive George to absolute distraction eventually wins the hand of the world's third richest girl, Margaret Vyne, for shiftless Tom; \"Winter Cruise\" finds the crew of a cargo boat becoming unglued by the endless chatter of a spinster passenger named Miss Reid. In a desperate attempt to silence the prattling busybody, the ship's officers browbeat a French steward, Pierre into making love to her. The results provide some astounding surprises for the officers, Pierre, and, for certain, Miss Reid; In \"The Gigolo and the Gigolette\" segment, beautiful daredevil Stella Cotman, who entertains the jaded guests of a resort hotel by diving nightly from an eighty-foot platform into a flaming tank, is losing her nerve.", "genres": ["Comedy", "Drama"], "imdb": {"id": 44586, "rating": 7, "votes": 315}, "languages": ["English"], "lastupdated": "2015-09-12 00:31:24.873000000", "num_mflix_comments": 1, "plot": "The film is made from three short stories by W. Somerset Maugham. The first, \"The Ant and the Grasshopper\" concerns the trials and tribulations a ne'er-do-well brother, Tom Ramsey, puts his...", "poster": "https://m.media-amazon.com/images/M/MV5BMTAxMjYxMTk3NDleQTJeQWpwZ15BbWU3MDk2NTk3NzE@._V1_SY1000_SX677_AL_.jpg", "released": -552355200000, "runtime": 89, "title": "Encore", "tomatoes": {"dvd": 581644800000, "lastUpdated": 1437590423000, "viewer": {"meter": 40, "numReviews": 30, "rating": 2.9}}, "type": "movie", "writers": ["Eric Ambler (screenplay)", "T.E.B. Clarke (screenplay)", "Arthur Macrae (screenplay)", "W. Somerset Maugham (stories)"], "year": 1951}