{"_id": "573a139af29313caabcf0ad2", "awards": {"nominations": 4, "text": "5 wins & 4 nominations.", "wins": 5}, "cast": ["Laura Fraser", "Adam Monty", "Isabella Rossellini", "Jeroen Krabbè"], "countries": ["USA", "Netherlands", "Belgium", "UK"], "directors": ["Jeroen Krabbè"], "fullplot": "While escaping from Nazis during the WWII, a Jewish man dug suitcases full of things dear to his heart in the ground two. The war deprived him of his family, and afterwards he endlessly turns over the soil of Antwerp to find the suitcases, which makes him look obsessed. He keeps checking old maps and keeps digging, trying to find, in fact, those he lost. His daughter Chaya is a beautiful modern girl looking for a part-time job. She finds a place as a nanny in the strictly observant Chassidic family with many children, although her secular manners clearly fly in the face of many commandments. One of the reasons she is accepted is that mother of the family is absolutely overburdened by the household, so she stays despite the resistance of the father, normally - an indisputable authority in the family. She develops a special bond with the youngest of the boys, four-year old Simcha, so far incapable of speaking. She teaches him while walking in the park, and it seems that during the upcoming Passover Seder, Simcha will be able to chant parts of the Haggadah. The old repulsive superintendent of the building is a constant wet blanket for the entire family and now for Chaya. However, as opposed to the observant Jews, she cannot be a victim and is not going to put up with his anti-Semitic tricks, so she fights him, thus exciting the children's admiration and family head's wrath. Unfortunately, walks with Simcha end in a tragedy: after sneaking to the park, he drowns in the pond, and some Chassids hold Chaya responsible. A beautiful, warm picture filled with compassion and humanism, making understandable even the behavior of the superintendent - a mean pathetic anti-Semite: he is so terribly lonely that has only his dog to talk to.", "genres": ["Drama"], "imdb": {"id": 119512, "rating": 7.4, "votes": 2485}, "languages": ["English", "Hebrew", "Yiddish"], "lastupdated": "2015-08-14 00:53:52.177000000", "metacritic": 51, "num_mflix_comments": 1, "plot": "Against a background of holocaust memories, a liberal Jewish girl becomes the nanny to a retarded strict Jewish young boy, and grows fond of him.", "poster": "https://m.media-amazon.com/images/M/MV5BMjA1OTc5OTYyOF5BMl5BanBnXkFtZTcwMDM0NDcxMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "UNRATED", "released": 891216000000, "runtime": 100, "title": "Left Luggage", "tomatoes": {"critic": {"meter": 36, "numReviews": 11, "rating": 5}, "dvd": 994723200000, "fresh": 4, "lastUpdated": 1442079744000, "production": "Castle Hill Productions", "rotten": 7, "viewer": {"meter": 87, "numReviews": 1149, "rating": 4.1}}, "type": "movie", "writers": ["Carl Friedman (novel)", "Edwin de Vries"], "year": 1998}