{"_id": "573a13d9f29313caabda9273", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Elena Anaya", "Owen McDonnell", "Elizabeth McGovern", "Gerry McLaughlin"], "countries": ["UK"], "directors": ["Colin Kennedy"], "fullplot": "David's life is on the slide: he's in the middle of a divorce, broke and 'can't get it up'. His girlfriend, Alice, is his rock, but the magazine she writes for is going down and the pressure is on to find a story. While job hunting online, David stumbles across the perfect antidote to his boredom: a 'Swingers' site. The resulting inbox of lewd invitations on the home-laptop justifiably upsets Alice, until she realises this could be just the 'story' she needs. The idea of uncovering the swinging scene causes quite a stir in Alice's office and, much to David's chagrin, she is urged to pursue the story. Their first reluctant foray is an hysterically low-rent initiation, however, an unexpected upturn for David's manhood is all the extra encouragement they need. As events accelerate beyond their control the once adoring couple become lost and fundamental questions are asked of their relationship and them as individuals. In darkness, touched by many others, they will have to find themselves or lose each other forever. SWUNG is a graphic, touching and funny drama about the secret underside of a very modern relationship taken to its emotional and sexual limits.", "genres": ["Romance"], "imdb": {"id": 2243260, "rating": 5.9, "votes": 7}, "lastupdated": "2015-08-19 00:42:17.703000000", "plot": "When an encounter with the swinging scene has an unexpected impact on David's impotence, Alice thinks she might have found the solution to all their problems, but the poly-amorous world is a difficult place for a love story to flourish.", "released": 1434672000000, "title": "Swung", "tomatoes": {"lastUpdated": 1440181519000, "viewer": {"numReviews": 16, "rating": 3.8}, "website": "http://santosvstetona.com/"}, "type": "movie", "writers": ["Ewan Morrison"], "year": 2015}