{"_id": "573a139ef29313caabcfc1ee", "awards": {"nominations": 6, "text": "9 wins & 6 nominations.", "wins": 9}, "cast": ["Stellan Skarsgèrd", "Jean Anderson", "Lena Headey", "Charlotte Rampling"], "countries": ["UK", "Norway", "Sweden"], "directors": ["Hans Petter Moland"], "fullplot": "Kaisa is a Scot, a successful London lawyer, who snorts coke and has one-night stands with strangers. Her mother calls from Aberdeen with some story begging her to fly to Norway and collect her alcoholic dad whom she hasn't seen in years. The impatient Kaisa reluctantly agrees. The story is a ruse: mom is dying and wants her ex and her daughter together again. The trip gets complicated (dad is too drunk to fly and the hot-tempered Kaisa gets them banned from the airline): they go by ferry then car, needing a great deal of help along the way from a sweet lorry driver named Clive. Will they reach Aberdeen before mom's death, and will Kaisa find any stability within herself or in others?", "genres": ["Drama"], "imdb": {"id": 168446, "rating": 7.3, "votes": 2468}, "languages": ["English"], "lastupdated": "2015-09-04 00:29:59.663000000", "metacritic": 78, "num_mflix_comments": 2, "plot": "Kaisa is a Scot, a successful London lawyer, who snorts coke and has one-night stands with strangers. Her mother calls from Aberdeen with some story begging her to fly to Norway and collect...", "poster": "https://m.media-amazon.com/images/M/MV5BMjAxNjkyNTczOV5BMl5BanBnXkFtZTgwOTU5NTY2MDE@._V1_SY1000_SX677_AL_.jpg", "released": 968371200000, "runtime": 106, "title": "Aberdeen", "tomatoes": {"consensus": "Though the characters are difficult to watch at times, Aberdeen burns with ferocious honesty and strong performances.", "critic": {"meter": 87, "numReviews": 38, "rating": 7}, "dvd": 1019520000000, "fresh": 33, "lastUpdated": 1440698469000, "production": "First Run Features", "rotten": 5, "viewer": {"meter": 81, "numReviews": 1541, "rating": 3.7}}, "type": "movie", "writers": ["Hans Petter Moland (screenplay)", "Kristin Amundsen (screenplay)", "Hans Petter Moland (based on an idea by)", "Lars Bill Lundholm (based on an idea by)"], "year": 2000}