{"_id": "573a139af29313caabcf0000", "awards": {"nominations": 31, "text": "Won 1 Oscar. Another 28 wins & 31 nominations.", "wins": 29}, "cast": ["Tom Cruise", "Cuba Gooding Jr.", "Renèe Zellweger", "Kelly Preston"], "countries": ["USA"], "directors": ["Cameron Crowe"], "fullplot": "Jerry Maguire (Tom Cruise) is a successful sports agent. The biggest clients, the respect, a beautiful fiancèe, he has it all. Until one night he questions his purpose. His place in the world, and finally comes to terms with what's wrong with his career and life. Recording all his thoughts in a mission statement Jerry feels he has a new lease on life. Unfortunately his opinions aren't met with enthusiasm from his superiors and after dishonorably being stripped of his high earning clients and elite status within the agency Jerry steps out into the sports business armed with only one volatile client (Cuba Gooding Jr.) and the only person with belief in his abilities (Renèe Zellweger) with the impossible task of rebuilding what he once had. Along the way he faces the harsh truths which he'd ignored in the past and a host of hardships that he'd never faced before.", "genres": ["Comedy", "Drama", "Romance"], "imdb": {"id": 116695, "rating": 7.3, "votes": 176229}, "languages": ["English", "American Sign Language"], "lastupdated": "2015-09-04 00:19:15.507000000", "metacritic": 77, "num_mflix_comments": 1, "plot": "When a sports agent has a moral epiphany and is fired for expressing it, he decides to put his new philosophy to the test as an independent with the only athlete who stays with him.", "poster": "https://m.media-amazon.com/images/M/MV5BYTM0ZWNmZTUtOTVkZS00MTZiLTg3M2QtZjA0Y2RmOWM1NWEyXkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 850435200000, "runtime": 139, "title": "Jerry Maguire", "tomatoes": {"consensus": "Anchored by dazzling performances from Tom Cruise, Cuba Gooding Jr., and Renèe Zellweger, as well as Cameron Crowe's tender direction, Jerry Maguire meshes romance and sports with panache.", "critic": {"meter": 85, "numReviews": 59, "rating": 7.4}, "dvd": 867110400000, "fresh": 50, "lastUpdated": 1442261313000, "production": "TriStar Pictures", "rotten": 9, "viewer": {"meter": 79, "numReviews": 440994, "rating": 3.3}}, "type": "movie", "writers": ["Cameron Crowe"], "year": 1996}