{"_id": "573a1392f29313caabcdb5ef", "awards": {"nominations": 0, "text": "2 wins.", "wins": 2}, "cast": ["Katharine Hepburn", "Cary Grant", "Charles Ruggles", "Walter Catlett"], "countries": ["USA"], "directors": ["Howard Hawks"], "fullplot": "Mild mannered zoology professor Dr. David Huxley is excited by the news that an intercostal clavicle bone has been found to complete his brontosaurus skeleton, a project four years in the construction. He is equally excited about his imminent marriage to his assistant, the officious Alice Swallow, who is interested in him more for his work than for him as a person. David needs the $1 million endowment of wealthy dowager Mrs. Carleton Random to complete the project. Her lawyer, Alexander Peabody, will make the decision on her behalf, so David needs to get in his favor. However, whenever David tries to make a good impression on Peabody, the same young woman always seems to do something to make him look bad. She is the flighty heiress Susan Vance. The more David wants Susan to go away, the more Susan seems not to want or be able to. But David eventually learns that Alexander Peabody is her good friend, who she calls Boopy, and Susan's Aunt Elizabeth, with whom David has also made a bad impression without her knowing who he is, is Mrs. Carleton Random. However getting in Aunt Elizabeth and Boopy's good graces is not as easy as Susan smoothing the waters with them. Throw into the mix a tame pet leopard named Baby that Susan's brother Mark inexplicably sends her from Brazil, Aunt Elizabeth's big game hunting friend Major Horace Applegate, Aunt Elizabeth's pet terrier George who has a penchant for burying bones and other things, and a traveling circus passing through town and David may never be able to finish his project or make it to his wedding. But David may come to the realization that there is something more important in his life.", "genres": ["Comedy", "Romance"], "imdb": {"id": 29947, "rating": 8, "votes": 42030}, "languages": ["English"], "lastupdated": "2015-08-17 01:12:28.783000000", "plot": "While trying to secure a $1 million donation for his museum, a befuddled paleontologist is pursued by a flighty and often irritating heiress and her pet leopard \"Baby.\"", "poster": "https://m.media-amazon.com/images/M/MV5BMmVkOTRiYmItZjE4NS00MWNjLWE0ZmMtYzg5YzFjMjMyY2RkXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_SY1000_SX677_AL_.jpg", "rated": "APPROVED", "released": -1005696000000, "runtime": 102, "title": "Bringing Up Baby", "tomatoes": {"consensus": "With Katharine Hepburn and Cary Grant at their effervescent best, Bringing Up Baby is a seamlessly assembled comedy with enduring appeal.", "critic": {"meter": 95, "numReviews": 41, "rating": 8.6}, "dvd": 1109635200000, "fresh": 39, "lastUpdated": 1441310455000, "production": "Turner Home Entertainment", "rotten": 2, "viewer": {"meter": 90, "numReviews": 38548, "rating": 4}}, "type": "movie", "writers": ["Dudley Nichols (screen play)", "Hagar Wilde (screen play)", "Hagar Wilde (from the story by)"], "year": 1938}