{"_id": "573a13b2f29313caabd3a32e", "awards": {"nominations": 6, "text": "3 wins & 6 nominations.", "wins": 3}, "cast": ["Kal Penn", "Tabu", "Irrfan Khan", "Jacinda Barrett"], "countries": ["India", "USA"], "directors": ["Mira Nair"], "fullplot": "While traveling by train to visit his grandfather in Jamshedpur, Calcutta born, Bengali-speaking Ashoke Ganguli meets with fellow-traveler, Ghosh, who impresses upon him to travel, while Ashoke is deep into a book authored by Nicholai Gogol. The train meets with an accident, and after recuperating, Ashoke re-locates to America, settles down, returns home in 1977 to get married to aspiring singer, Ashima, and returns home to New York. Shortly thereafter they become parents of a boy, who they initially name Gogol, and a few years later both give birth to Sonia. The family then buy their own house in the suburbs and travel to India for the first time after their marriage. The second time they travel to India is when Gogol and Sonia are in their late teens, and after a memorable visit to Kolkata and then to the Taj Mahal, they return home. Gogol falls in love with Maxine Ratliff and moves in with her family, while Ashoke spends time traveling, and Sonia moves to California, leaving Ashima all her by herself. The Ganguli family will be destined to travel to India again soon - this time under very different circumstances - and after all have endured life-changing events.", "genres": ["Drama"], "imdb": {"id": 433416, "rating": 7.6, "votes": 15705}, "languages": ["English", "Hindi", "Bengali", "French"], "lastupdated": "2015-08-18 00:27:15.687000000", "metacritic": 82, "plot": "American-born Gogol, the son of Indian immigrants, wants to fit in among his fellow New Yorkers, despite his family's unwillingness to let go of their traditional ways.", "poster": "https://m.media-amazon.com/images/M/MV5BMTAzNDA1NjEyMDJeQTJeQWpwZ15BbWU2MDkxODQxNw@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1175817600000, "runtime": 122, "title": "The Namesake", "tomatoes": {"boxOffice": "$13.5M", "consensus": "An ambitious exploration of the immigrant experience with a talented cast that serves the material well.", "critic": {"meter": 87, "numReviews": 127, "rating": 7.5}, "dvd": 1196121600000, "fresh": 110, "lastUpdated": 1442084740000, "production": "Fox Searchlight Pictures", "rotten": 17, "viewer": {"meter": 79, "numReviews": 64030, "rating": 3.7}, "website": "http://www.foxsearchlight.com/thenamesake/index.php"}, "type": "movie", "writers": ["Sooni Taraporevala (screenplay)", "Jhumpa Lahiri (novel)"], "year": 2006}