{"_id": "573a13b7f29313caabd49652", "awards": {"nominations": 3, "text": "2 wins & 3 nominations.", "wins": 2}, "cast": ["Josh Harris", "Tom Harris", "Carlos Alvarez", "David Amron"], "countries": ["USA"], "directors": ["Ondi Timoner"], "fullplot": "On the 40th anniversary of the Internet, WE LIVE IN PUBLIC tells the story of the effect the web is having on our society as seen through the eyes of \"the greatest Internet pioneer you've never heard of\", visionary Josh Harris. Award-winning director, Ondi Timoner (\"DIG!\"), documented his tumultuous life for more than a decade, to create a riveting, cautionary tale of what to expect as the virtual world inevitably takes control of our lives. Josh Harris, often called the \"Warhol of the Web\" through the infamous dot.com boom of the 1990's, founded Pseudo.com, the first Internet television network and created his vision of the future, an underground bunker in NYC where 100 people lived together on camera for 30 days over the millennium. He proved how in the not-so-distant future of life online, we will willingly trade our privacy for the connection and recognition we all deeply desire. Through his experiments, including a six-month stint living under 24-hour live surveillance online which led him to mental collapse, he demonstrated the price we will all pay for living in public.", "genres": ["Documentary"], "imdb": {"id": 498329, "rating": 7.2, "votes": 1468}, "languages": ["English"], "lastupdated": "2015-09-15 04:50:27.463000000", "metacritic": 69, "plot": "A documentary focusing on the life of dot-com entrepreneur Josh Harris, and his exploits over the last decade.", "poster": "https://m.media-amazon.com/images/M/MV5BMjE4MjE2MzA3MF5BMl5BanBnXkFtZTcwMzY5Nzc3Mg@@._V1_SY1000_SX677_AL_.jpg", "rated": "UNRATED", "released": 1283472000000, "runtime": 91, "title": "We Live in Public", "tomatoes": {"consensus": "This documentary about Josh Harris' surveillance-as-art project exposes the problems of privacy in the internet age and asks provocative questions about the power of ego in a place where everything is on display.", "critic": {"meter": 81, "numReviews": 47, "rating": 7.1}, "dvd": 1267488000000, "fresh": 38, "lastUpdated": 1441993249000, "production": "Interloper & Abramorama", "rotten": 9, "viewer": {"meter": 79, "numReviews": 13260, "rating": 3.7}, "website": "http://www.weliveinpublicthemovie.com/"}, "type": "movie", "writers": ["Ondi Timoner"], "year": 2009}