{"_id": "573a139cf29313caabcf6b91", "awards": {"nominations": 48, "text": "Nominated for 2 Oscars. Another 13 wins & 48 nominations.", "wins": 15}, "cast": ["Tobey Maguire", "Willem Dafoe", "Kirsten Dunst", "James Franco"], "countries": ["USA"], "directors": ["Sam Raimi"], "fullplot": "Based on Marvel Comics' superhero character, this is a story of Peter Parker who is a nerdy high-schooler. He was orphaned as a child, bullied by jocks, and can't confess his crush for his stunning neighborhood girl Mary Jane Watson. To say his life is \"miserable\" is an understatement. But one day while on an excursion to a laboratory a runaway radioactive spider bites him... and his life changes in a way no one could have imagined. Peter acquires a muscle-bound physique, clear vision, ability to cling to surfaces and crawl over walls, shooting webs from his wrist ... but the fun isn't going to last. An eccentric millionaire Norman Osborn administers a performance enhancing drug on himself and his maniacal alter ego Green Goblin emerges. Now Peter Parker has to become Spider-Man and take Green Goblin to the task... or else Goblin will kill him. They come face to face and the war begins in which only one of them will survive at the end.", "genres": ["Action", "Adventure"], "imdb": {"id": 145487, "rating": 7.3, "votes": 494371}, "languages": ["English"], "lastupdated": "2015-09-10 17:53:35.977000000", "metacritic": 73, "plot": "When bitten by a genetically modified spider, a nerdy, shy, and awkward high school student gains spider-like abilities that he eventually must use to fight evil as a superhero after tragedy befalls his family.", "poster": "https://m.media-amazon.com/images/M/MV5BZDEyN2NhMjgtMjdhNi00MmNlLWE5YTgtZGE4MzNjMTRlMGEwXkEyXkFqcGdeQXVyNDUyOTg3Njg@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1020384000000, "runtime": 121, "title": "Spider-Man", "tomatoes": {"dvd": 1207008000000, "lastUpdated": 1441993080000, "viewer": {"meter": 100, "numReviews": 84, "rating": 3.8}}, "type": "movie", "writers": ["Stan Lee (Marvel comic book)", "Steve Ditko (Marvel comic book)", "David Koepp (screenplay)"], "year": 2002}