{"_id": "573a13d2f29313caabd91754", "awards": {"nominations": 11, "text": "16 wins & 11 nominations.", "wins": 16}, "cast": ["Ranbir Kapoor", "Nargis Fakhri", "Shammi Kapoor", "Kumud Mishra"], "countries": ["India"], "directors": ["Imtiaz Ali"], "fullplot": "The film follows Janardhan Jhakar in a series of flashbacks and flash forwards, how the small collage boy became an international rock sensation \"Jordan\". To chase his dreams of a rockstar, the wanna-be singer his counseled that music and feelings only come with pain. In the process of which, he meets Heer, a tough on the outside and popular college girl, the both become friends, and as time passes by his dreams of music fade away as they spend time together. When heer moves away, Janardhan is thrown out of his house because of family misunderstandings. As he bides his time at a local mosque, his passion for music comes back to life. He is soon signed by a record label, where he makes more enemies than friends, his tour takes him to Prague, where he is reunited with a married Heer. Things go awry when the two share an intimate moment, and Jordan his deported to India on trespassing charges filed by Heer's husband. Now an angry painful and lonely JORDAN embarks on his journey to become a ROCKSTAR", "genres": ["Music", "Musical"], "imdb": {"id": 1839596, "rating": 7.6, "votes": 21223}, "languages": ["Hindi"], "lastupdated": "2015-09-06 00:04:34.277000000", "plot": "Janardhan Jakhar chases his dreams of becoming a big Rock star, during which he falls in love with Heer.", "poster": "https://m.media-amazon.com/images/M/MV5BOTc3NzAxMjg4M15BMl5BanBnXkFtZTcwMDc2ODQwNw@@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 1320969600000, "runtime": 159, "title": "RockStar", "tomatoes": {"boxOffice": "$1.0M", "dvd": 1332720000000, "lastUpdated": 1439664497000, "production": "Eros International", "viewer": {"meter": 65, "numReviews": 1356, "rating": 3.5}, "website": "http://www.rockstarthefilm.com/"}, "type": "movie", "writers": ["Imtiaz Ali", "Muazzam Beg"], "year": 2011}