{"_id": "573a13b9f29313caabd4f1af", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Ben Barnes", "Andrey Chadov", "Ovidiu Matesan", "Terence Anderson"], "countries": ["UK"], "directors": ["S.A. Halewood"], "fullplot": "Bigga Than Ben is a crime-fuelled tale of two likeable but wayward Russian \"pieces of Moscow scum\" who arrive in London intent on bettering themselves and amassing an easy fortune. But it's not long before Spiker (Andrei Chadov) and Cobakka (Ben Barnes) realise that, legally, they aren't going to get very far. So, aided by the dodgy Artash (Ovidiu Matesan) and sidekick Spartak (Hero Fiennes-Tiffin), they learn to shoplift from supermarkets, rip off banks, joyride on the tube and turn mobile phones into crack. . Finding themselves drawn into a shadowy underworld of backstreet drug deals, chav nightclubs, refugees and nymphomaniacs, life begins to turn sour. The highs begin to fade. Spiker badly misses his girlfriend back in Moscow, and seeks consolation in drugs. When he slips into serious addiction and Artash double-crosses them, Cobakka finds himself forced into making some life-changing decisions", "genres": ["Drama"], "imdb": {"id": 831275, "rating": 6.4, "votes": 1042}, "languages": ["English"], "lastupdated": "2015-07-27 00:16:27.933000000", "num_mflix_comments": 1, "plot": "Spiker & Cobakka are two self-confessed 'pieces of Moscow scum' who come to London to rip it off. This is their guide.", "poster": "https://m.media-amazon.com/images/M/MV5BMTEyMDQ3NDYxNTBeQTJeQWpwZ15BbWU3MDMyMzkwODE@._V1_SY1000_SX677_AL_.jpg", "released": 1223596800000, "runtime": 82, "title": "Bigga Than Ben", "tomatoes": {"consensus": "Bigga Than Ben is offensive and maybe slightly misogynistic, but still a provocative and crass slice of immigrant life in London.", "critic": {"meter": 60, "numReviews": 10, "rating": 5.1}, "fresh": 6, "lastUpdated": 1441995138000, "rotten": 4, "viewer": {"meter": 60, "numReviews": 495, "rating": 3.5}}, "type": "movie", "writers": ["S.A. Halewood"], "year": 2008}