{"_id": "573a13acf29313caabd2752f", "awards": {"nominations": 2, "text": "2 nominations.", "wins": 0}, "cast": ["Michael Bowen", "Johnny Knoxville", "Dwayne Johnson", "Neal McDonough"], "countries": ["USA"], "directors": ["Kevin Bray"], "fullplot": "After eight years serving the U.S. Army Special Forces, Sergeant Chris Vaughn returns to his hometown seeking for a job in the local mill. He is informed by Sheriff Stan Watkins that the mill was closed three years ago and now the Wild Cherry Casino, owned by his former high school friend Jay Hamilton, is the major source of jobs and income to the town. Chris goes home, and meets his best-friend Ray Templeton, who organized a football game with their friends. After the game, Jay invites Chris and his friends to spend the night in his casino on him, but when Chris finds that the casino crabs dealer is cheating with loaded dice, he fights against the security men and is almost killed by them. When his nephew Pete overdosed on crystal meth sold by the security men at the casino, Chris realizes that the town is dominated by the mobsters and the corrupt sheriff and with a huge piece of wood, he breaks the casino and the criminals. He is prosecuted and in the trial, he promises to the jury and to the population that if he is acquitted, he would be a candidate for sheriff and clean up the town. Later, Sheriff Chris Vaughn has to fight against the organized crime to keep his promise.", "genres": ["Action", "Crime"], "imdb": {"id": 351977, "rating": 6.2, "votes": 48830}, "languages": ["English"], "lastupdated": "2015-09-07 00:27:06.017000000", "metacritic": 44, "num_mflix_comments": 2, "plot": "A former U.S. soldier returns to his hometown to find it overrun by crime and corruption, which prompts him to clean house.", "poster": "https://m.media-amazon.com/images/M/MV5BMTM0MjYzNzM1N15BMl5BanBnXkFtZTcwMDcwNDc3NA@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1080864000000, "runtime": 86, "title": "Walking Tall", "tomatoes": {"boxOffice": "$45.9M", "consensus": "The Rock makes a competent hero, but the movie is content to let a 2x4 do all the talking.", "critic": {"meter": 25, "numReviews": 134, "rating": 4.5}, "dvd": 1096329600000, "fresh": 34, "lastUpdated": 1442165042000, "production": "MGM", "rotten": 100, "viewer": {"meter": 60, "numReviews": 229469, "rating": 3.2}, "website": "http://www.walkingtallmovie.com/home.html"}, "type": "movie", "writers": ["Mort Briskin (earlier screenplay)", "David Klass (screenplay)", "Channing Gibson (screenplay)", "David Levien (screenplay)", "Brian Koppelman (screenplay)"], "year": 2004}