{"_id": "573a13a7f29313caabd1bb0a", "awards": {"nominations": 3, "text": "3 nominations.", "wins": 0}, "cast": ["Rob Schneider", "Anna Faris", "Matthew Lawrence", "Eric Christian Olsen"], "countries": ["USA"], "directors": ["Tom Brady"], "fullplot": "Jessica Spencer is the hottest, most popular girl in high school. Jessica, her best friend April, and a couple of other hot girls Lulu and Keecia visit the mall to hang out and do some shopping. They enter a new age store, where they check out a pair of ancient earrings. Unbeknownst to Jessica, these are magical ones set in ancient Abyssinia. A princess known as Princess Nawa is disgusted by the groom of her arranged marriage and switches bodies with a slave girl by means of an enchanted set of earrings. Since the earrings are not for sale, Jessica steals them. But the next morning she gets a big dose of reality when she wakes up in the body of a 30-something lowlife male, Clive, a career criminal. Clive finds himself in Jessica's body. Now it's up to Jessica (in Clive's body) to find a way to get her body back, while Clive (in Jessica's body) takes advantage of his new body to set in motion a crime spree to put the blame on Jessica!", "genres": ["Comedy", "Fantasy"], "imdb": {"id": 302640, "rating": 5.5, "votes": 69640}, "languages": ["English"], "lastupdated": "2015-08-26 00:09:18.540000000", "metacritic": 29, "plot": "An attractive and popular teenager who is mean spirited toward others, finds herself in the body of an older man, and must find a way to get back to her original body.", "poster": "https://m.media-amazon.com/images/M/MV5BMzY1NTAzNTA3Ml5BMl5BanBnXkFtZTYwMDA5Mzc3._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1039737600000, "runtime": 104, "title": "The Hot Chick", "tomatoes": {"boxOffice": "$34.9M", "consensus": "The Hot Chick's one-note concept gets stretched thin, and a lot of the jokes fall flat.", "critic": {"meter": 21, "numReviews": 82, "rating": 3.7}, "dvd": 1106611200000, "fresh": 17, "lastUpdated": 1440180493000, "production": "Buena Vista Distribution Compa", "rotten": 65, "viewer": {"meter": 59, "numReviews": 474735, "rating": 3.1}, "website": "http://touchstonepictures.go.com/hotchick/index.html?CMP=IL10283"}, "type": "movie", "writers": ["Tom Brady", "Rob Schneider"], "year": 2002}