{"_id": "573a13e6f29313caabdc4b4a", "awards": {"nominations": 4, "text": "3 wins & 4 nominations.", "wins": 3}, "cast": ["Ronald Zehrfeld", "Mohsin Ahmady", "Saida Barmaki", "Salam Yousefzai"], "countries": ["Germany"], "directors": ["Feo Aladag"], "fullplot": "Jesper is a soldier in the German army. Although his brother was killed whilst serving in Afghanistan, he nevertheless reports for a new tour of duty in this war zone. He and his unit are to protect a remote village from the Taliban. One of the people accompanying Jesper is a young interpreter, Tarik, whose job includes mediating between soldiers and villagers. Both sides have a hard time trying to overcome the differences in their respective ways of life. Jesper must gain the trust of both villagers and the allied Arbaki militia and his nerves are soon on edge. He finds himself increasingly morally conflicted as a result of his superiors' orders. His association with the Germans means Tarik's life is constantly under threat, but when Tarik begins to fear for his sister's safety, Jesper has to make a decision. Feo Aladag uses this portrait of an ISAF soldier in Afghanistan to explore questions of affinity and otherness, trust and failure. How humane can your actions be if you are bound by the workings of a strict military bureaucracy? What remains of the ideals of human dignity when you are caught up in a daily struggle for survival?", "genres": ["Drama"], "imdb": {"id": 3032028, "rating": 6.3, "votes": 313}, "languages": ["German", "English", "Pushto", "Dari"], "lastupdated": "2015-08-26 00:37:41.337000000", "num_mflix_comments": 1, "plot": "Jesper is a soldier in the German army. Although his brother was killed whilst serving in Afghanistan, he nevertheless reports for a new tour of duty in this war zone. He and his unit are ...", "poster": "https://m.media-amazon.com/images/M/MV5BNzM1MzEzNTkyMF5BMl5BanBnXkFtZTgwNDQ0NTM1MTE@._V1_SY1000_SX677_AL_.jpg", "released": 1395878400000, "runtime": 98, "title": "Inbetween Worlds", "tomatoes": {"dvd": 1446422400000, "lastUpdated": 1442342988000, "production": "Vertical Entertainment", "viewer": {"numReviews": 41, "rating": 2.5}}, "type": "movie", "writers": ["Feo Aladag (screenplay)", "Matthias Kock (screenplay)", "Judith Kaufmann (screenplay)"], "year": 2014}