{"_id": "573a13c2f29313caabd67475", "awards": {"nominations": 5, "text": "1 win & 5 nominations.", "wins": 1}, "cast": ["Michel Cètè", "Louis-Josè Houde", "Rèmy Girard", "Caroline Dhavernas"], "countries": ["Canada"], "directors": ["èmile Gaudreault"], "fullplot": "They are father and son. They are both cops. And they are about to work together as a team. Trouble is... neither can stand the sight of the other. Jacques and Marc have been paired up in order to save the life of a brother officer who has been kidnapped by a biker gang. The success of their mission hinges on a lawyer in crisis. Charles Bèrubè may be the bikers' legal representative, but his conscience is giving him such a bad time that he looks ready to betray his clients to the forces of law and order. Jacques and Marc go undercover to get up close and personal with their target. Will they gain Bèrubè's trust? Will they coax him into baring his troubled conscience and all the information it contains? The film combines the strengths of a great, classic comedy cop thriller with a hilarious study of a dysfunctional, father-son relationship.", "genres": ["Action", "Comedy", "Crime"], "imdb": {"id": 1258134, "rating": 6.8, "votes": 1163}, "languages": ["French"], "lastupdated": "2015-09-04 00:29:05.117000000", "plot": "They are father and son. They are both cops. And they are about to work together as a team. Trouble is... neither can stand the sight of the other. Jacques and Marc have been paired up in ...", "poster": "https://m.media-amazon.com/images/M/MV5BODIxZGRhZmYtMWY2Ny00NDQ1LTgzMGItNTg1NmY0ZmQ4YjYyXkEyXkFqcGdeQXVyMjQzMjY4MjU@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1262995200000, "runtime": 107, "title": "Father and Guns", "tomatoes": {"lastUpdated": 1440698453000, "production": "Alliance Vivafilm", "viewer": {"meter": 70, "numReviews": 469, "rating": 3.7}}, "type": "movie", "writers": ["èmile Gaudreault", "Ian Lauzon"], "year": 2009}