{"_id": "573a139af29313caabcf0e28", "awards": {"nominations": 2, "text": "2 nominations.", "wins": 0}, "cast": ["Tammy Lauren", "Andrew Divoff", "Robert Englund", "Chris Lemmon"], "countries": ["USA"], "directors": ["Robert Kurtzman"], "fullplot": "In the beginning of the times, God created life into universe: light gave birth to angels, earth to men and fire to djin, creatures condemned to dwell in the void between the worlds. One who wakes a djin shall be given three wishes. Upon granting the third, an unholy legion of djins are freed through a doorway between the worlds upon the Earth. In 1127 A.D., in Persia, a sorcerer lures and traps a powerful Djinn in the stone of secret fire. In the present days, a drunken crane operator drops the valuable statue of Ahura Mazda over the assistant of Raymond Beaumont on the harbor, and one worker finds the huge and priceless opal red stone where Djin is seized. Alexandra Amberson, who works in an auction house, receives the stone for evaluation and accidentally awakes Djin. The evil creature is released later, charges the stone with people souls and feeds with their fears, while chasing Alexandra to force to make three wishes and unleash the demoniac fiends upon Earth.", "genres": ["Fantasy", "Horror"], "imdb": {"id": 120524, "rating": 5.7, "votes": 14487}, "languages": ["English"], "lastupdated": "2015-08-30 00:00:54.290000000", "num_mflix_comments": 2, "plot": "A demonic djinn attempts to grant its owner three wishes, which will allow him to summon his brethren to earth.", "poster": "https://m.media-amazon.com/images/M/MV5BNmQ2ZWQ4ZWItMTJiNS00MDE1LWEyNDgtMThhY2VlODRmZTMzXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 874627200000, "runtime": 90, "title": "Wishmaster", "tomatoes": {"critic": {"meter": 21, "numReviews": 28, "rating": 3.3}, "dvd": 964483200000, "fresh": 6, "lastUpdated": 1441910239000, "production": "Live Home Video", "rotten": 22, "viewer": {"meter": 38, "numReviews": 27990, "rating": 2.8}}, "type": "movie", "writers": ["Peter Atkins"], "year": 1997}