{"_id": "573a13b7f29313caabd498c5", "awards": {"nominations": 3, "text": "3 nominations.", "wins": 0}, "cast": ["Kunal Khemu", "Deepal Shaw", "Smiley Suri", "Atul Parchure"], "countries": ["India"], "directors": ["Mohit Suri"], "fullplot": "18 years ago, the Darr family, consisting of Pushkaran and his son, Kunal, were forced to leave Kashmir by terrorists, who had forced thousands of other Kashmiri Pandits to be mere refugees in their very own country. Pushkaran and Kunal re-locate to Bombay, where they live in a small room. This is where Kunal grows up, & gets a job at a gym. Then one day, the police knock on his door, informing him that his father had lost his hold from a crowded local train, fallen, and instantly killed. A devastated Kunal arranges his father's funeral, and before he could reconcile to living alone, his relatives contact him from Jammu, informing him that his father had promised to look after a young woman named Renuka. Kunal agrees to fulfill his father's promise. When Renuka arrives, she finds out about the untimely death, and wants to return back, but ticket reservation force her to stay with Kunal for a week. It is this week that changes their lives, for they fall in love and get married. A friend gives them a free hotel room for their honey-moon, and they spend the night getting intimate. They return home thereafter, and it is then that the police arrest them on charges of Pornography, Renuka is coerced into signing a statement implicating Kunal, and when she finds out what she has been done, she kills herself. Alone, devastated, and confused Kunal must now find a way to free himself from the clutches of the police, mourn the passing of his father and new wife, as well as find out who are the person(s) behind his loss and humiliation. The question is will he succeed, or just be another victim?", "genres": ["Action", "Crime", "Drama"], "imdb": {"id": 499041, "rating": 6.5, "votes": 1469}, "languages": ["Hindi"], "lastupdated": "2015-08-15 00:21:44.053000000", "num_mflix_comments": 2, "plot": "18 years ago, the Darr family, consisting of Pushkaran and his son, Kunal, were forced to leave Kashmir by terrorists, who had forced thousands of other Kashmiri Pandits to be mere refugees...", "released": 1134086400000, "runtime": 126, "title": "Modern Era", "tomatoes": {"dvd": 1143504000000, "lastUpdated": 1439230098000, "production": "BIGFlix", "viewer": {"meter": 68, "numReviews": 975, "rating": 3.6}}, "type": "movie", "writers": ["Jay Dixit (dialogue)", "Anand Sivakumaran (screenplay)", "Mohit Suri (story)"], "year": 2005}