{"_id": "573a13b9f29313caabd4de27", "awards": {"nominations": 2, "text": "1 win & 2 nominations.", "wins": 1}, "cast": ["Madeline Carroll", "Callan McAuliffe", "Rebecca De Mornay", "Anthony Edwards"], "countries": ["USA"], "directors": ["Rob Reiner"], "fullplot": "Juli Baker devoutly believes in three things: the sanctity of trees (especially her beloved sycamore), the wholesomeness of the eggs she collects from her backyard flock of chickens, and that someday she will kiss Bryce Loski. Ever since she saw Bryce's baby blues back in second grade, Juli has been smitten. Unfortunately, Bryce has never felt the same. Frankly, he thinks Juli Baker is a little weird--after all, what kind of freak raises chickens and sits in trees for fun? Then, in eighth grade, everything changes. Bryce begins to see that Juli's unusual interests and pride in her family are, well, kind of cool. And Juli starts to think that maybe Bryce's brilliant blue eyes are as empty as the rest of Bryce seems to be. After all, what kind of jerk doesn't care about other people's feelings about chickens and trees? With Flipped, mystery author Wendelin Van Draanen has taken a break from her Sammy Keyes series, and the result is flipping fantastic. Bryce and Juli's rants and raves about each other ring so true that teen readers will quickly identify with at least one of these hilarious feuding egos, if not both. A perfect introduction to the adolescent war between the sexes.", "genres": ["Comedy", "Drama", "Romance"], "imdb": {"id": 817177, "rating": 7.7, "votes": 54021}, "languages": ["English"], "lastupdated": "2015-09-13 00:15:31.323000000", "metacritic": 45, "plot": "Two eighth-graders start to have feelings for each other despite being total opposites. Based on the novel \"Flipped\" by Wendelin Van Draanen.", "poster": "https://m.media-amazon.com/images/M/MV5BMTU2NjQ1Nzc4MF5BMl5BanBnXkFtZTcwNTM0NDk1Mw@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 1284076800000, "runtime": 90, "title": "Flipped", "tomatoes": {"boxOffice": "$1.8M", "consensus": "While not without its nostalgic charms, Rob Reiner's sometimes awkward adaptation of Wendelin Van Draanen's childhood novel doesn't reach the heights of the director's earlier work like Stand By Me.", "critic": {"meter": 55, "numReviews": 73, "rating": 6}, "dvd": 1290470400000, "fresh": 40, "lastUpdated": 1442342587000, "production": "Warner Bros. Pictures", "rotten": 33, "viewer": {"meter": 78, "numReviews": 19372, "rating": 3.8}, "website": "http://www.flipped-movie.com/"}, "type": "movie", "writers": ["Rob Reiner (screenplay)", "Andrew Scheinman (screenplay)", "Wendelin Van Draanen (novel)"], "year": 2010}