{"_id": "573a13b6f29313caabd47797", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Amber Heard", "Anson Mount", "Whitney Able", "Michael Welch"], "countries": ["USA"], "directors": ["Jonathan Levine"], "fullplot": "The orphan Mandy Lane is a beautiful, virgin and pure teenager raised by her aunt, desired by her schoolmates and a close friend of the outcast Emmet. After the death of their high school mate in a pool party, Mandy befriends Chloe, Marlin, Red, Bird and Jake. Red invites the group for a weekend party in the isolated ranch of his family, with all the boys disputing who would succeed in having sex with Mandy Lane. They meet the henchman Garth that takes care of the ranch and he asks the group to go easy on the drugs and booze. In the middle of the night, a stranger wearing a hood attacks Marlin in the barn; when Jake seeks her out, he faces the killer, beginning a night of bloodshed and terror.", "genres": ["Horror"], "imdb": {"id": 490076, "rating": 5.6, "votes": 24238}, "languages": ["English"], "lastupdated": "2015-08-18 01:03:52.220000000", "metacritic": 44, "plot": "A group of high-schoolers invite Mandy Lane, a good girl who became quite hot over the summer, to a weekend party on a secluded ranch. While the festivities rage on, the number of revelers begins to drop quite mysteriously.", "poster": "https://m.media-amazon.com/images/M/MV5BMzM0MjU1MzUzMF5BMl5BanBnXkFtZTcwMjcwNDQyOQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1378425600000, "runtime": 90, "title": "All the Boys Love Mandy Lane", "tomatoes": {"consensus": "Mandy Lane has enough wit and craft to spark the horror fan's interest, but is not sufficiently original for mainstream audiences.", "critic": {"meter": 41, "numReviews": 59, "rating": 4.8}, "dvd": 1386028800000, "fresh": 24, "lastUpdated": 1440099464000, "production": "Radius-TWC", "rotten": 35, "viewer": {"meter": 31, "numReviews": 27513, "rating": 2.8}, "website": "http://alltheboyslovemandylane.com/"}, "type": "movie", "writers": ["Jacob Forman"], "year": 2006}