{"_id": "573a13c7f29313caabd7530a", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Daniel Craig", "Naomi Watts", "Rachel Weisz", "Elias Koteas"], "countries": ["USA", "Canada"], "directors": ["Jim Sheridan"], "fullplot": "Some say that all houses have memories. For one man, his home is the place he would kill to forget. A family unknowingly moves into a home where several grisly murders were committed...only to find themselves the killer's next target. Successful publisher Will Atenton (Craig) quit a job in New York City to relocate his wife, Libby (Weisz), and two girls to a quaint New England town. But as they settle into their new life, they discover their perfect home was the murder scene of a mother and her children. And the entire city believes it was at the hands of the husband who survived. When Will investigates the tragedy, his only lead comes from Ann Paterson (Watts), a neighbor who was close to the family that died. As Will and Ann piece together the disturbing puzzle, they discover that the story of the last man to leave Will's dream house will be just as horrifying to the one who came next.", "genres": ["Drama", "Mystery", "Thriller"], "imdb": {"id": 1462041, "rating": 5.9, "votes": 42302}, "languages": ["English"], "lastupdated": "2015-09-07 00:38:04.227000000", "metacritic": 35, "num_mflix_comments": 3, "plot": "Soon after moving into their seemingly idyllic new home, a family learns of a brutal crime committed against former residents of the dwelling.", "poster": "https://m.media-amazon.com/images/M/MV5BMTM5MzUxMDc5Ml5BMl5BanBnXkFtZTcwMTMwMjIwNg@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1317340800000, "runtime": 92, "title": "Dream House", "tomatoes": {"boxOffice": "$21.3M", "consensus": "Dream House is punishingly slow, stuffy, and way too obvious to be scary.", "critic": {"meter": 6, "numReviews": 82, "rating": 3.7}, "dvd": 1327968000000, "fresh": 5, "lastUpdated": 1442256459000, "production": "Universal Pictures", "rotten": 77, "viewer": {"meter": 36, "numReviews": 29253, "rating": 2.9}, "website": "http://www.dreamhousemovie.net"}, "type": "movie", "writers": ["David Loucka"], "year": 2011}