{"_id": "573a13cbf29313caabd80fc0", "awards": {"nominations": 7, "text": "Nominated for 1 BAFTA Film Award. Another 7 wins & 7 nominations.", "wins": 8}, "cast": ["Aksel Hennie", "Synnève Macody Lund", "Nikolaj Coster-Waldau", "Eivind Sander"], "countries": ["Norway", "Sweden", "Denmark", "Germany"], "directors": ["Morten Tyldum"], "fullplot": "Roger Brown works as one of the most powerful headhunters in Norway. To support his extravagant lifestyle, he is also an art thief, which he does in cahoots with his friend, the gun toting Ove Kjikerud. They replace the originals with forgeries, which go undetected at least until the trail back to them goes cold. His outward bravado, based primarily on building upon reputation, masks his insecurities, especially in his short physical stature. He feels he needs that confident demeanor and wealth to get what he wants, including his trophy wife, art gallery owner Diana Brown. However, he almost seems to like the thought of what Diana represents more than Diana herself. As such, he has a mistress on the side named Lotte. The issue of having a baby - Diana wants to get pregnant while Roger doesn't want her to - is another bone of contention in their marriage. The two sides of Roger's professional life intersect when Diana introduces him to Clas Greve, who would be perfect for the CEO position at Pathfinder, the job for which Roger is currently recruiting. Clas is also in possession of a priceless Rubens, which if Roger and Ove can steal it, would be by far their most lucrative theft to date. After he and Ove are able to steal the painting, things start going wrong for Roger. He learns that Diana is having an affair with Clas. And someone is trying to kill him. He learns that it is Clas, who seems to know his every move. Is Clas trying to kill him for Diana? Or because he knows about the theft? Or a combination of the two? Or is there a bigger picture which Roger will have to discover?", "genres": ["Crime", "Thriller"], "imdb": {"id": 1614989, "rating": 7.6, "votes": 72519}, "languages": ["Norwegian", "Danish", "Russian", "English"], "lastupdated": "2015-09-06 00:38:25.167000000", "metacritic": 72, "num_mflix_comments": 1, "plot": "An accomplished headhunter risks everything to obtain a valuable painting owned by a former mercenary.", "poster": "https://m.media-amazon.com/images/M/MV5BMjE4OTgzOTI2Nl5BMl5BanBnXkFtZTcwMjM5MDg0Nw@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1314316800000, "runtime": 100, "title": "Headhunters", "type": "movie", "writers": ["Ulf Ryberg (screenplay)", "Lars Gudmestad (screenplay)", "Jo Nesbè (novel)"], "year": 2011}