{"_id": "573a13bcf29313caabd56a0f", "awards": {"nominations": 5, "text": "5 nominations.", "wins": 0}, "cast": ["Jonathan Tucker", "Jena Malone", "Laura Ramsey", "Shawn Ashmore"], "countries": ["USA", "Germany", "Australia"], "directors": ["Carter Smith"], "fullplot": "While on vacation in a resort in Mexico, the Americans Jeff, his girlfriend Amy, her best friend Stacy and her boyfriend Eric befriend the German Mathias in the swimming pool. Mathias invites the group to visit the ruins of a Mayan temple with his Greek friend Dimitri in an archaeological field where his brother Henrich and his girlfriend are camped eighteen kilometers from the resort. They hire an old taxi and when they reach the spot, they are surrounded by Mayan villagers armed with revolvers, rifles and bows-and-arrows that kill Dimitri and do not allow the group to leave the place. They climb a construction covered by creepers with red flowers, and remain under siege of the locals. When they hear a cell phone in the bottom of a well, Mathias decides to seek the apparatus using a rope that breaks and he has a serious accident breaking his back. Amy and Stacy go to the bottom of the mine to rescue Mathias and they find many corpses covered by the climbing plants; further, they realize that they had been lured by the plants that are vibrating with the sound of a cell phone. When they are attacked by the carnivorous creeping plants, they understand the reaction of the Mayan villagers.", "genres": ["Horror", "Thriller"], "imdb": {"id": 963794, "rating": 5.9, "votes": 56918}, "languages": ["English", "Maya", "Spanish", "Greek", "German"], "lastupdated": "2015-08-30 00:01:41.603000000", "metacritic": 44, "num_mflix_comments": 1, "plot": "A group of friends whose leisurely Mexican holiday takes a turn for the worse when they, along with a fellow tourist embark on a remote archaeological dig in the jungle, where something evil lives among the ruins.", "poster": "https://m.media-amazon.com/images/M/MV5BMTcxNjc1NjkyOF5BMl5BanBnXkFtZTcwMzUwMjA2MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1207267200000, "runtime": 90, "title": "The Ruins", "tomatoes": {"boxOffice": "$17.4M", "consensus": "Despite a solid cast and truly frightening source material, The Ruins founders, thanks to a weak script and an excess of gore.", "critic": {"meter": 48, "numReviews": 92, "rating": 5.3}, "dvd": 1215475200000, "fresh": 44, "lastUpdated": 1440099207000, "production": "DreamWorks/Paramount Studios", "rotten": 48, "viewer": {"meter": 30, "numReviews": 530143, "rating": 2.4}, "website": "http://www.ruinsmovie.com/"}, "type": "movie", "writers": ["Scott B. Smith (screenplay)", "Scott B. Smith (novel)"], "year": 2008}