{"_id": "573a1397f29313caabce77cd", "awards": {"nominations": 8, "text": "Nominated for 1 Golden Globe. Another 1 win & 8 nominations.", "wins": 2}, "cast": ["Michael Caine", "Angie Dickinson", "Nancy Allen", "Keith Gordon"], "countries": ["USA"], "directors": ["Brian De Palma"], "fullplot": "While taking a shower, Kate Miller, a middle-aged, sexually frustrated New York City housewife, has a rape fantasy while her husband stands at the sink shaving. Later that day, after complaining to her psychiatrist Dr. Robert Elliott about her husband's pathetic performance in bed, she meets a strange man at a museum and returns to his apartment where they continue an adulterous encounter that began in the taxicab. Before she leaves his apartment, she finds papers which certify that the man has a venereal disease. Panicked, Kate rushes into the elevator, but has to return to his apartment when she realizes she's forgotten her wedding ring. When the elevator doors open, she's brutally slashed to death by a tall blonde woman wearing dark sunglasses. Liz Blake, a high-class call girl, is the only witness to the murder and she becomes the prime suspect and the murderess's next target. Liz is rescued from being killed by Kate's son Peter, who enlists the help of Liz to catch his mother's killer as Detective Marino who's in charge of the case is uncooperative in the investigation.", "genres": ["Drama", "Mystery", "Thriller"], "imdb": {"id": 80661, "rating": 7.1, "votes": 21568}, "languages": ["English"], "lastupdated": "2015-09-04 00:39:50.583000000", "num_mflix_comments": 1, "plot": "A mysterious blonde woman kills one of a psychiatrist's patients, and then goes after the high-class call girl who witnessed the murder.", "poster": "https://m.media-amazon.com/images/M/MV5BN2Q2MzczNjItOTAxMS00ZDMzLThiZTktZDFjYzRhYTcyYWU4XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "X", "released": 333331200000, "runtime": 105, "title": "Dressed to Kill", "tomatoes": {"critic": {"meter": 85, "numReviews": 39, "rating": 6.5}, "dvd": 998956800000, "fresh": 33, "lastUpdated": 1440011621000, "production": "MGM", "rotten": 6, "viewer": {"meter": 74, "numReviews": 10046, "rating": 3.5}}, "type": "movie", "writers": ["Brian De Palma"], "year": 1980}