{"_id": "573a13b3f29313caabd3d3de", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Barrie Zwicker", "James Howard Kunstler", "Peter Calthorpe", "Michael Klare"], "countries": ["Canada", "USA", "France"], "directors": ["Gregory Greene"], "fullplot": "The modern suburbs have ultimately become an unsustainable way of living. They were originally developed in an era of cheap oil, when the automobile became the center of the way people lived and an era when people wanted to escape the inner city to a more pastoral or rural way of life. However the suburbs quickly evolved into a merely a place to live that had neither the benefits of rural or urban life, and where one was reliant on an automobile both to travel elsewhere and even travel within the neighborhood. The suburbs are not only dependent upon cheap energy, but also reliable energy. The reliability of energy is becoming less so as demonstrated by the multi-day blackout of the North American Eastern Seaboard starting on August 14, 2003. Part of the problem of getting out of the suburban mentality is that a generation has grown up believing it to be a normal way of life, and a life of entitlement, which they will not give up without a fight. But many developers and planners and some of the general public understand the want and need to make the way the collective we live in a more walkable and humanistic manner.", "genres": ["Documentary", "War"], "imdb": {"id": 446320, "rating": 7.6, "votes": 929}, "languages": ["English"], "lastupdated": "2015-07-26 00:22:41.180000000", "num_mflix_comments": 2, "plot": "The modern suburbs have ultimately become an unsustainable way of living. They were originally developed in an era of cheap oil, when the automobile became the center of the way people ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTQ3Mjg0OTI3OF5BMl5BanBnXkFtZTgwNTU0MDA2MDE@._V1_SY1000_SX677_AL_.jpg", "released": 1083715200000, "runtime": 78, "title": "The End of Suburbia: Oil Depletion and the Collapse of the American Dream", "tomatoes": {"consensus": "The stories the soldiers have to tell are eye-opening and wrenching to hear; collectively it's a searing peek into the toll of war both during and after.", "critic": {"meter": 87, "numReviews": 47, "rating": 7.5}, "dvd": 1159228800000, "fresh": 41, "lastUpdated": 1442510886000, "production": "Focus Features", "rotten": 6, "viewer": {"meter": 76, "numReviews": 12468, "rating": 3.1}, "website": "http://www.thegroundtruth.net"}, "type": "movie", "writers": ["Gregory Greene"], "year": 2004}