{"_id": "573a13b6f29313caabd46726", "awards": {"nominations": 4, "text": "1 win & 4 nominations.", "wins": 1}, "cast": ["Ricardo Darèn", "Irène Jacob", "Bebe", "Vèctor Valdivia"], "countries": ["Argentina", "France", "Portugal", "Spain"], "directors": ["Josè Luis Cuerda"], "fullplot": "In a time of crisis, a young boy tries to make sense of the fine line between fantasy and reality in this drama from Spain. Nicolas (Ricardo Darin) is a toy designer who has married Ingrid (Irene Jacob), a scientist studying birds who has been raising her son Raul (Victor Valdivia) on her own since her husband was killed while serving in Iraq. Nicolas and Raul develop a close bond, and when the boy asks his new step-father about why his dad died, he tells the youngster stories about the fairies that be believed guided the world when he was a boy. Nicolas also shows Raul the shack he built in the woods where he used to go when he was troubled as a kid. While Nicolas's relationship with Ingrid falls apart, he remains close to Raul. One night, Nicolas befriends Sezar (Bebe), a clerk at a grocery store who is beaten when her unscrupulous boss is attacked by a gang of toughs while driving her home. With nowhere else for her to stay, Nicolas takes Sezar back to his shack so she can get a good night's sleep and clear her mind after the trauma. However, when Raul happens by the shack the next morning, he doesn't know what to make of its new occupant until he decides Sezar is one of the fairies Nicolas once believed in.", "genres": ["Drama"], "imdb": {"id": 485634, "rating": 6.3, "votes": 677}, "languages": ["Spanish", "French", "English"], "lastupdated": "2015-07-01 04:41:51.197000000", "num_mflix_comments": 2, "plot": "In a time of crisis, a young boy tries to make sense of the fine line between fantasy and reality in this drama from Spain. Nicolas (Ricardo Darin) is a toy designer who has married Ingrid ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTg4Nzc2MDM2OF5BMl5BanBnXkFtZTcwNzAxOTI0MQ@@._V1_SY1000_SX677_AL_.jpg", "released": 1151020800000, "runtime": 103, "title": "The Education of Fairies", "tomatoes": {"lastUpdated": 1429727686000, "production": "Alta", "viewer": {"meter": 69, "numReviews": 514, "rating": 3.7}}, "type": "movie", "writers": ["Josè Luis Cuerda", "Didier Van Cauwelaert (book)"], "year": 2006}