{"_id": "573a13a8f29313caabd1c905", "awards": {"nominations": 5, "text": "5 nominations.", "wins": 0}, "cast": ["Amitabh Bachchan", "Akshay Kumar", "Sushmita Sen", "Arjun Rampal"], "countries": ["India"], "directors": ["Vipul Amrutlal Shah"], "fullplot": "Vijay Singh Rajput (Amitabh Bachchan) is a quirky manager of Vilasrao Jefferson Bank. He is extremely strict at work and believes in pushing his workers to the limit. This means that his superiors hold him in high regard for his unblemished reputation and excellent track record. But things go terribly wrong for the honest bank manager when he finds one of his own employees trying to con the customers. At this, he loses his temper and gets physical with the employee. This doesn't go down well with his superiors and they decide that Rajput is now a liability to the bank and they sack him. Amitabh can't believe the Board of Directors and his mind is filled with revenge and what better revenge than robbing the bank himself, ironic as it may sound. He decides that he must think of a plan that will hit the bank where it hurts the most - in its safe where all the money is kept. Rajput blackmails Neha (Sushmita Sen) to use her professional skills to help his plan, to train three blind men to rob the bank for him. Rajput then gets together a team of three blind men Vishwas Prajapati (Akshay Kumar), Arjun Verma (Arjun Rampal) and Ilias (Paresh Rawal) who will help him obtain his vengeance and make a heap of money at the same time. After gruelling training sessions, the three succeed in robbing the bank, but things go haywire. What happens next?", "genres": ["Comedy", "Thriller", "Crime"], "imdb": {"id": 306434, "rating": 7.5, "votes": 4123}, "languages": ["Hindi"], "lastupdated": "2015-08-18 00:47:16.517000000", "plot": "Vijay Singh Rajput (Amitabh Bachchan) is a quirky manager of Vilasrao Jefferson Bank. He is extremely strict at work and believes in pushing his workers to the limit. This means that his ...", "released": 1017187200000, "runtime": 165, "title": "Aankhen", "tomatoes": {"dvd": 1186444800000, "lastUpdated": 1440878365000, "viewer": {"meter": 71, "numReviews": 618, "rating": 3.6}}, "type": "movie", "writers": ["Shobhana Desai (play)", "Aatish Kapadia (screenplay)", "Aatish Kapadia (story)", "Aatish Kapadia", "Vipul Amrutlal Shah (screenplay)", "Vipul Amrutlal Shah (story)"], "year": 2002}