{"_id": "573a13bbf29313caabd53d9c", "awards": {"nominations": 2, "text": "1 win & 2 nominations.", "wins": 1}, "cast": ["Nana Patekar", "Venkatesh Chavan", "Jhangir Badshah", "Ayesha Mohan"], "countries": ["USA"], "directors": ["Chris Smith"], "fullplot": "Coming of age. Venkatesh is 18, illiterate; he cleans hotel rooms in Panjim, Goa, and sells plastic bags on the street with his 10-year-old partner, Jhangir, an enterprising orphan. He's fascinated by the swimming pool on a vacant estate, and when the owner shows up from Bombay with his teen daughter, Venkatesh watches them from a tree and follows the girl when she's out. He and Jhangir start a friendship with her. The father and daughter are at odds, hardly speaking; tragedy is in their past. Venkatesh helps the father in the garden; short, odd conversations evolve into a gruff offering of a job and schooling in Bombay. What will Venkatesh do with this opportunity?", "genres": ["Drama"], "imdb": {"id": 911024, "rating": 7, "votes": 693}, "languages": ["Hindi"], "lastupdated": "2015-08-27 00:44:07.977000000", "metacritic": 77, "num_mflix_comments": 1, "plot": "A boy in abject poverty works in a hotel and becomes obsessed with a swimming pool in the opulent hills of Panjim, Goa, India. His life gets turned upside-down when he attempts to meet the mysterious family who lives at the house.", "poster": "https://m.media-amazon.com/images/M/MV5BMTI1ODMxMzExNV5BMl5BanBnXkFtZTcwNzUwNTM5MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "UNRATED", "released": 1167609600000, "runtime": 98, "title": "The Pool", "tomatoes": {"consensus": "Beautifully crafted with loosely drawn characters and a lilting, natural pace, Chris Smith's The Pool features a universal message to which everyone can relate.", "critic": {"meter": 96, "numReviews": 47, "rating": 7.5}, "dvd": 1360022400000, "fresh": 45, "lastUpdated": 1442261425000, "production": "Cinetic Media", "rotten": 2, "viewer": {"meter": 72, "numReviews": 810, "rating": 3.7}, "website": "http://thepoolfilm.com"}, "type": "movie", "writers": ["Chris Smith (screenplay)", "Randy Russell"], "year": 2007}