{"_id": "573a13ccf29313caabd82c68", "awards": {"nominations": 5, "text": "3 wins & 5 nominations.", "wins": 3}, "cast": ["Woody Harrelson", "Jon Bernthal", "Stella Schnabel", "Jon Foster"], "countries": ["USA"], "directors": ["Oren Moverman"], "fullplot": "Dave Brown is a Los Angeles police officer who works out of the Rampart Division. Dave is misogynistic, racist, brutally violent, egotistical and a womanizer, although he defends himself against many of these accusations as he says that his hate is equal opportunity. However unlawful, he uses intimidation and brutal force to defend his ideals. The most notorious of his actions is purportedly murdering a suspected serial date rapist, which is why he has been given the nickname \"Date Rape Dave\". He lives with two of his ex-wives - sisters Barbara and Catherine - in an effort to keep family together, namely his two daughters, Helen and Margaret, who each have a different sister as their mother. Dave still maintains a sexual relationship with both sisters - whenever the mood suits any of them - while he openly has other sexual relationships. His life is put under a microscope after he is caught on video brutally beating a person with who he got into an automobile crash. This situation is made all the more difficult for the police department because of the Rampart scandal. This microscope shows a further potentially scandalous incident involving Dave and a grocery store hold-up. Although he secretly has his defenders within the police department highers-up, Dave, who is unrepentant regarding his actions, has to figure out who he can and cannot trust among his colleagues and new associates as he goes about his business and tries to protect his ideals from being taken away by these scandals.", "genres": ["Crime", "Drama"], "imdb": {"id": 1640548, "rating": 5.8, "votes": 18257}, "languages": ["English"], "lastupdated": "2015-08-19 00:19:45.437000000", "metacritic": 70, "plot": "Set in 1999 Los Angeles, veteran police officer Dave Brown, the last of the renegade cops, works to take care of his family, and struggles for his own survival.", "poster": "https://m.media-amazon.com/images/M/MV5BMTk4MjAxNzU2MV5BMl5BanBnXkFtZTcwMDA5NTAwNw@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1330041600000, "runtime": 108, "title": "Rampart", "type": "movie", "writers": ["James Ellroy", "Oren Moverman"], "year": 2011}