{"_id": "573a13c2f29313caabd667af", "awards": {"nominations": 5, "text": "5 wins & 5 nominations.", "wins": 5}, "cast": ["Evan Glodell", "Jessie Wiseman", "Tyler Dawson", "Rebekah Brandes"], "countries": ["USA"], "directors": ["Evan Glodell"], "fullplot": "Bellflower follows two friends as they venture out into the world to begin their adult lives. Literally all their free time is spent building flame-throwers and weapons of mass destruction in hopes that a global apocalypse will occur and clear the runway for their imaginary gang \"Mother Medusa\". While waiting for the world to end, their call to excitement comes unexpectedly when one of them meets a charismatic young woman and falls hard in love. Quickly integrated into a new group of friends, they set off on a journey of betrayal, love, hate, infidelity and extreme violence more devastating and fiery than any of their apocalyptic fantasies. Often life's simplest and most obvious truths are the hardest to see, but once you've burned everything to the ground it may be the only thing left standing.", "genres": ["Action", "Drama", "Romance"], "imdb": {"id": 1242599, "rating": 6.4, "votes": 6557}, "languages": ["English"], "lastupdated": "2015-08-26 00:58:10.870000000", "metacritic": 72, "num_mflix_comments": 1, "plot": "Two friends spend all their free time building flame-throwers and weapons of mass destruction in hopes that a global apocalypse will occur and clear the runway for their imaginary gang \"Mother Medusa\".", "poster": "https://m.media-amazon.com/images/M/MV5BMTc4OTM5MDU1N15BMl5BanBnXkFtZTcwMDM3ODYyNg@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1332288000000, "runtime": 106, "title": "Bellflower", "tomatoes": {"boxOffice": "$0.2M", "consensus": "This fevered, stylish vision of the end of the world stitches multiple genres together and marks writer/director/star Evan Glodell as a true talent to watch.", "critic": {"meter": 74, "numReviews": 86, "rating": 6.9}, "dvd": 1321315200000, "fresh": 64, "lastUpdated": 1440185259000, "production": "Oscilloscope Laboratories", "rotten": 22, "viewer": {"meter": 63, "numReviews": 6184, "rating": 3.4}, "website": "http://www.bellflower-themovie.com/"}, "type": "movie", "writers": ["Evan Glodell"], "year": 2011}