{"_id": "573a13a8f29313caabd1e462", "awards": {"nominations": 3, "text": "1 win & 3 nominations.", "wins": 1}, "cast": ["Sandra Bullock", "Hugh Grant", "Alicia Witt", "Dana Ivey"], "countries": ["USA", "Australia"], "directors": ["Marc Lawrence"], "fullplot": "Harvard educated lawyer Lucy Kelson, following in the footsteps of her lawyer parents, uses her career for social activism. She hides any sense of femininity behind her work. George Wade is the suave public face of the Manhattan-based Wade Corporation, a development firm that Lucy routinely opposes and whose true head is George's profit-oriented brother, Howard Wade. George, who has a reputation as a lady's man, has had as his legal counsel a series of beautiful female lawyers with questionable credentials, they who have more primarily acted as his casual sex partners. Needing a real lawyer, he offers Lucy the job of his legal counsel on a chance meeting. Despite warnings from her parents in working for the \"enemy\", Lucy, who has no intention of being the latest in his bed partners, accepts the job as she feels she can do more good from the inside, and as George, as part of the job offer, promises not to demolish a community center in a heritage building as part of a development project near her childhood Coney Island home where her parents still live. Although Lucy is able to effect the type of change she wanted from this position, she finds she cannot deal with George's expectations of her, namely being his primary confidante and advisor at all hours of the day and night, mostly about issues she considers frivolous. As such, she gives her two weeks notice, although she promises to help George find her replacement. As Lucy begins to review resumes, George himself unilaterally decides to hire June Carver, a fellow Harvardite, but who seems to have her sights set on George as both a boss and personal partner. As June begins to replace Lucy in seemingly all aspects of George's life, Lucy begins to realize that she herself has fallen for George. However, Lucy's feelings for George and her attempts to re-ingratiate herself into George's life are placed into jeopardy when she learns of a Wade Corporation decision against her basic sensibilities.", "genres": ["Comedy", "Romance"], "imdb": {"id": 313737, "rating": 6, "votes": 79322}, "languages": ["English"], "lastupdated": "2015-09-11 00:02:52.933000000", "metacritic": 42, "num_mflix_comments": 3, "plot": "A lawyer decides that she's used too much like a nanny by her boss, so she walks out on him.", "poster": "https://m.media-amazon.com/images/M/MV5BYTg4N2M2ODItZjVjMy00YTljLTllNjUtYzY4ZTE2MTI2M2RhXkEyXkFqcGdeQXVyNjExODE1MDc@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1040342400000, "runtime": 101, "title": "Two Weeks Notice", "tomatoes": {"boxOffice": "$93.2M", "consensus": "Though Two Weeks Notice has nothing new to add to the crowded genre, Hugh Grant and Sandra Bullock make the movie a pleasant, if predictable, sit.", "critic": {"meter": 42, "numReviews": 120, "rating": 5.3}, "dvd": 1051574400000, "fresh": 50, "lastUpdated": 1440008927000, "production": "Warner Bros.", "rotten": 70, "viewer": {"meter": 59, "numReviews": 273564, "rating": 3}, "website": "http://twoweeksnoticemovie.warnerbros.com"}, "type": "movie", "writers": ["Marc Lawrence"], "year": 2002}