{"_id": "573a13b8f29313caabd4d5a9", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Eva Mendes", "David Krumholtz", "Rob Brown", "Katie Cassidy"], "countries": ["USA"], "directors": ["Bill Guttentag"], "fullplot": "In a world where reality and entertainment are continuously colliding, Academy Award winning documentary filmmaker Bill Guttentag's feature debut Live! follows ABN network president Katy Courbet and up-and-coming documentary filmmaker Rex as inspiration strikes to create the most daring reality program ever. The show is Russian Roulette, network style, with contestants competing for five million dollars on-air, complete with loaded guns. As seen through the lens of a documentary film crew, Live! examines the competitive and often gut-wrenching world of television production, where everyone from the crew to the contestants to the network brass becomes engulfed in a ratings battle to the top-a battle where questions of morality, ethics and sheer will lead to a darkly humorous and unforgettable outcome.", "genres": ["Drama"], "imdb": {"id": 810945, "rating": 5.8, "votes": 4231}, "languages": ["English"], "lastupdated": "2015-08-21 00:52:53.187000000", "plot": "A mockumentary following an ambitious TV network executive trying to produce a controversial reality show where contestants play Russian Roulette.", "poster": "https://m.media-amazon.com/images/M/MV5BMzc2MTM5NDY2NV5BMl5BanBnXkFtZTcwOTQ4NTMwMw@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1193875200000, "runtime": 96, "title": "Live!", "tomatoes": {"consensus": "Uneven media satire on how far TV will go to secure ratings. Unfortunately it's neither as funny or as sharp as it hopes to be.", "critic": {"meter": 44, "numReviews": 16, "rating": 4.7}, "dvd": 1259625600000, "fresh": 7, "lastUpdated": 1438539880000, "production": "Weinstein Company", "rotten": 9, "viewer": {"meter": 43, "numReviews": 11219, "rating": 2.9}}, "type": "movie", "writers": ["Bill Guttentag"], "year": 2007}