{"_id": "573a13b2f29313caabd396ab", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Jun Hee Lee", "Raymond Ma", "Julia Nickson", "Kevin Kleinberg"], "countries": ["Canada", "USA"], "directors": ["Quentin Lee"], "fullplot": "BOOTED OUT of his comfortable suburban house by his father for being gay after being outed by his manipulative stepmother, Ethan Mao, 18, survives on the street as a hustler selling sex to older men. He meets Remigio, 19, a drug dealer and sometime hustler, who befriends Ethan and takes him in. After being tipped off by his younger brother that his family is going on a day trip on Thanksgiving Day, Ethan asks Remigio for a ride to his family house to get some of his belongings and a necklace that belonged to his late mother. Ethan and Remigio break into Ethan's family house, but are caught in the act and believe they have no choice other than to hold his father, stepmother, and bullying stepbrother hostage. In the following increasingly desperate hours, Ethan, his family, and Remigio are forced to confront their unresolved conflicts between each other. As the tension between Ethan and his family escalates, their inner demons and family secrets unravel in this suspenseful drama.", "genres": ["Crime", "Drama", "Thriller"], "imdb": {"id": 430063, "rating": 6.3, "votes": 485}, "languages": ["English"], "lastupdated": "2015-08-25 01:02:22.993000000", "metacritic": 29, "num_mflix_comments": 2, "plot": "Kicked out of his house because he's gay, Ethan Mao returns home to steal and ends up holding his family hostage on a fateful Thanksgiving Day.", "poster": "https://m.media-amazon.com/images/M/MV5BMGVlMjBlNDYtYTY2ZC00MzA5LWJjMTMtYjg3MjA5MDkxZDUwXkEyXkFqcGdeQXVyMDE2NzY0MA@@._V1_SY1000_SX677_AL_.jpg", "released": 1100044800000, "runtime": 87, "title": "Ethan Mao", "tomatoes": {"critic": {"meter": 36, "numReviews": 11, "rating": 3.8}, "dvd": 1127174400000, "fresh": 4, "lastUpdated": 1438892309000, "production": "TLA Releasing", "rotten": 7, "viewer": {"meter": 59, "numReviews": 1068, "rating": 3.3}, "website": "http://www.marginfilms.com/ethan/"}, "type": "movie", "writers": ["Quentin Lee"], "year": 2004}