{"_id": "573a1396f29313caabce4d92", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Kirill Lavrov", "Ada Rogovtseva", "Igor Gorbachyov", "Andrei Popov"], "countries": ["Soviet Union"], "directors": ["Daniil Khrabrovitsky"], "fullplot": "Epic film based on a true story about Russian space and missile industry and it's founder Sergei P. Korolev (as the leading character Andrei Bashkirtsev). Before WWII he develops the first rocket launch center in Central Russia and makes the \"Katyusha\" weapon. In spite of his arrest and imprisonment, he continues working on rocket design. He is released from prison upon his request to fight in the front-line against the Nazis. After WWII he makes a new rocket system for the nuclear missiles program, and another new rocket that launched \"Sputnik\" in 1957. Next achievement is the first man in space and several other human space missions. Korolev's uncompromising character causes him many problems with Soviet politicians, and he dies from a heart attack. His mission is carried on by his colleagues. Note: Footages of Baykonur Kosmodrome in Kazakhstan and of the Soviet Space Center in Moscow are adding authenticity to the film, but most of the footage had not been released to the public. The original director's cut had 5500 meters of film length, but then it was shown to Brezhnev and Politbureau and was censored before the public release in 1972; the film was reduced to 4553m and ran 166 minutes. Currently available copies run only 158 minutes.", "genres": ["Biography", "Drama", "History"], "imdb": {"id": 69434, "rating": 7.3, "votes": 263}, "languages": ["Russian"], "lastupdated": "2015-06-25 00:19:25.177000000", "num_mflix_comments": 1, "plot": "About Russian space program and missile industry, and it's founder Sergei P. Korolev, from the 1920s to the first man in space in 1961.", "poster": "https://m.media-amazon.com/images/M/MV5BMTFkYzA5ZTYtNzdlZS00ZTRlLWIxY2QtMzVlMmI3ZDBiOTM2XkEyXkFqcGdeQXVyNDE4OTY5NzI@._V1_SY1000_SX677_AL_.jpg", "released": 107740800000, "runtime": 166, "title": "Ukroshcheniye ognya", "tomatoes": {"critic": {"meter": 86, "numReviews": 7, "rating": 6.5}, "dvd": 916358400000, "fresh": 6, "lastUpdated": 1442079137000, "production": "MCA Universal Home Video", "rotten": 1, "viewer": {"meter": 62, "numReviews": 1147, "rating": 3.4}}, "type": "movie", "writers": ["Daniil Khrabrovitsky"], "year": 1972}