{"_id": "573a13a0f29313caabd02b1a", "awards": {"nominations": 3, "text": "1 win & 3 nominations.", "wins": 1}, "cast": ["Hanan Turk", "Hani Salama", "Nabila Ebeid", "Mahmoud Hemida"], "countries": ["France", "Egypt"], "directors": ["Youssef Chahine"], "fullplot": "Egyptian director Youssef Chahine exposes the links between power and fanaticism and denounces intolerance in this bitter portrait of the Egyptian business world, where unconditional drive for money rules. Adam (Hani Salama), the son of a rich businessman and his American wife, meets Hanane (Hanane Turk), a journalist of modest means at the airport on his return from his studies in the US. She is part of a campaign against a wealthy elite, which has thrived on plundering its own people. They fall in love and get married. Corruption is everywhere in the country and American interests are taking over the lucrative tourist trade. Adam's rich parents and their friends in the government are at the heart of this corrupt system. Adam's mother, Margaret (Nabila Ebeid), nourishes a strange affection for her son. She is possessive to the point of violence and is ready to get rid of Hanane, whom she considers her rival. Adam turns against the global economy of which his parents are the perfect examples as he sees through the greed of international speculators and the secret ties that bind them to fanatical fundamentalist sects. The fact that Hanane's brother has become an Islamist terrorist does not help matters. The resistance that the couple has to put up makes them grow strong, for which they pay a heavy price. 52nd Cannes Film Festival, 1999.", "genres": ["Drama", "Romance"], "imdb": {"id": 196355, "rating": 6.1, "votes": 525}, "languages": ["Arabic", "French"], "lastupdated": "2015-06-18 00:54:36.970000000", "num_mflix_comments": 3, "plot": "Egyptian director Youssef Chahine exposes the links between power and fanaticism and denounces intolerance in this bitter portrait of the Egyptian business world, where unconditional drive ...", "poster": "https://m.media-amazon.com/images/M/MV5BNDk0MjA3NGQtOGQ1Ni00NGQwLTg1YTEtMTU5NmFiMjY5YTZmXkEyXkFqcGdeQXVyMjg0MzMwNzg@._V1_SY1000_SX677_AL_.jpg", "released": 927676800000, "runtime": 105, "title": "The Other", "tomatoes": {"lastUpdated": 1442341542000, "production": "Legend Films", "viewer": {"numReviews": 0, "rating": 0}}, "type": "movie", "writers": ["Youssef Chahine", "Khaled Youssef"], "year": 1999}