{"_id": "573a13def29313caabdb5d79", "awards": {"nominations": 9, "text": "4 wins & 9 nominations.", "wins": 4}, "cast": ["Stephen Badger", "Aretha Franklin", "Jerry Carrigan", "Alicia Keys"], "countries": ["USA"], "directors": ["Greg 'Freddy' Camalier"], "fullplot": "Located alongside the Tennessee River, Muscle Shoals, Alabama is the unlikely breeding ground for some of America's most creative and defiant music. Under the spiritual influence of the 'Singing River' as Native Americans called it, the music of Muscle Shoals changed the world and sold millions upon millions of copies. At its heart is Rick Hall who founded FAME Studios. Overcoming crushing poverty and staggering tragedies, he brought black and white together in Alabama's cauldron of racial hostility to create music for the generations while giving birth to the 'Muscle Shoals Sound' and 'The Swampers'. Mick Jagger, Keith Richards, Percy Sledge, Gregg Allman, Clarence Carter, Etta James, Alicia Keys, Bono, and others bear witness to Muscle Shoals' magnetism, mystery, and why it remains influential today.", "genres": ["Documentary", "Biography", "History"], "imdb": {"id": 2492916, "rating": 7.7, "votes": 2109}, "languages": ["English"], "lastupdated": "2015-09-01 00:07:22.913000000", "metacritic": 75, "num_mflix_comments": 1, "plot": "A documentary that celebrates Rick Hall, the founder of FAME Studios in Muscle Shoals, Alabama, and the signature sound he developed in songs such as \"I'll Take You There\", \"Brown Sugar\", and \"When a Man Loves a Woman\".", "poster": "https://m.media-amazon.com/images/M/MV5BMTUzMzU1MTA0N15BMl5BanBnXkFtZTgwMjY3MDgwMDE@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 1382659200000, "runtime": 111, "title": "Muscle Shoals", "tomatoes": {"boxOffice": "$0.7M", "consensus": "Essential for soul fans and entertaining for novices, Muscle Shoals offers a compelling, warts-and-all glimpse at one of the most fascinating stories in modern American music.", "critic": {"meter": 96, "numReviews": 80, "rating": 7.6}, "dvd": 1393286400000, "fresh": 77, "lastUpdated": 1439839529000, "production": "Magnolia Pictures", "rotten": 3, "viewer": {"meter": 88, "numReviews": 4463, "rating": 4.2}, "website": "http://www.muscleshoalsmovie.com/"}, "type": "movie", "year": 2013}