{"_id": "573a13bbf29313caabd54b0e", "awards": {"nominations": 81, "text": "Won 2 Oscars. Another 112 wins & 81 nominations.", "wins": 114}, "cast": ["Gabourey Sidibe", "Mo'Nique", "Paula Patton", "Mariah Carey"], "countries": ["USA"], "directors": ["Lee Daniels"], "fullplot": "It's Harlem 1987. Sixteen year old Claireece Jones - who goes by her middle name Precious - is an illiterate, overweight black girl. She is pregnant with her second child, both children fathered by her biological father, who has continually raped her since she was a child, but who she doesn't see otherwise. Her infant daughter, Mongo - such named since she has Down Syndrome - lives with Precious' grandmother. Precious lives with her mother Mary, who abuses Precious both physically and emotionally. Mary does nothing but smoke, watch television and collect welfare through fraud (as she doesn't ever look for a job) and believes that education does nothing for Precious, who she would rather also collect welfare if only to bring money into the household. To escape her life, Precious often daydreams of herself in glamorous situations. Because of her current pregnancy, Precious' principal transfers her into an alternative school. In dealing with the school's sympathetic teacher Miss Blu Rain, Precious begins to believe that she can have a future by learning how to read and write. Despite some devastating news from her mother following the birth of her child, Precious also begins to believe she can escape the grips of her abusive mother, who, up to this point, was Precious' only real support.", "genres": ["Drama"], "imdb": {"id": 929632, "rating": 7.4, "votes": 78885}, "languages": ["English", "Italian"], "lastupdated": "2015-08-24 00:11:59.680000000", "metacritic": 79, "num_mflix_comments": 1, "plot": "In New York City's Harlem circa 1987, an overweight, abused, illiterate teen who is pregnant with her second child is invited to enroll in an alternative school in hopes that her life can head in a new direction.", "poster": "https://m.media-amazon.com/images/M/MV5BMTk3NDM4ODMwNl5BMl5BanBnXkFtZTcwMTYyNDIzMw@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1258675200000, "runtime": 110, "title": "Precious", "tomatoes": {"boxOffice": "$47.5M", "consensus": "Precious is a grim yet ultimately triumphant film about abuse and inner-city life, largely bolstered by exceptional performances from its cast.", "critic": {"meter": 91, "numReviews": 219, "rating": 7.8}, "dvd": 1268092800000, "fresh": 200, "lastUpdated": 1440180463000, "production": "Lionsgate Films", "rotten": 19, "viewer": {"meter": 81, "numReviews": 140344, "rating": 3.6}, "website": "http://www.weareallprecious.com/"}, "type": "movie", "writers": ["Geoffrey Fletcher (screenplay)", "Sapphire (novel)"], "year": 2009}