{"_id": "573a13c6f29313caabd73400", "awards": {"nominations": 5, "text": "5 nominations.", "wins": 0}, "cast": ["Dwayne Johnson", "Mauricio Lopez", "Jim Gaines", "Tom Berenger"], "countries": ["USA"], "directors": ["George Tillman Jr."], "fullplot": "A lone man, recently released from prison, seeks out the people from his past who he believes betrayed him. While he forces each to atone for their sins, he must also face what meting out vengeance will do to his immortal soul. Meanwhile, he's not the only one looking to settle old scores. Hired by the man responsible for the events which lead him to prison, an eccentric contract killer follows his every move. Scenes of them crossing paths, sometimes violently, are interspersed with the assassin's self-realizations of how to deal with struggles within his own life. As if old enemies & hired guns aren't enough, a young female detective begrudgingly works alongside a veteran investigator looking to simply survive his last two weeks on the force before retirement, as they seek out the brazen ex-con who has been blazing a path of gasoline-powered destruction in his vintage Chevelle.", "genres": ["Action", "Crime", "Drama"], "imdb": {"id": 1433108, "rating": 6.5, "votes": 76025}, "languages": ["English"], "lastupdated": "2015-09-04 00:22:57.507000000", "metacritic": 44, "num_mflix_comments": 1, "plot": "An ex-con sets out to avenge his brother's death after they were double-crossed during a heist years ago. During his campaign, however, he's tracked by a veteran cop and an egocentric hit man.", "poster": "https://m.media-amazon.com/images/M/MV5BMTMyOTQ5MTAxOF5BMl5BanBnXkFtZTcwOTYzMDg5Mw@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1290556800000, "runtime": 98, "title": "Faster", "tomatoes": {"boxOffice": "$23.2M", "consensus": "It's good to see Dwayne Johnson back in full-throttle action mode, but Faster doesn't deliver enough of the high-octane thrills promised by its title.", "critic": {"meter": 43, "numReviews": 108, "rating": 4.9}, "dvd": 1298937600000, "fresh": 46, "lastUpdated": 1442079516000, "production": "CBS Films", "rotten": 62, "viewer": {"meter": 49, "numReviews": 44976, "rating": 3.3}, "website": "http://fasterthemovie.com/"}, "type": "movie", "writers": ["Tony Gayton", "Joe Gayton"], "year": 2010}