{"_id": "573a13e1f29313caabdbbeeb", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Thomas Arnold", "Harry Lloyd", "Amber Anderson", "Max Irons"], "countries": ["UK"], "directors": ["Lone Scherfig"], "fullplot": "SPOILER: Alistair and Miles, both with aristocratic connections, start their first year at Oxford University though they are very different, Miles is down to earth and happy to have a girlfriend from a lower background, Lauren, whilst Alistair is a snob with aspirations to follow his uncle, a Tory MP. The common bond is that both become members of the Riot Club, a long established elite drinking club priding itself on hedonism and the belief that money can buy anything. Having been barred from most establishments in Oxford they have their annual dinner at the function room in a country pub, where their rowdy behaviour angers other patrons though they reimburse Chris, the landlord. They hire a prostitute but she refuses to perform group sex, then one of them rings Lauren, whom they importune to Max's horror. Getting progressively more drunk and ingesting drugs they start to trash the room and when Chris comes to complain Alistair savagely assaults him, landing him in hospital. Though shocked none of the others do anything to stop him except Miles, who is attacked before ringing for an ambulance. The boys are all arrested but believing that the club is more important than the individual they agree not to give statements and suggest that Miles, as the newest club member, should take the blame for the attack on Chris.", "genres": ["Drama", "Thriller"], "imdb": {"id": 2717860, "rating": 6, "votes": 10818}, "languages": ["English"], "lastupdated": "2015-08-25 00:06:00.307000000", "metacritic": 54, "num_mflix_comments": 2, "plot": "Two first-year students at Oxford University join the infamous Riot Club, where reputations can be made or destroyed over the course of a single evening.", "poster": "https://m.media-amazon.com/images/M/MV5BMjAxNTA3NjI0NF5BMl5BanBnXkFtZTgwODcyMjQ3MjE@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1427414400000, "runtime": 107, "title": "The Riot Club", "tomatoes": {"boxOffice": "$2.2k", "consensus": "The Riot Club may not be subtle, but it makes its points with power, using dark humor and a talented cast to offer a scathing indictment of unearned privilege.", "critic": {"meter": 65, "numReviews": 60, "rating": 5.5}, "dvd": 1439856000000, "fresh": 39, "lastUpdated": 1440880239000, "production": "IFC Films", "rotten": 21, "viewer": {"meter": 46, "numReviews": 4139, "rating": 3.1}, "website": "http://www.riotclubmovie.com/"}, "type": "movie", "writers": ["Laura Wade (play)", "Laura Wade (adaptation)"], "year": 2014}