{"_id": "573a13b2f29313caabd38480", "awards": {"nominations": 4, "text": "4 nominations.", "wins": 0}, "cast": ["Craig Ferguson", "Peter Keleghan", "Damir Andrei", "Wendy Crewson"], "countries": ["Canada", "UK"], "directors": ["Gary Yates"], "fullplot": "The Niagara Motel and the attached Riverside Grill, located in Niagara Falls, are owned and operated by Serbian father and daughter, the always angry Boris and hard working Sophie. Through the motel and/or restaurant comes a series of disparate but equally struggling people: middle aged couple Henry and Lil, formerly middle class but who are trying to cope with the loss of employment and its associated money; young couple R.J. and Denise, who are trying to clean up (with varying degrees of success) so that they can reclaim their daughter from foster care; and the restaurant's new waitress, young widowed French-Canadian Lori, who is escaping a complicated situation in her hometown and who is preyed upon by two locals, straight-laced Dave and less than straight-laced Michael. The person who sees everything that is going on is the motel's caretaker Phillie, a Scot who stayed in Niagara Falls following a personal tragedy. To escape memory of that tragedy, Phillie is in a constant state of inebriation. Each person has to decide how far they will go to get what they want in life.", "genres": ["Drama"], "imdb": {"id": 425295, "rating": 6, "votes": 471}, "languages": ["English", "French", "Serbian"], "lastupdated": "2015-09-02 00:28:57.523000000", "num_mflix_comments": 1, "plot": "The Niagara Motel and the attached Riverside Grill, located in Niagara Falls, are owned and operated by Serbian father and daughter, the always angry Boris and hard working Sophie. Through ...", "poster": "https://m.media-amazon.com/images/M/MV5BMjA2NTU4NDI0OV5BMl5BanBnXkFtZTcwNjA1NzY5MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1143158400000, "runtime": 88, "title": "Niagara Motel", "tomatoes": {"critic": {"meter": 36, "numReviews": 14, "rating": 5}, "dvd": 1202169600000, "fresh": 5, "lastUpdated": 1442252315000, "production": "Muse Entertainment", "rotten": 9, "viewer": {"meter": 34, "numReviews": 570, "rating": 3}}, "type": "movie", "writers": ["George F. Walker (story)", "George F. Walker (plays)", "George F. Walker (screenplay)", "Dani Romain (screenplay)"], "year": 2005}