{"_id": "573a13a8f29313caabd1ca1d", "awards": {"nominations": 0, "text": "2 wins.", "wins": 2}, "cast": ["Kate Hudson", "Jean-Marie Lhomme", "Naomi Watts", "Esmèe Buchet-Deèk"], "countries": ["USA"], "directors": ["James Ivory"], "fullplot": "The differences in legalities and cultural mores of French and Americans regarding sex, love, marriage, religion and family bonds are presented through the interactions of two families related by marriage. American Isabel Walker heads to Paris to visit her half-sister, poet Roxeanne de Persand, who is early in the pregnancy of her second child. Isabel arrives to find that Roxy's French husband, Charles-Henri de Persand, has just left Roxy, the sisters both eventually further learning that it is because he has fallen in love with another woman, who is herself married. Roxy and Charles-Henri deal with their break-up, which Roxy does not want but must face the legal consequences of, including determining the ownership of what may be a valuable French painting that has been casually in the Walker family for years, but which Roxy has had in her possession since she got married. Meanwhile, Isabel begins to explore all that France has to offer, which includes concurrently embarking on sexual relationships with two men, including one with Charles-Henri's older maternal uncle, the wealthy and well-appointed Edgar Cosset, who is himself already married and who is using the same play-book on her that he has on countless women before her. As groups and individuals within the two families disagree and argue about certain issues they are facing, it does not necessarily affect other issues and relationships between the two families based on their priorities and those cultural and legal standards.", "genres": ["Drama", "Romance", "Comedy"], "imdb": {"id": 306734, "rating": 4.9, "votes": 9365}, "languages": ["English", "French"], "lastupdated": "2015-08-17 00:03:52.437000000", "metacritic": 51, "num_mflix_comments": 1, "plot": "French vs. American social customs and behaviors are observed in a story about an American visiting her Frenchman-wed sister in Paris.", "poster": "https://m.media-amazon.com/images/M/MV5BMTUxMjQ0MDgzOF5BMl5BanBnXkFtZTYwNjM1MDY2._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1062115200000, "runtime": 117, "title": "Le divorce", "tomatoes": {"boxOffice": "$8.9M", "consensus": "A mixed bag of uneven tones that feels flat.", "critic": {"meter": 37, "numReviews": 138, "rating": 5.2}, "dvd": 1075161600000, "fresh": 51, "lastUpdated": 1440010977000, "production": "20th Century Fox Film", "rotten": 87, "viewer": {"meter": 26, "numReviews": 17657, "rating": 2.5}, "website": "http://www.merchantivory.com/news.html"}, "type": "movie", "writers": ["Diane Johnson (novel)", "Ruth Prawer Jhabvala (screenplay)", "James Ivory (screenplay)"], "year": 2003}