{"_id": "573a1396f29313caabce4fe8", "awards": {"nominations": 2, "text": "Nominated for 1 Golden Globe. Another 1 nomination.", "wins": 0}, "cast": ["Liv Ullmann", "Edward Albert", "Gene Kelly", "Binnie Barnes"], "countries": ["USA"], "directors": ["Milton Katselas"], "fullplot": "Forty year old Norwegian-American divorcèe Ann Stanley owns her own Manhattan based real estate agency specializing in upscale Manhattan apartments. She lives with her seventeen year old daughter Trina Stanley, and her mother, Maud Ericson, who acts more the teenager than Trina. Largely because of her uptight and regimented attitude, Ann has had no love in her life since divorcing her ex-husband, character actor Billy Boylan, an irresponsible man who she still loves as a friend and who she sees whenever he is in town between acting jobs and whenever he needs money from her. Ann's uptight attitude seems to have softened slightly ever since returning from a trip to Greece with Maud. What she has not told anyone is that her softened attitude is from a romantic one night only liaison with a young American man she met by happenstance by an out of the way Greek beach, he who tried to get her to be more carefree, if only for that one night. Purely by coincidence, she meets that man again in New York. He is twenty-two year old Peter Latham, a steel heir who is an acquaintance of Trina's. While Ann's family and friends encourage her to pursue a relationship with a wealthy southern gentleman client named J.D. Rogers, Peter pursues Ann behind the scenes, while Maud believes Peter wants to court Trina. Peter is falling in love with Ann. Although she admits she is flattered by Peter's declaration, Ann may not be able to get over the difference in their ages, regardless of what she may be feeling about him. If she can let go of that repressed attitude, she may give herself the opportunity to examine if she truly does have romantic feelings for Peter, and what to do about them if they do exist. Dealing with an issue with Trina, discussing Billy's own life with him, and meeting Peter's friends and family may give Ann some insight into the matter.", "genres": ["Comedy"], "imdb": {"id": 70068, "rating": 6.3, "votes": 471}, "languages": ["English", "Greek", "French"], "lastupdated": "2015-09-17 04:39:03.860000000", "plot": "Forty year old Norwegian-American divorcèe Ann Stanley owns her own Manhattan based real estate agency specializing in upscale Manhattan apartments. She lives with her seventeen year old ...", "poster": "https://m.media-amazon.com/images/M/MV5BNTA3Nzc2OTAtNGVlZi00ODQ2LTlhNzAtMTNkMzM1MjRmM2FjXkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 123984000000, "runtime": 110, "title": "40 Carats", "tomatoes": {"lastUpdated": 1433788805000, "production": "Sony Pictures Entertainment", "viewer": {"meter": 64, "numReviews": 501, "rating": 3.6}}, "type": "movie", "writers": ["Jay Presson Allen (stage play adaptation)", "Pierre Barillet (play)", "Jean-Pierre Grèdy (play)", "Leonard Gershe (screenplay)"], "year": 1973}