{"_id": "573a13aef29313caabd2e799", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Ajay Devgn", "Abhishek Bachchan", "Bipasha Basu", "Mukesh Tiwari"], "countries": ["India"], "directors": ["Rohit Shetty"], "fullplot": "Islamic terrorists, backed by Pakistan, boldly attack the Indian Parliament building. The Indian army assigns this matter to Colonel Ranvir Singh Ranawat, who along with his men, apprehends and arrests the ring-leader Baba Zaheer Khan. The Colonel takes one of his subordinates, Jaideep Rai, to task as nine soldiers were killed due to his negligence, and asks him to resign. An Islamic terrorist group, Al-Tahit, recruits a group of men to try and spring Baba from prison, albeit in vain as their plans are thwarted by Jaideep, who is now the ACP in Mumbai. On the run from the Police, this group hijacks an Indian Airlines plane, en-route from Mumbai to Kathmandu, with Jaideep's wife, Nandini, an In-Flight Supervisor, on board. The plane, with 107 passengers and crew, is re-routed to Kazan in Pakistan Occupied Kashmir where they are met with more armed terrorists as well as the Pakistani army. Together they demand the release of Baba Zaheer in exchange for the lives of the passengers. The Army and Police in India collaborate and both Ranvir and Jaideep are asked to work together. Ranvir is weary of Jaideep's capabilities, and Jaideep is investigating Ranvir and his men - who are suspected of supplying arms and munitions to terrorists and Pakistanis. The duo nevertheless work out a plan to free the hostages and apprehend the terrorists. What they do not know is that their plan has already been compromised, and they may well be headed to their respective deaths.", "genres": ["Action"], "imdb": {"id": 382385, "rating": 5.3, "votes": 830}, "languages": ["Hindi"], "lastupdated": "2015-09-04 00:27:58.083000000", "num_mflix_comments": 1, "plot": "Islamic terrorists, backed by Pakistan, boldly attack the Indian Parliament building. The Indian army assigns this matter to Colonel Ranvir Singh Ranawat, who along with his men, apprehends...", "released": 1064534400000, "runtime": 154, "title": "Zameen", "type": "movie", "writers": ["Robin Bhatt (additional screenplay)", "Javed Siddiqui (dialogue)", "Suparn Verma (screenplay)", "Suparn Verma (story)"], "year": 2003}