{"_id": "573a139df29313caabcfad80", "awards": {"nominations": 0, "text": "2 wins.", "wins": 2}, "cast": ["Meg Ryan", "Diane Keaton", "Lisa Kudrow", "Walter Matthau"], "countries": ["USA", "Germany"], "directors": ["Diane Keaton"], "fullplot": "Georgia Mozell, Eve Marks and Maddy Mozell are adult sisters. Georgia is the editor of her own wildly successful self-titled women's magazine. She strives for publicity at any cost. Party planner Eve is the mother hen of the group, not only of her own family, but also of her siblings and father as their mother, Pat, not only emotionally left their father when they divorced, but her daughters as well. And Maddy is a vacuous soap opera actress who has always struggled for her own identity. Despite being as busy with her own life as the others, Eve is the only one of the three who deals with the long term hospitalization of their cantankerous seventy-nine year old father, Lou Mozell, when he enters the early stages of dementia, and the associated outcomes of that hospitalization. Eve's caring for Lou is despite an especially hurtful incident with him seven years earlier. As the emotional aspect of looking after Lou becomes more and more stressful, Eve has to figure out how to maintain her own sanity, while dealing with her sisters, who believe they too are part of their father's care while they don't lift a finger to help.", "genres": ["Comedy", "Drama"], "imdb": {"id": 162983, "rating": 4.7, "votes": 9673}, "languages": ["English"], "lastupdated": "2015-08-29 00:15:18.047000000", "metacritic": 33, "num_mflix_comments": 3, "plot": "A trio of sisters bond over their ambivalence toward the approaching death of their curmudgeonly father, to whom none of them was particularly close.", "poster": "https://m.media-amazon.com/images/M/MV5BNzJjYjgwZjMtYThhZi00NzNlLWI0Y2YtZjkxYWNlYWI2ZDJkXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 950832000000, "runtime": 94, "title": "Hanging Up", "tomatoes": {"consensus": "Though the screenplay and the novel it's based on were both written by the same person, critics say Hanging Up is an unsuccessful adaptation. The acting is praised as solid, but is ultimately unable to save the film.", "critic": {"meter": 12, "numReviews": 85, "rating": 3.8}, "dvd": 962064000000, "fresh": 10, "lastUpdated": 1438801960000, "production": "Sony Pictures Home Entertainment", "rotten": 75, "viewer": {"meter": 35, "numReviews": 21197, "rating": 2.7}, "website": "http://www.spe.sony.com/movies/hangingup/index.html"}, "type": "movie", "writers": ["Delia Ephron (book)", "Delia Ephron (screenplay)", "Nora Ephron (screenplay)"], "year": 2000}