{"_id": "573a13b1f29313caabd37448", "awards": {"nominations": 2, "text": "1 win & 2 nominations.", "wins": 1}, "cast": ["Michael Keaton", "Chandra West", "Deborah Kara Unger", "Ian McNeice"], "countries": ["UK", "Canada", "USA"], "directors": ["Geoffrey Sax"], "fullplot": "The car of successful author Anna Rivers is found disabled next to the river, the thought being that she accidentally fell into the river while trying to change a flat tire. Her dead body is found upstream several weeks later, consistent with the accidental death theory. Based on incidents around him, her grieving husband, architect Jonathan Rivers, decides several months later to visit with Raymond Price, who approached John prior to Anna's body being found with news that she was trying to contact him from beyond. At that time, John was skeptical of Raymond's claims of electronic voice phenomena (EVP): that he is contacted from the beyond through electronic means - radio, television - which he is able to record. Along with Sarah Tate, another of Raymond's \"clients\" whose fiancè passed away, John becomes obsessed with EVP as he gets more and more audio and video messages, however fuzzy, from Anna from beyond. That obsession takes a slight change in focus when John believes that Anna is trying to pass along information to help others. But the nature of those messages and their connection to Raymond in combination with John learning that not all good comes through EVP leads to the possible belief that he dabbling in EVP in and of itself may be dangerous and the cause of those potentially deadly issues in which he is supposed to assist in helping. John has to decide whether or not to continue with his work in EVP, not continuing which means that he may actually prevent bad things from happening, and continuing which means that he gets his much wanted connection with Anna.", "genres": ["Drama", "Horror", "Mystery"], "imdb": {"id": 375210, "rating": 5.5, "votes": 40002}, "languages": ["English"], "lastupdated": "2015-09-02 09:06:35.787000000", "metacritic": 30, "num_mflix_comments": 1, "plot": "An architect's desire to speak with his wife from beyond the grave, becomes an obsession with supernatural repercussions.", "poster": "https://m.media-amazon.com/images/M/MV5BNWVkNGY2NTgtNWVhNi00NWU3LWE4NWMtNDFjMzA1N2QzMjQyXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1105056000000, "runtime": 101, "title": "White Noise", "type": "movie", "writers": ["Niall Johnson"], "year": 2005}