{"_id": "573a1397f29313caabce7b79", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Natalya Belokhvostikova", "Curd Jèrgens", "Igor Kostolevskiy", "Claude Jade"], "countries": ["Soviet Union", "France", "Switzerland"], "directors": ["Aleksandr Alov", "Vladimir Naumov"], "fullplot": "This story starts in 1980 in Paris as the memories of Andrei Borodin (Igor Kostolevsky), a Soviet agent, take the action back to 1943 during the Teheran meetings of Stalin, Roosevelt and Churchill. A high-ranking Nazi officer developed a plan to assassinate the three world leaders in order to undermine the Allied forces. He commissioned the German agent Max Richard (Armen Dzhigarkhanian) to carry out his plan, but it failed miserably due to the quick action and thinking of Andrei. While in Teheran, Andrei met a French woman, Marie Louni (Natalia Belokhvostikova), living in the city and they had a brief but intense affair. Nearly four decades later, the Nazi officer has been captured - but not for long. Freed by terrorists, the officer is hunting down the German agent who failed to carry out the planned assassinations. Max lives at Franèoise (Claude Jade), a young French woman, who hides him. He trusts her and shows her all the documents. Max don't know, that Franèoise works for the officer Scherner (Albert Filozov). In the meantime, the Soviet agent is in Paris to meet his lover from years ago, and modern terrorists pose threats that seem to have been carried across the decades...", "genres": ["Action", "Drama", "Crime"], "imdb": {"id": 81609, "rating": 7.2, "votes": 821}, "languages": ["Russian"], "lastupdated": "2015-08-18 01:03:28.063000000", "num_mflix_comments": 1, "plot": "Alain Delon and Claude Jade stars in this Soviet movie: Documents reveal in 1980 that the Germans planned to kill the Big Three in Teheran in 1943.", "released": 363398400000, "runtime": 150, "title": "Assassination Attempt", "tomatoes": {"dvd": 1199750400000, "lastUpdated": 1436899853000, "production": "Media Home Entertainment", "viewer": {"meter": 67, "numReviews": 49, "rating": 3.1}}, "type": "movie", "writers": ["Aleksandr Alov", "Vladimir Naumov", "Mikhail Shatrov"], "year": 1981}