{"_id": "573a13b6f29313caabd45f57", "awards": {"nominations": 12, "text": "12 wins & 12 nominations.", "wins": 12}, "cast": ["Takuya Kimura", "Rei Dan", "Mitsugorè Bandè", "Takashi Sasano"], "countries": ["Japan"], "directors": ["Yèji Yamada"], "fullplot": "Shinnojo, a low level samurai, lives with his pretty, dutiful and loyal wife Kayo. He has come to find his position in a castle as a food-taster for a feudal lord to be boring and pointless, and talks about opening a kendo school open to boys of all castes where he can teach the use of the sword. Before he can act on his dream he becomes ill with a fever after tasting some sashimi made from shell fish, but an investigation reveals that the poisoning was not due to a human conspiracy, but a poor choice of food out of season. After three days he awakes but finds that the toxin from the food has blinded him. Kayo is summoned by Shinnojo's family to explain how the couple will survive. His uncle laments that he no longer knows anybody with influence in the castle, and asks Kayo if she knows of anybody. She relates how Toya Shimada, the chief duty officer in the castle and a samurai of high rank, offered to help and they tell her to act upon his offer of assistance. A message from the castle brings the good news that Shinnojo's stipend of rice will remain the same, and for life but his aunt tells him that Kayo was seen with another man. He has Tohuhei, his faithful servant, follow her. Kayo notices that she is being followed, and although Tokuhei offers to cover for her, she reveals to Shinnojo that Shimada offered to help but with a price, shown when he forced himself upon her. He then solicited two additional trysts by threatening to tell Shinnojo about the first. An enraged Shinnojo divorces her and orders her out of his house. When it is revealed to him that Shimada had nothing to do with maintaining his stipend, but that it came out of gratitude from the lord of the clan himself, Shinnojo seeks to renew his skill with the sword as a blind man to avenge the dishonor of Kayo. Through Tokuhei he sends a message to Shimada to set up a duel, with the additional message to not underestimate him. The two samurai meet at the stables near the river to decide their destinies.", "genres": ["Drama", "Romance"], "imdb": {"id": 483578, "rating": 7.8, "votes": 2287}, "languages": ["Japanese"], "lastupdated": "2015-08-20 00:47:21.923000000", "plot": "A look at the relationship between a young blind samurai (Kimura) and his wife, who will make a sacrifice in order to defend her husband's honor.", "poster": "https://m.media-amazon.com/images/M/MV5BNGYxNjlmMzYtYzE2YS00MDg1LWI4OWItMzg2YzI3OGM5ODIyXkEyXkFqcGdeQXVyNzQzNDEyOQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1193961600000, "runtime": 121, "title": "Love and Honour", "tomatoes": {"consensus": "The third in director in Yoji Yamada's samurai trilogy is enjoyable, intricately made and well acted.", "critic": {"meter": 79, "numReviews": 19, "rating": 6.8}, "dvd": 1226361600000, "fresh": 15, "lastUpdated": 1439149109000, "production": "The Bigger Picture", "rotten": 4, "viewer": {"meter": 84, "numReviews": 2157, "rating": 3.9}, "website": "http://www.loveandhonorthemovie.com/"}, "type": "movie", "writers": ["Shèhei Fujisawa (novel)", "Yèji Yamada", "Emiko Hiramatsu", "Ichirè Yamamoto"], "year": 2006}