{"_id": "573a13d2f29313caabd917cc", "awards": {"nominations": 10, "text": "7 wins & 10 nominations.", "wins": 7}, "cast": ["Shailene Woodley", "Theo James", "Ashley Judd", "Jai Courtney"], "countries": ["USA"], "directors": ["Neil Burger"], "fullplot": "Set in a futuristic dystopia where society is divided into five factions that each represent a different virtue, teenagers have to decide if they want to stay in their faction or switch to another - for the rest of their lives. Tris Prior makes a choice that surprises everyone. Then Tris and her fellow faction-members have to live through a highly competitive initiation process to live out the choice they have made. They must undergo extreme physical and intense psychological tests, that transform them all. But Tris has a secret that she is Divergent, which means she doesn't fit into any one group. If anyone knew, it would mean a certain death. As she discovers a growing conflict that threatens to unravel her seemingly peaceful society, this secret might help her save the people she loves... or it might destroy her.", "genres": ["Adventure", "Mystery", "Sci-Fi"], "imdb": {"id": 1840309, "rating": 6.8, "votes": 291535}, "languages": ["English", "Spanish"], "lastupdated": "2015-08-31 00:01:06.310000000", "metacritic": 48, "num_mflix_comments": 1, "plot": "In a world divided by factions based on virtues, Tris learns she's Divergent and won't fit in. When she discovers a plot to destroy Divergents, Tris and the mysterious Four must find out what makes Divergents dangerous before it's too late.", "poster": "https://m.media-amazon.com/images/M/MV5BMTYxMzYwODE4OV5BMl5BanBnXkFtZTgwNDE5MzE2MDE@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1395360000000, "runtime": 139, "title": "Divergent", "tomatoes": {"boxOffice": "$150.8M", "consensus": "With an adherence to YA formula that undercuts its individualistic message, Divergent opens its planned trilogy in disappointingly predictable fashion.", "critic": {"meter": 40, "numReviews": 199, "rating": 5.4}, "dvd": 1407110400000, "fresh": 80, "lastUpdated": 1440698630000, "production": "Lionsgate Films/Summit Entertainment", "rotten": 119, "viewer": {"meter": 70, "numReviews": 136882, "rating": 3.8}, "website": "http://www.facebook.com/DivergentMovie"}, "type": "movie", "writers": ["Veronica Roth (based on the novel by)", "Evan Daugherty (screenplay)", "Vanessa Taylor (screenplay)"], "year": 2014}