{"_id": "573a13c3f29313caabd691a2", "awards": {"nominations": 3, "text": "1 win & 3 nominations.", "wins": 1}, "cast": ["Michael Caine", "Emily Mortimer", "Charlie Creed-Miles", "David Bradley"], "countries": ["UK"], "directors": ["Daniel Barber"], "fullplot": "In England, retired Royal Marine Harry Brown spends his lonely life between the hospital, where his beloved wife Kath is terminally ill, and playing chess with his only friend Leonard Attwell in the Barge pub owned by Sid Rourke. After the death of Kath, Len tells his grieving friend that the local gang is harassing him and he is carrying an old bayonet for self-defense; the widower suggests him to go to the police. When Len is beaten, then stabbed to death in an underground passage, Inspector Alice Frampton and her partner Sergeant Terry Hicock are sent to investigate. They pay Harry a visit but don't have good news; the police have not found any other evidence, other than the bayonet, in order to arrest the hoodlums. This mean that should the case go to trial the gang would claim self-defense. Harry Brown sees that justice will not be granted and decides to take matters into his own hands.", "genres": ["Action", "Crime", "Drama"], "imdb": {"id": 1289406, "rating": 7.2, "votes": 70728}, "languages": ["English"], "lastupdated": "2015-09-07 01:02:57.333000000", "metacritic": 55, "plot": "An elderly ex-serviceman and widower looks to avenge his best friend's murder by doling out his own form of justice.", "poster": "https://m.media-amazon.com/images/M/MV5BMTM5NjE2NzI2Ml5BMl5BanBnXkFtZTcwNDY0ODUyMw@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1273795200000, "runtime": 103, "title": "Harry Brown", "tomatoes": {"boxOffice": "$1.8M", "consensus": "Its lurid violence may put off some viewers, but Harry Brown is a vigilante thriller that carries an emotional as well as a physical punch, thanks to a gripping performance from Michael Caine in the title role.", "critic": {"meter": 64, "numReviews": 121, "rating": 6}, "dvd": 1283212800000, "fresh": 78, "lastUpdated": 1439924112000, "production": "Samuel Goldwyn Films", "rotten": 43, "viewer": {"meter": 75, "numReviews": 42410, "rating": 3.7}, "website": "http://www.harrybrown-movie.com/"}, "type": "movie", "writers": ["Gary Young (screenplay)"], "year": 2009}