{"_id": "573a13c6f29313caabd72148", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Aaron Eckhart", "Yvonne Strahovski", "Miranda Otto", "Bill Nighy"], "countries": ["Australia", "USA"], "directors": ["Stuart Beattie"], "fullplot": "Dr Victor Frankenstein dies frozen to death and the creature buries him at the cemetery of his family. However he is attacked by demons but he kills one of them and Gargoyles save him and take him to a Cathedral where the Gargoyles Order gathers. The Queen of the Gargoyles Leonore keeps Dr. Frankenstein's journal together with the treasures of the Order and gives the name of Adam to the creature. Then she explains to Adam that there is an ancient war between the Gargoyles that are angels and demons under the command of the Prince Naberius. She also invites Adam to join the Gargoyles in the war against demons, but Adam prefers to isolate in a remote place. Two hundred years later, Adam returns and finds a modern society. Soon he learns that Naberius has the intention of creating an army of soulless corpses to be possessed by demons. The scientist Terra is researching a process to create life and Naberius is seeking Dr Frankenstein's journal to help Terra and raise his army.", "genres": ["Action", "Fantasy", "Sci-Fi"], "imdb": {"id": 1418377, "rating": 5.1, "votes": 59091}, "languages": ["English"], "lastupdated": "2015-09-13 00:14:35.157000000", "metacritic": 30, "plot": "Frankenstein's creature finds himself caught in an all-out, centuries old war between two immortal clans.", "poster": "https://m.media-amazon.com/images/M/MV5BMjM3Mzk2MDU3N15BMl5BanBnXkFtZTgwMzg1NTI4MDE@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1390521600000, "runtime": 92, "title": "I, Frankenstein", "tomatoes": {"consensus": "Loud, incoherent, and dramatically listless, I, Frankenstein is a remarkably dull fantasy adventure that fails to generate much excitement or interest in its characters.", "critic": {"meter": 3, "numReviews": 87, "rating": 3.1}, "dvd": 1399939200000, "fresh": 3, "lastUpdated": 1442164546000, "production": "Lionsgate Films", "rotten": 84, "viewer": {"meter": 38, "numReviews": 57908, "rating": 2.9}, "website": "http://www.ifrankensteinfilm.com"}, "type": "movie", "writers": ["Stuart Beattie (screenplay)", "Kevin Grevioux (screen story)", "Stuart Beattie (screen story)", "Kevin Grevioux (Darkstorm Studios graphic novel)", "Mary Shelley (characters)"], "year": 2014}