{"_id": "573a13bff29313caabd5e50d", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Akshay Kumar", "Ayesha Takia", "Javed Jaffrey", "Girish Karnad"], "countries": ["India"], "directors": ["Nagesh Kukunoor"], "fullplot": "8 X 10 revolves around Jai, a man who has the power to see into the past. He uses this power to help people even though using it nearly kills him every time. When his father, Jatin, dies in a mysterious boating accident, Jai's suspicion is aroused by the appearance of an oddball detective, Happi. The only article that can help him in his investigation is an 8 X 10 photograph taken just minutes before the accident by his mother Savitri that shows Jatin surrounded by his best friend and lawyer, Anil, his adopted son, Adit and younger brother, Sundar. Jai decides to use this photograph to go into the past to unravel the mystery surrounding Jatin's death. As he discovers clues he realizes that his father was actually murdered and that everyone on the boat had a motive. Now on a mission to unmask the killer, he undertakes the dangerous journey of visiting the past repeatedly. A cat and mouse game ensues, with the killer outwitting Jai at every turn. As the bodies pile up and time begins to run out, Jai ventures into the photo one last time with the killer on his heels. Does Jai discover who the killer is? Will the killer get him before the truth is uncovered? Does he get out of the photo in time before it is destroyed?", "genres": ["Crime", "Drama", "Mystery"], "imdb": {"id": 1105709, "rating": 5.4, "votes": 1964}, "languages": ["Hindi"], "lastupdated": "2015-09-03 00:32:48.350000000", "num_mflix_comments": 1, "plot": "A man with the ability to visit the past by looking at photographs, must solve the mystery behind his father's sudden death.", "released": 1238716800000, "runtime": 122, "title": "8 x 10 Tasveer", "tomatoes": {"dvd": 1243900800000, "lastUpdated": 1437332496000, "production": "Percept Picture Company & T-Series", "viewer": {"meter": 34, "numReviews": 1018, "rating": 3}}, "type": "movie", "writers": ["Bohemia (lyrics)", "Nagesh Kukunoor", "Sameer (lyrics)", "Irfan Siddiqui (lyrics)"], "year": 2009}