{"_id": "573a13cff29313caabd88da1", "awards": {"nominations": 3, "text": "3 wins & 3 nominations.", "wins": 3}, "cast": ["You Ge", "Xueqi Wang", "Fengyi Zhang", "Xiaoming Huang"], "countries": ["China"], "directors": ["Kaige Chen"], "fullplot": "Sacrifice (Orphan of Zhao Family): To save the only child of the Zhao Family, whose whole clan is massacred at the hands of a nefarious minister, a doctor sacrifices his own son, and later becomes intent on seeking vengeance against the minister after the child grows up. For generations, the Zhao family has wielded power, even extending over the king. In a well-planned coup, their mortal enemy TU'AN GU (Wang Xue Qi) slaughters the entire clan, determined to wipe out their influence forever. However, a solitary Zhao baby survives the massacre, and is hidden and taken home by CHENG YING (Ge You), the doctor who delivered him, to live with his WIFE (Hai Qing) and their own newborn baby. Set on revenge, and raising the Zhao child as his own, Cheng Ying bides his time, enrolling himself and the Zhao orphan (whom he calls Cheng Bo) into the service of the Tu'an Gu household. Tu' an Gu grows very fond of Cheng Bo and makes Cheng Bo his godson, unaware that Cheng Ying has been plotting to use the boy as an instrument of vengeance when he comes of age. But as the day draws closer, the boy's true identity is discovered...", "genres": ["Drama", "History"], "imdb": {"id": 1726738, "rating": 6.2, "votes": 1589}, "languages": ["Chinese"], "lastupdated": "2015-08-21 00:25:06.390000000", "metacritic": 57, "num_mflix_comments": 3, "plot": "To save the only child of the Zhao Family, whose entire clan was massacred at the hands of a nefarious minister, a doctor sacrifices his own son; after the Zhao child grows up, the doctor becomes intent on seeking his vengeance.", "poster": "https://m.media-amazon.com/images/M/MV5BMTQ0MDE2MDI2OF5BMl5BanBnXkFtZTcwMTYwMDQwOA@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1343347200000, "runtime": 122, "title": "Sacrifice", "tomatoes": {"boxOffice": "$27.9k", "critic": {"meter": 71, "numReviews": 24, "rating": 6.7}, "fresh": 17, "lastUpdated": 1439057617000, "production": "Samuel Goldwyn Films", "rotten": 7, "viewer": {"meter": 51, "numReviews": 1861, "rating": 3.2}, "website": "http://www.sacrifice-movie.com"}, "type": "movie", "writers": ["Ningyu Zhao"], "year": 2010}