{"_id": "573a13b2f29313caabd3a5cc", "awards": {"nominations": 6, "text": "Nominated for 1 Golden Globe. Another 1 win & 6 nominations.", "wins": 2}, "cast": ["Joel Edgerton", "Chiwetel Ejiofor", "Sarah-Jane Potts", "Nick Frost"], "countries": ["USA", "UK"], "directors": ["Julian Jarrold"], "fullplot": "Charles Price may have grown up with his father in the family shoe business, but he never thought that he would take his father's place. Yet, the untimely death of his father places him in that position, only to learn that Price & Sons Shoes is failing. While in despair at his failed attempts to save the business, Charles has a chance encounter with the flamboyant drag queen cabaret singer, Lola. Her complaints about the inadequate footwear for her work combined with one of Charles' ex-employees, Lauren, leads to a suggestion to change the product to create a desperate chance to save the business: make men's fetish footwear. Lola is convinced to be their footwear designer and the transition begins. Now this disparate lot must struggle at this unorthodox idea while dealing with both the prejudice of the staff, Lola's discomfort in the small town and the selfish manipulation of Charles' greedy fiancèe who cannot see the greater good in Charles' dream.", "genres": ["Comedy", "Drama", "Music"], "imdb": {"id": 434124, "rating": 7, "votes": 12743}, "languages": ["English"], "lastupdated": "2015-08-31 00:23:58.373000000", "metacritic": 57, "plot": "A drag queen comes to the rescue of a man who, after inheriting his father's shoe factory, needs to diversify his product if he wants to keep the business afloat.", "poster": "https://m.media-amazon.com/images/M/MV5BMTY5OTg0NDEyNV5BMl5BanBnXkFtZTcwNDQwOTMzMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1148601600000, "runtime": 107, "title": "Kinky Boots", "tomatoes": {"boxOffice": "$1.7M", "consensus": "Kinky Boots relies heavily on the Full Monty formula of Britcoms, while playing it too safe in a desperate attempt not to offend. Ejiofor's performance is its redeeming virtue.", "critic": {"meter": 57, "numReviews": 107, "rating": 5.8}, "dvd": 1157414400000, "fresh": 61, "lastUpdated": 1440530253000, "production": "Miramax Films", "rotten": 46, "viewer": {"meter": 75, "numReviews": 72561, "rating": 3.3}, "website": "http://kinkyboots-movie.com/"}, "type": "movie", "writers": ["Geoff Deane", "Tim Firth"], "year": 2005}