{"_id": "573a13baf29313caabd514c0", "awards": {"nominations": 0, "text": "3 wins.", "wins": 3}, "cast": ["Thomas Calabro", "Ashley Laurence", "Shaun Kurtz", "James Russo"], "countries": ["USA"], "directors": ["Serge Rodnunsky"], "fullplot": "In this classic retro horror thriller, Sam, an aspiring writer, takes a job as a clerk in an L.A. inner city grocery market owned by the sinister Dr. Munoz, a former scientist who claims to have a rare skin condition that forces him to live in sub-freezing temperatures. Meanwhile, Sam befriends an attractive neighborhood boutique owner Maria and becomes unwittingly entwined in a threatening love triangle when she reveals that ex-boyfriend Detective Defazio, who is investigating the recent disappearance of two local prostitutes, is stalking her. But it's what Sam doesn't know that might prove more fatal. A darker, diabolical secret lurks behind the freezer walls of his newfound employment. Sam is horrified when he discovers that Munoz died some time ago, but has kept himself alive through occult measures and the flesh that he harvests from his kidnapped victims. With Defazio off track in his investigation, Sam becomes captive in this house of horrors. Time is running out and he must escape to save his own hide - literally. Will he escape before the next fall of Munoz's razor-edged blades?", "genres": ["Horror", "Thriller"], "imdb": {"id": 862892, "rating": 3.3, "votes": 422}, "languages": ["English"], "lastupdated": "2015-07-30 00:34:37.097000000", "num_mflix_comments": 2, "plot": "In this classic retro horror thriller, Sam, an aspiring writer, takes a job as a clerk in an L.A. inner city grocery market owned by the sinister Dr. Munoz, a former scientist who claims to...", "poster": "https://m.media-amazon.com/images/M/MV5BMjE2MTMxNDY0NV5BMl5BanBnXkFtZTcwNDkyMzg0MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1171497600000, "runtime": 88, "title": "Chill", "tomatoes": {"lastUpdated": 1430249285000, "viewer": {"meter": 25, "numReviews": 41, "rating": 2.9}}, "type": "movie", "writers": ["H.P. Lovecraft (short story \"Cool Air\")", "Serge Rodnunsky"], "year": 2007}