{"_id": "573a13b3f29313caabd3ce06", "awards": {"nominations": 1, "text": "2 wins & 1 nomination.", "wins": 2}, "cast": ["Mahasamut Boonyaruk", "Saengthong Gate-Uthong", "Sawatwong Palakawong Na Autthaya", "Nattha Wattanapaiboon"], "countries": ["Thailand"], "directors": ["Wisit Sasanatieng"], "fullplot": "Pod is a man without a dream. He's a country bumpkin who comes to work at a tinned sardine factory in Bangkok. One day, Pod chops off his finger and packs it in the can, prompting him to go around looking for his lost finger at various supermarkets. The incident convinces him to change his job, and Pod becomes a security guard at a large company. There he meets Jin, a lanky maid who carries a mysterious white book around even though she cannot read a single word written in it. The aimless Pod has a crush on Jin, a dreamy girl who dreams that one day she'll be able to decipher the meaning of the white book. In this bright, colour-splashed world of director Wisit Sasanatieng, Bangkokians can grow tails and a dead grandmother can come back as a chatty gecko to deliver a few life lessons to her grandson. It's a world where innocence is so precious and yet impossible to preserve. The unusual love story between Pod and Jin is set against the playfully ironic portrait of Bangkok, the city that offers false dreams and real disillusionment", "genres": ["Comedy", "Fantasy", "Romance"], "imdb": {"id": 444778, "rating": 7.5, "votes": 1490}, "languages": ["Thai", "English", "Mandarin"], "lastupdated": "2015-09-04 00:08:48.490000000", "plot": "Pod is a man without a dream. He's a country bumpkin who comes to work at a tinned sardine factory in Bangkok. One day, Pod chops off his finger and packs it in the can, prompting him to go...", "released": 1141862400000, "runtime": 100, "title": "Citizen Dog", "tomatoes": {"critic": {"meter": 100, "numReviews": 5, "rating": 7.4}, "dvd": 1188259200000, "fresh": 5, "lastUpdated": 1437675138000, "rotten": 0, "viewer": {"meter": 88, "numReviews": 2291, "rating": 4.1}}, "type": "movie", "writers": ["Koynuch (novel)", "Wisit Sasanatieng"], "year": 2004}