{"_id": "573a1397f29313caabce86cd", "awards": {"nominations": 4, "text": "Nominated for 2 Oscars. Another 4 wins & 4 nominations.", "wins": 6}, "cast": ["Tom Conti", "Kelly McGillis", "Roberts Blossom", "Joel Fabiani"], "countries": ["USA"], "directors": ["Robert Ellis Miller"], "fullplot": "Gowan McGland is a half-Irish/half-Welsh Scottish poet with some renown. He is also a total s*** - a boozer, a womanizer (his conquests more frequently married than not), lazy, and a leech, with a deteriorating body and bad teeth, losing which he equates with death. He also has his charms, which, in combination with his renown, leads to him usually being able to get what he wants. His wife, Edith McGland, also a writer, is well aware of who he is, their marriage which is in name only, although they are still good friends. It is because of her profession and her connection that she has been commissioned to write his biography. Because he is lazy, he has not written anything in five years. He is on a speaking tour to earn what little money he has, currently on an extended stop in Woodsmoke, Connecticut. His reputation in almost every sense precedes him in Woodsmoke - including his womanizing where probably only the husbands of his conquests are unaware of what's going on, and his excessive drinking. He is able to sponge off the generosity of the people who hear him speak, but worse he steals the tips they leave when they take him out for meals. His life may change when he meets college student Geneva Spofford, with who he falls in love. She, in return, is not immune to his charms. The question is whether there is a future for Gowan and Geneva, or if his life will catch up with him. Reuben, the sheepdog belonging to Geneva's grandfather and Gowan's friend Frank Spofford, may have some say in what happens.", "genres": ["Comedy", "Drama", "Romance"], "imdb": {"id": 84591, "rating": 6.9, "votes": 748}, "languages": ["English"], "lastupdated": "2015-07-03 00:14:37.333000000", "plot": "A drunken Scottish poet, who has not written a word in years, feels compelled to regain control of his life and work after meeting a beautiful young woman.", "poster": "https://m.media-amazon.com/images/M/MV5BYzc5ZDliMzYtYjEyNy00ZWU5LTg4NjgtNzM2YjJjZjY4OGNhXkEyXkFqcGdeQXVyMjI4MjA5MzA@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 456624000000, "runtime": 101, "title": "Reuben, Reuben", "tomatoes": {"critic": {"meter": 100, "numReviews": 6, "rating": 6.5}, "dvd": 677203200000, "fresh": 6, "lastUpdated": 1437416274000, "rotten": 0, "viewer": {"meter": 83, "numReviews": 220, "rating": 4}}, "type": "movie", "writers": ["Peter De Vries (novel)", "Herman Shumlin (play)", "Julius J. Epstein (screenplay)"], "year": 1983}