{"_id": "573a13baf29313caabd51c8a", "awards": {"nominations": 18, "text": "26 wins & 18 nominations.", "wins": 26}, "cast": ["Shah Rukh Khan", "Vidya Malvade", "Tanya Abrol", "Chitrashi Rawat"], "countries": ["India"], "directors": ["Shimit Amin"], "fullplot": "Kabir Khan lives a middle-class lifestyle along with his widowed mom in Delhi, India, and is the Captain of the Indian men's hockey team. He fails to score at the last tournament resulting in Pakistan winning the World Cup amidst allegations that he was more inclined toward his opponents due to his religion. Kabir and his mom move away and virtually disappear for seven years. Thereafter Kabir surfaces to be a Coach for the women's hockey team, consisting of 16 players from all over India, some of who do not communicate well. Kabir's disciplinarian style ends up offending the players, lead by the militant Bindia Naik, who decide not to participate unless he resigns amidst allegations that he is having an affair with soon to-be married Vidya Sharma, who he appoints as the new Captain. Things change after a brawl with eve-teasers at the local McDonald's, the girls accept Kabir, however, the Chair of the Indian Women Hockey Association, Tripathi, decides to pull out of the World Cup but decides to give them a shot after Kabir challenges the men's team. The women lose by a goal but their performance compels the Association to revise their decision and dispatch them to Melbourne, Australia. In the very first match against six-time winning team of Australia, the Indian team lose 7-0 to, but manage to struggle back to the semi-finals after defeating Great Britain, Argentina, and Korea. On the eve of the final match Kabir will meet secretly with two rival players, Preety Sabharwal (who is engaged to be married to Cricket Team Captain, Abhimanyu Singh), and Komal Chautala, and during this meeting he will tell them that two of his hockey players will be playing for the Australians. Watch what impact this has on both Preety and Komal.", "genres": ["Drama", "Family", "Sport"], "imdb": {"id": 871510, "rating": 8.4, "votes": 37173}, "languages": ["Hindi"], "lastupdated": "2015-09-17 01:50:06.400000000", "metacritic": 68, "plot": "A disgraced hockey player coaches the women's national team to win back his honor and dignity.", "poster": "https://m.media-amazon.com/images/M/MV5BMTUzODMyNzk4NV5BMl5BanBnXkFtZTgwNTk1NTYyNTM@._V1_SY1000_SX677_AL_.jpg", "released": 1186704000000, "runtime": 153, "title": "Chakde! India", "tomatoes": {"boxOffice": "$1.1M", "critic": {"meter": 91, "numReviews": 11, "rating": 7.1}, "dvd": 1187222400000, "fresh": 10, "lastUpdated": 1440439392000, "production": "Yash Raj Films", "rotten": 1, "viewer": {"meter": 92, "numReviews": 13346, "rating": 4.3}, "website": "http://www.yashrajfilms.com/"}, "type": "movie", "writers": ["Jaideep Sahni"], "year": 2007}