{"_id": "573a1398f29313caabceb98a", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Robert Englund", "Jill Schoelen", "Alex Hyde-White", "Bill Nighy"], "countries": ["USA"], "directors": ["Dwight H. Little"], "fullplot": "In New York, the Julliard student Christine Day meets her friend Meg in the library where she works and she shows a piece of music from the unknown author Erik Destler that she has found on the shelf. Christine decides to use the music in her audition on the next day for a part in a Faust version in the New York Opera. During the audition, there is an accident on the stage and Christina faints. She relives her past life in the Nineteenth Century in London, when she is an aspirant opera singer and becomes the protègèe of The Phantom of the London Opera House. The Phantom is the unknown composer Erik Destler that makes a pact with the devil in order to the world would love his music. In return, the devil destroys his face and tells that he would never be loved by anyone and would be disfigured forever. After a tragic ending, Christine awakes in the present days and has a great surprise when she is introduced to the producer of the opera.", "genres": ["Drama", "Horror", "Music"], "imdb": {"id": 98090, "rating": 5.4, "votes": 2700}, "languages": ["English"], "lastupdated": "2015-09-10 17:58:56.610000000", "plot": "A darker version of the classic Gaston Leroux novel. A young soprano becomes the obsession of a horribly disfigured composer who has plans for those oppose himself or the young singer.", "poster": "https://m.media-amazon.com/images/M/MV5BMmUzMDFiMjItMDdmMS00MmVlLWEyODAtOTRhODZjZjEyYmM2XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 626140800000, "runtime": 93, "title": "The Phantom of the Opera", "tomatoes": {"critic": {"meter": 36, "numReviews": 11, "rating": 5.3}, "dvd": 1102377600000, "fresh": 4, "lastUpdated": 1442257093000, "production": "RCA/Columbia", "rotten": 7, "viewer": {"meter": 54, "numReviews": 49265, "rating": 3.3}}, "type": "movie", "writers": ["Gaston Leroux (novel)", "Gerry O'Hara (based upon the screenplay by)", "Duke Sandefur (screenplay)"], "year": 1989}