{"_id": "573a13c2f29313caabd66276", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Jimmy Chamberlin", "Billy Corgan", "Lauren M. Davidson", "Kateri Forbes"], "countries": ["USA"], "directors": ["Jack Gulick"], "fullplot": "A full concert filmed in late July and early August of 2007 over five of the 11 sold-out nights at the famed Fillmore Auditorium in San Francisco, CA. Features seven all new tracks not available anywhere else, along with new versions of fan favorites and a selection of Pumpkins rarities. From the opening note to the final chord, the documentary If All Goes Wrong showcases a band returning with an \"enveloping epic force\" (Los Angeles Times) as it traces The Smashing Pumpkins during their 19-show residency, which began with eight shows at Asheville, NC's Orange Peel in late June and continued through 11 sold-out nights at San Francisco's famed Fillmore Auditorium. Interviews with band members, fans, journalists and fellow musicians reveal the fears, excitement, determination, exhaustion and tension inherent in main singer-songwriter and lead guitarist Billy Corgan and his newly revitalized musical unit. The documentary also includes Voices Of The Ghost Children, a featurette about the band's fans, and an interview with The Who's legendary guitarist and songwriter Pete Townshend as bonus material. The band explore the freedom afforded to them in a live setting, including the 30+ minute opus \"Gossamer\". The Fillmore Residency also includes five songs recorded live from the floor of The Fillmore that gives fans an intimate glimpse of the band as a performing entity.", "genres": ["Documentary", "Music"], "imdb": {"id": 1236247, "rating": 8.4, "votes": 78}, "languages": ["English"], "lastupdated": "2015-05-01 00:10:27.047000000", "plot": "A full concert filmed in late July and early August of 2007 over five of the 11 sold-out nights at the famed Fillmore Auditorium in San Francisco, CA. Features seven all new tracks not ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTkzNjMwNzc0MV5BMl5BanBnXkFtZTcwOTEyMjAwMg@@._V1_SY1000_SX677_AL_.jpg", "released": 1226361600000, "runtime": 271, "title": "Smashing Pumpkins: If All Goes Wrong", "tomatoes": {"dvd": 1228089600000, "lastUpdated": 1425321260000, "viewer": {"meter": 91, "numReviews": 2698, "rating": 3.7}}, "type": "movie", "year": 2008}