{"_id": "573a1399f29313caabcecf0d", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Kevin Van Hentenryck", "Annie Ross", "Gil Roper", "Dan Biggers"], "countries": ["USA"], "directors": ["Frank Henenlotter"], "fullplot": "The saga of Times Square Freak Twins Duane and Belail Bradley takes its most bizarre twist yet. It all starts innocently enough when the Bradley boys join kindly doctor Granny Ruth and her family of unique individuals for a road trip through the deep South.. The occasion - Belail's about to become a proud monster father - and no basket is big enough to hold this ungodly brood! But when a pair of warped sheriffs deputies kidnap Belai's babies Granny Ruth and the family strike back. Belial single handedly decimates the local police station with crazed, Terminator like fury - and that's just the beginning. Threatened with the loss of the newest additions to their family, Granny Ruth and the others concoct a delicious revenge against their enemies, climaxing in Belial's futuristic one-on-one with the town Sheriff.", "genres": ["Comedy", "Horror"], "imdb": {"id": 103773, "rating": 4.3, "votes": 1971}, "languages": ["English"], "lastupdated": "2015-08-28 01:01:55.173000000", "num_mflix_comments": 2, "plot": "Duane recovers from his delusional breakdown to find his freakish basket-bound brother Belial will soon become a father. But not everything is joyous as the once tight knit brothers no longer seem to trust each other.", "poster": "https://m.media-amazon.com/images/M/MV5BNGE3NTRlODItOTYyMi00M2RiLWI4MGQtNWRmNGRlN2ZiMTBjXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 696902400000, "runtime": 90, "title": "Basket Case 3", "tomatoes": {"consensus": "Director Tim Burton's dark, brooding atmosphere, Michael Keaton's work as the tormented hero, and the flawless casting of Danny DeVito as The Penguin and Christopher Walken as, well, Christopher Walken make the sequel better than the first.", "critic": {"meter": 80, "numReviews": 70, "rating": 6.7}, "dvd": 862272000000, "fresh": 56, "lastUpdated": 1442081251000, "production": "Warner Bros. Pictures", "rotten": 14, "viewer": {"meter": 73, "numReviews": 638292, "rating": 3.3}}, "type": "movie", "writers": ["Frank Henenlotter", "Robert Martin"], "year": 1991}