{"_id": "573a13c8f29313caabd78d6f", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "countries": ["USA"], "directors": ["Chico Colvard"], "fullplot": "At 10 years old, Chico Colvard accidentally shot his older sister in the leg. This seemingly random act detonated a chain reaction that exposed unspeakable realities and shattered his family. Thirty years later, Colvard ruptures veils of secrecy and silence again. As he bravely visits his relatives, what unfolds is a personal film that's as uncompromising, raw, and cathartic as any in the history of the medium. Driving the story forward is Colvard's sensitive probing of a complex dynamic: the way his three sisters survived severe childhood abuse by their father and, as adults, manage to muster loyalty to him. These unforgettable, invincible women paint a picture of their harrowing girlhoods as they resiliently struggle with present-day fallout. The distance time gives them from their trauma yields piercing insights about the legacy of abuse, the nature of forgiveness, and eternal longing for family and love. These truths may be too searing to bear, but they reverberate powerfully within each of us", "genres": ["Documentary", "Family"], "imdb": {"id": 1515059, "rating": 7.3, "votes": 154}, "languages": ["English"], "lastupdated": "2015-09-07 01:07:25.943000000", "metacritic": 65, "plot": "At 10 years old, Chico Colvard accidentally shot his older sister in the leg. This seemingly random act detonated a chain reaction that exposed unspeakable realities and shattered his ...", "poster": "https://m.media-amazon.com/images/M/MV5BMjI3MDc0Nzg2M15BMl5BanBnXkFtZTcwNDY3OTY2Mw@@._V1_SY1000_SX677_AL_.jpg", "released": 1262822400000, "runtime": 80, "title": "Family Affair", "tomatoes": {"critic": {"numReviews": 4}, "fresh": 2, "lastUpdated": 1424627101000, "production": "IFC Films", "rotten": 2, "viewer": {"meter": 80, "numReviews": 85, "rating": 4}, "website": "http://www.c-linefilms.com/the_movie_2.html"}, "type": "movie", "writers": ["Chico Colvard"], "year": 2010}