{"_id": "573a13b5f29313caabd4403c", "awards": {"nominations": 4, "text": "4 nominations.", "wins": 0}, "cast": ["Michel Piccoli", "Bulle Ogier", "Ricardo Trèpa", "Leonor Baldaque"], "countries": ["Portugal", "France"], "directors": ["Manoel de Oliveira"], "fullplot": "Belle toujours occurred to me unexpectedly and, as I had the will to pay my tribute to Luis Buèuel and Jean-Claude Carrière, I was happy to have found a way to do so, perhaps the best, and I started working. What is it about? Taking two of the strange characters from the film Belle de Jour, and make them relive, thirty eight years later, in the strangeness of a secret which was only in the possession of the masculine character and a knowledge that had become crucial to the female character. Thus, passed this time, they meet again. She tries to avoid him by all means. But he stalks her and eventually manages to gain her attention with the intention of revealing the secret that he alone can unfold. They set a meeting, a dinner, where she expects that all will be revealed. During dinner, she, now a widow, awaits the expected revelation: what he had told her husband while he was mute and paralytic because of a gunshot wound fired by a lover of hers. The situation is tense and she ends up in despair without being able to find out what in truth happened. He is satisfied in his sadism and in his particular revenge from the ways of that woman, who deep down desired him but whose haughty ways never allowed him to possess her.", "genres": ["Drama", "Music"], "imdb": {"id": 475224, "rating": 6.5, "votes": 821}, "languages": ["French"], "lastupdated": "2015-08-27 00:37:22.713000000", "num_mflix_comments": 1, "plot": "38 years after the original story, Henri Husson thinks he sees Sèverine one night in a concert. He follows her and makes her face her past and with sadism takes a slow and painful revenge on her.", "poster": "https://m.media-amazon.com/images/M/MV5BMjAyNjg5NjI4M15BMl5BanBnXkFtZTcwODY5NzQ5MQ@@._V1_SY1000_SX677_AL_.jpg", "released": 1176249600000, "runtime": 68, "title": "Belle toujours", "tomatoes": {"consensus": "An unexpectedly moving sequel to Luis Bunuel's Belle du Jour, Belle Toujours is a short and sweet elegy on aging, sexuality, and the power of cinema.", "critic": {"meter": 69, "numReviews": 39, "rating": 6.3}, "dvd": 1214265600000, "fresh": 27, "lastUpdated": 1437935506000, "production": "New Yorker Films", "rotten": 12, "viewer": {"meter": 43, "numReviews": 2141, "rating": 3}}, "type": "movie", "writers": ["Manoel de Oliveira"], "year": 2006}