{"_id": "573a139cf29313caabcf7448", "awards": {"nominations": 13, "text": "2 wins & 13 nominations.", "wins": 2}, "cast": ["Heath Ledger", "Julia Stiles", "Joseph Gordon-Levitt", "Larisa Oleynik"], "countries": ["USA"], "directors": ["Gil Junger"], "fullplot": "Adapted from William Shakespeare's play \"The Taming of the Shrew,\" 10 Things I Hate About You starts off with Cameron, new student at Padua High, sitting in the office of the quirky guidance counselor Ms. Perky. He is then shown around the school by Michael, who will become his best friend. During his tour is when Cameron first sees Bianca Stratford, a beautiful sophomore with one problem: she isn't allowed to date. And neither is her \"shrew\" sister, Katarina, a senior who loves indie rock and feminist prose and hates conformity. But Kat and Bianca's father alters his house rule: now, Bianca can date... as long as Kat has a date, too. Now, in order for Cameron to date Bianca, he has to find someone to date Kat. So Michael helps him enlist the help of pretty-boy/jerk/model Joey Donner, tricking him into thinking that *he* will get to take Bianca out if he pays someone to take out Kat. His choice: Patrick Verona, a bad-boy with a mysterious reputation--some say he ate a live duck once, others that he lit a state trooper on fire, and even more claim that he had a brief porn career. Will Patrick win Kat's heart? Will Cameron win Bianca's? Or will everything hit the fan...?", "genres": ["Comedy", "Drama", "Romance"], "imdb": {"id": 147800, "rating": 7.2, "votes": 201405}, "languages": ["English", "French"], "lastupdated": "2015-09-05 00:53:03.213000000", "metacritic": 70, "num_mflix_comments": 394, "plot": "A new kid must find a guy to date the meanest girl in school, the older sister of the girl he has a crush on, who cannot date until her older sister does.", "poster": "https://m.media-amazon.com/images/M/MV5BMmVhZjhlZDYtMDAwZi00MDcyLTgzOTItOWNiZjY0YmE0MGE0XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 922838400000, "runtime": 97, "title": "10 Things I Hate About You", "tomatoes": {"consensus": "Julia Stiles and Heath Ledger add strong performances to an unexpectedly clever script, elevating 10 Things (slightly) above typical teen fare.", "critic": {"meter": 61, "numReviews": 62, "rating": 6.1}, "dvd": 939686400000, "fresh": 38, "lastUpdated": 1441994691000, "production": "Buena Vista Pictures", "rotten": 24, "viewer": {"meter": 69, "numReviews": 32102606, "rating": 3.3}}, "type": "movie", "writers": ["Karen McCullah", "Kirsten Smith"], "year": 1999}