{"_id": "573a13c5f29313caabd6eb62", "awards": {"nominations": 14, "text": "Nominated for 3 BAFTA Film Awards. Another 3 wins & 14 nominations.", "wins": 6}, "cast": ["Sally Hawkins", "Andrea Riseborough", "Jaime Winstone", "Lorraine Stanley"], "countries": ["UK"], "directors": ["Nigel Cole"], "fullplot": "In 1968, the Ford auto factory in Dagenham was one of the largest single private employers in the United Kingdom. In addition to the thousands of male employees, there are also 187 underpaid women machinists who primarily assemble the car seat upholstery in poor working conditions. Dissatisfied, the women, represented by the shop steward and Rita O'Grady, work with union rep Albert Passingham for a better deal. However, Rita learns that there is a larger issue in this dispute considering that women are paid an appalling fraction of the men's wages for the same work across the board on the sole basis of their sex. Refusing to tolerate this inequality any longer, O'Grady leads a strike by her fellow machinists for equal pay for equal work. What follows would test the patience of all involved in a grinding labour and political struggle that ultimately would advance the cause of women's rights around the world.", "genres": ["Biography", "Comedy", "Drama"], "imdb": {"id": 1371155, "rating": 7.2, "votes": 10290}, "languages": ["English"], "lastupdated": "2015-08-17 00:05:25.437000000", "metacritic": 65, "plot": "A dramatization of the 1968 strike at the Ford Dagenham car plant, where female workers walked out in protest against sexual discrimination.", "poster": "https://m.media-amazon.com/images/M/MV5BMTgyNzU0NTczMl5BMl5BanBnXkFtZTcwNTMyMjAxNA@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1284940800000, "runtime": 113, "title": "Made in Dagenham", "tomatoes": {"boxOffice": "$1.1M", "critic": {"meter": 80, "numReviews": 123, "rating": 6.8}, "dvd": 1301356800000, "fresh": 99, "lastUpdated": 1441135170000, "production": "Sony Pictures Classics", "rotten": 24, "viewer": {"meter": 75, "numReviews": 19193, "rating": 3.6}, "website": "http://www.sonyclassics.com/madeindagenham/"}, "type": "movie", "writers": ["William Ivory"], "year": 2010}