{"_id": "573a13c2f29313caabd662ba", "awards": {"nominations": 17, "text": "1 win & 17 nominations.", "wins": 1}, "cast": ["Selton Mello", "Luana Piovani", "Vladimir Brichta", "Maria Manoella"], "countries": ["Brazil"], "directors": ["Clèudio Torres"], "fullplot": "In Rio de Janeiro, the sensitive Pedro worships his wife Marina and expects to have a conventional married life with children. His next door neighbor Vitoria, who is married with a rude detective, dreams on the romanticism of Pedro and listens to him through the wall between her kitchen and his living room. When Marina discloses to Pedro that she is pregnant of her German lover and leaves Pedro, he becomes depressed, but his best friend Carlos convinces him to have sex with many women. However Pedro has a breakdown; quits his job; and decides to stay alone. One night, the beautiful and sexy neighbor Amanda knocks on Pedro's front door and asks for a cup of sugar. They immediately fall in love for each other and Pedro recovers the meaning of his life; but Carlos discovers that Amanda exists only in Pedro's imagination and that his friend is actually disturbed. When Pedro finds the truth, he becomes confused and without sense of reality. Meanwhile Vitoria's husband dies and her sister Lucia convinces her to meet Pedro; but the guy is not sure that Vitoria does exist.", "genres": ["Comedy"], "imdb": {"id": 1236397, "rating": 6.4, "votes": 1970}, "languages": ["Portuguese"], "lastupdated": "2015-08-08 01:20:31.413000000", "num_mflix_comments": 2, "plot": "A romantic comedy in which a 35-year old man is abandoned by his wife and falls in love with his neighbor, a perfect, ideal woman. The only problem: she doesn't exist!", "released": 1244160000000, "runtime": 105, "title": "A Mulher Invisèvel", "tomatoes": {"lastUpdated": 1438627110000, "viewer": {"meter": 39, "numReviews": 269, "rating": 3}}, "type": "movie", "writers": ["Clèudio Torres", "Adriana Falcèo (collaborating writer)", "Maria Luèsa Mendonèa (collaborating writer)", "Clèudio Paiva (collaborating writer)"], "year": 2009}