{"_id": "573a13bdf29313caabd594c5", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Kay Panabaker", "Walter Perez", "Naturi Naughton", "Asher Monroe"], "countries": ["USA"], "directors": ["Kevin Tancharoen"], "fullplot": "The four years in the lives of some students in one class, from their entrance audition to their graduation, at New York City's High School for the Performing Arts (P.A.) is presented. Upon their entrance, the disparate group have a few things in common: they've got \"big dreams\" and they \"want fame\". Some have natural talent, some have had to obtain talent through hard work and training, and some show only some promise which the teachers hope will materialize into true talent. Some have full support from their parents, some have support from their parents but only for the parents' specific dreams, and some have little or no parental support whatsoever. Some have formal training, some not. Some are confident of what they can do, some believe they are limited and are at school to expand those talents, while others have no confidence whatsoever. And some are clear about where they want to \"be\" after graduation, while some want to explore whatever other opportunities may arise for them through this experience. During their four years, some will try to learn whatever they can from their teachers, while some will butt heads with the teachers over creative differences. Some will focus on what they entered the school for, while some will explore other hidden talents. Some will blossom, while some will stagnate. Unlike their counterparts from thirty years earlier, they are allowed to find work in the performing arts while at P.A. Most will find that there are many pitfalls in looking for work - whether it be hired work or having their own work produced - especially as they are inexperienced and may want fame at any cost. And some will not make it to the end of the four years for differing reasons. After graduation, some will move onto the next phase of their pursuit of fame, while others know this juncture is the end of the line for their dream. And some will have formed life long bonds with their friends from P.A., while others know they will lose touch with their colleagues out of circumstance.", "genres": ["Comedy", "Drama", "Musical"], "imdb": {"id": 1016075, "rating": 5, "votes": 13364}, "languages": ["English"], "lastupdated": "2015-08-17 00:41:46.843000000", "metacritic": 39, "num_mflix_comments": 1, "plot": "An updated version of the 1980 musical, which centered on the students of the New York Academy of Performing Arts.", "poster": "https://m.media-amazon.com/images/M/MV5BMTU1NjE1NjY0OF5BMl5BanBnXkFtZTcwMDQ3ODg3Mg@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 1253836800000, "runtime": 107, "title": "Fame", "tomatoes": {"boxOffice": "$22.4M", "consensus": "Fame is ultimately undone by its choppy editing, its incomplete characterizations, and its apparent desire to appeal to the High School Musical generation.", "critic": {"meter": 25, "numReviews": 118, "rating": 4.4}, "dvd": 1263254400000, "fresh": 29, "lastUpdated": 1441904875000, "production": "MGM", "rotten": 89, "viewer": {"meter": 35, "numReviews": 194967, "rating": 3}, "website": "http://www.generationfame.com"}, "type": "movie", "writers": ["Allison Burnett (screenplay)", "Christopher Gore"], "year": 2009}