{"_id": "573a13a1f29313caabd0806a", "awards": {"nominations": 12, "text": "10 wins & 12 nominations.", "wins": 10}, "cast": ["Labina Mitevska", "Jitka Schneiderovè", "Sasa Rasilov", "Jirè Machècek"], "countries": ["Czech Republic", "Slovakia"], "directors": ["David Ondrècek"], "fullplot": "Robert works for a travel agency and helps to arrange scenes from the everyday lives of \"ordinary\" Czech families as an attraction for Japanese tourists. He also works as a kind of matchmaker and occasionally helps to put together some of his friends. He helps to separate his friend Hanka from Peter, an announcer for an independent radio station who tries to capture \"real\" life by recording the moments from \"reality\" and playing them over the air. Vesna, came to Prague from Macedonia because it is according to her the best place for UFOs to land, but her real reason for coming is somewhat different... Hanka is followed by the crazy Ondrej, until then a respected brain surgeon, and married with two kids. Through him she meets Jacob, who uses copious amounts of weed in order to be constructive in this gloomy world. On the other hand, this destroys his short-term memory - and he forgets that he already has a girlfriend. The disappointed Hanka runs to her parents, only to find some twenty-odd Japanese tourists watching her parents eat their dinner...", "genres": ["Comedy"], "imdb": {"id": 219288, "rating": 7.7, "votes": 2091}, "languages": ["Czech"], "lastupdated": "2015-09-16 08:23:06.273000000", "metacritic": 33, "plot": "Robert works for a travel agency and helps to arrange scenes from the everyday lives of \"ordinary\" Czech families as an attraction for Japanese tourists. He also works as a kind of ...", "released": 955584000000, "runtime": 103, "title": "Loners", "tomatoes": {"lastUpdated": 1441997261000, "production": "Ceska Televize", "viewer": {"numReviews": 1041, "rating": 4.4}}, "type": "movie", "writers": ["Olga Dabrowskè (story)", "Petr Zelenka (screenplay)", "Petr Zelenka (story)"], "year": 2000}