{"_id": "573a13b4f29313caabd3fdac", "awards": {"nominations": 3, "text": "3 nominations.", "wins": 0}, "cast": ["Ted Ludzik", "Natalie Portman", "Zach Mills", "Dustin Hoffman"], "countries": ["USA", "Canada"], "directors": ["Zach Helm"], "fullplot": "Molly Mahoney is the manager of Mr. Magorium's Wonder Emporium, the awesome toy store owned by Mr. Edward Magorium. Molly was a promising composer and piano player when she was a girl, and now she is a twenty-three year-old insecure woman that feels stuck in her job. Among the costumers of the Emporium is the lonely hat collector, Eric Applebaum, who has only Molly and Mr. Magorium for friends. When the last pair of shoes that Mr. Magorium bought in Toscana is worn, he hires the accountant, Henry Weston to adjust the accounts of the Emporium. Furthermore, he claims that he is two hundred and forty-three years old and his time to go has come; he gives a block of wood called Congreve cube to Molly and asks Henry to transfer the Emporium to her name. Molly tries to convince Mr. Magorium to stay in his magical toy store instead of \"going\".", "genres": ["Comedy", "Family", "Fantasy"], "imdb": {"id": 457419, "rating": 6.2, "votes": 32851}, "languages": ["English"], "lastupdated": "2015-09-04 00:16:17.240000000", "metacritic": 48, "plot": "Molly Mahoney is the awkward and insecure manager of Mr. Magorium's Wonder Emporium, the strangest, most fantastic, most wonderful toy store in the world. But when Mr. Magorium, the 243 year-old eccentric who owns the store, bequeaths the store to her, a dark and ominous change begins to take over the once remarkable Emporium.", "poster": "https://m.media-amazon.com/images/M/MV5BMTI4MzY1OTY3NF5BMl5BanBnXkFtZTYwNzU1Nzc4._V1_SY1000_SX677_AL_.jpg", "rated": "G", "released": 1195171200000, "runtime": 93, "title": "Mr. Magorium's Wonder Emporium", "tomatoes": {"boxOffice": "$31.9M", "consensus": "Mr. Magorium's Wonder Emporium's title is much more fun that the film itself, as the colorful visuals and talented players can't make up for a bland story.", "critic": {"meter": 37, "numReviews": 124, "rating": 5}, "dvd": 1204588800000, "fresh": 46, "lastUpdated": 1439925116000, "production": "20th Century Fox", "rotten": 78, "viewer": {"meter": 55, "numReviews": 328218, "rating": 3.2}, "website": "http://www.magorium.com/"}, "type": "movie", "writers": ["Zach Helm"], "year": 2007}