{"_id": "573a13b6f29313caabd47491", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Ahmet Ertegun", "Nesuhi Ertegèn", "Matt Dillon", "Clive Toye"], "countries": ["UK", "USA"], "directors": ["Paul Crowder", "John Dower"], "fullplot": "A look back at one of the more curious fads in American professional sports, the sudden rise and precipitous fall of the North American Soccer League, spanning its existence 1968-1984, as seen through the experience of its most famous club, the New York Cosmos. The NASL made very little impact in the US, where soccer had virtually no following, until in 1975 the New York Cosmos succeeded in signing the most famous player in the world, Pele. Attendence for Cosmos games exploded, outdrawing even the New York Giants and New York Jets of the NFL, to where exhibition games in Seattle were drawing huge crowds, and when Pele announced his retirement in 1977 his final game drew the biggest crowd to ever see a soccer game in the US. His retirement from the game began a slow but steady decline for the NASL as money issues for the league and the spending practices of the Cosmos became a running controversy.", "genres": ["Documentary", "Sport"], "imdb": {"id": 489247, "rating": 7.3, "votes": 1246}, "languages": ["English"], "lastupdated": "2015-09-02 00:16:43.617000000", "metacritic": 67, "num_mflix_comments": 2, "plot": "The rise and fall of the N.Y. Cosmos. The soccer team that brought Pele to America; against the backdrop of N.Y. City in the 70's.", "poster": "https://m.media-amazon.com/images/M/MV5BMTYyMjc2MDE1OV5BMl5BanBnXkFtZTcwODAwNzMzMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1152230400000, "runtime": 97, "title": "Once in a Lifetime: The Extraordinary Story of the New York Cosmos", "tomatoes": {"dvd": 1172707200000, "lastUpdated": 1438197273000, "viewer": {"meter": 100, "numReviews": 45, "rating": 2.2}}, "type": "movie", "writers": ["John Dower (story)", "Mark Monroe (screenplay)", "Mark Monroe (story)"], "year": 2006}