{"_id": "573a13a0f29313caabd0529f", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Joely Richardson", "Matthew Macfadyen", "Hugh Laurie", "Adrian Lester"], "countries": ["UK"], "directors": ["Ben Elton", "Hugh Laurie"], "fullplot": "Sam and Lucy Bell are a married couple who seem to have it all: good looks, successful careers and an enthusiastic love life. The only thing they lack is the one thing they want most - a baby. They try everything in their efforts to reproduce: New Age chanting, acupuncture, creative lovemaking... but all this hectic schedule achieves is improvement in their cardiovascular systems. Ovulation charts soon replace spontaneity, when the couple reluctantly deliver themselves into the hands of medical professionals. At the same time, as Sam comes to find his job increasingly unfulfilling, he sets his sights on writing a screenplay, but writer's block strikes. Encouraged to 'look within' by his hippie friend Druscilla, Sam is inspired: he will write a comedy about a couple trying for a baby! But Lucy is horrified at the idea, and forbids him to tell their story. Sam and Lucy's love for each other, the most important thing they both have, will now truly be put to the test...with surprising results.", "genres": ["Comedy", "Romance"], "imdb": {"id": 206926, "rating": 5.7, "votes": 4838}, "languages": ["English"], "lastupdated": "2015-08-22 00:58:51.860000000", "metacritic": 46, "num_mflix_comments": 1, "plot": "A comedy about a couple (Hugh Laurie and Joely Richardson) who are trying to conceive a child.", "poster": "https://m.media-amazon.com/images/M/MV5BMTI0NjkzNjM0OF5BMl5BanBnXkFtZTcwMTk4ODQyMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 998611200000, "runtime": 104, "title": "Maybe Baby", "tomatoes": {"critic": {"meter": 46, "numReviews": 28, "rating": 5.1}, "dvd": 1018310400000, "fresh": 13, "lastUpdated": 1440529268000, "production": "USA Films", "rotten": 15, "viewer": {"meter": 48, "numReviews": 7723, "rating": 3}, "website": "http://www.maybebaby.com.au"}, "type": "movie", "writers": ["Ben Elton (novel)", "Ben Elton"], "year": 2000}