{"_id": "573a1398f29313caabcebd91", "awards": {"nominations": 2, "text": "2 nominations.", "wins": 0}, "cast": ["Alan Alda", "Joey Bishop", "Madeline Kahn", "Anthony LaPaglia"], "countries": ["USA"], "directors": ["Alan Alda"], "fullplot": "Offbeat fashion student Betsy Hopper and her strait-laced investment-banker fiancè, Jake Lovell, just want an intimate little wedding reception, but Betsy's father, Eddie, a Long Island construction contractor, feels so threatened by Jake's rich WASP parents that he blows the ceremony up into a bank-breaking showpiece, sending his wife, Lola, into a financial panic. Pressure from Betsy's extended family to include their joint Jewish and Italian-Catholic heritage in the ceremony doesn't do much to assuage the title character's worries, nor does the lovelorn bitterness of her older sister, Connie, who's single, her parents assume, because she has the audacity to pursue the unfeminine profession of police officer. With all of his funds tied up into the money pit of a house he's building, Betsy's dad has to turn to his crooked brother-in-law, Oscar, for financial assistance, and soon a soft-spoken but menacing young mobster named Stevie Dee is supervising Eddie's construction project and casting his romantic aspirations toward the clueless Connie.", "genres": ["Comedy", "Romance"], "imdb": {"id": 99128, "rating": 5.6, "votes": 2760}, "languages": ["English"], "lastupdated": "2015-09-15 04:11:47.287000000", "num_mflix_comments": 5, "plot": "Offbeat fashion student Betsy Hopper and her strait-laced investment-banker fiancè, Jake Lovell, just want an intimate little wedding reception, but Betsy's father, Eddie, a Long Island ...", "poster": "https://m.media-amazon.com/images/M/MV5BZDY2NTVhZDYtMjMzMi00NzY0LWI5YmQtMGE0NDgxYzJkNDhjXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 646012800000, "runtime": 94, "title": "Betsy's Wedding", "tomatoes": {"critic": {"meter": 50, "numReviews": 8, "rating": 5.5}, "dvd": 1031011200000, "fresh": 4, "lastUpdated": 1439405243000, "rotten": 4, "viewer": {"meter": 41, "numReviews": 6834, "rating": 2.8}}, "type": "movie", "writers": ["Alan Alda"], "year": 1990}