{"_id": "573a1396f29313caabce4aa0", "awards": {"nominations": 3, "text": "Nominated for 1 Golden Globe. Another 2 wins & 3 nominations.", "wins": 3}, "cast": ["Vic Morrow", "Alan Alda", "Clu Gulager", "Billy Dee Williams"], "countries": ["USA"], "directors": ["Tom Gries"], "fullplot": "Adapted from a story by Truman Capote (\"In Cold Blood\"), the world of the prison convict is open to the viewer. As the story develops, one thing becomes clear. As in the outside world, there is a \"system\"; and just as on the outside, there is accommodation, honesty, cynicism, violence and all the other factors that make up our society. Three new convicts act as the catalyst for the events that follow; a college teacher, convicted of accidental manslaughter; a young man, sentenced for possession of marijuana; a new guard, interested in changing the system. Inside prison, the 'establlishment' presents itself. The warden doesn't want to rock the boat of the small society within prison walls. A convict dictator controls activities among the inmates thanks to a control of the narcotics traffic. A leader of the black convicts seethes in his own world of racial tension when there is no difference between convicts and authorities. As the film follows the three newcomers, it records the grim, terrifying, sometimes fascinating events that occur.", "genres": ["Drama"], "imdb": {"id": 68642, "rating": 7.4, "votes": 437}, "languages": ["English"], "lastupdated": "2015-09-05 00:52:21.540000000", "num_mflix_comments": 1, "plot": "A young guard and a college professor convicted of manslaughter both start their first day in prison.", "poster": "https://m.media-amazon.com/images/M/MV5BNTgyNjQ5NjMwN15BMl5BanBnXkFtZTcwODI3MzcyMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 66009600000, "runtime": 90, "title": "The Glass House", "tomatoes": {"dvd": 1149552000000, "lastUpdated": 1438370982000, "viewer": {"meter": 80, "numReviews": 107, "rating": 3.6}}, "type": "movie", "writers": ["Truman Capote (story)", "Wyatt Cooper (story)", "Tracy Keenan Wynn (screenplay)"], "year": 1972}