{"_id": "573a1395f29313caabce213f", "awards": {"nominations": 2, "text": "2 nominations.", "wins": 0}, "cast": ["Doris Day", "James Garner", "Arlene Francis", "Edward Andrews"], "countries": ["USA"], "directors": ["Norman Jewison"], "fullplot": "The Happy Soap Company is owned and managed by the Fraleigh family. Although he is more of a company figurehead than an active participant in the company's day-to-day business, anything that family patriarch Tom Fraleigh wants for the company he usually gets. What he wants is Beverly Boyer - the wife of his daughter-in-law's obstetrician, Dr. Gerald Boyer - to appear as the company spokesperson when Beverly, who he meets at a small dinner party, mentions a personal and true story about how Happy Soap saved her life. She is to appear in a live commercial spot during a Happy Soap sponsored television show telling her story just as she told Tom. Despite Beverly's performance going poorly in her own mind, Tom loved it and how refreshing and honest Beverly came across to the viewer. So Tom signs her to a one year, $80,000 contract to continue doing the same. This move is questioned by Happy Soap's own managers and its advertising company. But it is questioned even more by Gerald, who believes Beverly's place is in the home taking care of the house and their two adolescent children. As Beverly continues to do the commercials, her fame rises and her professional commitments increase which add another level of strain to their marriage. Only a natural act by Mrs. Fraleigh Jr. may be able to save the Boyer's marriage.", "genres": ["Comedy", "Romance"], "imdb": {"id": 57581, "rating": 7, "votes": 3045}, "languages": ["English"], "lastupdated": "2015-08-23 00:31:56.407000000", "num_mflix_comments": 2, "plot": "A housewife's sudden rise to fame as a soap spokesperson leads to chaos in her home life.", "poster": "https://m.media-amazon.com/images/M/MV5BZTNkYTlkNmMtZGEwNy00ZjI1LWEzODctNTExOWQ0NTNjN2QzXkEyXkFqcGdeQXVyMTMxMTY0OTQ@._V1_SY1000_SX677_AL_.jpg", "rated": "APPROVED", "released": -203904000000, "runtime": 108, "title": "The Thrill of It All", "tomatoes": {"critic": {"meter": 86, "numReviews": 7, "rating": 6.1}, "dvd": 1044316800000, "fresh": 6, "lastUpdated": 1438366309000, "production": "MCA Universal Home Video", "rotten": 1, "viewer": {"meter": 74, "numReviews": 4556, "rating": 3.7}}, "type": "movie", "writers": ["Carl Reiner (screenplay)", "Larry Gelbart (story)", "Carl Reiner (story)"], "year": 1963}