{"_id": "573a13aaf29313caabd21564", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Jackie Shroff", "Kumar Iyengar", "Raveena Tandon", "Nagarjuna Akkineni"], "countries": ["India"], "directors": ["Arjun Sajnani"], "fullplot": "This is the story of wronged and misunderstood Arvasu (Milind Soman), a brahman by caste, who has become a performing actor. He loves Nittilai (Sonali Kulkarni), who reciprocates his love, but seeks approval of her father and her village's elders before marrying him. Arvasu's brother is Parvasu (Jackie Shroff) who has been conducting a major prayer ceremony to appease Devraj Indra (Amitabh Bachchan) so that their region may get rain. Arvasu's father is Raibhya (Mohan Agashe), who dislikes both his sons, and wishes that he cremate them before his death. Raibhyu, suspects Vishaka (Raveena Tandon) Parvasu's wife, of having an illicit affair with Yarvaki (Nagarjuna), and detests her. Yavarki loves Vishaka, but left her to worship and pray to Devraj Indra for 10 years, and on his return found her married to Parvasu. Parvasu married Vishaka, lived with her happily for 3 years, before leaving her to conduct the prayer ceremoney for Devraj Indra. On finding that Vishaka has met with Yavarki, an engraged Raibhya summons a Brahm Rakshas, a demon (Prabhu Deva) to kill Yavarki. The demon does so, and Arvasu has to cremate him; this delays his appointment with Nittilai's dad and her village elders, and as a result she is married to someone else. When Parvasu hears of the death of Yavarki, he kills his father, and subsequently blames Arvasu for this and has him badly beaten up and left for dead. When Nittilai hears of this, she comes to the rescue of Arvasu, and finds that she is being hunted by her husband and herbrother, who will kill her on sight. Sutradhar (Raghuvir Yadav) arranges an act to entertain the Devas, and as a result Arvasu goes berserk, Nittilai exposes herself and is killed by her husband; Parvasu admits failure and cremates himself. Thus one by one, whoever, was close to Arvasu is dead. Finally appeased, Devraj Indra appears, and Arvasu is allowed a wish of his choice. The only thought in Arvasu's mind is to bring Nittilai back to life, but will Devraj Indra turn history around and help Arvasu?", "genres": ["Drama", "Fantasy"], "imdb": {"id": 326722, "rating": 4.9, "votes": 289}, "languages": ["Hindi"], "lastupdated": "2015-09-15 01:36:35.590000000", "metacritic": 57, "num_mflix_comments": 2, "plot": "This is the story of wronged and misunderstood Arvasu (Milind Soman), a brahman by caste, who has become a performing actor. He loves Nittilai (Sonali Kulkarni), who reciprocates his love, ...", "poster": "https://m.media-amazon.com/images/M/MV5BM2VkYjBkMjUtMTI5YS00MzdlLWE3OGEtOTc5MzI4NGNmZTI4XkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY1000_SX677_AL_.jpg", "released": 1030665600000, "runtime": 126, "title": "Agnivarsha: The Fire and the Rain", "tomatoes": {"lastUpdated": 1441994036000, "production": "Cinebella Entertainment", "viewer": {"meter": 0, "numReviews": 9, "rating": 2.8}, "website": "http://www.agnivarsha.com"}, "type": "movie", "writers": ["Girish Karnad (play)", "Anil Mehta (screenplay)", "Arjun Sajnani (screenplay)", "Jayshree T. (screenplay)", "Atul Tiwari (dialogue)"], "year": 2002}