{"_id": "573a13a3f29313caabd0f239", "awards": {"nominations": 17, "text": "2 wins & 17 nominations.", "wins": 2}, "cast": ["Shah Rukh Khan", "Kareena Kapoor", "Danny Denzongpa", "Rahul Dev"], "countries": ["India"], "directors": ["Santosh Sivan"], "fullplot": "Prince Ashoke (Shahrukh Khan), heir to the Magadha Kingdom, bowing to his mother's (Shilpa Mehta) demand forsakes his princely status and goes to live in the wild for awhile. There he meets and falls in love with Kaurwaki (Kareena Kapoor). He identifies himself as Pawan, not wanting to disclose his identity yet. Ashoke has to return to Magadha, but when he returns to find and wed Kaurwaki, he is told by Bheema (Rahul Dev) that Kaurwaki and her brother Arya have been killed. Devastated Ashoke returns home. On the way home he is attacked and Devi (Hrishitaa Bhatt), of the Buddhist faith rescues him and tends to him till he gets well. As a result, Devi's marriage to her groom is cancelled. Ashoke weds her and brings her to Magadha, only to be told by his father that since Devi is not of the same race as he, she cannot be welcomed. Ashoke leaves with Devi and lives in Ujjaini. Soon Devi gets pregnant, and this arouses jealously and hatred amongst Ashoke's step-brothers. As a result they plot to kill Devi, however, their plans are foiled by Ashoke's mother, who is killed. Ashoke swears to avenge his mother's death by killing his step-brothers one by one, except for one, who has led to Kalinga. Ashoke asks the ruler of Kalings to turn over his step-brother to him, and they refuse. Ashoke swears to raze Kalinga to the ground. Ashoke is unstoppable. Even his close friend, Virat (Danny Denzongpa), too, is unable to stop Ashoke. Ashoke proceeds to war, little knowing that the queen of Kalinga is none other than Kaurwaki, who is still alive.", "genres": ["Action", "Drama", "History"], "imdb": {"id": 249371, "rating": 6.7, "votes": 9559}, "languages": ["Hindi"], "lastupdated": "2015-08-30 00:45:37.697000000", "num_mflix_comments": 2, "plot": "The Epic tale of King Asoka's life.", "poster": "https://m.media-amazon.com/images/M/MV5BNjk3OTZmYWUtMDYwMy00Y2ZmLWEzMDYtOTg3YjQzNDNkM2E1XkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1004054400000, "runtime": 176, "title": "Ashoka the Great", "tomatoes": {"boxOffice": "$0.3M", "critic": {"meter": 100, "numReviews": 10, "rating": 7.6}, "dvd": 1015891200000, "fresh": 10, "lastUpdated": 1439924050000, "production": "Wonder Films", "rotten": 0, "viewer": {"meter": 68, "numReviews": 9289, "rating": 3.5}}, "type": "movie", "writers": ["Saket Chaudhary (screenplay)", "Santosh Sivan (screenplay)", "Abbas Tyrewala (dialogue)"], "year": 2001}