{"_id": "573a1394f29313caabcdf42f", "awards": {"nominations": 2, "text": "Won 1 Golden Globe. Another 1 nomination.", "wins": 0}, "cast": ["Richard Carlson", "Barbara Rush", "Charles Drake", "Joe Sawyer"], "countries": ["USA"], "directors": ["Jack Arnold"], "fullplot": "John Putnam is a writer and an amateur stargazer with a new home out in the beautiful Arizona desert, which he enjoys with Ellen Fields, his girlfriend and a local schoolteacher. John is not trusted by the people of the small town near where he lives, certainly not by Sheriff Matt Warren, who feels protective of Ellen, and perhaps something more. One night, John and Ellen see a meteor crash in the desert. John drags his friend, Pete, out of bed to take him over to the crash site in his helicopter. Once there, John climbs down into the crater. Unfortunately, he does so alone, as Pete and Ellen wait for him. John is the only one who sees the spaceship before a landslide covers it. And John is the only one who catches a glimpse of the hideous thing inside. At first John's story seems mad, until some of the townsfolk begin acting strange - as if they aren't really who they seem to be.", "genres": ["Horror", "Sci-Fi"], "imdb": {"id": 45920, "rating": 6.6, "votes": 5392}, "languages": ["English"], "lastupdated": "2015-08-24 00:17:53.070000000", "num_mflix_comments": 1, "plot": "A spaceship from another world crashes in the Arizona desert, and only an amateur stargazer and a schoolteacher suspect alien influence when the local townsfolk begin to act strange.", "poster": "https://m.media-amazon.com/images/M/MV5BOTUzNzM0MzQxMV5BMl5BanBnXkFtZTgwNTM5NDI1MDE@._V1_SY1000_SX677_AL_.jpg", "rated": "APPROVED", "released": -524016000000, "runtime": 81, "title": "It Came from Outer Space", "tomatoes": {"consensus": "It Came From Outer Space is a pulpy-but-effective psychological sci-fi picture, with a provocative message about xenophobia.", "critic": {"meter": 81, "numReviews": 27, "rating": 6.9}, "dvd": 1021939200000, "fresh": 22, "lastUpdated": 1441218306000, "production": "Universal Pictures", "rotten": 5, "viewer": {"meter": 52, "numReviews": 3680, "rating": 3.2}}, "type": "movie", "writers": ["Harry Essex (screenplay)", "Ray Bradbury (story)"], "year": 1953}