{"_id": "573a13acf29313caabd27679", "awards": {"nominations": 11, "text": "2 wins & 11 nominations.", "wins": 2}, "cast": ["Saif Ali Khan", "Urmila Matondkar", "Seema Biswas", "Aditya Srivastava"], "countries": ["India"], "directors": ["Sriram Raghavan"], "fullplot": "Sarika and Karan are employed in a big city called Mumbai in India. They meet, have a date, and find that they are attracted to each other. They do not know nor care of each others' backgrounds, and get married. They start to live in a small apartment. One day Karan asks Sarika to deliver a parcel for him via an Indian airline, which she does. The authorities stop her, and a search reveals that she was carrying drugs in the parcel, and she is arrested. After her arrest, Karan visits her and assures that this is all a big misunderstanding, and she will be found not guilty and let out soon. This does not happen, Sarika is found guilty, is convicted and sentenced to a long jail term. While in prison, it slowly and painfully dawns on her that she has been used, and wants to avenge this. In order to get even with Karan, she must first of all either wait for the sentence to get over or be more daring and escape, take Karan by surprise and avenge her humiliation. Which way will Sarika take?", "genres": ["Crime", "Romance", "Thriller"], "imdb": {"id": 352314, "rating": 7.7, "votes": 3895}, "languages": ["Hindi", "English"], "lastupdated": "2015-09-07 01:15:17.373000000", "plot": "A woman falls for a charming and mysterious businessman. The whirlwind romance turns sour when she is framed for his underworld crimes. Now, finally out of prison she is ready for sweet revenge.", "poster": "https://m.media-amazon.com/images/M/MV5BYjhiZmZjYTAtY2M4Zi00YWMzLTg0YTctZjVhOTc0MjhkYTRhXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY1000_SX677_AL_.jpg", "released": 1077580800000, "runtime": 120, "title": "Ek Hasina Thi", "tomatoes": {"dvd": 1135036800000, "lastUpdated": 1441996694000, "viewer": {"meter": 80, "numReviews": 298, "rating": 3.8}}, "type": "movie", "writers": ["Sriram Raghavan", "Pooja Ladha Surti"], "year": 2004}