{"_id": "573a13c3f29313caabd6adf3", "awards": {"nominations": 10, "text": "7 wins & 10 nominations.", "wins": 7}, "cast": ["Patrick Fabian", "Ashley Bell", "Iris Bahr", "Louis Herthum"], "countries": ["USA", "France"], "directors": ["Daniel Stamm"], "fullplot": "In Baton Rouge, Louisiana, the evangelical Reverend Cotton Marcus was raised by his father to be a preacher. He agrees that the filmmaker Iris Reisen and the cameraman Daniel Moskowitz make a documentary about his life. Cotton tells that when his wife Shanna Marcus had troubles in the delivery of their son Justin, he prioritized the doctor help to God and since then he questions his faith. Further, he tells that exorcisms are frauds but the results are good for the believers because they believe it is true. When Cotton is summoned by the farmer Louis Sweetzer to perform an exorcism in his daughter Nell, Cotton sees the chance to prove to the documentary crew what he has just told. They head to Ivanwood and they have a hostile reception from Louis's son Caleb. Cotton performs the exorcism in Nell, exposing his tricks to the camera, but sooner they learn that the dysfunctional Sweetzer family has serious problems.", "genres": ["Drama", "Horror", "Thriller"], "imdb": {"id": 1320244, "rating": 5.6, "votes": 39412}, "languages": ["English"], "lastupdated": "2015-09-16 11:04:57.437000000", "metacritic": 63, "plot": "A troubled evangelical minister agrees to let his last exorcism be filmed by a documentary crew.", "poster": "https://m.media-amazon.com/images/M/MV5BNDc4Mjk2MjA0NF5BMl5BanBnXkFtZTcwMzMyNjQ3Mw@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1282867200000, "runtime": 87, "title": "The Last Exorcism", "tomatoes": {"boxOffice": "$41.0M", "consensus": "It doesn't fully deliver on the chilly promise of its Blair Witch-style premise, but The Last Exorcism offers a surprising number of clever thrills.", "critic": {"meter": 72, "numReviews": 150, "rating": 6.2}, "dvd": 1294099200000, "fresh": 108, "lastUpdated": 1442139322000, "production": "Lionsgate", "rotten": 42, "viewer": {"meter": 34, "numReviews": 73040, "rating": 2.7}, "website": "http://www.thelastexorcism.com/"}, "type": "movie", "writers": ["Huck Botko", "Andrew Gurland"], "year": 2010}