{"_id": "573a13bdf29313caabd58fd3", "awards": {"nominations": 91, "text": "Won 8 Oscars. Another 153 wins & 91 nominations.", "wins": 161}, "cast": ["Dev Patel", "Saurabh Shukla", "Anil Kapoor", "Rajendranath Zutshi"], "countries": ["UK", "USA"], "directors": ["Danny Boyle", "Loveleen Tandan"], "fullplot": "The story of Jamal Malik, an 18 year-old orphan from the slums of Mumbai, who is about to experience the biggest day of his life. With the whole nation watching, he is just one question away from winning a staggering 20 million rupees on India's Kaun Banega Crorepati? (2000) (Who Wants To Be A Millionaire?) But when the show breaks for the night, police arrest him on suspicion of cheating; how could a street kid know so much? Desperate to prove his innocence, Jamal tells the story of his life in the slum where he and his brother grew up, of their adventures together on the road, of vicious encounters with local gangs, and of Latika, the girl he loved and lost. Each chapter of his story reveals the key to the answer to one of the game show's questions. Each chapter of Jamal's increasingly layered story reveals where he learned the answers to the show's seemingly impossible quizzes. But one question remains a mystery: what is this young man with no apparent desire for riches really doing on the game show? When the new day dawns and Jamal returns to answer the final question, the Inspector and sixty million viewers are about to find out. At the heart of its storytelling lies the question of how anyone comes to know the things they know about life and love.", "genres": ["Drama", "Romance"], "imdb": {"id": 1010048, "rating": 8, "votes": 584956}, "languages": ["English", "Hindi", "French"], "lastupdated": "2015-08-22 00:03:30.360000000", "metacritic": 86, "num_mflix_comments": 402, "plot": "A Mumbai teen, who grew up in the slums, becomes a contestant on the Indian version of \"Who Wants To Be A Millionaire?\" He is arrested under suspicion of cheating, and while being interrogated, events from his life history are shown which explain why he knows the answers.", "poster": "https://m.media-amazon.com/images/M/MV5BZmNjZWI3NzktYWI1Mi00OTAyLWJkNTYtMzUwYTFlZDA0Y2UwXkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1230163200000, "runtime": 120, "title": "Slumdog Millionaire", "tomatoes": {"boxOffice": "$141.2M", "consensus": "Visually dazzling and emotionally resonant, Slumdog Millionaire is a film that's both entertaining and powerful.", "critic": {"meter": 92, "numReviews": 264, "rating": 8.4}, "dvd": 1238457600000, "fresh": 244, "lastUpdated": 1442084995000, "production": "Fox Searchlight Pictures", "rotten": 20, "viewer": {"meter": 90, "numReviews": 1153204, "rating": 4}, "website": "http://www.foxsearchlight.com/slumdogmillionaire/"}, "type": "movie", "writers": ["Simon Beaufoy (screenplay)", "Vikas Swarup (novel)"], "year": 2008}