{"_id": "573a13a0f29313caabd02a09", "awards": {"nominations": 2, "text": "1 win & 2 nominations.", "wins": 1}, "cast": ["Bernie", "Louie", "Mac", "Russell Ferrier"], "countries": ["Canada", "USA"], "directors": ["Robert Vince"], "fullplot": "Jack is a three-year-old chimpanzee who has been the subject of a long-term experiment by Dr. Kendall, a researcher who been teaching Jack to communicate through sign language. Jack, however, has not been making progress fast enough for Dr. Kendall's sponsor, Dr. Peabody, who has cut off his funding and sold Jack to a medical research lab. Afraid of what could happen to his simian friend, Dr. Kendall sneaks Jack out of his home in the lab; however, Jack is accidentally sent to Canada, where he gets loose and is discovered by Tara, a deaf girl who recognizes Jack's sign language. Jack has an even bigger surprise for Tara's older brother Steven; Jack scrambles onto the ice in the midst of practice for Steven's junior league hockey team, and he and his teammates discover the monkey has a natural talent for the game. With Jack on the team, Steven's team is on their way to a league championship, but Jack's notoriety attracts the unfortunate attention of Dr. Peabody, who are determined to send Jack back to his new owners.", "genres": ["Comedy", "Family", "Sport"], "imdb": {"id": 196106, "rating": 3.7, "votes": 1644}, "languages": ["English"], "lastupdated": "2015-08-21 00:45:11.953000000", "metacritic": 43, "num_mflix_comments": 2, "plot": "Jack is a three-year-old chimpanzee who has been the subject of a long-term experiment by Dr. Kendall, a researcher who been teaching Jack to communicate through sign language. Jack, ...", "poster": "https://m.media-amazon.com/images/M/MV5BMjMzODAwMDAwOV5BMl5BanBnXkFtZTgwOTYxMDc4ODE@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 972000000000, "runtime": 93, "title": "MVP: Most Valuable Primate", "tomatoes": {"critic": {"meter": 20, "numReviews": 5, "rating": 4.2}, "dvd": 980208000000, "fresh": 1, "lastUpdated": 1440959844000, "production": "Keystone Pictures", "rotten": 4, "viewer": {"meter": 39, "numReviews": 7108, "rating": 2.7}}, "type": "movie", "writers": ["Anne Vince", "Robert Vince"], "year": 2000}