{"_id": "573a13a7f29313caabd1aa6d", "awards": {"nominations": 2, "text": "3 wins & 2 nominations.", "wins": 3}, "cast": ["Xiuling Chai", "Fengsen Jia", "Hongshen Jia", "Tong Wang"], "countries": ["China"], "directors": ["Yang Zhang"], "fullplot": "In the early 1990s, Hongshen Jia, then in his mid twenties and based in Beijing, was considered one of the most promising of the emerging actors in China, with several movie and television roles to his credit. However, self doubt in his acting abilities coupled with an emerging drug problem, especially with heroin, led to him deciding to quit acting. Instead, he spent his time solely listening to music and taking drugs. His erratic behavior led to alienation of friends and ultimately leading a solitary life. First his sister and then in addition his rural based parents, his father who took early retirement, came to live with Hongshen in Beijing to help him through his life problems, which included financially supporting him. Hongshen treated them poorly, especially his father, who in turn accepted Hongshen's abusive behavior all in the name of helping him. But they didn't trust him and followed him everywhere. Ultimately the family had figure out what to do to best help Hongshen. Ultimately, Hongshen, and in association his family, is provided a unique opportunity to allow him to release the emotions associated with this turbulent time in his life.", "genres": ["Biography", "Drama", "Music"], "imdb": {"id": 298238, "rating": 7.2, "votes": 628}, "languages": ["Mandarin"], "lastupdated": "2015-08-20 01:22:39.390000000", "metacritic": 61, "plot": "An actor becomes increasingly introverted and psychotic and his entire family attempts to intervene.", "poster": "https://m.media-amazon.com/images/M/MV5BMzUwNjIyMTc4OF5BMl5BanBnXkFtZTYwNjUxMzg5._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1014940800000, "runtime": 112, "title": "Quitting", "tomatoes": {"consensus": "While Quitting is an honest and intimate look into the world of one man's struggle with drug addiction, the subject matter is better suited for the small screen.", "critic": {"meter": 77, "numReviews": 44, "rating": 6.4}, "dvd": 1046736000000, "fresh": 34, "lastUpdated": 1439404015000, "production": "Sony Pictures Classics", "rotten": 10, "viewer": {"meter": 85, "numReviews": 961, "rating": 3.8}, "website": "http://www.sonyclassics.com/quitting"}, "type": "movie", "writers": ["Xin Huo", "Yang Zhang"], "year": 2001}