{"_id": "573a1399f29313caabceccef", "awards": {"nominations": 1, "text": "2 wins & 1 nomination.", "wins": 2}, "cast": ["Bill Murray", "Richard Dreyfuss", "Julie Hagerty", "Charlie Korsmo"], "countries": ["USA"], "directors": ["Frank Oz"], "fullplot": "Doctor Leo Marvin, an egotistical psychotherapist in New York City, is looking forward to his forthcoming appearance on a \"Good Morning America\" telecast, during which he plans to brag about \"Baby Steps,\" his new book about emotional disorder theories in which he details his philosophy of treating patients and their phobias. Meanwhile, Bob Wiley is a recluse who is so afraid to leave his own apartment that he has to talk himself out the door. When Bob is pawned off on Leo by a psychotherapist colleague, Bob becomes attached to Leo. Leo finds Bob extremely annoying. When Leo accompanies his wife Fay, his daughter Anna, and his son Siggy to a peaceful New Hampshire lakeside cottage for a month-long vacation, Leo thinks he's been freed from Bob. Leo expects to mesmerize his family with his prowess as a brilliant husband and remarkable father who knows all there is to know about instructing his wife and raising his kids. But Bob isn't going to let Leo enjoy a quiet summer by the lake. By cleverly tricking the telephone operator at the doctor's exchange, Bob discovers the whereabouts of Leo and his family. Despite his phobia about traveling alone, Bob somehow manages to talk himself onto a bus, and he arrives in New Hampshire. Leo's vacation comes to a screeching halt the moment he sees Bob. With his witty personality, his ability to manipulate people, and his good sense of humor, Bob quickly becomes an annoyance to Leo, but not to Fay, Anna, and Siggy, because they think Bob is fun while Leo is dull. Fearing that he's losing his family to Bob, Leo frantically tries to find a way to make Bob go back to New York, and it's not as easy as Leo had hoped. Leo finds himself stepping outside the law to try to get Bob to stay away from Fay, Anna, and Siggy--Leo slowly goes berserk, and makes plans to kill Bob.", "genres": ["Comedy"], "imdb": {"id": 103241, "rating": 7, "votes": 47004}, "languages": ["English"], "lastupdated": "2015-09-14 00:00:30.117000000", "metacritic": 60, "num_mflix_comments": 5, "plot": "A successful psychotherapist loses his mind after one of his most dependent patients, a manipulative, obsessively compulsive narcissist, tracks him down during his family vacation.", "poster": "https://m.media-amazon.com/images/M/MV5BMTQxMjU2ODk4N15BMl5BanBnXkFtZTgwODQzNTcxMTE@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 674438400000, "runtime": 99, "title": "What About Bob?", "tomatoes": {"consensus": "Bill Murray and Richard Dreyfuss' chemistry helps make the most of a familiar yet durable premise, elevating What About Bob? into the upper ranks of '90s comedies.", "critic": {"meter": 82, "numReviews": 39, "rating": 6.4}, "dvd": 963273600000, "fresh": 32, "lastUpdated": 1439921550000, "production": "Touchstone Home Entertainment", "rotten": 7, "viewer": {"meter": 79, "numReviews": 118502, "rating": 3.3}}, "type": "movie", "writers": ["Alvin Sargent (story)", "Laura Ziskin (story)", "Tom Schulman (screenplay)"], "year": 1991}