{"_id": "573a13aff29313caabd2f295", "awards": {"nominations": 2, "text": "2 wins & 2 nominations.", "wins": 2}, "cast": ["Sandra Bullock", "Regina King", "Enrique Murciano", "William Shatner"], "countries": ["USA", "Australia"], "directors": ["John Pasquin"], "fullplot": "Because of the notoriety she gained from the Miss United States pageant, Gracie Hart's life as an undercover FBI agent is over. In addition, Agent Eric Matthews broke off their relationship which she did not take well. Begrudgingly on the advice her boss Director Harry McDonald, Gracie decides to become the FBI's media relations officer. Ten months later with the assistance of style coach Joel Meyers and a best selling book behind her about her experience, Gracie becomes a designer-clad media darling and the made-up face of the FBI. The new Gracie is the exact opposite of Agent Sam Fuller, a woman who, like Gracie before her pageant experience, has deep seated anger issues. The two do not get along, but that doesn't stop McDonald from assigning Sam to be Gracie's bodyguard. The two are sent to Las Vegas when Gracie's friend, reigning Miss United States Cheryl Frasier, and the long time Miss United States pageant host Stan Fields are kidnapped there. At the FBI's Las Vegas field office, Assistant Director Walter Collins wants Gracie solely to be the media spokesperson on the case, but Gracie wants to be back in the field, especially when she uncovers some leads Collins dismisses. Despite their antagonistic relationship, Gracie and Sam have to work together to follow these leads. Along with them are Joel and insecure FBI Agent Jeff Foreman, the foursome who in addition to finding Cheryl and Stan, have to elude Collins' other agents, Collins who wants Gracie and Sam back on a plane to New York and who wants the glory of solving the case for himself.", "genres": ["Action", "Comedy", "Crime"], "imdb": {"id": 385307, "rating": 4.9, "votes": 46128}, "languages": ["English"], "lastupdated": "2015-09-10 17:45:57.793000000", "metacritic": 34, "num_mflix_comments": 2, "plot": "After Cheryl Frasier and Stan Fields are kidnapped, Gracie goes undercover in Las Vegas to find them.", "poster": "https://m.media-amazon.com/images/M/MV5BMjAxNzk2OTI2OV5BMl5BanBnXkFtZTcwODk0MDIzMw@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1111622400000, "runtime": 115, "title": "Miss Congeniality 2: Armed and Fabulous", "type": "movie", "writers": ["Marc Lawrence (characters)", "Katie Ford (characters)", "Caryn Lucas (characters)", "Marc Lawrence"], "year": 2005}