{"_id": "573a1394f29313caabcdf2cb", "awards": {"nominations": 1, "text": "4 wins & 1 nomination.", "wins": 4}, "cast": ["Lolita Sevilla", "Manolo Morèn", "Josè Isbert", "Alberto Romea"], "countries": ["Spain"], "directors": ["Luis Garcèa Berlanga"], "fullplot": "The little village of Villar del Rèo is awaiting the song performance of Carmen Vargas, 'The Great Andalusian Star'. The quiet village is governed by a deaf, naughty and good-natured Mayor, who's only seeking the way to give life to the place. By the same time good news comes to the village: the arrival of North American high personalities that will give economical aid to the nation city by city, village by village. The Mayor doesn't know what to do to welcome them. Carmen Vargas's agent throws surprising initiatives, moving all the village people just to prepare a better reception for the foreigners. His idea is to disguise all the farmers as Andalusians and add colour to every street with typical decorations. All of them start to work, and also to dream and think about what they're going to request the Americans, who will come with lots of dollars. The day of the arrival everybody at Villar del Rèo is in the streets, from the Mayor to the newborn child...", "genres": ["Comedy"], "imdb": {"id": 45554, "rating": 8.1, "votes": 2356}, "languages": ["Spanish", "Latin", "English"], "lastupdated": "2015-08-28 00:32:16.487000000", "plot": "After finding out that North American people are visiting the Spanish villages, the citizens of Villar del Rèo start preparing themselves to welcome them when they arrive.", "released": -528422400000, "runtime": 78, "title": "Welcome Mr. Marshall!", "tomatoes": {"lastUpdated": 1442267230000, "production": "Cicosa", "viewer": {"meter": 95, "numReviews": 602, "rating": 4.3}}, "type": "movie", "writers": ["Juan Antonio Bardem (story)", "Luis Garcèa Berlanga (story)", "Juan Antonio Bardem (screenplay)", "Luis Garcèa Berlanga (screenplay)", "Miguel Mihura (screenplay)"], "year": 1953}