{"_id": "573a13aef29313caabd2e5e1", "awards": {"nominations": 2, "text": "2 nominations.", "wins": 0}, "cast": ["Anna Katharina Schwabroh", "Martin Rapold", "Regula Grauwiller", "Yangzom Brauen"], "countries": ["Switzerland"], "directors": ["Ivan Engler", "Ralph Etter"], "fullplot": "In 2270, Earth is completely depleted and no one lives there anymore. Those that have money move to Rhea; but most of the population lives in orbit in space stations. Dr. Laura Portmann decides to work in the cargo ship Kassandra in an eight year travel to Station 42 that is in orbit of RH278 to raise money to meet her sister Arianne in Rhea. They keep in touch with each other, but their messages take three years to reach the other. Laura joins Captain Pierre Lacroix and his crew composed by the First Officer Anna Lindbergh; Communication Officer Miyuki Yoshida and Igor Prokoff and Claudio Vespucci. The Sky Marshall Samuel Decker joins the team since the terrorist group Luddites, led by Klaus Bruckner, is bombing the stations. Lacroix organizes shifts of eight and half months for each crew-member while the others rest in cryogenic sleep. Three years and eight months later, Laura finds that there is apparently a stowaway in the cargo compartments and Decker and Lacroix are awakened to investigate the incident with her; however, Lacroix has an accident and dies and the crew is waken up. Further, she finds that Arianne's transmission to her took only twenty minutes. What might be the secret of the cargo transported by Kassandra and where the spaceship is going?", "genres": ["Mystery", "Sci-Fi", "Thriller"], "imdb": {"id": 381940, "rating": 6.2, "votes": 14438}, "languages": ["German"], "lastupdated": "2015-08-31 00:39:27.107000000", "num_mflix_comments": 1, "plot": "In 2270, Earth is completely depleted and no one lives there anymore. Those that have money move to Rhea; but most of the population lives in orbit in space stations. Dr. Laura Portmann ...", "poster": "https://m.media-amazon.com/images/M/MV5BNzUyOTgwMTA0MV5BMl5BanBnXkFtZTcwNTMwOTYyMw@@._V1_SY1000_SX677_AL_.jpg", "released": 1344211200000, "runtime": 112, "title": "Cargo", "type": "movie", "writers": ["Arnold Bucher (story)", "Ivan Engler (story)", "Arnold Bucher (screenplay)", "Ivan Engler (screenplay)", "Patrik Steinmann (screenplay)", "Thilo Rèscheisen (screenplay)", "Johnny Hartmann (screenplay)"], "year": 2009}