{"_id": "573a13e3f29313caabdbff7e", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Denise Crosby", "John de Lancie", "Jonathan Frakes", "Gates McFadden"], "countries": ["Canada", "USA"], "directors": ["William Shatner"], "fullplot": "Canadian acting legend William Shatner takes viewers inside the creation of Star Trek: The Next Generation, the bold attempt in 1986 to recreate the success of the original television series, in which Shatner played Captain James T. Kirk. The documentary, directed, written and presented by Shatner reveals the drama, chaos and controversy behind the scenes as producers tried to make lighting strike twice. Not only were the beloved original characters of Kirk, Spock and McCoy excluded from the new series, the studio also attempted to block the involvement of the creator of the original series - Gene Roddenberry. Few believed it would work including those closest to the production. Yet Star Trek: The Next Generation went on to enormous success lasting seven seasons and spawning the multi-billion dollar Star Trek franchise, which continues to the present day. Now, more than 25 years later, William Shatner brings together the cast, crew and fans of Star Trek: The Next Generation to present an intimate look inside the development of a television series that became a benchmark for many of the high profile science fiction series that we enjoy today.", "genres": ["Documentary", "Biography", "Sci-Fi"], "imdb": {"id": 2880448, "rating": 7.3, "votes": 49}, "languages": ["English"], "lastupdated": "2015-08-30 00:01:34.617000000", "num_mflix_comments": 1, "plot": "Canadian acting legend William Shatner takes viewers inside the creation of Star Trek: The Next Generation, the bold attempt in 1986 to recreate the success of the original television series, in which Shatner played Captain James T. Kirk.", "poster": "https://m.media-amazon.com/images/M/MV5BMjc4Nzk5MDY0OV5BMl5BanBnXkFtZTgwODQ3MjQ0NjE@._V1_SY1000_SX677_AL_.jpg", "released": 1408924800000, "runtime": 59, "title": "William Shatner Presents: Chaos on the Bridge", "tomatoes": {"lastUpdated": 1438973754000, "viewer": {"numReviews": 0, "rating": 0}, "website": "http://outofnothingmovie.com/"}, "type": "movie", "writers": ["William Shatner"], "year": 2014}