{"_id": "573a139af29313caabcf0869", "awards": {"nominations": 3, "text": "1 win & 3 nominations.", "wins": 1}, "cast": ["Javier Bardem", "Juan Diego Botto", "Laura Morante", "Elvira Mènguez"], "countries": ["Spain", "USA"], "directors": ["John Malkovich"], "fullplot": "The story of Detective Agustin Rejas, a man clinging to the hope of an impossible love in an impossible world. Tracking Ezequiel, a delusional anarchist who incites the downtrodden masses to join in his brutal revolution against the fascist government in their unnamed Latin American country, Rejas finds solace in his sense of self-respect and the joy that his daughter and wife bring him. Then he meets Yolanda--his daughter's soulfully beautiful ballet teacher--a woman who sparks his long-forgotten passions and represents all that is good and all that is corrupt in their troubled country. But she, who appears to be a shelter from the storm, may in actuality be the storm's eye. Ultimately, as the revolution intensifies and the net closes around hunter and hunted alike, the dancer's truth will prove as elusive as the revolutionary's cause and the detective's peace.", "genres": ["Drama", "Thriller", "Crime"], "imdb": {"id": 118926, "rating": 7, "votes": 5359}, "languages": ["English", "Quechua", "Spanish"], "lastupdated": "2015-09-07 01:12:12.077000000", "metacritic": 64, "plot": "A police detective in a South American country is dedicated to hunting down a revolutionary guerilla leader.", "poster": "https://m.media-amazon.com/images/M/MV5BODE2ODA5OTE1OV5BMl5BanBnXkFtZTYwNzk1MTc2._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1053648000000, "runtime": 132, "title": "The Dancer Upstairs", "tomatoes": {"boxOffice": "$2.3M", "consensus": "Javier Bardem is compelling in the lead role as a police detective in search of a violent, mysterious politcal radical, and as a director, John Malkovich proves adept at crafting a suspenseful mood.", "critic": {"meter": 64, "numReviews": 114, "rating": 6.4}, "dvd": 1064275200000, "fresh": 73, "lastUpdated": 1442140663000, "production": "Fox Searchlight Pictures", "rotten": 41, "viewer": {"meter": 77, "numReviews": 4793, "rating": 3.6}, "website": "http://www.foxsearchlight.com/thedancerupstairs/"}, "type": "movie", "writers": ["Nicholas Shakespeare (novel)", "Nicholas Shakespeare (screenplay)"], "year": 2002}