{"_id": "573a13cff29313caabd88ec2", "awards": {"nominations": 25, "text": "5 wins & 25 nominations.", "wins": 5}, "cast": ["Steve Carell", "Toni Collette", "Allison Janney", "AnnaSophia Robb"], "countries": ["USA"], "directors": ["Nat Faxon", "Jim Rash"], "fullplot": "Duncan (Liam James) is not a popular kid and it doesn't look like the summer is going to offer anything better for him. His mother's boyfriend has invited them to his beach house where Duncan is expected to improve his personality and physical appearance, and meet girls. But his would-be step-sister doesn't want anything to do with him and his shy demeanor makes it difficult for him to meet anybody new. When Duncan wanders into the Water Wizz, the local water park, he meets adult employees who are just having fun. Owen (Sam Rockwell) lets Duncan work with him and their new-found bond will help each other mature and find their place in life. Which for Duncan means standing up to his would-be step-father, having a conversation with the girl next door and being more comfortable with who he is.", "genres": ["Comedy", "Drama"], "imdb": {"id": 1727388, "rating": 7.4, "votes": 106142}, "languages": ["English"], "lastupdated": "2015-09-15 05:15:19.933000000", "metacritic": 68, "num_mflix_comments": 1, "plot": "Shy 14-year-old Duncan goes on summer vacation with his mother, her overbearing boyfriend, and her boyfriend's daughter. Having a rough time fitting in, Duncan finds an unexpected friend in Owen, manager of the Water Wizz water park.", "poster": "https://m.media-amazon.com/images/M/MV5BNTU5ODk5NDg0Nl5BMl5BanBnXkFtZTcwNzQwMjI1OQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1374796800000, "runtime": 103, "title": "The Way Way Back", "tomatoes": {"boxOffice": "$21.5M", "consensus": "Despite its familiar themes, The Way Way Back makes use of its talented cast, finely tuned script, and an abundance of charm to deliver a funny and satisfying coming-of-age story.", "critic": {"meter": 85, "numReviews": 169, "rating": 7.3}, "dvd": 1382400000000, "fresh": 143, "lastUpdated": 1442431056000, "production": "Fox Searchlight", "rotten": 26, "viewer": {"meter": 84, "numReviews": 54267, "rating": 4}, "website": "http://www.foxsearchlight.com/thewaywayback/"}, "type": "movie", "writers": ["Nat Faxon", "Jim Rash"], "year": 2013}