{"_id": "573a13def29313caabdb6596", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "countries": ["UK"], "directors": ["Sarah McCarthy"], "fullplot": "ABOUT THE FILM Eleven year old Masha Kulabokhova is about to be adopted into fourteen year old Cami Diaz's family. Masha grew up in a Russian orphanage; Cami was born and raised in Wisconsin and has been the exclusive focus of her parents' love her whole life. The process of Masha becoming part of the Diaz family is going to change both girls forever. THE DARK MATTER OF LOVE follows Masha as she leaves Russia to spend her first year as part of the Diaz family, who have also adopted five year old twin boys Marcel and Vadim. When the reality of bonding with children who have grown up in institutions turns out to be more difficult than they ever imagined, the Diaz's hire two of the world's best developmental psychologists to help them build their new family - through science. Professor Emeritus at the University of Virginia School of Medicine, Dr Robert Marvin, has spent a lifetime developing a world-renowned therapy program that draws upon the past 100 years of scientific discoveries in the field of parent child love. By connecting the Diaz's with his research, Dr Marvin believes that he can help them create an environment in which Masha, Marcel and Vadim can form supportive, loving relationships. Sometimes hilarious, sometimes heartbreaking, THE DARK MATTER OF LOVE melds the story of the Diaz family learning to love, with rare archive footage of science experiments exploring parent child love. The science of love has an intriguing and dark past. Experiments on monkeys, birds and even human children have contributed to science's knowledge of love's inner workings. Director Sarah McCarthy fuses revealing footage of these experiments to the narrative, drawing audiences deeper into the dark matter of love and encouraging them to contemplate their own relationships through an unflinching, scientific lens.", "genres": ["Documentary"], "imdb": {"id": 2512582, "rating": 7.4, "votes": 537}, "languages": ["English"], "lastupdated": "2015-08-30 00:48:25.367000000", "num_mflix_comments": 1, "plot": "Documentary on the psychological aspects of growing up with and without parental love. It centers around the Diaz family, who chooses to adopt three orphans from Russia, and how their new and old kids handle family together.", "poster": "https://m.media-amazon.com/images/M/MV5BMTg5OTY1MzgwNF5BMl5BanBnXkFtZTgwODIwOTcxMzE@._V1_SY1000_SX677_AL_.jpg", "released": 1351728000000, "runtime": 93, "title": "The Dark Matter of Love", "tomatoes": {"dvd": 1417392000000, "lastUpdated": 1440267904000, "production": "Virgil Films", "viewer": {"meter": 79, "numReviews": 88, "rating": 3.9}, "website": "http://www.thedarkmatteroflove.com/"}, "type": "movie", "year": 2012}