{"_id": "573a13b1f29313caabd37f7d", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Anton Yelchin", "Robert Downey Jr.", "Hope Davis", "Kat Dennings"], "countries": ["USA"], "directors": ["Jon Poll"], "fullplot": "Although cheerful, friendly, intelligent, well-dressed, authentic and wealthy, Charlie Bartlett has problems. With his father gone and his mother loopy and clueless, he's been expelled from every private school for his victimless crimes. Now he's in a public school getting punched out daily by the school thug. He ever longs to be popular - the go-to guy - and the true crux of his troubles is that he invariably finds the means to this end, whatever that might be. At Western Summit High, he makes peace with his tormentor by going into business with him - listening to kids' problems and selling them prescription drugs. Charlie's a hit, but attraction to Susan (daughter of the school's laissez-faire principal), new security cameras on campus, a student's overdose, and Charlie's open world view all converge to get him in serious trouble. Can this self-made physician possibly heal himself and just be a kid?", "genres": ["Comedy", "Drama", "Romance"], "imdb": {"id": 423977, "rating": 7, "votes": 54015}, "languages": ["English"], "lastupdated": "2015-09-14 23:57:58.367000000", "metacritic": 54, "num_mflix_comments": 3, "plot": "A rich kid becomes the self-appointed psychiatrist to the student body of his new high school.", "poster": "https://m.media-amazon.com/images/M/MV5BMTUyNTgyNDI2NF5BMl5BanBnXkFtZTcwOTA2NTg1MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1203638400000, "runtime": 97, "title": "Charlie Bartlett", "tomatoes": {"boxOffice": "$3.7M", "consensus": "With engaging performances marked by an inconsistent tone, Charlie Bartlett is a mixed bag of clever teen angst comedy and muddled storytelling.", "critic": {"meter": 56, "numReviews": 131, "rating": 5.8}, "dvd": 1214265600000, "fresh": 74, "lastUpdated": 1442078648000, "production": "MGM", "rotten": 57, "viewer": {"meter": 71, "numReviews": 104842, "rating": 3.5}, "website": "http://charliebartlett-themovie.com"}, "type": "movie", "writers": ["Gustin Nash"], "year": 2007}