{"_id": "573a1396f29313caabce4ac7", "awards": {"nominations": 0, "text": "Nominated for 2 BAFTA Film Awards. Another 1 win.", "wins": 3}, "cast": ["Albert Finney", "Billie Whitelaw", "Frank Finlay", "Janice Rule"], "countries": ["UK"], "directors": ["Stephen Frears"], "fullplot": "Ginley (Albert Finney) is a nightclub bingo caller eager for a career change. On his thirty-first birthday, he advertises himself as a private eye in the newspaper. He dons a trench coat, and begins engaging others in rapid-fire dialogue as if he were Humphrey Bogart, or some Dashiell Hammett creation. Soon after, Ginley is phoned by a fat man, who gives him a package containing a gun, a photograph, and a large sum of money. Eventually Ginley is investigating a case involving smuggling of weapons as well as drugs. Ginley also finds himself at odds with his unsupportive brother, who offers Ginley payment to break off his investigations. Eventually Ginley learns of his brother-in-law's involvement in the crimes at hand. Ginley faces a series of daunting tasks: solving the crimes, bringing justice to the smugglers (and a murderer), as well as maintaining his safety and sanity in the process.", "genres": ["Comedy", "Crime", "Drama"], "imdb": {"id": 68669, "rating": 6.5, "votes": 880}, "languages": ["English"], "lastupdated": "2015-07-24 00:46:31.523000000", "num_mflix_comments": 1, "plot": "Ginley (Albert Finney) is a nightclub bingo caller eager for a career change. On his thirty-first birthday, he advertises himself as a private eye in the newspaper. He dons a trench coat, ...", "poster": "https://m.media-amazon.com/images/M/MV5BOGMyMGVmNWItMjg4Zi00OGNiLTlmNDAtN2Q4OTM0YTYxODFhXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 60393600000, "runtime": 88, "title": "Gumshoe", "tomatoes": {"dvd": 1233619200000, "lastUpdated": 1437417531000, "production": "Sony Pictures Entertainment", "viewer": {"meter": 59, "numReviews": 294, "rating": 3.4}}, "type": "movie", "writers": ["Neville Smith"], "year": 1971}