{"_id": "573a13e7f29313caabdc7d9f", "awards": {"nominations": 1, "text": "1 win & 1 nomination.", "wins": 1}, "cast": ["Jason O'Mara", "Stuart Allan", "Thomas Gibson", "Morena Baccarin"], "countries": ["USA"], "directors": ["Ethan Spaulding"], "fullplot": "Ra's al Ghul is dead, slain by former League of Assassin Slade Wilson, aka Deathstroke. His victory is not without a cost, the price his right eye; taken by Ra's own grandson Damien. Fearing for her sons' safety Talia al Ghul decides now is the time for the boy to meet his father. Half a world away a trail of chemical plant heists finds the Batman catching the culprit in the very act. The thief is Killer Croc, but Croc has changed mutated by some unseen hand. With the shocking appearance of the lovely but deadly Talia, Croc is quickly taken down. Back at Gotham harbor Talia gives the Detective the news of Ra's fate along with the surprise of introducing him to Damien, their son. Talia sets out to handle Slade while Damien falls under the guardianship of Batman. The young man possess great fighting prowess but his cocky self confidence creates friction back at Wayne Manor. Batman's investigation into Croc's actions leads him to the home of Dr. Kirk Langstrom, creator of the Man-bat formula. But Langstrom is merely another pawn serving the ambitions of the League of Assassins and their new leader Deathstroke. Deathstroke takes Langstrom's family hostage moving up the time-table for product delivery. Meanwhile Damien using the Batcave's resources conducts his own manhunt. One of Slade's lieutenant's likes to spend his off time in Gotham. Damien combats the traitor but before he can deliver the final blow, is stopped by Nightwing. Batman impressed by Damien's ability and drive allows him to take up the mantel of Robin. Soon the two are hot on the trail of Deathstroke who is aiming to amass an army of ninja Man-bats. Can Batman teach his new sidekick what it takes to be a hero, leaving behind his murderous past? Or will his greatest challenge yet prove to be for the very soul of the son of Batman.", "genres": ["Animation", "Action", "Adventure"], "imdb": {"id": 3139072, "rating": 6.6, "votes": 9084}, "languages": ["English"], "lastupdated": "2015-09-05 00:48:58.057000000", "num_mflix_comments": 1, "plot": "Batman learns he has a violent, unruly pre-teen son, secretly raised by the terrorist group the League of Assassins.", "poster": "https://m.media-amazon.com/images/M/MV5BYjdkZWFhNzctYmNhNy00NGM5LTg0Y2YtZWM4NmU2MWQ3ODVkXkEyXkFqcGdeQXVyNTA0OTU0OTQ@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1399334400000, "runtime": 74, "title": "Son of Batman", "tomatoes": {"dvd": 1407801600000, "lastUpdated": 1442250981000, "production": "WARNER BROTHERS PICTURES", "viewer": {"meter": 86, "numReviews": 2589, "rating": 4.1}}, "type": "movie", "writers": ["Bob Kane (characters)", "Grant Morrison (comic book)", "Andy Kubert (graphic novel illustrator)", "James Robinson (story)", "Joe R. Lansdale (screenplay)"], "year": 2014}