{"_id": "573a13a6f29313caabd171ac", "awards": {"nominations": 2, "text": "2 nominations.", "wins": 0}, "cast": ["Ryan Reynolds", "Tara Reid", "Tim Matheson", "Kal Penn"], "countries": ["Germany", "USA"], "directors": ["Walt Becker"], "fullplot": "In certain circles, Van Wilder is a living legend at Coolidge College, where he's been a student now for seven years, not yet having completed his degree requirements. Despite being bright, he never attends classes anymore, instead hosting parties, imparting his brand of wisdom to his adoring fans, hosting school organization fundraisers, and rallying the college spirit among the student body. Conversely, Van loves his Coolidge life. In his antics, he has a 2ic in Hutch, and always hires a personal assistant, this year's being a South Asian transfer student named Taj, who wants to learn from the best, namely Van. Van's college life is threatened when his wealthy neglectful father only now learns that Van is still in school, Wilder Sr. who has been paying his way all this time. As such, Wilder Sr. pulls the plug on that subsidy, meaning that Van has to figure out a way to pay for his Coolidge life. Because of his living legend status, Van becomes the subject of a series of articles by the college paper's star reporter, Gwen Pearson, an assignment she would rather not do, preferring harder hitting material. However, in Gwen needing to spend time with Van, Richard Bagg, Gwen's arrogant fraternity president pre-med boyfriend, tries to place Van in a bad light time and time again, believing that Gwen and Van are falling for each other. Also in spending time with Gwen, Van may come to a true understanding of why he has stayed at Coolidge for such a long time, and what he should be looking for in his future.", "genres": ["Comedy", "Romance"], "imdb": {"id": 283111, "rating": 6.4, "votes": 83791}, "languages": ["English"], "lastupdated": "2015-09-04 00:16:44.053000000", "metacritic": 26, "num_mflix_comments": 1, "plot": "The most popular kid on campus meets a beautiful journalist who makes him realize that maybe he's afraid to graduate.", "poster": "https://m.media-amazon.com/images/M/MV5BMTM4YjQxYzAtNzAyNy00Zjk1LTk4ZTMtNTUwNTBjMWY1M2IwXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1017964800000, "runtime": 92, "title": "Van Wilder: Party Liaison", "tomatoes": {"boxOffice": "$21.0M", "consensus": "A derivative gross-out comedy that's short on laughs.", "critic": {"meter": 19, "numReviews": 96, "rating": 3.4}, "dvd": 1029801600000, "fresh": 18, "lastUpdated": 1442255274000, "production": "Artisan Entertainment", "rotten": 78, "viewer": {"meter": 74, "numReviews": 203323, "rating": 3.3}, "website": "http://www.nationallampoon.com/vanwilder"}, "type": "movie", "writers": ["Brent Goldberg", "David Wagner"], "year": 2002}