{"_id": "573a13a9f29313caabd2038b", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Dolph Lundgren", "Alex Karzis", "Kata Dobè", "Corey Sevier"], "countries": ["USA", "Canada"], "directors": ["Sidney J. Furie"], "fullplot": "Hamilton High is no place for a teacher who cares. Teacher Sam Decker doesn't care anymore. He's quitting. Sam marks his last day in the battleground of public education by getting saddled with the detention class after hours, playing warden to a pack of rebellious students, the worst troublemakers in school. But Hamilton High is about to become an all too real battleground when a well-organized group of killers armed with automatic weapons and explosives invade the supposedly deserted school after hours to use it as an operating base for meticulously planned armored car robbery. Led by the brilliant and sadistic Chester Lamb, the invaders are surprised to discover Sam and the kids from the detention room are still inside the school. The hunt is on as the killers ruthlessly stalk the teacher and students through the school's halls and classrooms, while Lamb tracks them on the surveillance cameras, turning the school's security system against his prey. Sam and the kids band together and manage to combat the armed thugs and foil Lamb's perfectly planned crime. Along the way, they discover a sinister conspiracy that reaches to the police department and even the highest level of government. But Sam Decker still has a few tricks to teach the kids, and he's got some thingfs to learn from them. Tonight at Hamilton High, the lesson is survival.", "genres": ["Action", "Drama", "Thriller"], "imdb": {"id": 321997, "rating": 4.3, "votes": 1780}, "languages": ["English", "Hungarian"], "lastupdated": "2015-08-29 00:00:52.170000000", "num_mflix_comments": 4, "plot": "A heroic high school teacher leads a band of students trapped in school by violent drug-runners.", "poster": "https://m.media-amazon.com/images/M/MV5BMTI2MDY4MzI5NV5BMl5BanBnXkFtZTcwNDU5MDUyMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1062720000000, "runtime": 98, "title": "Detention", "tomatoes": {"dvd": 943920000000, "lastUpdated": 1438280025000, "viewer": {"meter": 27, "numReviews": 850, "rating": 2.8}}, "type": "movie", "writers": ["Paul Lynch (story)", "John Sheppard"], "year": 2003}