{"_id": "573a13def29313caabdb5838", "awards": {"nominations": 2, "text": "1 win & 2 nominations.", "wins": 1}, "cast": ["Antti Litja", "Petra Frey", "Mari Perankoski", "Iikka Forss"], "countries": ["Finland"], "directors": ["Dome Karukoski"], "fullplot": "The Grump is a man from the past. A man who knows that everything used to be so much better in the old days. Pretty much everything that's been done after 1953 has always managed to ruin The Grump's day. Our story unfolds as The Grump takes a fall from his basement steps, hurting his ankle. He has to spend a weekend in Helsinki to attend physiotherapy. The Grump doesn't like this for four reasons: 1) He has to take a taxi. 2) He can't take daily care of his wife, an Alzheimer's patient. 3) He can't drive, which means he might have to sit in a car with a female driver. 4) He has to spend time with his family. The daughter-in-law is a career woman, not keen to spend time with The Grump when he comes to the city. Her boss has given her the task to look after Russian businessmen supposed to close a major deal over the weekend. It doesn't make her any happier when The Grump decides to help with the deal. Then The Grump has to face his useless son to become the father he never was, teaching his son how to take care of his loved ones. A thing The Grump has never been able to do. And somebody's day will be ruined.", "genres": ["Comedy"], "imdb": {"id": 2480454, "rating": 7, "votes": 860}, "languages": ["Finnish"], "lastupdated": "2015-08-19 00:25:04.343000000", "plot": "The Grump is a man from the past. A man who knows that everything used to be so much better in the old days. Pretty much everything that's been done after 1953 has always managed to ruin ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTU4OTI1MDI5NF5BMl5BanBnXkFtZTgwOTUwMTQwMjE@._V1_SY1000_SX677_AL_.jpg", "released": 1409875200000, "runtime": 104, "title": "The Grump", "tomatoes": {"lastUpdated": 1439838327000, "viewer": {"numReviews": 31, "rating": 3.5}}, "type": "movie", "writers": ["Dome Karukoski", "Tuomas Kyrè (novel)", "Tuomas Kyrè (screenplay)", "Pekko Pesonen (shooting script)"], "year": 2014}