{"_id": "573a13dbf29313caabdae9b1", "awards": {"nominations": 3, "text": "9 wins & 3 nominations.", "wins": 9}, "cast": ["Tatiana Maslany", "Richard Dreyfuss", "Aaron Poole", "Jayne Eastwood"], "countries": ["Canada"], "directors": ["Jason Priestley"], "fullplot": "In Winnipeg, Dr. Cas Pepper has just found out he has a terminal brain tumor. Dylan Morgan is an aspiring writer. The two first set eyes on each other in the hospital ward, where Dylan was trying to get inspired for her writings. Despite being a mismatched pair, the two end up on a journey together, largely out of a joint incident with Dylan's boyfriend Bobby, to head \"west\". This journey was originally Cas' alone as part of what he felt he needed to do in light of his diagnosis, his complete mission about which Dylan is unaware. Although he would like to do this trip on his own beyond the issue with Bobby, he finds it is more difficult to get rid of Dylan than he would like. It seems as if Dylan is both running away from Bobby, and running toward what she hopes is that lucrative writing career, that next step being a meeting with a representative at a publishing house in Vancouver. This journey ends up being one of discovery for both, both in terms of learning about the other's full current mission - which each believes he/she gets a better handle on from information gleaned from the other's cell phone - and what the other truly means to him/herself in their short time together.", "genres": ["Comedy", "Drama"], "imdb": {"id": 2334593, "rating": 6.7, "votes": 477}, "languages": ["English"], "lastupdated": "2015-08-31 00:26:51.030000000", "metacritic": 32, "num_mflix_comments": 2, "plot": "A dying Doctor, who plans to check out on his own terms, takes a reluctant detour when he inadvertently winds up on the lam with an 'anything-but-normal' 22-year-old girl.", "poster": "https://m.media-amazon.com/images/M/MV5BMjMzMTk5OTgzMF5BMl5BanBnXkFtZTgwNDkwNjY0MTE@._V1_SY1000_SX677_AL_.jpg", "released": 1430438400000, "runtime": 90, "title": "Cas & Dylan", "tomatoes": {"critic": {"meter": 31, "numReviews": 13, "rating": 4.7}, "dvd": 1433808000000, "fresh": 4, "lastUpdated": 1440099376000, "production": "Entertainment One Films", "rotten": 9, "viewer": {"meter": 72, "numReviews": 135, "rating": 3.7}, "website": "http://casanddylanmovie.com/"}, "type": "movie", "writers": ["Jessie Gabe"], "year": 2013}