{"_id": "573a1393f29313caabcde3af", "awards": {"nominations": 3, "text": "Won 1 Oscar. Another 2 nominations.", "wins": 0}, "cast": ["Terry Moore", "Ben Johnson", "Robert Armstrong", "Mr. Joseph Young"], "countries": ["USA"], "directors": ["Ernest B. Schoedsack"], "fullplot": "In Africa, the girl Jill Young trades a baby gorilla with two natives and raises the animal. Twelve years later, the talkative and persuasive promoter Max O'Hara organizes a safari to Africa with the Oklahoma cowboy Gregg to bring attractions to his new night-club in Hollywood. They capture several lions and out of blue, they see a huge gorilla nearby their camping and they try to capture the animal. However, the teenager Jill Young stops the men that intended to kill her gorilla. Max seduces Jill with a fancy life in Hollywood and she signs a contract with him where the gorilla Joseph \"Joe\" Young would be the lead attraction. Soon she realizes that her dream is a nightmare to Joe and she asks Max to return to Africa. However he persuades her to stay a little longer in the show business. But when three alcoholic costumers give booze to Joe, the gorilla destroys the spot and is sentenced by the justice to be sacrificed. Will Jill, Gregg and Max succeed in saving Joe?", "genres": ["Adventure", "Drama", "Fantasy"], "imdb": {"id": 41650, "rating": 7, "votes": 3101}, "languages": ["English", "Swahili"], "lastupdated": "2015-08-26 01:17:07.773000000", "plot": "In Africa, the girl Jill Young trades a baby gorilla with two natives and raises the animal. Twelve years later, the talkative and persuasive promoter Max O'Hara organizes a safari to ...", "poster": "https://m.media-amazon.com/images/M/MV5BYTkwYTM1Y2QtMWUwNC00YTg5LWI5M2QtMGM0MDM1YjczNDY5XkEyXkFqcGdeQXVyMTMxMTY0OTQ@._V1_SY1000_SX677_AL_.jpg", "rated": "APPROVED", "released": -641952000000, "runtime": 84, "title": "Mighty Joe Young", "tomatoes": {"critic": {"meter": 94, "numReviews": 18, "rating": 6.4}, "dvd": 1132617600000, "fresh": 17, "lastUpdated": 1442343732000, "production": "RKO Radio Pictures Inc.", "rotten": 1, "viewer": {"meter": 62, "numReviews": 7718, "rating": 3.1}}, "type": "movie", "writers": ["Ruth Rose (screenplay)", "Merian C. Cooper (from an original story by)"], "year": 1949}