{"_id": "573a1395f29313caabce23c2", "awards": {"nominations": 1, "text": "1 win & 1 nomination.", "wins": 1}, "cast": ["Jeanne Moreau", "Georges Gèret", "Michel Piccoli", "Franèoise Lugagne"], "countries": ["Italy", "France"], "directors": ["Luis Buèuel"], "fullplot": "Celestine, the chambermaid, has new job on the country. The Monteils, who she works for are a group of strange people. The wife is frigid, her husband is always hunting (both animals and women) and her father is a shoe-fetishist. Joseph, the farm-labourer is a fascist and sexually attracted to Celestine. Celestine settles herself and talks to the neighbour, an ex-officer, who likes damaging his neighbour's things. After the death of the old man, she quits her job, but because of the rape and murder of a child 'Little Claire' she decides to stay, believing that Joseph is the murderer. To get his confession she sleeps with him and promises to marry him. In spite of her engagement she fakes evidence to implicate him in the murder. He is arrested, but is released because the evidence is inconclusive. She marries the ex-officer and takes on a housewife role similar to that of Madame Monteil", "genres": ["Crime", "Drama"], "imdb": {"id": 58249, "rating": 7.6, "votes": 5777}, "languages": ["French"], "lastupdated": "2015-09-05 00:43:44.540000000", "num_mflix_comments": 1, "plot": "Celestine, the chambermaid, has new job on the country. The Monteils, who she works for are a group of strange people. The wife is frigid, her husband is always hunting (both animals and ...", "poster": "https://m.media-amazon.com/images/M/MV5BZjUzNjA1ZTgtY2Y5Ni00NGM0LTg3ODUtNWMzM2IzMmZmMmE0XkEyXkFqcGdeQXVyMTIyNzY1NzM@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": -151977600000, "runtime": 101, "title": "Diary of a Chambermaid", "tomatoes": {"critic": {"meter": 85, "numReviews": 20, "rating": 8}, "dvd": 1006214400000, "fresh": 17, "lastUpdated": 1440612543000, "production": "20th Century-Fox", "rotten": 3, "viewer": {"meter": 83, "numReviews": 3861, "rating": 3.8}}, "type": "movie", "writers": ["Octave Mirbeau (based on the novel by)", "Luis Buèuel (adaptation)", "Jean-Claude Carrière (adaptation)"], "year": 1964}