{"_id": "573a13b3f29313caabd3bd45", "awards": {"nominations": 5, "text": "7 wins & 5 nominations.", "wins": 7}, "cast": ["Marcelo Faria", "Maria Flor", "Mèrcio Libar", "Netinho Alves"], "countries": ["Brazil", "France", "Portugal", "Switzerland"], "directors": ["Alice de Andrade"], "fullplot": "In Copabacana, the pothead surfer Paulo Roberto is the son of a politician with a dysfunctional family that spends the day surfing and smoking grass. The family maid has a son, the smalltime drug dealer China, who spends most of the time in the beach with Paulo. In the building across the street lives the sexy Amazon-born babysitter Rita de Cèssia that has a crush on Paulo. On the streets, the boy Waldick has just arrived from the country of Minas Gerais and idolizes the successful TV entertainer Fèlvio Fontes, who worked as a street vendor when was a boy. When Rita meets Paulo and tells him that she is virgin, Paulo leaves her telling that he likes whores. Rita visits the pimp Tim Mais and asks him to work as a prostitute using the nickname of Mystery to draw the attention of Paulo Roberto. Mystery becomes a hit among the clients of Tim. Their lives entwines when Paulo steals a can of marijuana that China had found in the sea, while Paulo Roberto, Tim Mais and Waldick fall in love for Mystery.", "genres": ["Comedy"], "imdb": {"id": 440270, "rating": 6.5, "votes": 249}, "languages": ["Portuguese"], "lastupdated": "2015-09-06 01:03:48.057000000", "plot": "In Copabacana, the pothead surfer Paulo Roberto is the son of a politician with a dysfunctional family that spends the day surfing and smoking grass. The family maid has a son, the ...", "released": 1123804800000, "runtime": 108, "title": "O Diabo a Quatro", "tomatoes": {"lastUpdated": 1430248801000, "viewer": {"numReviews": 221, "rating": 3.1}}, "type": "movie", "writers": ["Pauline Alphen", "Jacques Arhex", "Joaquim Assis", "Jean-Vincent Fournier", "Clèudio MacDowell", "Evandro Mesquita", "Alice de Andrade"], "year": 2004}