{"_id": "573a13d9f29313caabdaa530", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["John Cleese", "Troye Sivan", "Sven Ruygrok", "Byron Langley"], "countries": ["South Africa"], "directors": ["Donovan Marsh"], "fullplot": "The year is 1991, and Spud Milton's long walk to manhood is still creeping along at an unnervingly slow pace. Approaching the ripe old age of fifteen and still no signs of the much anticipated ball-drop, Spud is coming to terms with the fact that he may well be a freak of nature. With a mother hell-bent on emigrating, a father making a killing out of selling homemade moonshine, and a demented grandmother called Wombat, the new year seems to offer little except extreme embarrassment and more mortifying Milton madness. But Spud is returning to a boarding school where he is no longer the youngest or the smallest. His dormitory mates, known as the Crazy Eight, have an unusual new member and his house has a new clutch of first years (the Normal Seven). If Spud thinks his second year will be a breeze, however, he is seriously mistaken. He is soon beset with women trouble, coerced into misguided late-night adventures, and funds his dreams of a famous career on the stage in tatters after landing the part of the Dove of Peace in a disastrous house play production of Noah's Ark. To top it all off, boarding master Sparerib and his prefects Death breath and Earthworm are concocting an almighty plan to get Spud and the Crazy 8 expelled! Hilarious, bitter-sweet, tragic and real, join Spud as he takes another tentative step forward while all around him the madness continues...", "genres": ["Comedy"], "imdb": {"id": 2262270, "rating": 6.2, "votes": 680}, "languages": ["English"], "lastupdated": "2015-09-10 17:53:37.397000000", "num_mflix_comments": 1, "plot": "Spud faces the second year of boarding school whilst still waiting for his own body to mature as much as he has.", "poster": "https://m.media-amazon.com/images/M/MV5BMTM3ODY0OTI3OF5BMl5BanBnXkFtZTgwMzc2OTYwMDE@._V1_SY1000_SX677_AL_.jpg", "released": 1370476800000, "runtime": 91, "title": "Spud 2: The Madness Continues", "tomatoes": {"lastUpdated": 1440960513000, "viewer": {"numReviews": 80, "rating": 3.4}}, "type": "movie", "writers": ["Donovan Marsh"], "year": 2013}