{"_id": "573a13a9f29313caabd1efbf", "awards": {"nominations": 6, "text": "2 wins & 6 nominations.", "wins": 2}, "cast": ["Queen Latifah", "Jimmy Fallon", "Henry Simmons", "Jennifer Esposito"], "countries": ["USA", "France"], "directors": ["Tim Story"], "fullplot": "Belle Williams is a speed demon. Flying through the streets of New York in her tricked-out taxi, she's earned a rep as New York's fastest cabbie. But driving a hack is only a pit stop for her real dream: Belle wants to be a race car champion. And she's well on her way--until she's derailed by overeager cop Andy Washburn, whose undercover skills are matched only by his total ineptitude behind the wheel. Washburn, whose lack of vehicular skills has landed him in the precinct doghouse, is hot on the heels of a gang of beautiful Brazilian bank robbers, led by Vanessa, their cold, calculating--and leggy--leader. To nab the evasive crooks, drivers license-less Washburn convinces Belle to team up with him to pursue Vanessa and crew. Belle has carte blanche to drive at any speed and break any law. The car-less cop and speed-demon cabbie--New York's unlikeliest partners-- begin a high-speed game of cat and mouse with the robbers. That is, if Belle and Washburn don't end up killing each other first.", "genres": ["Action", "Comedy", "Crime"], "imdb": {"id": 316732, "rating": 4.4, "votes": 30663}, "languages": ["English", "Portuguese", "Spanish"], "lastupdated": "2015-09-01 00:14:35.537000000", "metacritic": 27, "num_mflix_comments": 1, "plot": "A mouthy and feisty taxicab driver has hot tips for a green and inept cop set on solving a string of New York City bank robberies committed by a quartet of female Brazilian bank robbers.", "poster": "https://m.media-amazon.com/images/M/MV5BMTYwNTY2NTkzNV5BMl5BanBnXkFtZTYwMjE2ODA3._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1097020800000, "runtime": 97, "title": "Taxi", "tomatoes": {"boxOffice": "$36.5M", "consensus": "Silly and unfunny remake of a French movie of the same name.", "critic": {"meter": 10, "numReviews": 105, "rating": 3.4}, "dvd": 1108425600000, "fresh": 11, "lastUpdated": 1440269960000, "production": "20th Century Fox", "rotten": 94, "viewer": {"meter": 43, "numReviews": 183634, "rating": 2.8}, "website": "http://www.taximovie.com/"}, "type": "movie", "writers": ["Luc Besson (earlier screenplay)", "Robert Ben Garant (screenplay)", "Thomas Lennon (screenplay)", "Jim Kouf (screenplay)"], "year": 2004}