{"_id": "573a13dff29313caabdb87c5", "awards": {"nominations": 3, "text": "5 wins & 3 nominations.", "wins": 5}, "cast": ["Leon Alan Beiersdorf", "Matthias Dittmer", "Lea Draeger", "Monika Hetterle"], "countries": ["Germany"], "directors": ["Ramon Zèrcher"], "fullplot": "Siblings Karin and Simon are visiting their parents and their little sister Clara. That evening, other relatives will be joining them for dinner. Over the course of the day, the washing machine is repaired, people sit together at the kitchen table, carry out an experiment with orange peel, talk about lungs, and sew on a button that was deliberately torn off. This sequence of family scenes in a Berlin flat complete with cat and dog creates a wondrous world of the everyday: Coming and going, all manner of doings, each movement leading to the next, one word following another. It is a carefully staged chain reaction of actions and sentences. And in between, silent gazes and anecdotes about experiences. The people act oddly even-temperedly; their dialogues are direct and unemotional. Even the pets and the material surroundings play a part. Some objects seem alive as if by magic. Commonplace actions and familiar items appear absurd and eerie in this narrative cosmos. Putting the absurdities of daily life on display and translating unspectacular events into an exciting choreography of everyday life, this film is no small feat.", "genres": ["Comedy", "Drama", "Family"], "imdb": {"id": 2586000, "rating": 6.6, "votes": 572}, "languages": ["German"], "lastupdated": "2015-09-16 06:10:44.277000000", "metacritic": 80, "num_mflix_comments": 1, "plot": "A family in a house, and a chain of events that take place, on an ordinary evening that they plan to have dinner with relatives.", "poster": "https://m.media-amazon.com/images/M/MV5BMGY2Nzc5MzgtNjZiMy00YzdmLWIyMzctMTk2MGY3ODNjMzZlXkEyXkFqcGdeQXVyMTQ0MzMwNQ@@._V1_SY1000_SX677_AL_.jpg", "released": 1388620800000, "runtime": 72, "title": "The Strange Little Cat", "tomatoes": {"critic": {"meter": 73, "numReviews": 15, "rating": 7.1}, "fresh": 11, "lastUpdated": 1438631895000, "production": "Kimstim", "rotten": 4, "viewer": {"meter": 53, "numReviews": 224, "rating": 3.3}, "website": "http://www.kimstim.com/cat.html"}, "type": "movie", "writers": ["Ramon Zèrcher (screenplay)"], "year": 2013}