{"_id": "573a13d8f29313caabda84a9", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["A.J. Cook", "Sebastian Rochè", "Vik Sahay", "Stephanie Lemelin"], "countries": ["USA"], "directors": ["William Brent Bell"], "fullplot": "In France, the Porter family is slaughtered while camping in the woods and only Claire Porter survives seriously wounded. She reports that her husband Henry and her son Peter have been eaten alive by a strong man. The eremite Talan Gwynek that lives in the woods with his mother is arrested by the police accused of being the killer. The defense attorney Kate Moore is assigned to defend Talan and she comes to the police station with her investigator Eric Sarin and the animal expert Gavin Flemyng to interview Talan. The unwilling police inspector Klaus Pistor is sure that Talan is the murderer but has to let Kate and her team work. There is turmoil in the precinct and Gavin is scratched by Talan. Then they visit Talan's mother Mrs. Gwynek and they learn that Talan has a rare disease. Further, the government wants her lands to dispose nuclear waste and her husband has recently died in car accident. Soon Eric discloses that the death of Mr. Gwynek was suspicious and Pistor was in charge of the investigation. When Kate succeeds in sending Talan to a hospital for examination, she discovers the effects of Talan's disease and is the responsible for the next events.", "genres": ["Action", "Horror", "Mystery"], "imdb": {"id": 2229511, "rating": 5.9, "votes": 4762}, "languages": ["English", "French"], "lastupdated": "2015-08-21 00:40:55.437000000", "num_mflix_comments": 4, "plot": "A defense attorney begins to suspect that there might be more to her client, who is charged with the murders of a vacationing family, than meets the eye.", "poster": "https://m.media-amazon.com/images/M/MV5BNDM2MDYxODE2Ml5BMl5BanBnXkFtZTgwMjcxMjc3MTE@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1408406400000, "runtime": 89, "title": "Wer", "tomatoes": {"dvd": 1411430400000, "lastUpdated": 1439926074000, "production": "Universal Pictures", "viewer": {"meter": 39, "numReviews": 362, "rating": 3}}, "type": "movie", "writers": ["William Brent Bell (screenplay)", "Matthew Peterman (screenplay)"], "year": 2013}