{"_id": "573a13b8f29313caabd4bcd9", "awards": {"nominations": 2, "text": "2 nominations.", "wins": 0}, "cast": ["Kiefer Sutherland", "Paula Patton", "Cameron Boyce", "Erica Gluck"], "countries": ["USA", "Romania", "Germany"], "directors": ["Alexandre Aja"], "fullplot": "In New York, the former NYPD detective Ben Carson is hired to work as night watch of the remains of the Mayflower Department Store that was partially destroyed by fire many years ago. Ben became alcoholic and was retired from the police force after killing a man in a shooting. His marriage was also destroyed and now he is living in the apartment of his younger sister Angie. However he has not been drinking for three months and sees the employment as a chance to rebuild his life. When he goes to the rounds in his first night, he finds that the mirrors are impeccably clean and his colleague explains that the former night watch was obsessed with the mirrors. After a couple of nights, Ben sees weird images in the mirrors, but due to the lack of credibility of his past, his ex-wife Amy believes he has hallucinations as a side effect of his medication. When Angie is found brutally murdered in her bathtub, Ben discovers that there is an evil force in the mirror that is chasing him and jeopardizing his family.", "genres": ["Horror", "Mystery", "Thriller"], "imdb": {"id": 790686, "rating": 6.2, "votes": 80807}, "languages": ["English"], "lastupdated": "2015-09-16 07:18:24.327000000", "metacritic": 35, "plot": "An ex-cop and his family are the target of an evil force that is using mirrors as a gateway into their home.", "poster": "https://m.media-amazon.com/images/M/MV5BMTI2NTA1ODEyOF5BMl5BanBnXkFtZTcwNjc3MjY3MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1218758400000, "runtime": 110, "title": "Mirrors", "tomatoes": {"boxOffice": "$30.6M", "consensus": "Inconsistency and listless plot make this K-horror remake a less-than-frightening time at the movies.", "critic": {"meter": 14, "numReviews": 85, "rating": 3.8}, "dvd": 1231804800000, "fresh": 12, "lastUpdated": 1442339861000, "production": "Buena Vista", "rotten": 73, "viewer": {"meter": 44, "numReviews": 90541, "rating": 3.1}, "website": "http://www.mirrorsmovie.com/"}, "type": "movie", "writers": ["Alexandre Aja (screenplay)", "Grègory Levasseur (screenplay)", "Sung-ho Kim (Korean motion picture \"Into the Mirror\")"], "year": 2008}