{"_id": "573a13d5f29313caabd9d2dc", "awards": {"nominations": 6, "text": "5 wins & 6 nominations.", "wins": 5}, "cast": ["Dree Hemingway", "Boonee", "Stella Maeve", "Sheri Vecchio"], "countries": ["USA", "UK"], "directors": ["Sean Baker"], "fullplot": "STARLET explores the unlikely cross-generational friendship between 21 year-old Jane (Dree Hemingway), and the elderly Sadie (Besedka Johnson), two women whose worlds collide in California's San Fernando Valley. Jane, an aspiring actress, spends her time getting high with her dysfunctional roommates, Melissa and Mikey (Stella Maeve and James Ransone), while caring for her Chihuahua, Starlet. Sadie, a widow, passes her days alone, tending to her flower garden. After a confrontation between the women at Sadie's yard sale, Jane uncovers a hidden stash of money inside a relic from Sadie's past. Jane attempts to befriend the caustic older woman in an effort to solve her dilemma and secrets emerge as their relationship grows. Director Sean Baker continues in the naturalistic style of his previous films, the award-winning and Spirit Award nominees PRINCE OF BROADWAY and TAKE OUT, capturing the rhythms of everyday life with an authenticity rarely seen in cinema. Featuring a pair of exceptional debut performances by Dree Hemingway (great granddaughter of Ernest and daughter of Mariel) and 85 year-old Besedka Johnson who received a Special Jury Recognition for her performance at SXSW. STARLET is at once provocative, haunting, unpredictable, and surprisingly sweet.", "genres": ["Drama"], "imdb": {"id": 2035630, "rating": 6.7, "votes": 3891}, "languages": ["English"], "lastupdated": "2015-09-03 00:47:23.883000000", "metacritic": 74, "num_mflix_comments": 1, "plot": "An unlikely friendship forms between 21 year-old Jane and the elderly Sadie after Jane discovers a hidden stash of money inside an object at Sadie's yard sale.", "poster": "https://m.media-amazon.com/images/M/MV5BMzI5NTI3MjYyNl5BMl5BanBnXkFtZTcwNTg1NjQ2OA@@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 1368057600000, "runtime": 103, "title": "Starlet", "tomatoes": {"boxOffice": "$87.9k", "critic": {"meter": 88, "numReviews": 43, "rating": 7.3}, "dvd": 1367884800000, "fresh": 38, "lastUpdated": 1440010243000, "production": "Music Box Films", "rotten": 5, "viewer": {"meter": 67, "numReviews": 3718, "rating": 3.6}, "website": "http://www.musicboxfilms.com/starlet-movies-44.php"}, "type": "movie", "writers": ["Sean Baker", "Chris Bergoch"], "year": 2012}