{"_id": "573a13a9f29313caabd1f431", "awards": {"nominations": 15, "text": "23 wins & 15 nominations.", "wins": 23}, "cast": ["Lèzaro Ramos", "Marcelia Cartaxo", "Flavio Bauraqui", "Fellipe Marques"], "countries": ["Brazil", "France"], "directors": ["Karim Aènouz"], "fullplot": "A story inspired by the life of one of the most remarkable figures in Brazilian popular culture, Joèo Francisco dos Santos (1900-1976). In turn, bandit, transvestite, street fighter, brothel cook, convict and father to seven adopted children, dos Santos--better known as Madame Satè--was also a notorious gay performer who pushed social boundaries in a volatile time. The story begins in 1932, in Rio de Janeiro's bohemian Lapa district, when Joèo Francisco is about to achieve his dream: becoming a stage star. In the sordid yet lively world of Lapa--populated by pimps, prostitutes and other denizens of Rio's underworld--Joèo battles the streets and presides over a surrogate family that includes the charming prostitute Laurita, and her baby daughter whom everyone dotes on; the flamboyant hustler Taboo; Joèo's teenage lover, Renatinho; and Amador, the owner of the Blue Danube club which is their second home. It is at the Blue Danube that street tough Joèo begins to sing, and the mythic drag artiste Madam Satè is born.", "genres": ["Biography", "Crime", "Drama"], "imdb": {"id": 317887, "rating": 7.1, "votes": 1834}, "languages": ["Portuguese"], "lastupdated": "2015-09-10 17:08:30.303000000", "metacritic": 59, "num_mflix_comments": 3, "plot": "Loose portrait of Joèo Francisco dos Santos, also known as Madame Satè, a sometime chef, transvestite, lover, father, hero and convict from Rio de Janeiro.", "poster": "https://m.media-amazon.com/images/M/MV5BMTU3MzU3NTI1Nl5BMl5BanBnXkFtZTcwOTE3MzAwMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "UNRATED", "released": 1036713600000, "runtime": 105, "title": "Madame Satè", "tomatoes": {"critic": {"meter": 60, "numReviews": 42, "rating": 6.2}, "dvd": 1073952000000, "fresh": 25, "lastUpdated": 1438715927000, "production": "Wellspring", "rotten": 17, "viewer": {"meter": 80, "numReviews": 1407, "rating": 3.7}, "website": "http://www.wellspring.com/movies/movie.html?movie_id=7"}, "type": "movie", "writers": ["Karim Aènouz", "Marcelo Gomes", "Sèrgio Machado", "Mauricio Zacharias"], "year": 2002}