{"_id": "573a13c1f29313caabd658dd", "awards": {"nominations": 4, "text": "1 win & 4 nominations.", "wins": 1}, "cast": ["David James Elliott", "Natasha Henstridge", "Benjamin Sadler", "Florentine Lahme"], "countries": ["Germany", "Canada"], "fullplot": "While the entire world watches the largest meteor shower in 10,000 years, a rogue asteroid, hidden by the meteor field, smashes into the moon in a tremendous explosion of rock and debris. Fragments from the asteroid, and even from the moon itself, penetrate Earth's atmosphere and make impact. Even though the initial damage is minimal, nerves are frayed throughout the planet. There is significant physical damage to the lunar surface, but experts quickly conclude there will be no lasting ramifications. Then strange anomalies begin to manifest themselves on Earth. It starts small - cell phone disruptions, unusual static charges and odd tidal behavior. The world's leading scientists, including Alex Kittner, Maddie Rhodes and Roland Emerson, begin piecing together evidence that suggests the moon's properties, and its orbit, may have been permanently altered. Their fears are realized when the anomalies increase to the point where the effect of \"simulated\" gravity is being manipulated by increased electromagnetic surges coming from the moon. People, cars and other objects are rendered momentarily weightless in random, isolated areas around the globe. Alex, Maddie, Roland and the rest of their team soon discover something far worse - the moon's new orbit has put it on a collision course with Earth! The world now has 39 days to stop it or Earth, and all of mankind, will perish. After a failed attempt by the United States to destroy the moon, our heroes bring all the countries of the world together in one last hope for humanity - an international mission to the moon itself where astronauts will attempt to reverse the magnetic effects and restore the moon to its original orbit. Alex, whose children are now missing after the latest rampage of anti-gravity, is emotionally torn as he must now join Roland and two other astronauts on the Earth saving mission into space. It is a race against time as the two celestial bodies are drawn closer and closer to impact, the world united, watching and praying, the survival of mankind in the balance.", "genres": ["Action", "Adventure", "Drama"], "imdb": {"id": 1227637, "rating": 5.6, "votes": 2764}, "languages": ["English", "German", "French"], "lastupdated": "2015-09-05 00:01:43.127000000", "plot": "While the entire world watches the largest meteor shower in 10,000 years, a rogue asteroid, hidden by the meteor field, smashes into the moon in a tremendous explosion of rock and debris. ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTM1MDY4NjM5N15BMl5BanBnXkFtZTcwMzc3NTY1Mg@@._V1_SY1000_SX677_AL_.jpg", "released": 1245542400000, "runtime": 180, "title": "Impact", "tomatoes": {"dvd": 1299542400000, "lastUpdated": 1441304948000, "production": "Eros International", "viewer": {"meter": 42, "numReviews": 884, "rating": 3.3}, "website": "http://www.aladin.erosentertainment.com/"}, "type": "movie", "year": 2009}