{"_id": "573a13a8f29313caabd1cce0", "awards": {"nominations": 8, "text": "2 wins & 8 nominations.", "wins": 2}, "cast": ["George Clooney", "Natascha McElhone", "Viola Davis", "Jeremy Davies"], "countries": ["USA"], "directors": ["Steven Soderbergh"], "fullplot": "Dr. Gibarian, part of a team at a space station studying Solaris, makes an urgent and self-described bizarre video request to his friend, civilian psychiatrist Dr. Chris Kelvin, to come to the station to deal with an unspecified phenomenon aboard, that phenomenon with which Chris' experience and background may be able to explain and solve. Chris learns that his trip is sanctioned by the space program as a security force had been sent to the station to investigate, that security team which is now missing. When Chris arrives at the station, he finds only two surviving team members, Drs. Gordon and Snow (Dr. Gibarian committed suicide), who are both acting nervously. Chris also finds two unexpected people there, the first, who Chris only sees fleetingly, being Dr. Gibarian's adolescent son Michael, and the second being Chris' deceased wife, Rheya. Chris and Rheya had a passionate relationship in all its good and bad before she committed suicide. Apparently, these appearances of loved ones of the crew at the station are what Chris has come to investigate. As Chris, Gordon and Snow discuss and argue about what to do, Chris becomes emotionally invested in this vision of his wife, who herself begins to realize she looks like Rheya, acts like Rheya (including having the same feelings for Chris), answers to the name Rheya, but is not really the Rheya that was once Chris' wife.", "genres": ["Drama", "Mystery", "Romance"], "imdb": {"id": 307479, "rating": 6.2, "votes": 64906}, "languages": ["English"], "lastupdated": "2015-09-10 17:18:27.433000000", "metacritic": 65, "num_mflix_comments": 1, "plot": "A troubled psychologist is sent to investigate the crew of an isolated research station orbiting a bizarre planet.", "poster": "https://m.media-amazon.com/images/M/MV5BNzlkNGE0MmMtMzU4YS00ZDU1LWFhMTktZDRjMGU5MjI1MzRlXkEyXkFqcGdeQXVyNDk3NzU2MTQ@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1038355200000, "runtime": 99, "title": "Solaris", "tomatoes": {"boxOffice": "$14.8M", "consensus": "Slow-moving, cerebral, and ambiguous, Solaris is not a movie for everyone, but it offers intriguing issues to ponder.", "critic": {"meter": 66, "numReviews": 202, "rating": 6.5}, "dvd": 1059436800000, "fresh": 133, "lastUpdated": 1442164014000, "production": "20th Century Fox", "rotten": 69, "viewer": {"meter": 59, "numReviews": 47392, "rating": 2.9}, "website": "http://www.solaristhemovie.com/"}, "type": "movie", "writers": ["Stanislaw Lem (novel)", "Steven Soderbergh (screenplay)"], "year": 2002}