{"_id": "573a13ddf29313caabdb3335", "awards": {"nominations": 5, "text": "1 win & 5 nominations.", "wins": 1}, "cast": ["Alec Baldwin", "Rob Bowman", "Tina Fey", "James Gandolfini"], "countries": ["USA"], "directors": ["Chiemi Karasawa"], "fullplot": "What does it mean to be a performing artist - first, last and always? Broadway legend Elaine Stritch can answer that. At 87, Stritch is still here, dominating the stage in her one woman cabaret act, torturing Alec Baldwin on 30ROCK, giving us her take on aging, her struggle with alcohol and diabetes, and the fear of leaving the follow spot behind. In stolen moments from her corner room at the Carlyle, and on breaks from her tour and work, candid reflections about her life are punctuated with rare archival footage, words from friends (Hal Prince, George C. Wolfe, Nathan Lane, Cherry Jones and John Turturro) and photographs from her personal collection. By turns bold, hilarious and achingly poignant, the journey connects Stritch's present to her past, and an inspiring portrait of a one-of-a-kind survivor emerges.", "genres": ["Documentary"], "imdb": {"id": 2405792, "rating": 7.4, "votes": 641}, "languages": ["English"], "lastupdated": "2015-08-28 00:08:38.627000000", "metacritic": 81, "num_mflix_comments": 1, "plot": "The uncompromising Tony and Emmy Award-winner is showcased both on and off stage via rare archival footage and intimate cinema vèritè.", "poster": "https://m.media-amazon.com/images/M/MV5BMjIzNzgzMTY4NF5BMl5BanBnXkFtZTgwNzEyNTcwMTE@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 1366329600000, "runtime": 81, "title": "Elaine Stritch: Shoot Me", "tomatoes": {"boxOffice": "$0.3M", "consensus": "Brutally honest and utterly compelling, Elaine Stritch: Shoot Me offers a riveting, vanity-free portrait of its legendary subject while offering a few essential truths about the human condition.", "critic": {"meter": 98, "numReviews": 64, "rating": 7.9}, "dvd": 1403568000000, "fresh": 63, "lastUpdated": 1440267795000, "production": "IFC Films", "rotten": 1, "viewer": {"meter": 80, "numReviews": 2918, "rating": 3.9}, "website": "http://elainestritchshootme.com/"}, "type": "movie", "year": 2013}