{"_id": "573a139af29313caabcf0909", "awards": {"nominations": 32, "text": "Nominated for 1 Oscar. Another 9 wins & 32 nominations.", "wins": 10}, "cast": ["Bruce Willis", "Gary Oldman", "Ian Holm", "Milla Jovovich"], "countries": ["France"], "directors": ["Luc Besson"], "fullplot": "In the twenty-third century, the universe is threatened by evil. The only hope for mankind is the Fifth Element, who comes to Earth every five thousand years to protect the humans with four stones of the four elements: fire, water, Earth and air. A Mondoshawan spacecraft is bringing The Fifth Element back to Earth but it is destroyed by the evil Mangalores. However, a team of scientists use the DNA of the remains of the Fifth Element to rebuild the perfect being called Leeloo. She escapes from the laboratory and stumbles upon the taxi driver and former elite commando major Korben Dallas that helps her to escape from the police. Leeloo tells him that she must meet Father Vito Cornelius to accomplish her mission. Meanwhile, the Evil uses the greedy and cruel Jean-Baptiste Emanuel Zorg and a team of mercenary Mangalores to retrieve the stones and avoid the protection of Leeloo. But the skilled Korben Dallas has fallen in love with Leeloo and decides to help her to retrieve the stones.", "genres": ["Action", "Adventure", "Romance"], "imdb": {"id": 119116, "rating": 7.6, "votes": 314964}, "languages": ["English", "Swedish", "German"], "lastupdated": "2015-09-13 00:14:56.827000000", "metacritic": 52, "plot": "In the colorful future, a cab driver unwittingly becomes the central figure in the search for a legendary cosmic weapon to keep Evil and Mr Zorg at bay.", "poster": "https://m.media-amazon.com/images/M/MV5BZWFjYmZmZGQtYzg4YS00ZGE5LTgwYzAtZmQwZjQ2NDliMGVmXkEyXkFqcGdeQXVyNTUyMzE4Mzg@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 863136000000, "runtime": 126, "title": "The Fifth Element", "tomatoes": {"consensus": "Visually inventive and gleefully over the top, Luc Besson's The Fifth Element is a fantastic piece of pop sci-fi that never takes itself too seriously.", "critic": {"meter": 71, "numReviews": 58, "rating": 6.3}, "dvd": 881625600000, "fresh": 41, "lastUpdated": 1441907454000, "production": "Sony Pictures Home Entertainment", "rotten": 17, "viewer": {"meter": 87, "numReviews": 584929, "rating": 3.7}}, "type": "movie", "writers": ["Luc Besson (story)", "Luc Besson (screenplay)", "Robert Mark Kamen (screenplay)"], "year": 1997}