{"_id": "573a13a4f29313caabd0fd3c", "awards": {"nominations": 6, "text": "1 win & 6 nominations.", "wins": 1}, "cast": ["Joaquin Phoenix", "Ed Harris", "Scott Glenn", "Anna Paquin"], "countries": ["UK", "Germany"], "directors": ["Gregor Jordan"], "fullplot": "1989. The Berlin Wall is about to fall, and the world is about to be made safe for the new world order. But outside of Stuttgart, West Germany, at Theodore Roosevelt Army Base, Specialist Ray Elwood of the 317th Supply Battalion is about to find his own cold war turn white hot. Elwood's a lovable rogue, a conscript who's managed to turn his military servitude into a blossoming network of black market deals, more out of boredom than ambition. Officially, there's his day job as battalion secretary to the inept but caring Commander Wallace Berman. On the side, there's everything from selling the locals stolen Mop'N'Glo to cooking heroin for the base's ruthless head of Military Police, Sgt. Saad. When a new top sergeant arrives, with the avowed intention of cleaning the base up, Elwood thinks the new blood is nothing he can't handle, especially after he lays eyes on the top's daughter, rebellious Robyn. But that was before he figured in the $5 million in stolen arms that just landed on his lap, Berman's jealous wife, an insane Turkish drug dealer, and, of course, the resulting lust, betrayal, and murder.", "genres": ["Comedy", "Crime", "Drama"], "imdb": {"id": 252299, "rating": 6.9, "votes": 19914}, "languages": ["English", "Turkish"], "lastupdated": "2015-09-06 00:35:58.680000000", "metacritic": 56, "num_mflix_comments": 2, "plot": "A criminal subculture operates among U.S. soldiers stationed in West Germany just before the fall of the Berlin wall.", "poster": "https://m.media-amazon.com/images/M/MV5BMTI1MDYxMTE3MV5BMl5BanBnXkFtZTYwMzc1NDk5._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1036022400000, "runtime": 98, "title": "Buffalo Soldiers", "tomatoes": {"consensus": "Overall, this caustic comedy hits more of its targets than it misses.", "critic": {"meter": 73, "numReviews": 114, "rating": 6.5}, "dvd": 1073952000000, "fresh": 83, "lastUpdated": 1440269830000, "production": "Miramax Films", "rotten": 31, "viewer": {"meter": 73, "numReviews": 15508, "rating": 3.4}, "website": "http://www.miramax.com/buffalosoldiers/index.html"}, "type": "movie", "writers": ["Robert O'Connor (book)", "Gregor Jordan (screenplay)", "Eric Weiss (screenplay)", "Nora Maccoby (screenplay)"], "year": 2001}