{"_id": "573a13b4f29313caabd40902", "awards": {"nominations": 3, "text": "2 wins & 3 nominations.", "wins": 2}, "cast": ["Yeo-reum Han", "Si-jeok Seo", "Gook-hwan Jeon", "Seong-hwang Jeon"], "countries": ["South Korea", "Japan"], "directors": ["Ki-duk Kim"], "fullplot": "A sixty and something year old captain has been raising for ten years a girl since she was six in his old fishing vessel that is permanently anchored offshore with the intention of marrying her on her seventeenth birthday. He survives bringing fishermen to fish in the vessel and predicting the future using his bow and shooting arrows in a Buddhist painting on the hull of the vessel while the girl moves back and forth in a swing. He also uses the bow and arrows to protect the girl against sexual assault of the fishermen. They live happily until the day that a teenage student comes to the ship and the girl feels attracted to him. When the teenager discovers that the girl was abducted when she was six and does not know the world, he returns to the vessel to bring the girl back to her parents.", "genres": ["Drama", "Romance"], "imdb": {"id": 456470, "rating": 7.2, "votes": 8216}, "languages": ["Korean"], "lastupdated": "2015-09-02 13:15:57.897000000", "num_mflix_comments": 2, "plot": "On a fishing boat at sea, a 60-year old man has been raising a girl since she was a baby. It is agreed that they will get married on her 17th birthday, and she is 16 now. They live a quiet and secluded life, renting the boat to day fishermen and practicing strange divination rites. Their life changes when a teenage student comes aboard...", "poster": "https://m.media-amazon.com/images/M/MV5BMTQzMDE4MzM4NV5BMl5BanBnXkFtZTcwOTMyNzYzMQ@@._V1_SY1000_SX677_AL_.jpg", "released": 1115856000000, "runtime": 90, "title": "The Bow", "tomatoes": {"critic": {"meter": 83, "numReviews": 6, "rating": 6.8}, "dvd": 1182816000000, "fresh": 5, "lastUpdated": 1442267210000, "production": "Tartan Films", "rotten": 1, "viewer": {"meter": 78, "numReviews": 5179, "rating": 3.8}, "website": "http://www.tfmdistribution.com/larc/accueil.htm"}, "type": "movie", "writers": ["Ki-duk Kim"], "year": 2005}