{"_id": "573a1397f29313caabce6bed", "awards": {"nominations": 1, "text": "1 win & 1 nomination.", "wins": 1}, "cast": ["William Holden", "Marthe Keller", "Hildegard Knef", "Josè Ferrer"], "countries": ["France", "West Germany"], "directors": ["Billy Wilder"], "fullplot": "The former successful and famous Polish actress Fedora commits suicide at the Mortcerf Station, jumping off in front of a train. The broken Hollywood producer Barry 'Dutch' Detweiler attends the funeral at her house in Paris and recalls that he might have caused her death. Two weeks ago, Dutch traveled to Greece Island of Corfu seeking Fedora out in the Vila Calypso, located in an isolated island owned by the bitter Countess Sobryanski. Fedora has been living an unsocial reclusive life for the last years in the villa with the countess, the plastic surgeon Doctor Vando and her assistant Miss Balfour, since she abandoned the set of a film that she was shooting in London with Michael York. Dutch brings the screenplay with a version of \"Anna Karenina\" to offer to Fedora, with the promise that investors would finance the film if Fedora accepts the lead role. Fedora, who is impressively young, is receptive to the offer, but the countess and the doctor tell that she is mentally unstable and paranoid and can not act again. When Dutch discovers that Fedora will be secretly sent to a mental institution owned by Dr. Vando in Mortcert, he tries to rescue the actress from the island but he is hit on the head and faints with a concussion. One week later, when he awakes, he learns that Fedora is dead. Dutch travels to Paris and meets Countess Sobryanski that him the truth about Fedora.", "genres": ["Drama", "Romance"], "imdb": {"id": 77539, "rating": 6.9, "votes": 2080}, "languages": ["English", "Greek", "French"], "lastupdated": "2015-08-22 01:02:52.733000000", "plot": "Down-on-his-luck Hollywood producer Barry 'Dutch' Detweiler attempts to lure Fedora, a famous but reclusive film actress out of retirement.", "poster": "https://m.media-amazon.com/images/M/MV5BN2Q1MTc4ZDktYTI2ZS00YTExLWIyOWMtMTk3NWM1MDAyODQ3L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 274492800000, "runtime": 114, "title": "Fedora", "tomatoes": {"critic": {"meter": 73, "numReviews": 15, "rating": 7}, "dvd": 705110400000, "fresh": 11, "lastUpdated": 1442510969000, "production": "Rialto Films", "rotten": 4, "viewer": {"meter": 62, "numReviews": 501, "rating": 3.4}}, "type": "movie", "writers": ["Tom Tryon (story)", "Billy Wilder", "I.A.L. Diamond"], "year": 1978}