{"_id": "573a13bbf29313caabd53db1", "awards": {"nominations": 3, "text": "5 wins & 3 nominations.", "wins": 5}, "cast": ["Nicholas Kristof", "Brian Steidle"], "countries": ["USA"], "directors": ["Ricki Stern", "Anne Sundberg"], "fullplot": "The tragedy taking place in Darfur as seen through the eyes of an American witness and who has since returned to the US to take action to stop it. Uses the photographs and first hand testimony of former U.S. Marine Captain Brian Steidle to take the viewer on a journey into the heart of Darfur, Sudan, where an Arab run government is systematically executing a plan to rid the province of its black African citizens. As an official military observer, Steidle had access to parts of the country that no journalist could penetrate. Ultimately frustrated by the inaction of the international community, Steidle resigned and returned to the US to expose the images and stories of lives systematically destroyed. We witness Steidle's transformation from soldier to observer to witness and, finally, to passionate activist and moral hero.", "genres": ["Documentary"], "imdb": {"id": 912580, "rating": 7.8, "votes": 1415}, "languages": ["English", "Arabic"], "lastupdated": "2015-08-17 00:49:27.937000000", "metacritic": 78, "num_mflix_comments": 2, "plot": "A documentary that exposes the genocide raging in Darfur, Sudan as seen through the eyes of a former U.S. marine who returns home to make the story public.", "poster": "https://m.media-amazon.com/images/M/MV5BMTQ2NTI4NDUwM15BMl5BanBnXkFtZTcwOTE0MjA1MQ@@._V1_SY1000_SX677_AL_.jpg", "released": 1207872000000, "runtime": 85, "title": "The Devil Came on Horseback", "tomatoes": {"consensus": "The Devil Came on Horseback is both a strong primer on the complexities of the situation in Darfur and a harrowing first-person doc.", "critic": {"meter": 98, "numReviews": 52, "rating": 7.8}, "dvd": 1193702400000, "fresh": 51, "lastUpdated": 1440357351000, "production": "Break Thru Films", "rotten": 1, "viewer": {"meter": 91, "numReviews": 4310, "rating": 4.1}, "website": "http://www.thedevilcameonhorseback.com/home.html"}, "type": "movie", "writers": ["Anne Sundberg", "Ricki Stern"], "year": 2007}