{"_id": "573a13e3f29313caabdc0d26", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Sandra Adair", "James Benning", "Richard Linklater"], "countries": ["France", "Portugal", "USA"], "directors": ["Gabe Klinger"], "fullplot": "In 1985, filmmaker Richard Linklater began a film screening society in Austin, Texas, that aimed to show classic art-house and experimental films to a budding community of cinephiles and filmmakers. The Austin Film Society raised enough money to fly in their first out-of-town invitee, visionary experimental filmmaker James Benning. Accepting the invitation, Benning met Linklater and immediately the two began to develop a personal and intellectual bond, which has lasted through the present. After the cult success of \"Slacker\" (1991), Linklater has gone on to make award-winning big budget narrative films including \"School of Rock\" (2003), \"Before Midnight\" (2013) and \"Boyhood\" (2014). Benning, meanwhile, has stayed close to his modest roots and is mainly an unknown figure in mainstream film culture. Combining filmed conversations and archival material, \"Double Play\" explores the connections between the work and lives of these two American visionaries.", "genres": ["Documentary", "Biography"], "imdb": {"id": 2915662, "rating": 6.8, "votes": 89}, "languages": ["English"], "lastupdated": "2015-07-25 00:24:59.023000000", "metacritic": 71, "plot": "In 1985, filmmaker Richard Linklater began a film screening society in Austin, Texas, that aimed to show classic art-house and experimental films to a budding community of cinephiles and ...", "poster": "https://m.media-amazon.com/images/M/MV5BNTI2NTM2NDM0Ml5BMl5BanBnXkFtZTgwNTUzNDkyMDE@._V1_SY1000_SX677_AL_.jpg", "runtime": 70, "title": "Double Play: James Benning and Richard Linklater", "tomatoes": {"lastUpdated": 1438978141000, "viewer": {"numReviews": 38, "rating": 3.1}, "website": "http://www.filmbuff.com/films/double-play-james-benning-and-richard-linklater"}, "type": "movie", "writers": ["Gabe Klinger", "Eugenio Renzi"], "year": 2013}