{"_id": "573a13a2f29313caabd09e69", "awards": {"nominations": 8, "text": "5 wins & 8 nominations.", "wins": 5}, "cast": ["Leonardo Sbaraglia", "Eduardo Noriega", "Pablo Echarri", "Leticia Brèdice"], "countries": ["Argentina", "Spain", "Uruguay"], "directors": ["Marcelo Pièeyro"], "fullplot": "Burnt Money, is set in Argentina in 1965. This true story follows the tumultuous relationship between two men who became lovers and ultimately ruthless bank robbers in a notoriously famous footnote in the annals of Argentinian crime history. Nene, Angel and Cuervo are bank robbers who flee from Argentina across the border to Uruguay after a large-scale hold-up that turns bloody. Angel is hurt and the three must lay low until Angel recovers. Nene and Angel are known to everyone they know as \"the twins\" because of their resemblance, but the two are not brothers at all - they are involved in a steamy homosexual relationship. To get back to Argentina, the group must first wait for Fontana, the brains behind the robbery, to arrange for passports. Anxious from hiding, Cuervo decides to break curfew and go party. After Nene and Angel also decide to take off, Nene meets a prostitute named Giselle and Angel ends up getting in a fight. The group is forced to abandon their refuge and Angel and Nene decide to move in with Giselle. However, the sexual attraction between Nene and Angel burns too strongly and when Nene gets hostile with Giselle and kicks her out, she goes straight to the police to snitch on the group. It's not long before police are surrounding the building and the fate of Nene and Angel appears to be sealed.", "genres": ["Crime", "Drama", "Romance"], "imdb": {"id": 227277, "rating": 7.3, "votes": 4800}, "languages": ["Spanish"], "lastupdated": "2015-09-07 00:39:48.220000000", "metacritic": 68, "plot": "Nene & Angel and their accomplice Cuervo participate in a botched bank robbery in 1965 Buenos Aires, then hide out from the police in Uruguay while the gang breaks down.", "poster": "https://m.media-amazon.com/images/M/MV5BMWEyYWVlMTMtY2UzZS00M2YwLWIyYzYtMTdkNGE2NzUzNGQyXkEyXkFqcGdeQXVyMTA0MjU0Ng@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 958003200000, "runtime": 125, "title": "Burnt Money", "tomatoes": {"consensus": "Burnt Money tells a stylish and steamy story about criminals on the lam.", "critic": {"meter": 77, "numReviews": 30, "rating": 6.5}, "dvd": 1033430400000, "fresh": 23, "lastUpdated": 1442138129000, "production": "Strand Releasing", "rotten": 7, "viewer": {"meter": 78, "numReviews": 3172, "rating": 3.8}, "website": "http://www.strandreleasing.com/in_theaters/plata_quemada.html"}, "type": "movie", "writers": ["Marcelo Figueras", "Ricardo Piglia (novel)", "Marcelo Pièeyro"], "year": 2000}