{"_id": "573a13b5f29313caabd4430e", "awards": {"nominations": 2, "text": "Nominated for 1 Primetime Emmy. Another 1 nomination.", "wins": 0}, "cast": ["Jon Voight", "Cary Elwes", "James Cromwell", "Christopher Lee"], "countries": ["Italy", "USA", "Poland"], "directors": ["John Kent Harrison"], "fullplot": "Following the premature death of his mother, Karol Wojtyla is brought up by his father in the Polish city of Krakow during the first half of the 20th century. An outstanding student with a magnetic personality, he dreams of becoming an actor. When his homeland is invaded by the Nazis in 1939, he and his friends secretly oppose the systematic persecution of their Polish culture. But, with the death of his father and the lacerating solitude which accompanies this loss, Karol's personal \"resistance\" takes on a new form and he decides to follow a priestly vocation. At the end of the war, Poland falls into the grip of Soviet totalitarianism. The newly ordained Karol is constantly surrounded by young people whom he teaches to safeguard and defend human dignity. He could be considered a serious threat to the regime, but the Communist authorities merely see him as an innocuous intellectual and even encourage his nomination for the position of bishop. Karol Wojtila is the youngest bishop in the history of Poland. When he is appointed Cardinal, Karol is more intransigent in the spiritual guidance of his homeland, becoming a real and proper thorn in the side of the Communist government. And the whole Catholic world begins to wonder who he is. On the death of Pope John Paul I in 1978, the cardinals of the Conclave decide that Woytjla is the right man to lead replace him. Thus Karol leaves his beloved Poland to become Pope John Paul II. His free, unconventional attitude alarms several prelates, but immediately wins the hearts of the people. In a age paralyzed by fear and ideology, the new Pope shows everybody again the overwhelming fascination of Christianity: this is the beginning of a deep change, which will affect the whole world and the Church itself, as a sort of \"contagion\". He miraculously survives an attempt on his life in 1981, and not even this event curbs his mission. Thanks to his unshakable tenacity , Pope John Paul II helps to change the course of history: the fall of the Berlin Wall in 1989 decrees the collapse of Communism. But the Pope does not stop being the voice of Christ, even among the injustices of the capitalistic Western world, even among the provocations and challenges of modern times . The Great Jubilee of 2000 is the most moving evidence of his mission: 3 million young people in love with the Pope gather in Rome, bringing with them the whole world's hopes. This world has learned to look to him, now old and shaky, as a ray of light in the heart of darkness.", "genres": ["Biography", "Drama"], "imdb": {"id": 475999, "rating": 7.1, "votes": 949}, "languages": ["English"], "lastupdated": "2015-08-12 01:01:08.487000000", "plot": "Following the premature death of his mother, Karol Wojtyla is brought up by his father in the Polish city of Krakow during the first half of the 20th century. An outstanding student with a ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTQ4MTQ1OTc4OF5BMl5BanBnXkFtZTcwMzc3MzI2Mg@@._V1_SY1000_SX677_AL_.jpg", "released": 1133654400000, "runtime": 201, "title": "Pope John Paul II", "tomatoes": {"dvd": 1213056000000, "lastUpdated": 1439749059000, "viewer": {"meter": 100, "numReviews": 85, "rating": 5}}, "type": "movie", "writers": ["John Kent Harrison (teleplay)", "Francesco Contaldo (earlier teleplay)", "Salvatore Basile (additional material)", "Francesco Arlanch (additional material)"], "year": 2005}