{"_id": "573a13b5f29313caabd42aae", "awards": {"nominations": 101, "text": "Won 2 Oscars. Another 117 wins & 101 nominations.", "wins": 119}, "cast": ["Daniel Day-Lewis", "Martin Stringer", "Matthew Braden Stringer", "Jacob Stringer"], "countries": ["USA"], "directors": ["Paul Thomas Anderson"], "fullplot": "The intersecting life stories of Daniel Plainview and Eli Sunday in early twentieth century California presents miner-turned-oilman Daniel Plainview, a driven man who will do whatever it takes to achieve his goals. He works hard but also takes advantage of those around him at their expense if need be. His business partner/son (H.W.) is, in reality, an \"acquired\" child whose true biological single-parent father (working on one of Daniel's rigs) died in a workplace accident. Daniel is deeply protective of H.W. if only for what H.W. brings to the partnership. Eli Sunday is one in a pair of twins whose family farm Daniel purchases for the major oil deposit located on it. Eli, a local preacher and a self-proclaimed faith healer, wants the money from the sale of the property to finance his own church. The lives of the two competitive men often clash as Daniel pumps oil off the property and tries to acquire all the surrounding land at bargain prices to be able to build a pipeline to the coast, and as Eli tries to build his own religious empire.", "genres": ["Drama"], "imdb": {"id": 469494, "rating": 8.1, "votes": 335023}, "languages": ["English", "American Sign Language"], "lastupdated": "2015-09-02 00:24:22.633000000", "metacritic": 92, "num_mflix_comments": 2, "plot": "A story of family, religion, hatred, oil and madness, focusing on a turn-of-the-century prospector in the early days of the business.", "poster": "https://m.media-amazon.com/images/M/MV5BMjAxODQ4MDU5NV5BMl5BanBnXkFtZTcwMDU4MjU1MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1201219200000, "runtime": 158, "title": "There Will Be Blood", "tomatoes": {"boxOffice": "$40.1M", "consensus": "Widely touted as a masterpiece, this sparse and sprawling epic about the underhanded \"heroes\" of capitalism boasts incredible performances by leads Daniel Day-Lewis and Paul Dano, and is director Paul Thomas Anderson's best work to date.", "critic": {"meter": 91, "numReviews": 213, "rating": 8.4}, "dvd": 1207612800000, "fresh": 194, "lastUpdated": 1442081797000, "production": "Paramount Vantage", "rotten": 19, "viewer": {"meter": 86, "numReviews": 251265, "rating": 4}, "website": "http://www.therewillbeblood.com"}, "type": "movie", "writers": ["Paul Thomas Anderson (screenplay)", "Upton Sinclair (novel)"], "year": 2007}