{"_id": "573a139ff29313caabd01775", "awards": {"nominations": 0, "text": "5 wins.", "wins": 5}, "cast": ["Annunziata Gianzero", "Thomas Jay Ryan", "Richard Bakalyan", "Andrew Borba"], "countries": ["USA"], "directors": ["Mark Wilkinson"], "fullplot": "On the brink of her world tour, at the height of her success, alternative rock violinist, Gypsy, put down her violin and walked away... A man brutally beats his girlfriend to death and tosses her remains into a local river... A retired Boston PD detective isn't buying the news report of a local girl accidentally drowning... While Gypsy's unprecedented disappearance perplexes the entire music industry, she retreats with her husband to the desolation of Cape Cod in winter... Seeking refuge in his past, the murderer contacts his estranged brother and falls in love with his brother's wife, Gypsy... And then a body turns up on Cape Cod... And the detective isn't convinced that this will be the last... Here, in the smallest quietest corner of New England unfolds a disquieting tale of what happens when music meets murder... and a lyrical portrait of the ever-present guardians who preserve life's natural harmony.", "genres": ["Drama", "Music", "Thriller"], "imdb": {"id": 191177, "rating": 5.3, "votes": 71}, "languages": ["English"], "lastupdated": "2015-03-24 01:30:47.367000000", "metacritic": 14, "num_mflix_comments": 1, "plot": "On the brink of her world tour, at the height of her success, alternative rock violinist, Gypsy, put down her violin and walked away... A man brutally beats his girlfriend to death and ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTQ5MTU4MDE2NV5BMl5BanBnXkFtZTYwMzYxNDk5._V1_SY1000_SX677_AL_.jpg", "runtime": 102, "title": "Dischord", "tomatoes": {"critic": {"meter": 29, "numReviews": 14, "rating": 4.3}, "dvd": 1096329600000, "fresh": 4, "lastUpdated": 1442167872000, "production": "Artistic License", "rotten": 10, "viewer": {"meter": 0, "numReviews": 29, "rating": 2.8}, "website": "http://dischordthemovie.com"}, "type": "movie", "writers": ["Mark Wilkinson"], "year": 2001}