{"_id": "573a13baf29313caabd51c77", "awards": {"nominations": 4, "text": "1 win & 4 nominations.", "wins": 1}, "cast": ["Amy Poehler", "Tina Fey", "Greg Kinnear", "Dax Shepard"], "countries": ["USA"], "directors": ["Michael McCullers"], "fullplot": "Successful and single businesswoman Kate Holbrook has long put her career ahead of a personal life. Now 37, she's finally determined to have a kid on her own. But her plan is thrown a curve ball after she discovers she has only a million-to-one chance of getting pregnant. Undaunted, the driven Kate allows South Philly working girl Angie Ostrowiski to become her unlikely surrogate. Simple enough ... After learning from the steely head of their surrogacy center that Angie is pregnant, Kate goes into precision nesting mode: reading childcare books, baby-proofing the apartment and researching top pre-schools. But the executive's well-organized strategy is turned upside down when her Baby Mama shows up at her doorstep with no place to live. An unstoppable force meets an immovable object as structured Kate tries to turn vibrant Angie into the perfect expectant mom. In a battle of wills, they will struggle their way through preparation for the baby's arrival. And in the middle of this tug-of-war, they'll discover two kinds of family: the one you're born to and the one you make.", "genres": ["Comedy", "Romance"], "imdb": {"id": 871426, "rating": 6.1, "votes": 31484}, "languages": ["English"], "lastupdated": "2015-09-04 00:14:04.960000000", "metacritic": 55, "num_mflix_comments": 1, "plot": "A successful, single businesswoman who dreams of having a baby discovers she is infertile and hires a working class woman to be her unlikely surrogate.", "poster": "https://m.media-amazon.com/images/M/MV5BMTYwNTc1Nzk1N15BMl5BanBnXkFtZTcwNjE4OTI2MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1209081600000, "runtime": 99, "title": "Baby Mama", "tomatoes": {"boxOffice": "$60.3M", "consensus": "Baby Mama is a lightweight, predictable comedy that ekes by on the strength of its performers.", "critic": {"meter": 64, "numReviews": 160, "rating": 6.2}, "dvd": 1220918400000, "fresh": 103, "lastUpdated": 1440095390000, "production": "Universal Pictures", "rotten": 57, "viewer": {"meter": 55, "numReviews": 374232, "rating": 3.3}, "website": "http://www.babymamamovie.net/"}, "type": "movie", "writers": ["Michael McCullers"], "year": 2008}