{"_id": "573a13d1f29313caabd8f808", "awards": {"nominations": 1, "text": "1 win & 1 nomination.", "wins": 1}, "cast": ["Celestina Peruggia", "Joe Medeiros", "Benito Mussolini", "Robert Wittman"], "countries": ["USA", "UK", "Italy", "France"], "directors": ["Joe Medeiros"], "fullplot": "How did an unassuming house painter from Italy pull off \"the greatest little known art heist in modern time?\" Was his motivation more than money? Writer-director Joe Medeiros traces the path of Vincenzo Peruggia, charged with the 1911 theft of Leonardo da Vinci's Mona Lisa from The Louvre, and finds the story of a daughter mourning the father she never knew and a country recovering from old wounds. Combining historical photographs, animation and interviews with Peruggia's descendants, Medeiros answers why and how the man called \"Macaroni\" by his French co-workers absconded with and kept the legendary painting for two years. This riveting, often humorous documentary portrays a man struggling to find his way in the world and make his family proud. Most touching are the scenes of Peruggia's 84-year-old daughter, Celestina, who grew up on stories about her father and longed for the truth.", "genres": ["Documentary", "Crime", "History"], "imdb": {"id": 1816681, "rating": 7.4, "votes": 88}, "languages": ["English"], "lastupdated": "2015-08-25 01:01:33.320000000", "num_mflix_comments": 3, "plot": "A man steals the Mona Lisa from the Louvre in 1911. His 84-year-old daughter thought he did it for patriotic reasons. A filmmaker spends more than 30 years trying to find the truth.", "poster": "https://m.media-amazon.com/images/M/MV5BMTkwOTgxNjgwOV5BMl5BanBnXkFtZTgwMzU2OTcwMzE@._V1_SY1000_SX677_AL_.jpg", "released": 1350691200000, "runtime": 85, "title": "The Missing Piece: Mona Lisa, Her Thief, the True Story", "tomatoes": {"dvd": 1413763200000, "lastUpdated": 1437157862000, "production": "First Pond Entertainment", "viewer": {"meter": 75, "numReviews": 56, "rating": 3.8}, "website": "http://www.monalisamissing.com/"}, "type": "movie", "writers": ["Joe Medeiros"], "year": 2012}