{"_id": "573a139ef29313caabcfee26", "awards": {"nominations": 13, "text": "6 wins & 13 nominations.", "wins": 6}, "cast": ["Jeanie Drynan", "Linal Haft", "Russell Dykstra", "Geneviève Lemon"], "countries": ["Australia", "USA"], "directors": ["Christina Andreef"], "fullplot": "For the first time in 15 years, all four siblings in a family show up to care for their dying mother, who is only given a couple of weeks to live. One comes from America with her two children. A divorced sister also comes with her child and sneaks off regularly to meet a mystery man who may be her ex-husband. The third & youngest daughter is an unmarried nurse aware of her ticking biological clock. The only son chases after his grumpy father who seems to not care a whit about his wife's circumstances. The four are also faced my their mother's dreams to accomplish a few things before she dies - to visit a beach she had visited in the past, to see her youngest married, and to visit Paris. She also wants to be embalmed and be honored with a 21 gun salute. Thus the whole group has to set off in the quest to fulfill their mother's wishes.", "genres": ["Comedy", "Drama"], "imdb": {"id": 180181, "rating": 6.6, "votes": 470}, "languages": ["English"], "lastupdated": "2015-08-29 01:08:20.953000000", "metacritic": 56, "num_mflix_comments": 1, "plot": "Three sisters and their ex-con brother return home to nurse their mother, who is dying of cancer.", "poster": "https://m.media-amazon.com/images/M/MV5BMTU3MTA1NzIxOV5BMl5BanBnXkFtZTcwMTc5OTEyMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 941068800000, "runtime": 101, "title": "Soft Fruit", "tomatoes": {"consensus": "Critics say that while Soft Fruit might be difficult to watch -- dealing as it is with terminal illness -- it is an emotionally genuine, warm film. The ensemble cast are also praised for their excellent portrayals of a family.", "critic": {"meter": 64, "numReviews": 14, "rating": 6.2}, "dvd": 963964800000, "fresh": 9, "lastUpdated": 1440528108000, "production": "Twentieth Century Fox Home Entertainment", "rotten": 5, "viewer": {"meter": 82, "numReviews": 372, "rating": 3.9}, "website": "http://www.foxmovies.com.au/comingsoon/softfruit/home.htm"}, "type": "movie", "writers": ["Christina Andreef"], "year": 1999}