{"_id": "573a139af29313caabcf0bcf", "awards": {"nominations": 0, "text": "3 wins.", "wins": 3}, "cast": ["Shah Rukh Khan", "Amrish Puri", "Mahima Chaudhry", "Apoorva Agnihotri"], "countries": ["India"], "directors": ["Subhash Ghai"], "fullplot": "This film takes a serious look at the lives of Westernized Non-Resident Indians (NRIs) in North America. Whereas Dilwale Dulhania Le Jayenge was about NRIs with Indian hearts, Pardes is about Westernized NRIs.) and hence the meaning of the title - \"foreign land\". Kishorilal is a successful businessman settled in America but still emotionally attached to his motherland - India. So the pardesi comes to India with his \"American\" son Rajiv to find a suitable '\"Indian\" girl for him. Kishorilal hopes his soon-to-be bahu will instill some Indian values in his extremely westernized beta. He finds his bahu in Kusum Ganga (a pet Subhash Ghai name just as Chandni was Yash Chopra's favorite for a long time) in the house of his childhood friend Suraj Dev. Mahima Chaudhary makes her debut as Ganga. To finalize the marriage he sends his son along with his foster son Arjun to India. Arjun plays Cupid and returns to America with Kusum and Rajiv. Arjun comes into the movie to get the American-boy to accept Indian values, and support the Indian-girl to accept American vices. The reverse does not fit into this movie. Arjun is portrayed as an Indian at heart and the hero of the film! All is hunky-dory till the true Bharatiya Nari finds out that her future husband is not a teetotaler. So, the heartbroken Kusum returns to India. Don't conclude that it is the end of the Bollywood fairy tale. It is just the beginning as Arjun falls in love with his would-have-been bhabi while playing Cupid and leads to a love triangle.", "genres": ["Musical", "Romance", "Action"], "imdb": {"id": 119861, "rating": 7, "votes": 7371}, "languages": ["Hindi"], "lastupdated": "2015-08-27 00:30:28.307000000", "num_mflix_comments": 1, "plot": "This film takes a serious look at the lives of Westernized Non-Resident Indians (NRIs) in North America. Whereas Dilwale Dulhania Le Jayenge was about NRIs with Indian hearts, Pardes is ...", "poster": "https://m.media-amazon.com/images/M/MV5BNTczMzc2MjYwNF5BMl5BanBnXkFtZTgwNTk4ODk1MDE@._V1_SY1000_SX677_AL_.jpg", "released": 881539200000, "runtime": 191, "title": "Pardes", "tomatoes": {"lastUpdated": 1442082415000, "production": "Rajshri Media", "viewer": {"meter": 72, "numReviews": 4841, "rating": 3.7}}, "type": "movie", "writers": ["Subhash Ghai (screenplay)", "Subhash Ghai (story)", "Neeraj Pathak (screenplay)", "Javed Siddiqui (dialogue)"], "year": 1997}