{"_id": "573a139af29313caabcef91b", "awards": {"nominations": 3, "text": "4 wins & 3 nominations.", "wins": 4}, "cast": ["Renè Groothof", "Veerle Dobbelaere", "Renè van 't Hof", "Gene Bervoets"], "countries": ["Netherlands", "Belgium", "Germany"], "directors": ["Jos Stelling"], "fullplot": "Late 16th century, persecuted protestantism and general dissatisfaction with the Catholic Habsburg rule in the Netherlands lead to large-scale plundering and vandalizing of churches, only harshening the Spanish Inquisition, sparkling the Eighty Years War. Flanders, 1568: Italian minstrel Campanelli tells he followed a Dutchman, the robber of a golden chalice, but failed to prevent him being taken -after banging a country-girl- by the men of a rigid farmer Netelneck, who has him tied-up inside a huge shit-container. After Campanelli frees him, the gold stays inside, and the Dutchman is killed, but the minstrel turns to offer the paying audience a happier version. Seven years later, he scares the Dutchman's posthumous son into bringing him food and convinces the kid he can fly, like his dad, who is on a grand ship, but fails to drag the gold out and is blinded and chased by Netelneck. Fourteen years later, the minstrel returns and tricks Netelneck into diving after the gold himself so he can drawn the bastard, then sets the 'little Dutchman' on the road to find his father, who proves a mere thief living in a beached shipwreck. Both join a brigand band, but it ends up arrested by the Spaniards and imprisoned under the authority of Netelneck's son, who has him thrown in an oubliette forced to scoop water, but Lotte, his only lover ever, notices something she gave him and believes her son, now she's Netelneck junior's wife, is the little Dutchman's...", "genres": ["Comedy", "Drama", "Fantasy"], "imdb": {"id": 114864, "rating": 7.2, "votes": 414}, "languages": ["Dutch", "Italian", "French"], "lastupdated": "2015-06-17 18:40:39.373000000", "plot": "Late 16th century, persecuted protestantism and general dissatisfaction with the Catholic Habsburg rule in the Netherlands lead to large-scale plundering and vandalizing of churches, only ...", "released": 800150400000, "runtime": 140, "title": "De vliegende Hollander", "tomatoes": {"lastUpdated": 1440183333000, "viewer": {"numReviews": 8, "rating": 4.2}}, "type": "movie", "writers": ["Hans Heesen", "Jos Stelling"], "year": 1995}