{"_id": "573a1399f29313caabced443", "awards": {"nominations": 4, "text": "1 win & 4 nominations.", "wins": 1}, "cast": ["Nomadlozi Kubheka", "Agatha Hurle", "Nigel Ivy", "Tracy Brooks Swope"], "countries": ["Australia", "France", "USA"], "directors": ["John G. Avildsen"], "fullplot": "The Power of One is an intriguing story of a young English boy named Peekay and his passion for changing the world. Growing up he suffered as the only English boy in an Afrikaans school. Soon orphaned, he was placed in the care of a German national named Professor von Vollensteen (a.k.a. \"Doc\"), a friend of his grandfather. Doc develops Peekay's piano talent and Peekay becomes \"assistant gardener\" in Doc's cactus garden. It is not long after WWII begins that Doc is placed in prison for failure to register with the English government as a foreigner. Peekay makes frequent visits and meets Geel Piet, an inmate, who teaches him to box. Geel Piet spreads the myth of the Rainmaker, the one who brings peace to all of the tribes. Peekay is cast in the light of this myth. After the war Peekay attends an English private school where he continues to box. He meets a young girl, Maria, with whom he falls in love. Her father, Professor Daniel Marais, is a leader of the Nationalist Party of South Africa. The two fight to teach the natives English as Peekay's popularity grows via the myth. Peekay loses focus until he sees the success of his language school among the tribes. He and Guideon Duma continue the work in hopes of building a better future for Africa.", "genres": ["Drama"], "imdb": {"id": 105159, "rating": 7.2, "votes": 7127}, "languages": ["English"], "lastupdated": "2015-09-15 03:21:43.930000000", "plot": "The Power of One is an intriguing story of a young English boy named Peekay and his passion for changing the world. Growing up he suffered as the only English boy in an Afrikaans school. ...", "poster": "https://m.media-amazon.com/images/M/MV5BMjE1MjA3NDM0OV5BMl5BanBnXkFtZTcwNDgwMTEyMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 701654400000, "runtime": 127, "title": "The Power of One", "tomatoes": {"critic": {"meter": 39, "numReviews": 18, "rating": 5}, "dvd": 930009600000, "fresh": 7, "lastUpdated": 1439923136000, "production": "Warner Home Video", "rotten": 11, "viewer": {"meter": 88, "numReviews": 9619, "rating": 4}}, "type": "movie", "writers": ["Bryce Courtenay (novel)", "Robert Mark Kamen (screenplay)"], "year": 1992}