{"_id": "573a139af29313caabcf0db3", "awards": {"nominations": 1, "text": "1 win & 1 nomination.", "wins": 1}, "cast": ["Llyr Ifans", "Rhys Ifans", "Dorien Thomas", "Dougray Scott"], "countries": ["UK"], "directors": ["Kevin Allen"], "fullplot": "Twin Town opens with wide sweeping shots of seaside Swansea; to be the place of action for the next one and a half hours. The serene setting with miles upon miles of old semi-detached housing is suddenly cleaved apart by two young lads tearing through the neighbourhood in a two tone BMW 525. Julian and Jeremy are in deep trouble. Their dysfunctional family scrapes together a living from their dole money and odd-jobs offered to their father. The boys have long since turned to drug abuse and car theft leading a happy-go-lucky life in downtown no-hoper city. In due course the plot thickens as the boys are out for revenge against wealthy club owner Bryn who is not particularly helpful in providing compensation when their father is hit by an accident when working on his premises. The boys are fairly imaginative when it comes to planning their strike, culminating in scenes which all dog-haters and karaoke loathers will love.", "genres": ["Comedy", "Drama"], "imdb": {"id": 120394, "rating": 6.7, "votes": 4456}, "languages": ["English"], "lastupdated": "2015-08-22 00:09:31.547000000", "num_mflix_comments": 2, "plot": "Twin Town opens with wide sweeping shots of seaside Swansea; to be the place of action for the next one and a half hours. The serene setting with miles upon miles of old semi-detached ...", "poster": "https://m.media-amazon.com/images/M/MV5BOTQ1MWVjYmEtMTMzNS00YzI2LTg5OWEtY2VlMDU2YTU2Y2IxXkEyXkFqcGdeQXVyODY0NzcxNw@@._V1_SY1000_SX677_AL_.jpg", "rated": "UNRATED", "released": 863136000000, "runtime": 99, "title": "Twin Town", "tomatoes": {"critic": {"meter": 46, "numReviews": 13, "rating": 5.4}, "dvd": 877478400000, "fresh": 6, "lastUpdated": 1442085546000, "production": "Gramercy Pictures", "rotten": 7, "viewer": {"meter": 89, "numReviews": 7936, "rating": 4.1}}, "type": "movie", "writers": ["Kevin Allen", "Paul Durden"], "year": 1997}