{"_id": "573a13e6f29313caabdc50b3", "awards": {"nominations": 5, "text": "4 wins & 5 nominations.", "wins": 4}, "cast": ["Pawan Kalyan", "Samantha Ruth Prabhu", "Pranitha", "Boman Irani"], "countries": ["India"], "directors": ["Trivikram Srinivas"], "fullplot": "The Nanda family based in Milan,Italy is a very powerful family with a huge business empire. Raghunanda(Boman Irani), his son(Mukesh Rishi)and his grandson Gautam Nanda(Pawan Kalyan) manage their billion dollar business.Raghunanda asks his grandson to fulfil his wish of reuniting him(Raghunanda) with her daughter.In the past, she is asked to get out of the house for having married a pleader without their family's consent which leads to a heated and a shocking thing ,which is later revealed in the film. Gautam promises his grandfather that he would reunite him with his estranged daughter Sunanda(Nadiya) ,who lives far away from them in Hyderabad, he decides to travel to India and bring her back. But as he reaches Hyderabad , he come to know that his uncle(Rao Ramesh)is at the airport who returns back to Hyderabad from Chennai.His uncle in fact has a stroke while driving back and Gautam takes him to a hospital and saves his life. In the hospital he sees his aunt for the first time.He is asked to take up the job of their driver, in their house and enters into their lives.As the story unfolds he finds out that convincing his aunt to come back isn't easy and remains a stranger to the family. In the mean time, the story also shows his interaction with the doctor(Ali) who is appointed to take care of Rajasekhar. Gautam's interactions with his aunt's daughters Sashi(Samantha) and Pramila(Pranitha) also are engaging,funny and flirtatious. Various other characters(Brahmanandam,Kota Srinivasa Rao,Pradeep Machiraju, Subbaraju and many others) enter the plot as the story unfolds.Watch the film to understand the essence of the film and how he manages to convince his aunt to come back.", "genres": ["Action", "Comedy", "Drama"], "imdb": {"id": 3042926, "rating": 7.4, "votes": 5021}, "languages": ["Telugu"], "lastupdated": "2015-09-14 23:58:05.413000000", "num_mflix_comments": 1, "plot": "The Nanda family based in Milan,Italy is a very powerful family with a huge business empire. Raghunanda(Boman Irani), his son(Mukesh Rishi)and his grandson Gautam Nanda(Pawan Kalyan) manage...", "released": 1380153600000, "title": "Atharintiki Daaredi", "tomatoes": {"lastUpdated": 1440098760000, "viewer": {"meter": 81, "numReviews": 144, "rating": 4}}, "type": "movie", "writers": ["Trivikram Srinivas"], "year": 2013}