{"_id": "573a13bef29313caabd5b7a5", "awards": {"nominations": 19, "text": "Nominated for 2 Oscars. Another 5 wins & 19 nominations.", "wins": 7}, "cast": ["Andrew Garfield", "Christopher Plummer", "Richard Riddell", "Katie Lyons"], "countries": ["UK", "Canada", "France"], "directors": ["Terry Gilliam"], "fullplot": "In London, the sideshow troupe of Doctor Parnassus promises the audience a journey to the \"Imaginarium\", an imaginary world commanded by the mind of Doctor Parnassus, where dreams come true. In the stories that Doctor Parnassus tells to his daughter Valentina, the midget Percy, and his assistant Anton, he claims to have lived for more than one thousand years; However, when he fell in love with a mortal woman, he made a deal with the devil (Mr. Nick), trading his immortality for youth. As part of the bargain, he promised his son or daughter to Mr. Nick on their sixteenth birthday. Valentina is now almost to the doomed age and Doctor Parnassus makes a new bet with Mr. Nick, whoever seduces five souls in the Imaginarium will have Valentina as a prize. Meanwhile the troupe rescues Tony, a young man that was hanged on a bridge by the Russians. Tony was chased until he finds and joins the group. Tony and Valentina fall in love with each other and the jealous Anton discovers that his competition may be a liar.", "genres": ["Adventure", "Fantasy", "Mystery"], "imdb": {"id": 1054606, "rating": 6.9, "votes": 119634}, "languages": ["English", "Russian", "French"], "lastupdated": "2015-09-02 00:24:28.833000000", "metacritic": 65, "num_mflix_comments": 2, "plot": "A traveling theater company gives its audience much more than they were expecting.", "poster": "https://m.media-amazon.com/images/M/MV5BMTY4Njg4NTA3Nl5BMl5BanBnXkFtZTcwNzYxMzg5Mg@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1262908800000, "runtime": 123, "title": "The Imaginarium of Doctor Parnassus", "tomatoes": {"boxOffice": "$7.5M", "consensus": "Terry Gilliam remains as indulgent as ever, but The Imaginarium of Doctor Parnassus represents a return to the intoxicatingly imaginative, darkly beautiful power of his earlier work, with fine performances to match all the visual spectacle.", "critic": {"meter": 64, "numReviews": 189, "rating": 6}, "dvd": 1272326400000, "fresh": 121, "lastUpdated": 1442512208000, "production": "Sony Pictures Classics", "rotten": 68, "viewer": {"meter": 60, "numReviews": 295289, "rating": 3.1}, "website": "http://www.sonyclassics.com/theimaginariumofdoctorparnassus/"}, "type": "movie", "writers": ["Terry Gilliam", "Charles McKeown"], "year": 2009}