{"_id": "573a13d6f29313caabda07a3", "awards": {"nominations": 5, "text": "3 wins & 5 nominations.", "wins": 3}, "cast": ["Amy Acker", "Alexis Denisof", "Nathan Fillion", "Clark Gregg"], "countries": ["USA"], "directors": ["Joss Whedon"], "fullplot": "Leonato (Clark Gregg), the governor of Messina, is visited by his friend Don Pedro (Reed Diamond) who is returning from a victorious campaign against his rebellious brother Don John (Sean Maher). Accompanying Don Pedro are two of his officers: Benedick (Alexis Denisof) and Claudio (Fran Kranz). While in Messina, Claudio falls for Leonato's daughter Hero (Jillian Morgese), while Benedick verbally spars with Beatrice (Amy Acker), the governor's niece. The budding love between Claudio and Hero prompts Don Pedro to arrange with Leonato for a marriage. In the days leading up to the ceremony, Don Pedro, with the help of Leonato, Claudio and Hero, attempts to sport with Benedick and Beatrice in an effort to trick the two into falling in love. Meanwhile, the villainous Don John, with the help of his allies Conrade (Riki Lindhome) and Borachio (Spencer Treat Clark), plots against the happy couple, using his own form of trickery to try to destroy the marriage before it begins. A series of comic and tragic events may continue to keep the two couples from truly finding happiness, but then again perhaps love may prevail.", "genres": ["Comedy", "Drama", "Romance"], "imdb": {"id": 2094064, "rating": 7.2, "votes": 13070}, "languages": ["English"], "lastupdated": "2015-09-05 00:53:30.963000000", "metacritic": 78, "num_mflix_comments": 2, "plot": "A modern retelling of Shakespeare's classic comedy about two pairs of lovers with different takes on romance and a way with words.", "poster": "https://m.media-amazon.com/images/M/MV5BMTgxNjQ0MjAwMl5BMl5BanBnXkFtZTcwNjI1NDEyOQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1371168000000, "runtime": 109, "title": "Much Ado About Nothing", "tomatoes": {"boxOffice": "$4.3M", "consensus": "Lighthearted to a fault, Much Ado About Nothing's giddy energy and intimate charm make for an entertaining romantic comedy -- and a Shakespearean adaptation that's hard to resist.", "critic": {"meter": 84, "numReviews": 153, "rating": 7.5}, "dvd": 1381190400000, "fresh": 129, "lastUpdated": 1442085582000, "production": "Roadside Attractions", "rotten": 24, "viewer": {"meter": 77, "numReviews": 26220, "rating": 3.8}, "website": "http://www.muchadothemovie.com/"}, "type": "movie", "writers": ["Joss Whedon (written for the screen by)", "William Shakespeare (play)"], "year": 2012}