{"_id": "573a13aff29313caabd3224f", "awards": {"nominations": 2, "text": "5 wins & 2 nominations.", "wins": 5}, "cast": ["Kevin Kline", "Cesar Ramos", "Alicja Bachleda", "Paulina Gaitan"], "countries": ["Germany", "USA"], "directors": ["Marco Kreuzpaintner"], "fullplot": "Adriana is a 13-year-old girl from Mexico City whose kidnapping by sex traffickers sets in motion a desperate mission by her 17-year-old brother, Jorge, to save her. Trapped and terrified by an underground network of international thugs who earn millions exploiting their human cargo, Adriana's only friend and protector throughout her ordeal is Veronica, a young Polish woman tricked into the trade by the same criminal gang. As Jorge dodges immigration officers and incredible obstacles to track the girls' abductors, he meets Ray, a Texas cop whose own family loss to sex trafficking leads him to become an ally in the boy's quest. Fighting with courage and hard-tested faith, the characters of Trade negotiate their way through the unspeakable terrain of the sex trade \"tunnels\" between Mexico and the United States. From the barrios of Mexico City and the treacherous Rio Grande border, to a secret Internet sex slave auction and the final climactic confrontation at a stash house in suburban New Jersey, Ray and Jorge forge a close bond as they give desperate chase to Adriana's kidnappers before she is sold and disappears forever into this brutal global underworld, a place from which few victims ever return.", "genres": ["Crime", "Drama", "Thriller"], "imdb": {"id": 399095, "rating": 7.5, "votes": 14202}, "languages": ["English", "Spanish", "Polish", "Russian"], "lastupdated": "2015-09-05 00:55:02.620000000", "metacritic": 42, "num_mflix_comments": 2, "plot": "Adriana is a 13-year-old girl from Mexico City whose kidnapping by sex traffickers sets in motion a desperate mission by her 17-year-old brother, Jorge, to save her. Trapped and terrified ...", "poster": "https://m.media-amazon.com/images/M/MV5BYjUzMmUzZmMtZDRmNy00NGJkLWJmZTgtZDEwZmZkMGMxMjU2XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1192665600000, "runtime": 120, "title": "Trade", "type": "movie", "writers": ["Jose Rivera (screenplay)", "Peter Landesman (story)", "Jose Rivera (story)", "Peter Landesman (article)"], "year": 2007}