{"_id": "573a13adf29313caabd29c06", "awards": {"nominations": 40, "text": "Nominated for 1 Oscar. Another 19 wins & 40 nominations.", "wins": 20}, "cast": ["Liam Neeson", "Laura Linney", "Chris O'Donnell", "Peter Sarsgaard"], "countries": ["USA", "Germany"], "directors": ["Bill Condon"], "fullplot": "Called Prok as an adult (short for Professor Kinsey), Alfred Kinsey has been interested in biology since he was a child growing up in the early twentieth century, despite the criticisms of such being evil nonsense from his overbearing and devoutly Christian father, professor Alfred Seguine Kinsey. Prok goes on to become a biology professor at Indiana University, initially focusing on the study of gall wasps. But those studies in combination with questions from his students, coming to terms with the needs of sex with his own wife, a former student of his named Clara McMillen (who he calls Mac), and what he sees as the gross misinformation on the subject currently within popular belief makes him change his focus to human sexuality. Many of those gross untruths - as he sees them - are that oral sex and masturbation cause a slew of maladies, which are perpetuated by what is presented in the university's hygiene class taught by Professor Thurman Rice. With the approval of faculty head Herman Wells, Prok starts teaching his own wildly popular marriage course, talking about sex in a straightforwardly academic fashion. When he sees that morals don't necessarily mirror sexual behavior, he decides to conduct a massive sex survey with the assistance of students Wardell Pomeroy, Clyde Martin and Paul Gebhard. He faces the issue of the funding required for the survey and public and political response to this controversial and oft seen as taboo subject. But in conducting the survey, he and Mac also face the issue of their own sexuality in relationship to their marriage and the emotional and cultural aspects behind it, such as the notion of love.", "genres": ["Biography", "Drama"], "imdb": {"id": 362269, "rating": 7.1, "votes": 41236}, "languages": ["English"], "lastupdated": "2015-08-20 00:29:22.843000000", "metacritic": 79, "plot": "A look at the life of Alfred Kinsey, a pioneer in the area of human sexuality research, whose 1948 publication \"Sexual Behavior in the Human Male\" was one of the first recorded works that saw science address sexual behavior.", "poster": "https://m.media-amazon.com/images/M/MV5BMTA0MjA1MjA4MDNeQTJeQWpwZ15BbWU3MDQxMDQ2MjE@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1105056000000, "runtime": 118, "title": "Kinsey", "tomatoes": {"boxOffice": "$10.2M", "consensus": "A biopic of the sex researcher is hailed as adventurous, clever, and subversive, with fine performances by Liam Neeson and Laura Linney.", "critic": {"meter": 90, "numReviews": 193, "rating": 7.6}, "dvd": 1116288000000, "fresh": 173, "lastUpdated": 1440441650000, "production": "Fox Searchlight Pictures", "rotten": 20, "viewer": {"meter": 75, "numReviews": 33818, "rating": 3.4}, "website": "http://www2.foxsearchlight.com/kinsey/site/"}, "type": "movie", "writers": ["Bill Condon"], "year": 2004}