{"_id": "573a1396f29313caabce54c3", "awards": {"nominations": 11, "text": "Nominated for 3 Oscars. Another 15 wins & 11 nominations.", "wins": 18}, "cast": ["Gene Hackman", "John Cazale", "Allen Garfield", "Frederic Forrest"], "countries": ["USA"], "directors": ["Francis Ford Coppola"], "fullplot": "Harry Caul is a devout Catholic and a lover of jazz music who plays his saxophone while listening to his jazz records. He is a San Francisco-based electronic surveillance expert who owns and operates his own small surveillance business. He is renowned within the profession as being the best, one who designs and constructs his own surveillance equipment. He is an intensely private and solitary man in both his personal and professional life, which especially irks Stan, his business associate who often feels shut out of what is happening with their work. This privacy, which includes not letting anyone into his apartment and always telephoning his clients from pay phones is, in part, intended to control what happens around him. His and Stan's latest job (a difficult one) is to record the private discussion of a young couple meeting in crowded and noisy Union Square. The arrangement with his client, known only to him as \"the director\", is to provide the audio recording of the discussion and photographs of the couple directly to him alone in return for payment. Based on circumstances with the director's assistant, Martin Stett, and what Harry ultimately hears on the recording, Harry believes that the lives of the young couple are in jeopardy. Harry used to be detached from what he recorded, but is now concerned ever since the deaths of three people that were the direct result of a previous audio recording he made for another job. Harry not only has to decide if he will turn the recording over to the director, but also if he will try and save the couple's lives using information from the recording. As Harry goes on a quest to find out what exactly is happening on this case, he finds himself in the middle of his worst nightmare.", "genres": ["Drama", "Mystery", "Thriller"], "imdb": {"id": 71360, "rating": 7.9, "votes": 69112}, "languages": ["English"], "lastupdated": "2015-09-12 00:33:15.760000000", "metacritic": 86, "num_mflix_comments": 1, "plot": "A paranoid, secretive surveillance expert has a crisis of conscience when he suspects that a couple he is spying on will be murdered.", "poster": "https://m.media-amazon.com/images/M/MV5BYTQxYWJlYTgtMTk5MS00ZGFiLWI5MWItYjhkNjM3YmUyNjYxXkEyXkFqcGdeQXVyNjUwNzk3NDc@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 139276800000, "runtime": 113, "title": "The Conversation", "tomatoes": {"consensus": "This tense, paranoid thriller presents Francis Ford Coppola at his finest -- and makes some remarkably advanced arguments about technology's role in society that still resonate today.", "critic": {"meter": 98, "numReviews": 46, "rating": 8.7}, "dvd": 976579200000, "fresh": 45, "lastUpdated": 1442336757000, "production": "Paramount Pictures", "rotten": 1, "viewer": {"meter": 90, "numReviews": 33748, "rating": 4.1}}, "type": "movie", "writers": ["Francis Ford Coppola"], "year": 1974}