{"_id": "573a139af29313caabcef464", "awards": {"nominations": 1, "text": "1 win & 1 nomination.", "wins": 1}, "cast": ["Cameron Diaz", "Ron Eldard", "Annabeth Gish", "Jonathan Penner"], "countries": ["USA"], "directors": ["Stacy Title"], "fullplot": "Jude, Luke, Marc, Paulie and Pete are liberal-minded roommates and grad students at a Iowa post-secondary institution. Every Sunday for the past year, they have hosted a dinner party, inviting a friend over to have an open-minded discussion about whatever topics are of interest. On a dark and stormy night when Pete was supposed to bring a friend for one of those dinners, he instead comes home with Zachary Cody, who rescued a stranded Pete whose car broke down. They invite Zach to stay for dinner instead of Pete's missing friend. They soon find out that Zach is among other things a racist neo-Nazi, which brings up a potentially dangerous situation for Jewish Marc and black Luke. After some physical altercations and verbal threats, Marc ends up stabbing Zach dead out of what he considers self-defense. As the friends discuss what to do about Zach, they finally come to the conclusion that in killing Zach, they have done society a service. So they ponder 'why not invite other ultra-conservatives with extreme views to dinner to do the same to them'? Several dinner parties and deaths later, they think they've hit the jackpot when they meet powerful ultra-conservative broadcaster Norman Arbuthnot, who they invite for dinner. But the friends' plans start to unravel when they can't agree on whether certain of their guests deserve to die. It is also threatened by Sheriff Alice Stanley, who is not looking for the five's victims, but is nevertheless nosing around as she works on a missing girl case.", "genres": ["Comedy", "Crime", "Drama"], "imdb": {"id": 113613, "rating": 6.8, "votes": 11785}, "languages": ["English"], "lastupdated": "2015-09-04 00:34:20.227000000", "plot": "A group of idealistic, but frustrated, liberals succumb to the temptation of murdering rightwing pundits for their political beliefs.", "poster": "https://m.media-amazon.com/images/M/MV5BZjY5MjY3MjktM2QyMy00ZTNmLWFkYTctOTVlNjljYzExNjI5XkEyXkFqcGdeQXVyNjU0NTI0Nw@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 828662400000, "runtime": 92, "title": "The Last Supper", "tomatoes": {"consensus": "It struggles to find a balance between its humor and its message, but The Last Supper's sharp script and well-chosen cast offer just enough nourishment for fans of black comedy.", "critic": {"meter": 65, "numReviews": 31, "rating": 6}, "dvd": 1041897600000, "fresh": 20, "lastUpdated": 1440442024000, "production": "Sony Pictures Home Entertainment", "rotten": 11, "viewer": {"meter": 70, "numReviews": 7931, "rating": 3.4}}, "type": "movie", "writers": ["Dan Rosen (screenplay)"], "year": 1995}