{"_id": "573a13d7f29313caabda4ffe", "awards": {"nominations": 1, "text": "1 win & 1 nomination.", "wins": 1}, "countries": ["USA"], "directors": ["Amir Bar-Lev"], "fullplot": "The town of State College, the home of Penn State University, has long been known as Happy Valley, and its iconic figure for more than 40 years was Joe Paterno, the head coach of the school's storied football team. His program was lauded for not only its success on the field but also its students' achievements in the classroom. And Paterno took on mythic national stature as \"Saint Joe.\" But then, in November 2011, everything came crashing down. Longtime Assistant Coach Jerry Sandusky was charged with 40 counts of child sex abuse, setting off a firestorm of accusations about who failed to protect the children of Happy Valley. Was Sandusky's abuse an \"open secret\" in the town? Did Coach Paterno and the Penn State administration value their football program more than the lives of Sandusky's victims? Filmed over the course of the year after Sandusky's arrest as key players in the scandal agreed to share their stories, Happy Valley deconstructs the story we think we know to uncover a much more complicated and tragic tale.", "genres": ["Documentary", "Drama", "Sport"], "imdb": {"id": 2171902, "rating": 7, "votes": 509}, "languages": ["English"], "lastupdated": "2015-08-09 01:04:55.627000000", "metacritic": 76, "num_mflix_comments": 1, "plot": "A documentary that observes the year after Pennsylvania State University assistant football coach Jerry Sandusky's arrest on child sex abuse charges.", "poster": "https://m.media-amazon.com/images/M/MV5BMTk0OTkxMjkxOF5BMl5BanBnXkFtZTgwMzg1NjUxMzE@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 1416528000000, "runtime": 98, "title": "Happy Valley", "tomatoes": {"boxOffice": "$22.7k", "consensus": "Sober, even-handed, and quietly devastating, Happy Valley illuminates the wreckage of a tragedy while leaving viewers room to draw their own conclusions.", "critic": {"meter": 89, "numReviews": 35, "rating": 6.8}, "dvd": 1428364800000, "fresh": 31, "lastUpdated": 1441913954000, "production": "Music Box Films", "rotten": 4, "viewer": {"meter": 68, "numReviews": 1441, "rating": 3.5}, "website": "http://www.musicboxfilms.com/happy-valley-movies-115.php?showPressPage=true"}, "type": "movie", "writers": ["Amir Bar-Lev"], "year": 2014}