{"_id": "573a13bff29313caabd5e99e", "awards": {"nominations": 3, "text": "3 nominations.", "wins": 0}, "cast": ["Belèn Fabra", "Leonardo Sbaraglia", "Llum Barrera", "Geraldine Chaplin"], "countries": ["Spain"], "directors": ["Christian Molina"], "fullplot": "In Barcelona, Valère is very attached to her French grandmother Marie Tasso and likes to stay with her. While discussing sex with Val, Marie advises her that it would be important to jot her life experience down and Val decides to write a diary. Val recalls her promiscuous love life and her lovers since her first sexual experience when she was 15-years-old. When Val loses her job in a downsizing, she is simultaneously informed that Marie had a heart attack and she visits her granny one last time who dies. Val looks for a job and when she is interviewed by an executive called Jaime, she falls in love for the first time. However Jaime is not good in bed. They move in together to a magnificent apartment and Val believes she has found the man of her life. Val gets a job with a gay Italian called Harry at a fashion house but Jaime becomes jealous and changes his behavior. Val decides to leave Jaime when she gets pregnant and he does not recognize the baby as his own.", "genres": ["Drama", "Romance"], "imdb": {"id": 1111890, "rating": 5.8, "votes": 7410}, "languages": ["Spanish", "French"], "lastupdated": "2015-09-02 00:02:47.883000000", "num_mflix_comments": 4, "plot": "A chronicle of the life of a middle-class French girl's sexual adventures, her then fall into prostitution, and her ultimate redemption.", "poster": "https://m.media-amazon.com/images/M/MV5BMWFlNzMxYTQtOWQxMS00MDE4LTllYzQtOWFlMDU3NmE0OTM2XkEyXkFqcGdeQXVyMTA0MjU0Ng@@._V1_SY1000_SX677_AL_.jpg", "rated": "UNRATED", "released": 1224201600000, "runtime": 102, "title": "Diary of a Nymphomaniac", "tomatoes": {"dvd": 1278979200000, "lastUpdated": 1440353535000, "production": "IFC Films", "viewer": {"meter": 49, "numReviews": 1446, "rating": 3.2}}, "type": "movie", "writers": ["Cuca Canals (adaptation)", "Valèrie Tasso (novel)"], "year": 2008}