{"_id": "573a13b1f29313caabd362a4", "awards": {"nominations": 19, "text": "Nominated for 1 Oscar. Another 11 wins & 19 nominations.", "wins": 12}, "cast": ["Jonathan Rhys Meyers", "Alexander Armstrong", "Paul Kaye", "Matthew Goode"], "countries": ["UK", "Russia", "Ireland", "Luxembourg", "USA"], "directors": ["Woody Allen"], "fullplot": "From a humble background and with traditional values, Irish Chris Wilton is still struggling financially despite being a recently retired high ranked tennis pro. He has taken a job as a tennis instructor at an upscale London tennis club, although he knows there is a better life for him somewhere down the road. He is befriended by one of his students, wealthy Tom Hewett. Chris starts to date Tom's sister, Chloe Hewett, a girl-next-door type who is immediately attracted to Chris. Chloe quickly knows she wants to marry Chris, and through her businessman father, Alec Hewett, tries to help Chris and their future by getting him an executive job in Alec's company. In his life with the Hewetts, Chris begins to enjoy the finer things in life. Through it all however, Chris cannot help thinking about Nola Rice, a struggling American actress who he meets at the Hewett estate and who is Tom's unofficial fiancèe. Nola is vivacious, and she knows the effect she has on men, including Chris. Unlike Chris, Nola is not accepted by Tom and Chloe's mother, the outspoken Eleanor Hewett. Chris has to decide if he can give up what he has been able to achieve with Chloe and the Hewetts, or if the passion he feels for Nola is stronger than the finer things in life to which he is now accustomed. He may go to any length to have his cake and eat it too.", "genres": ["Drama", "Romance", "Thriller"], "imdb": {"id": 416320, "rating": 7.7, "votes": 153633}, "languages": ["English"], "lastupdated": "2015-09-14 11:50:24.210000000", "metacritic": 72, "num_mflix_comments": 2, "plot": "At a turning point in his life, a former tennis pro falls for a femme-fatal type who happens to be dating his friend and soon-to-be brother-in-law.", "poster": "https://m.media-amazon.com/images/M/MV5BMzA1MDdmYTktYzAyZC00ODM3LTgxZGYtNmE3NTgxMTY2NTdiXkEyXkFqcGdeQXVyNDgyODgxNjE@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1137715200000, "runtime": 124, "title": "Match Point", "tomatoes": {"boxOffice": "$23.1M", "consensus": "Woody Allen's sharpest film in years, Match Point is a taut, philosophical thriller about class and infidelity.", "critic": {"meter": 76, "numReviews": 208, "rating": 7.2}, "dvd": 1145923200000, "fresh": 159, "lastUpdated": 1442251754000, "production": "Dreamworks", "rotten": 49, "viewer": {"meter": 81, "numReviews": 249752, "rating": 3.4}, "website": "http://www.matchpoint.dreamworks.com//"}, "type": "movie", "writers": ["Woody Allen"], "year": 2005}