{"_id": "573a1391f29313caabcd8978", "awards": {"nominations": 2, "text": "2 nominations.", "wins": 0}, "cast": ["Lon Chaney", "Norman Kerry", "Joan Crawford", "Nick De Ruiz"], "countries": ["USA"], "directors": ["Tod Browning"], "fullplot": "Alonzo is an armless knife thrower and gun shooter for a circus---or so he appears. He is actually a burglar with his arms intact. He and his accomplice, Cojo (a little person), are hiding from the police, and Alonzo views his disguise as perfect, especially since it keeps from view an unusual deformity of his left hand that would immediately give him away as the burglar. Nanon, the daughter of the circus owner, is the target in his act. Although Alonzo is in love with her, Nanon's father despises him. Nanon is attracted to Malabar, the circus strong man, but she is also repulsed by his uninhibited sexual advances and desire to touch and hold her. Apparently her phobia extends to the touch of any man. Alonzo feeds her fears in the hopes that Nanon will fall in love with him since he is \"armless.\" Because Zanzi discovers Alonzo really has arms, Alonzo kills him, but Nanon witnesses the killing without seeing Alonzo's face; however, she does see the telltale deformity of his left hand. As Alonzo continues to plot to steal Nanon away from Mirabar, Cojo makes him realize that she will hate him once she discovers he has arms---and the deformity showing that he is her father's murderer. Alonzo decides to have his left arm amputated, which he succeeds in doing through blackmailing a surgeon. He thinks Nanon will forgive him for hiding the fact that he has ONE arm. While Alonzo is recuperating from the surgery, Nanon gets over her fear of being touched and falls completely in love with Mirabar. Discovering this upon his return, Alonzo hatches a scheme to kill Mirabar as he attempts his latest, most daring stunt. Although the stunt goes horribly awry, it is Alonzo who gets killed.", "genres": ["Drama", "Horror", "Romance"], "imdb": {"id": 18528, "rating": 7.9, "votes": 4993}, "languages": ["English"], "lastupdated": "2015-08-26 00:11:36.870000000", "num_mflix_comments": 3, "plot": "A criminal on the run hides in a circus and seeks to possess the daughter of the ringmaster at any cost.", "poster": "https://m.media-amazon.com/images/M/MV5BMTk3MjQ0MzYzMF5BMl5BanBnXkFtZTgwNDg1NDM4MTE@._V1_SY1000_SX677_AL_.jpg", "rated": "UNRATED", "released": -1343692800000, "runtime": 63, "title": "The Unknown", "tomatoes": {"critic": {"meter": 100, "numReviews": 6, "rating": 9.3}, "fresh": 6, "lastUpdated": 1442336560000, "production": "Metro-Goldwyn-Mayer", "rotten": 0, "viewer": {"meter": 89, "numReviews": 1845, "rating": 4.1}}, "type": "movie", "writers": ["Tod Browning (story)", "Waldemar Young (scenario)", "Joseph Farnham (titles)"], "year": 1927}