{"_id": "573a13a3f29313caabd0eda0", "awards": {"nominations": 43, "text": "22 wins & 43 nominations.", "wins": 22}, "cast": ["Amitabh Bachchan", "Jaya Bhaduri", "Shah Rukh Khan", "Kajol"], "countries": ["India"], "directors": ["Karan Johar"], "fullplot": "Yashvardhan Raichand lives a very wealthy lifestyle along with his wife, Nandini, and two sons, Rahul and Rohan. While Rahul has been adopted, Yashvardhan and Nandini treat him as their own. When their sons mature, they start to look for suitable brides for Rahul, and decide to get him married to a young woman named Naina. When Rahul is told about this, he tells them that he loves another woman by the name of Anjali Sharma. Yashvardhan decides to meet with the Sharma family, and finds out that they are middle-classed, unsophisticated, and will not be able to it into his family circle, as a result he refuses to permit Rahul to marry Anjali. A defiant Rahul decides to leave, gets married to Anjali, without his foster parents blessings, and re-locates to London, England, where Anjali's unmarried sister, Pooja, also lives. Rohan, who was studying in a hostel, returns home to find that Rahul is no longer living with them, and he also discovers that while outwardly his dad is not interested in seeing Rahul get back, Nandini wants the family back all together for all happy and sad moments. Rohan also misses Rahul a lot, and decides to travel to London in order to try and get Rahul to return home. Yashvardhan, is unable to prevent this, and as a result Rohan does travel to London, meets with Rahul, Anjali, and Pooja. The question remains will the hurt and sorrow that Rahul experienced with his foster parents be erased and enable the family to be reunited, or will Rahul forget about the past, and continue to live his life without getting back to his roots and the family who brought him up, leaving Rohan to return alone?", "genres": ["Drama", "Musical", "Romance"], "imdb": {"id": 248126, "rating": 7.5, "votes": 24511}, "languages": ["Hindi", "English", "Urdu"], "lastupdated": "2015-08-17 00:24:25.720000000", "num_mflix_comments": 3, "plot": "Yashvardhan Raichand lives a very wealthy lifestyle along with his wife, Nandini, and two sons, Rahul and Rohan. While Rahul has been adopted, Yashvardhan and Nandini treat him as their own...", "poster": "https://m.media-amazon.com/images/M/MV5BZjc5NGExODktNjE3MC00OGJiLWE1NzItNzI1MzU5ODBjNWVkXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY1000_SX677_AL_.jpg", "released": 1008288000000, "runtime": 210, "title": "Kabhi Khushi Kabhie Gham...", "tomatoes": {"dvd": 1062460800000, "lastUpdated": 1439839598000, "viewer": {"meter": 88, "numReviews": 28737, "rating": 4.2}}, "type": "movie", "writers": ["Karan Johar", "Sheena Parikh (screenplay)"], "year": 2001}