{"_id": "573a13b4f29313caabd3f3ee", "awards": {"nominations": 8, "text": "6 wins & 8 nominations.", "wins": 6}, "cast": ["Denzel Washington", "Clive Owen", "Jodie Foster", "Christopher Plummer"], "countries": ["USA"], "directors": ["Spike Lee"], "fullplot": "From a cell, a man tells us he has planned the perfect bank robbery; he invites us to watch. An efficient gang enters a Manhattan bank, locks the doors, and takes hostages. They work deliberately, without haste. Detective Frazier is assigned to negotiate, but half his mind is occupied with the corruption charges he is facing. The bank's president has something to protect in a safe deposit box, so he brings in Madeleine White, a high-power broker with a hidden agenda. With an army of police surrounding the bank, the thief, the cop, and the plutocrat's fixer enter high-stakes negotiations. Why are the robbers asking for a plane, if they are so competent and they know they won't get one? Why aren't they in more of a hurry? If the job's perfect, why is the thieves' leader in a cell?", "genres": ["Crime", "Drama", "Mystery"], "imdb": {"id": 454848, "rating": 7.6, "votes": 254319}, "languages": ["English", "Albanian", "Spanish"], "lastupdated": "2015-09-04 00:00:44.147000000", "metacritic": 76, "num_mflix_comments": 1, "plot": "A police detective, a bank robber, and a high-power broker enter high-stakes negotiations after the criminal's brilliant heist spirals into a hostage situation.", "poster": "https://m.media-amazon.com/images/M/MV5BYjc4MjA2ZDgtOGY3YS00NDYzLTlmNTEtYWMxMzcwZjgzYWNjXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1143158400000, "runtime": 129, "title": "Inside Man", "tomatoes": {"boxOffice": "$88.4M", "consensus": "Spike Lee's energetic and clever bank-heist thriller is a smart genre film that is not only rewarding on its own terms, but manages to subvert its pulpy trappings with wit and skill -- and Denzel Washington is terrific as a brilliant hostage negotiator.", "critic": {"meter": 86, "numReviews": 197, "rating": 7.3}, "dvd": 1154995200000, "fresh": 170, "lastUpdated": 1442078088000, "production": "Universal Pictures", "rotten": 27, "viewer": {"meter": 85, "numReviews": 349567, "rating": 3.7}, "website": "http://theinsideman.net/"}, "type": "movie", "writers": ["Russell Gewirtz"], "year": 2006}