{"_id": "573a1394f29313caabcdfbd0", "awards": {"nominations": 6, "text": "Nominated for 4 Oscars. Another 2 nominations.", "wins": 0}, "cast": ["Glenn Ford", "Anne Francis", "Louis Calhern", "Margaret Hayes"], "countries": ["USA"], "directors": ["Richard Brooks"], "fullplot": "War veteran Rick Dadier is one of three new teachers hired at North Manual High School, an inner city boys school. This is his first teaching assignment, which he needs to support himself and his insecure pregnant wife, Anne. Despite Principle Warnecke's assertions to the contrary, Dadier quickly learns that the rumors of student discipline problems at the school are indeed true. The established teachers at the school try to counsel the newcomers, all inexperienced in such situations, as how best to handle the rowdy students. Regardless, Dadier tries to exert discipline in his class, which provokes a violent response. Dadier believes the student leaders against him are Artie West, but more specifically Gregory Miller, who he thinks uses the fact of being black as a means of racial provocation. Dadier has to decide either to leave and teach at a \"real\" school, or stay and figure out how to get through to his students. If he decides to stay, he has to figure out who the real disruptive influences are, especially as they have resorted to attacks of a personal nature that affect especially Anne.", "genres": ["Drama"], "imdb": {"id": 47885, "rating": 7.4, "votes": 5978}, "languages": ["English"], "lastupdated": "2015-08-30 00:44:26.053000000", "plot": "A new English teacher at a violent, unruly inner-city school is determined to do his job, despite resistance from both students and faculty.", "poster": "https://m.media-amazon.com/images/M/MV5BZDRhOTM5ZDgtNWQ3ZS00NWI4LTkxM2ItOWZkNTIxMTFlM2NlXkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "APPROVED", "released": -466214400000, "runtime": 101, "title": "Blackboard Jungle", "tomatoes": {"critic": {"meter": 76, "numReviews": 21, "rating": 7.1}, "dvd": 1115683200000, "fresh": 16, "lastUpdated": 1442084749000, "production": "MGM Home Entertainment", "rotten": 5, "viewer": {"meter": 77, "numReviews": 3633, "rating": 3.6}}, "type": "movie", "writers": ["Richard Brooks (screenplay)", "Evan Hunter (novel)"], "year": 1955}