{"_id": "573a13c1f29313caabd64037", "awards": {"nominations": 5, "text": "2 wins & 5 nominations.", "wins": 2}, "cast": ["Janet Johnson Bryant", "Etweda Cooper", "Vaiba Flomo", "Leymah Gbowee"], "countries": ["USA"], "directors": ["Gini Reticker"], "fullplot": "A civil war had been raging for years between the dictatorship of the Liberian president and the rebels who called themselves the LURD. The LURD wanted to overthrow the government. They terrorized the people in the country through killings, rapes, dismemberment and destruction. They were becoming more powerful as they closed in on the capital city, Monrovia. One unlikely heroine is inspired by a dream to bring Christian women together to start a peace movement. She begins within her own church and asks that all women from all churches are brought together. At one meeting, a Muslim woman goes up to the podium to address the church and tells them that she is moved by what they were doing and that Muslim women need to be brought into the Peace Movement. This was a cause that transcended all differences. With this extraordinary mission, the women dressed in plain white clothes and covered their heads, as a way to shed any differences of class or religion among them. They decide to make peace signs and sit in at the fish market where the Liberian president drove past every morning. He refuses to acknowledge them for weeks. The women finally get to present their mission statement to the president, as well as demand peace talks between the government and the rebels. The women do not just hand things over to the men, however. When the peace talks finally come to fruition, a delegate group goes to Ghana to ensure that a resolution is made. The first two weeks no progress is made. The rebel warlords are just demanding future positions in the government and access to the country's resources. The Liberian president had already fled back to Liberia when Sierra Leone tries to indict him for war crimes. The women's growing anger and frustration lead them to stage a sit in. They block all the doors and windows preventing anyone from leaving the peace talks without a resolution. Trapped with no food and water, the talks turn serious. Finally, a resolution is signed. The UN peacekeepers move in and the Liberian president is exiled to Nigeria. The women understood that they could not rely on anyone else to make sure that the resolutions are implemented. They also realize, seeing the UN only creating chaos, that to ensure full disarmament in the country, they would need to step in, forgive their perpetrators, and convince each one of them that they would be accepted back into the community. The truly final mission for the women was to ensure a democratic election and elect a woman into the office of the presidency. The power of the women prevails. The first female president is elected. The women can finally go home. Mission accomplished. Peace reigns in Liberia.", "genres": ["Documentary"], "imdb": {"id": 1202203, "rating": 7.6, "votes": 387}, "languages": ["English"], "lastupdated": "2015-09-12 00:37:15.790000000", "metacritic": 78, "num_mflix_comments": 1, "plot": "A group of women rise up to peace to Liberia and help bring to power the country's first female head of state.", "poster": "https://m.media-amazon.com/images/M/MV5BMjA5ODc2MTE3NF5BMl5BanBnXkFtZTcwNzQxODc5MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "UNRATED", "released": 1241740800000, "runtime": 72, "title": "Pray the Devil Back to Hell", "tomatoes": {"consensus": "This political documentary about protests during the Liberian Civil War is an uplifting celebration of the capacity of everyday people to affect great change.", "critic": {"meter": 100, "numReviews": 36, "rating": 7.8}, "dvd": 1257811200000, "fresh": 36, "lastUpdated": 1442261406000, "production": "Balcony Releasing", "rotten": 0, "viewer": {"meter": 87, "numReviews": 1187, "rating": 4}, "website": "http://www.praythedevilbacktohell.com/"}, "type": "movie", "year": 2008}