{"_id": "573a13b9f29313caabd4edc5", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Slavoj Zizek"], "countries": ["UK", "Austria", "Netherlands"], "directors": ["Sophie Fiennes"], "fullplot": "THE PERVERT'S GUIDE TO CINEMA takes the viewer on an exhilarating ride through some of the greatest movies ever made. Serving as presenter and guide is the charismatic Slavoj Zizek, acclaimed philosopher and psychoanalyst. With his engaging and passionate approach to thinking, Zizek delves into the hidden language of cinema, uncovering what movies can tell us about ourselves. Whether he is untangling the famously baffling films of David Lynch, or overturning everything you thought you knew about Hitchcock, Zizek illuminates the screen with his passion, intellect, and unfailing sense of humour. THE PERVERT'S GUIDE TO CINEMA cuts its cloth from the very world of the movies it discusses; by shooting at original locations and from replica sets it creates the uncanny illusion that Zizek is speaking from 'within' the films themselves. Together the three parts construct a compelling dialectic of ideas. Described by The Times in London as 'the woman helming this Freudian inquest,' director Sophie Fiennes' collaboration with Slavoj Zizek illustrates the immediacy with which film and television can communicate complex ideas. Says Zizek: 'My big obsession is to make things clear. I can really explain a line of thought if I can somehow illustrate it in a scene from a film. THE PERVERT'S GUIDE TO CINEMA is really about what psychoanalysis can tell us about cinema.'", "genres": ["Documentary"], "imdb": {"id": 828154, "rating": 7.9, "votes": 4074}, "languages": ["English"], "lastupdated": "2015-08-10 00:37:56.017000000", "num_mflix_comments": 3, "plot": "THE PERVERT'S GUIDE TO CINEMA takes the viewer on an exhilarating ride through some of the greatest movies ever made. Serving as presenter and guide is the charismatic Slavoj Zizek, ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTQ2MTQ2MzI3MV5BMl5BanBnXkFtZTcwOTU5ODM1MQ@@._V1_SY1000_SX677_AL_.jpg", "released": 1232064000000, "runtime": 150, "title": "The Pervert's Guide to Cinema", "tomatoes": {"consensus": "Slovenian philosopher Slavoj Zizek forgoes the textbook stuff for a fun, probing look at cinema and the human emotional response to it.", "critic": {"meter": 88, "numReviews": 24, "rating": 7}, "fresh": 21, "lastUpdated": 1442167897000, "production": "ICA Films", "rotten": 3, "viewer": {"meter": 86, "numReviews": 2652, "rating": 4}}, "type": "movie", "writers": ["Slavoj Zizek"], "year": 2006}