{"_id": "573a13c8f29313caabd76dc2", "awards": {"nominations": 3, "text": "4 wins & 3 nominations.", "wins": 4}, "cast": ["Gemma Arterton", "Roger Allam", "Bill Camp", "Dominic Cooper"], "countries": ["UK"], "directors": ["Stephen Frears"], "fullplot": "Once the ugly duckling in the Dorset village of Ewedown, Tamara Drewe returns to sell her late mother's house, now a glamorous journalist with a life-changing nose job. She awakens feelings in sexy old flame, Andy, the decent odd job man at pretentious author Nicholas Hardiment's writers' school and in Nicholas himself, a serial philanderer who cheats on his loyal wife Beth. But Tamara has a new man in her life, Ben, an obnoxious rock drummer whose marriage proposal she accepts, to the dismay of local girl - and Ben's biggest fan - Jody. Jody's efforts to sabotage the engagement lead to Tamara, on the rebound and finding Andy in the arms of another, allowing Nicholas to have his wicked way with her, and also allowing it to be photographed and sent to a distraught Beth. Beth's secret admirer, American writer Glen, confronts Nicholas out in the fields, but Ben's dog Boss has got loose and has caused a local farmer's cattle to stampede towards them, an event which will shape the futures of everybody.", "genres": ["Comedy", "Drama", "Romance"], "imdb": {"id": 1486190, "rating": 6.2, "votes": 16084}, "languages": ["English"], "lastupdated": "2015-08-19 00:36:41.703000000", "metacritic": 64, "num_mflix_comments": 1, "plot": "A young newspaper writer returns to her hometown in the English countryside, where her childhood home is being prepped for sale.", "poster": "https://m.media-amazon.com/images/M/MV5BMjAyOTIyMjI0Nl5BMl5BanBnXkFtZTcwMzcyODE3Mw@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1284076800000, "runtime": 107, "title": "Tamara Drewe", "tomatoes": {"boxOffice": "$0.6M", "critic": {"meter": 66, "numReviews": 120, "rating": 6.3}, "dvd": 1297123200000, "fresh": 79, "lastUpdated": 1440180899000, "production": "Sony Pictures Classics", "rotten": 41, "viewer": {"meter": 42, "numReviews": 9276, "rating": 3.1}, "website": "http://www.sonyclassics.com/tamaradrewe/"}, "type": "movie", "writers": ["Moira Buffini (screenplay)", "Posy Simmonds (graphic novel)"], "year": 2010}