{"_id": "573a139af29313caabcef150", "awards": {"nominations": 8, "text": "6 wins & 8 nominations.", "wins": 6}, "cast": ["Johnny Depp", "Gary Farmer", "Crispin Glover", "Lance Henriksen"], "countries": ["USA", "Germany", "Japan"], "directors": ["Jim Jarmusch"], "fullplot": "Dead Man is the story of a young man's journey, both physically and spiritually, into very unfamiliar terrain. William Blake travels to the extreme western frontiers of America sometime in the 2nd half of the 19th century. Lost and badly wounded, he encounters a very odd, outcast Native American, named \"Nobody\", who believes Blake is actually the dead English poet of the same name. The story, with Nobody's help, leads William Blake through situations that are in turn comical and violent. Contrary to his nature, circumstances transform Blake into a hunted outlaw, a killer, and a man whose physical existence is slowly slipping away. Thrown into a world that is cruel and chaotic, his eyes are opened to the fragility that defines the realm of the living. It is as though he passes through the surface of a mirror, and emerges into a previously-unknown world that exists on the other side.", "genres": ["Drama", "Fantasy", "Western"], "imdb": {"id": 112817, "rating": 7.7, "votes": 66924}, "languages": ["English", "Cree"], "lastupdated": "2015-08-19 00:15:59.703000000", "metacritic": 61, "plot": "On the run after murdering a man, accountant William Blake encounters a strange North American man named Nobody who prepares him for his journey into the spiritual world.", "poster": "https://m.media-amazon.com/images/M/MV5BYTJlZmQ1OTAtODQzZi00NGIzLWI1MmEtZGE4NjFlOWRhODIyXkEyXkFqcGdeQXVyNTc1NTQxODI@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 831686400000, "runtime": 121, "title": "Dead Man", "tomatoes": {"critic": {"meter": 71, "numReviews": 35, "rating": 7}, "dvd": 994118400000, "fresh": 25, "lastUpdated": 1442511770000, "production": "Miramax", "rotten": 10, "viewer": {"meter": 88, "numReviews": 54776, "rating": 3.9}}, "type": "movie", "writers": ["Jim Jarmusch"], "year": 1995}