{"_id": "573a13b2f29313caabd383ba", "awards": {"nominations": 0, "text": "2 wins.", "wins": 2}, "cast": ["Timothy Hutton", "David Strathairn", "Leelee Sobieski", "Anthony Mackie"], "countries": ["USA"], "directors": ["Terry Green"], "fullplot": "Successful New York attorney Sam Leibowitz travels to the South in 1933 to defend nine young black men accused of raping two women on an Alabama freight train. In the spring of 1931 nine black hoboes were pulled off an Alabama freight train and arrested for allegedly raping two young white women in a gondola car. Ranging in ages from twelve to twenty years, they were quickly tried and sentenced to the electric chair. News of their convictions spread and the plight of the Scottsboro Boys became a 'cause celebre' that fueled the fire of socialism worldwide, forcing an appeal to the United States Supreme Court and resulting in new trials for all nine defendants. New Yorker Samuel Leibowitz, a savvy and self-assured defense lawyer with an impressive string of courtroom victories, agreed to represent the accused at their retrials in Decatur, Alabama. His journey into the Deep South symbolized the polarity of the times and set in motion a legal battle that ultimately changed the course of American jurisprudence. The Scottsboro case was a tragic chapter in American history and a story of epic injustice. From their arrest in 1931 to the release of the last Scottsboro defendant in 1950, the rights of nine young black men were violated. In this century in America, we face many of the same racial prejudices and human rights issues that existed almost seventy-five years ago. The names have changed, but the rhetoric that convicted the Scottsboro Nine remains virtually the same. Heavens Fall attempts to examine the cultural and political differences that divide us. It is my hope that by looking into the hearts and minds of the Scottsboro participants, black and white, North and South, powerful and impoverished, we may come to a better understanding of each other.", "genres": ["Crime", "Drama"], "imdb": {"id": 425094, "rating": 6.7, "votes": 1008}, "languages": ["English"], "lastupdated": "2015-08-12 00:35:24.127000000", "plot": "Two young woman accuse nine black youths of rape in the segregated South.", "poster": "https://m.media-amazon.com/images/M/MV5BMTY1MDU3ODU2NF5BMl5BanBnXkFtZTcwNjg2Mzk1MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1153353600000, "runtime": 105, "title": "Heavens Fall", "tomatoes": {"dvd": 1194307200000, "lastUpdated": 1440698912000, "production": "Strata Productions", "viewer": {"meter": 63, "numReviews": 589, "rating": 3.7}}, "type": "movie", "writers": ["Terry Green"], "year": 2006}