{"_id": "573a13d3f29313caabd94fd0", "awards": {"nominations": 8, "text": "10 wins & 8 nominations.", "wins": 10}, "cast": ["Yle Vianello", "Salvatore Cantalupo", "Pasqualina Scuncia", "Anita Caprioli"], "countries": ["Italy", "Switzerland", "France"], "directors": ["Alice Rohrwacher"], "fullplot": "Set deep in the south of Italy, Corpo Celeste is the story of 13 year old Marta who is struggling to resettle after ten years growing up in Switzerland. Bright-eyed and restless, she observes the sights, sounds and smells of the city but feels very much an outsider. Marta is about to undergo the rite of confirmation. In the convention of the Catholic Church she takes catechism but confronts the morality of the local Catholic community. A series of subtle moments trace her journey as she connects and conflicts with her mother, sister and the Sunday school teacher Santa. From experiencing her period to making a bold decision to cut her hair, Marta begins to shape her own life for the first time since moving back to Italy. Corpo Celeste heralds the arrival of a young and distinctive voice. Alice Rohrwacher's writing and directing debut is a sensitive unveiling of the moral and religious layers that can smother adolescence.", "genres": ["Drama"], "imdb": {"id": 1886502, "rating": 6.7, "votes": 616}, "languages": ["Italian"], "lastupdated": "2015-08-23 00:03:43.017000000", "metacritic": 65, "num_mflix_comments": 1, "plot": "Thirteen year-old Marta has recently moved back to southern Italy with her mother and older sister and struggles to find her place, restlessly testing the boundaries of an unfamiliar city and the catechism of the Catholic church.", "poster": "https://m.media-amazon.com/images/M/MV5BOTUxNjE1NjYzMV5BMl5BanBnXkFtZTgwNjIxMDY0MDE@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 1305849600000, "runtime": 100, "title": "Corpo celeste", "tomatoes": {"boxOffice": "$7.7k", "critic": {"meter": 82, "numReviews": 17, "rating": 6.9}, "dvd": 1352160000000, "fresh": 14, "lastUpdated": 1442344092000, "production": "Film Movement", "rotten": 3, "viewer": {"meter": 42, "numReviews": 1365, "rating": 3.2}, "website": "http://www.filmmovement.com/theatrical/index.asp?MerchandiseID=275"}, "type": "movie", "writers": ["Alice Rohrwacher"], "year": 2011}