{"_id": "573a13e0f29313caabdbb1a0", "awards": {"nominations": 8, "text": "12 wins & 8 nominations.", "wins": 12}, "cast": ["Candy", "Terri Lyne Carrington", "Quincy Cavers", "Bill Cosby"], "countries": ["USA"], "directors": ["Alan Hicks"], "fullplot": "First-time director/drummer from Australia, Alan Hicks, convinced his surfing mate and cinematographer, Adam Hart, to travel to the U.S. to follow and film 89-year-old jazz legend, Clark Terry (Quincy Jones's first teacher) over four years - to document an unlikely mentorship between Terry and a driven, blind piano prodigy, Justin Kauflin, 23. Clark, now 93, mentored Miles Davis as a young musician and is among the few performers ever to have played in both Count Basie's and Duke Ellington's bands. In Keep On Keepin' On, as Justin is invited to compete in an elite, international competition while battling terrible stage fright, Clark's health takes a critical turn for the worse. Over the course of filming, Clark loses his sight, which deepens his bond with Justin. As clocks tick, we are suddenly witness to two great friends tackling the toughest challenges of their interwoven lives. The film, from the producer of The Cove and Chasing Ice, captures the passing of the torch from a cultural icon to potentially his last student, inspiring viewers in climactic, cinematic fashion.", "genres": ["Documentary"], "imdb": {"id": 2674040, "rating": 7.5, "votes": 544}, "languages": ["English"], "lastupdated": "2015-08-29 00:29:33.343000000", "metacritic": 77, "plot": "A documentary that follows jazz legend Clark Terry over four years to document the mentorship between Terry and 23-year-old blind piano prodigy Justin Kauflin as the young man prepares to compete in an elite, international competition.", "poster": "https://m.media-amazon.com/images/M/MV5BMjIxOTU3MjU4Nl5BMl5BanBnXkFtZTgwMjc4OTI5MzE@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1425513600000, "runtime": 84, "title": "Keep on Keepin' On", "tomatoes": {"boxOffice": "$0.2M", "consensus": "Offering keen observations and infectious warmth, Keep On Keepin' On is a joy for jazz buffs and novices alike.", "critic": {"meter": 97, "numReviews": 39, "rating": 7.5}, "dvd": 1421107200000, "fresh": 38, "lastUpdated": 1439922347000, "production": "Radius-TWC", "rotten": 1, "viewer": {"meter": 87, "numReviews": 1169, "rating": 4.3}, "website": "http://keeponkeepinon.com/"}, "type": "movie", "writers": ["Davis Coombe", "Alan Hicks"], "year": 2014}