{"_id": "573a13c2f29313caabd665c1", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Mahmoud Hamid Ali", "Edward Allier", "Ryan Baker", "Zack Corke"], "countries": ["USA"], "directors": ["Jake Rademacher"], "fullplot": "An intimate portrait of an American family during a turbulent time. Jake Rademacher sets out to understand the experience, sacrifice, and motivation of his two brothers serving in Iraq. The film follows Jake's exploits as he risks everything-including his life-to tell his brothers' story. Often humorous, but sometimes downright lethal, it is a remarkable journey where Jake embeds with four combat units in Iraq. Unprecedented access to US and Iraqi combat units take him behind the camouflage curtain with secret reconnaissance troops on the Syrian border, into sniper \"hide sites\" in the Sunni Triangle, through raging machine gun battles with the Iraqi Army. Ultimately, the film follows his brothers home where separations and life-threatening work ripple through their parents, siblings, wives, and children. It is a rare look at the bonds and service of our soldiers on the front lines and the profound effects their service has on the loved ones they leave behind.", "genres": ["Documentary", "War"], "imdb": {"id": 1239427, "rating": 6.6, "votes": 551}, "languages": ["English"], "lastupdated": "2015-08-29 01:05:03.187000000", "metacritic": 60, "plot": "An intimate portrait of an American family during a turbulent time. Jake Rademacher sets out to understand the experience, sacrifice, and motivation of his two brothers serving in Iraq. The...", "poster": "https://m.media-amazon.com/images/M/MV5BMTkyOTE5NTU2Ml5BMl5BanBnXkFtZTcwMjY2OTgyMg@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1236902400000, "runtime": 110, "title": "Brothers at War", "tomatoes": {"boxOffice": "$33.1k", "critic": {"meter": 70, "numReviews": 20, "rating": 5.7}, "dvd": 1263254400000, "fresh": 14, "lastUpdated": 1439665134000, "production": "Samuel Goldwyn Films/IDP", "rotten": 6, "viewer": {"meter": 66, "numReviews": 2159, "rating": 3.6}}, "type": "movie", "year": 2009}