{"_id": "573a13b7f29313caabd4a59c", "awards": {"nominations": 14, "text": "7 wins & 14 nominations.", "wins": 7}, "cast": ["Robbie Kay", "Monika Schurmann", "Nina Dobrev", "Jordan Pettle"], "countries": ["Canada", "Greece"], "directors": ["Jeremy Podeswa"], "fullplot": "Middle aged Jakob Beer reflects on his life, this reflection which is all consuming. He is a Polish born and raised Jew. When he was an adolescent, his parents were shot dead and his sister Bella hauled away by the Nazis during World War II. Jakob witnessed these events from a hideout in their home. Running away, Jakob was found by Athos Roussos, a Greek national working on an archaeological project in Poland. Athos managed to smuggle Jakob out of Poland back to his native Greece. A few years later, Athos and Jakob moved to Canada where Athos began work as a teacher. Jakob has continual dreams about Bella, especially her piano playing but never knew Bella's ultimate fate. Jakob's reflections, especially the emotions stemming from his thoughts, lead to him becoming a writer of a successful book. His marriage to his first wife Alex, an outgoing and upbeat woman, fails because he can't get out of the somberness connected to his past at this time of his life. It isn't until he comes to understand the meaning of the dreams about Bella that Jakob can commit to a relationship. Meanwhile, Jakob has a lifelong friendship with his neighbors in Canada, a Jewish family who are also fighting demons of their past.", "genres": ["Drama"], "imdb": {"id": 765451, "rating": 7.1, "votes": 1731}, "languages": ["English", "Greek", "Yiddish", "German"], "lastupdated": "2015-09-07 00:22:07.073000000", "metacritic": 60, "num_mflix_comments": 2, "plot": "A child escapes from Poland during World War II and first heads to Greece before coming of age in Canada.", "poster": "https://m.media-amazon.com/images/M/MV5BODU3MzU3MzQyMV5BMl5BanBnXkFtZTcwMzMyNzg2MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1210291200000, "runtime": 104, "title": "Fugitive Pieces", "tomatoes": {"boxOffice": "$0.4M", "consensus": "Though the retelling is a bit too subtle, the moving story and solid performances lift Fugitive Pieces beyond standard holocaust tales.", "critic": {"meter": 69, "numReviews": 74, "rating": 6.2}, "dvd": 1223942400000, "fresh": 51, "lastUpdated": 1438280687000, "production": "IDP Distribution", "rotten": 23, "viewer": {"meter": 64, "numReviews": 33387, "rating": 3}, "website": "http://samuelgoldwynfilms.com/"}, "type": "movie", "writers": ["Anne Michaels (novel)", "Jeremy Podeswa"], "year": 2007}