{"_id": "573a1399f29313caabcee962", "awards": {"nominations": 6, "text": "1 win & 6 nominations.", "wins": 1}, "cast": ["Steven Seagal", "Michael Caine", "Joan Chen", "John C. McGinley"], "countries": ["USA"], "directors": ["Steven Seagal"], "fullplot": "Forrest Taft is an environmental agent who works for the Aegis Oil Company in Alaska. Aegis Oil's corrupt CEO, Michael Jennings, is the kind of person who doesn't care whether or not oil spills into the ocean or onto the land, just as long as it's making money for him. He even makes commercials that make him look like he cares about the environment. Jennings is almost finished with building his new state-of-the art oil rig: AEGIS-1. The problem is that if he doesn't finish building the rig in thirteen days, the land rights will be returned to the Eskimos and the Alaskan government. When Jennings finds out that Taft's best friend Hugh Palmer has a computer disk that contains information about defective equipment on AEGIS-1, he sends out his goons to murder Palmer. When Taft tries to interfere, Jennings tries to kill Taft. But an Eskimo woman named Masu, who introduces Taft to her father Silook, the chief of her tribe, rescues Taft. With Masu's help, Taft begins a trek through the Alaskan wilderness, heading straight for AEGIS-1 and to destroy it before it destroys all of the forest.", "genres": ["Action", "Adventure", "Thriller"], "imdb": {"id": 110725, "rating": 4.3, "votes": 16680}, "languages": ["English", "Inuktitut"], "lastupdated": "2015-08-21 00:25:15.500000000", "plot": "Mystical martial artist/environmental agent takes on a ruthless oil corporation.", "poster": "https://m.media-amazon.com/images/M/MV5BNzA1OGZiMjktYTA5YS00NmYzLTg2YWUtYTE0ZTg2YTE4MWI0XkEyXkFqcGdeQXVyMjU0NDExNDg@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 761529600000, "runtime": 101, "title": "On Deadly Ground", "tomatoes": {"critic": {"meter": 10, "numReviews": 30, "rating": 2.6}, "dvd": 926985600000, "fresh": 3, "lastUpdated": 1440526235000, "production": "Warner Home Video", "rotten": 27, "viewer": {"meter": 35, "numReviews": 32881, "rating": 2.5}}, "type": "movie", "writers": ["Ed Horowitz", "Robin U. Russin"], "year": 1994}