{"_id": "573a13e4f29313caabdc1762", "awards": {"nominations": 3, "text": "1 win & 3 nominations.", "wins": 1}, "cast": ["Michael Gambon", "Michelle Fairley", "Nico Mirallegro", "Daniel Mays"], "countries": ["UK"], "directors": ["David Blair"], "fullplot": "Young Johnjo O'Shea drives his cousin Tony and two friends to a takeaway, unaware that they intend to beat up another youth. In the fracas one of the trio, psycho Kieran Gillespie, stabs to death innocent bystander Thomas Hughes and threatens Johnjo not to go to the police. However Johnjo voluntarily gives a statement to DI Hastings but finds himself remanded in custody despite being guiltless of any crime. Under an ancient legal process known as Joint Enterprise which holds that any accomplice was aware of malicious intent he stands trial with the others. His lawyer puts up an excellent case for him but the judge feels unable to oppose Joint Enterprise and, although only Gillespie gets life, the other boys are forced to plead guilty to GBH and get five years. Parallel to the O'Sheas' plight is the reaction of Thomas's estranged parents, especially his mother Margaret, who ultimately feels a kinship with Johnjo's mother after receiving a letter of apology from the boy. As the credits roll parents whose children are victims of Joint Enterprise talk to the camera.", "genres": ["Crime", "Drama"], "imdb": {"id": 2937752, "rating": 7.4, "votes": 668}, "languages": ["English"], "lastupdated": "2015-09-04 00:42:10.070000000", "num_mflix_comments": 1, "plot": "Jimmy McGovern's gritty drama stars Nico Mirallegro as guileless 17 year old Johnjo O'Shea, who goes from innocent bystander to accessory to premeditated murder after giving a few friends a lift.", "poster": "https://m.media-amazon.com/images/M/MV5BMjM1OTI2MzUxOV5BMl5BanBnXkFtZTgwNjA3OTQzMzE@._V1_SY1000_SX677_AL_.jpg", "released": 1404604800000, "runtime": 90, "title": "Common", "tomatoes": {"lastUpdated": 1420263494000, "viewer": {"numReviews": 0, "rating": 0}}, "type": "movie", "writers": ["Jimmy McGovern (script)", "Jimmy McGovern"], "year": 2014}