{"_id": "573a13bbf29313caabd53dbb", "awards": {"nominations": 5, "text": "1 win & 5 nominations.", "wins": 1}, "cast": ["Amir Bar-Lev", "Anthony Brunelli", "Elizabeth Cohen", "Jonathan Crosby"], "countries": ["USA", "UK"], "directors": ["Amir Bar-Lev"], "fullplot": "Four year old Marla Olmstead from Binghamton, New York became the sensation of the art world for her abstract artwork, which have sold for thousands of dollars per piece. The showing of her work started off as a lark, but when the paintings sold without the buyers knowing who the artist was, the media began to run with the story. Through it all, Marla's parents, Mark Olmstead and Laura Olmstead, want to be grounded in what is best for their daughter while exposing her to whatever positive may come from the experience. But some negative and big name media also surfaces, some questioning whether Marla is the real artist behind the work, and some questioning exposing a four year old to such infamy. Regardless, the fact of this art selling brings up the legitimacy of abstract art being quantified as \"quality\", especially if a four year old can produce it but can't express the emotions or rationale behind its creation. Or is art truly in the eyes of the beholder? Regardless, money, in the art world as is much in life, becomes the great equalizer.", "genres": ["Documentary", "Family", "Mystery"], "imdb": {"id": 912592, "rating": 7.2, "votes": 2793}, "languages": ["English", "Mandarin"], "lastupdated": "2015-09-14 12:55:39.630000000", "metacritic": 74, "num_mflix_comments": 2, "plot": "A look at the work and surprising success of a four-year-old girl whose paintings have been compared to the likes of Picasso and has raked in hundreds of thousands of dollars.", "poster": "https://m.media-amazon.com/images/M/MV5BMTIyMjY4OTQwNV5BMl5BanBnXkFtZTcwMzE5NjA1MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1197590400000, "runtime": 82, "title": "My Kid Could Paint That", "tomatoes": {"consensus": "Director Amir Bar-Lev grapples with exposing the authenticity of four-year-old Marla's paintings at the sake of burdening her publicly shamed family to transfixing results.", "critic": {"meter": 94, "numReviews": 82, "rating": 7.8}, "dvd": 1204588800000, "fresh": 77, "lastUpdated": 1442252539000, "production": "Sony Pictures Classics", "rotten": 5, "viewer": {"meter": 78, "numReviews": 5091, "rating": 3.7}, "website": "http://www.sonyclassics.com/mykidcouldpaintthat"}, "type": "movie", "year": 2007}