{"_id": "573a13c7f29313caabd75673", "awards": {"nominations": 2, "text": "2 nominations.", "wins": 0}, "cast": ["Brian Krause", "Jeremy Sumpter", "Lauren Holly", "Caitlin E.J. Meyer"], "countries": ["USA"], "directors": ["John Lyde"], "fullplot": "Fraternal twin sisters Emma and Lilly are as different as night and day. Emma, the beautiful blonde tomboy, would rather be riding a horse than anything else in the world. While Lilly, her shy redheaded twin, loves to be left alone to curl up with a good book. Inseparable since the day they were born, Emma and Lilly have an insatiable desire to play matchmaker, even though they've never fallen in love themselves. Emma and Lilly find out their matchmaking skills are not just a gift from heaven, but rather because their father is actually Cupid (yes the guy who shoots bows and arrows). As they enter their senior year in high school, Emma and Lilly finally fall in love. Life gets complicated when they discover they're in love with the same guy and they become bitter rivals as they try to win his affection. Sisterhood and matchmaking are tossed out the window like last year's shoes, as Emma and Lilly plot to sabotage each other, so they can win the heart of their dream guy. The sisters who once were inseparable, now spend every waking moment, planning each others demise. Meanwhile, their parents are falling out of love. Can Emma and Lily overcome their problems and use their matchmaking skills to bring their parents back together?", "genres": ["Fantasy", "Romance"], "imdb": {"id": 1464606, "rating": 5.5, "votes": 647}, "languages": ["English"], "lastupdated": "2015-09-07 00:29:45.893000000", "plot": "Fraternal twin sisters Emma and Lilly are as different as night and day. Emma, the beautiful blonde tomboy, would rather be riding a horse than anything else in the world. While Lilly, her ...", "poster": "https://m.media-amazon.com/images/M/MV5BNDY5MTEyMDE1Nl5BMl5BanBnXkFtZTcwNzM3Mjk0Mw@@._V1_SY1000_SX677_AL_.jpg", "rated": "G", "released": 1265932800000, "runtime": 93, "title": "You're So Cupid!", "tomatoes": {"critic": {"meter": 86, "numReviews": 14, "rating": 6.6}, "dvd": 1383609600000, "fresh": 12, "lastUpdated": 1435179030000, "production": "WARNER BROTHERS PICTURES", "rotten": 2, "viewer": {"meter": 71, "numReviews": 83, "rating": 3.6}, "website": "http://www.facebook.com/hiphophoax"}, "type": "movie", "writers": ["Sally Meyer"], "year": 2010}