{"_id": "573a1394f29313caabce0e30", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Victor Mature", "Red Buttons", "Rhonda Fleming", "Kathryn Grant"], "countries": ["USA"], "directors": ["Joseph M. Newman"], "fullplot": "After splitting with his longtime business partner, Hank Whirling is about to take his big top circus on tour. He manages to get a loan and some investment money but has to take on one of their employees, Randy Sherman, to keep an eye on the finances. Sherman immediately hires a new press agent, Helen Harrison, over Hank's objections. After a series of accidents, they soon realize that they have a saboteur in the company. With financial problems increasing, Whirling looks to take the the show to New York City before his former partner Jules Borman can get his circus there. He realizes that he'll need a lot of publicity and trapeze and high wire artist Zach Colino agrees to walk the wire across Niagara Falls. After the circus train is sabotaged - killing Zach's wife and several others - they race to Niagara Falls to complete the high wire act but Zach may not be up it. The saboteur working for Borman bides his time and is planning another death.", "genres": ["Drama"], "imdb": {"id": 52626, "rating": 6.3, "votes": 420}, "languages": ["English"], "lastupdated": "2015-07-17 01:21:44.990000000", "plot": "Hank Whirling tries to keep his financially troubled circus on the road despite the efforts of a saboteur who has determined that the show must not go on.", "poster": "https://m.media-amazon.com/images/M/MV5BOTdlYWVlOWUtOGU0Yy00NzcxLWJhN2MtYzY3NGY4YzY3ZDA1XkEyXkFqcGdeQXVyMjI4MjA5MzA@._V1_SY1000_SX677_AL_.jpg", "released": -331171200000, "runtime": 109, "title": "The Big Circus", "tomatoes": {"dvd": 1245628800000, "lastUpdated": 1437069877000, "production": "Warner Bros.", "viewer": {"meter": 46, "numReviews": 67, "rating": 3.4}}, "type": "movie", "writers": ["Irwin Allen (screenplay)", "Charles Bennett (screenplay)", "Irving Wallace (screenplay)", "Irwin Allen (story)"], "year": 1959}