{"_id": "573a13a7f29313caabd1af22", "awards": {"nominations": 1, "text": "2 wins & 1 nomination.", "wins": 2}, "cast": ["Liv Ullmann", "Erland Josephson", "Bèrje Ahlstedt", "Julia Dufvenius"], "countries": ["Sweden", "Denmark", "Norway", "Italy", "Finland", "Germany", "Austria"], "directors": ["Ingmar Bergman"], "fullplot": "Marianne and Johan meet again after thirty years without contact, when Marianne suddenly feels a need to see her ex-husband again. She decides to visit Johan at his old summer house in the western province of Dalarna. And so, one beautiful autumn day, there she is, beside his reclining chair, waking him with a light kiss. Staying at a cottage on the property are Johan's son Henrik and Henrik's daughter Karin. Henrik is giving his daughter cello lessons and already sees her future as staked out. Relations between father and son are very strained, but both are protective of Karin. They are all still mourning Anna, Henrik's much-loved wife, who died two years ago, yet who, in many ways, remains present among them. Marianne soon realizes that things are not all as they should be, and she finds herself unwillingly drawn into a complicated and upsetting power struggle.", "genres": ["Drama", "Music"], "imdb": {"id": 299478, "rating": 7.8, "votes": 5127}, "languages": ["Swedish", "English", "German"], "lastupdated": "2015-09-03 00:29:24.897000000", "metacritic": 80, "plot": "Marianne, some thirty years after divorcing Johan, decides to visit her ex-husband at his summer home. She arrives in the middle of a family drama between Johan's son from another marriage and his granddaughter.", "poster": "https://m.media-amazon.com/images/M/MV5BMTI1MTgwNzcwOF5BMl5BanBnXkFtZTcwNjExNDAzMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1070236800000, "runtime": 107, "title": "Saraband", "tomatoes": {"boxOffice": "$0.5M", "consensus": "If Saraband appears to be a minor entry in Ingmar Bergman's filmography, it's still an accomplished piece of work from one of cinema's greatest masters.", "critic": {"meter": 92, "numReviews": 83, "rating": 7.8}, "dvd": 1136851200000, "fresh": 76, "lastUpdated": 1442423340000, "production": "Sony Pictures Classics", "rotten": 7, "viewer": {"meter": 86, "numReviews": 5003, "rating": 3.9}, "website": "http://www.sonyclassics.com/saraband/"}, "type": "movie", "writers": ["Ingmar Bergman"], "year": 2003}