{"_id": "573a13b5f29313caabd454e7", "awards": {"nominations": 2, "text": "1 win & 2 nominations.", "wins": 1}, "cast": ["Siedah Garrett", "Michael Jackson", "Darryl Phinnessee"], "countries": ["Romania"], "directors": ["Andrew Morahan"], "fullplot": "For over four decades Michael Jackson has been entertaining the world. From his many #1 smash hits to his incredible short films that dominated MTV, Michael is one of the greatest performers of our lifetime. But to truly experience the creativity and genius of Michael Jackson, you must experience him LIVE. Here is your chance! Michael's \"Dangerous Tour\" was the biggest tour any performer had done in history, breaking his own record from the preceding \"Bad Tour.\" The incredible staging took nearly 3 days to set up and 20 trucks of equipment were shipped between countries on cargo planes, making headlines everywhere it went. The \"Dangerous Tour\" included 69 concerts reaching over 3.5 MILLION fans. This concert, \"Live In Bucharest: The Dangerous Tour,\" aired on HBO in 1992. The special received the highest TV ratings in the history of HBO and Michael was honored with the Cable Ace Award. The Bucharest Concert was performed on October 1st, 1992 and was broadcast live on radio and shown on TV in over 60 countries around the world. Now, for the first time on digital video, here is the complete concert in all its splendor. Experience the magic of the King Of Pop...", "genres": ["Documentary", "Music"], "imdb": {"id": 480827, "rating": 8.9, "votes": 1030}, "languages": ["English"], "lastupdated": "2015-08-31 00:52:33.530000000", "num_mflix_comments": 2, "plot": "For over four decades Michael Jackson has been entertaining the world. From his many #1 smash hits to his incredible short films that dominated MTV, Michael is one of the greatest ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTczNzE2MDI2MF5BMl5BanBnXkFtZTgwMDE2OTkwMzE@._V1_SY1000_SX677_AL_.jpg", "released": 1119744000000, "runtime": 122, "title": "Michael Jackson Live in Bucharest: The Dangerous Tour", "tomatoes": {"dvd": 1292889600000, "lastUpdated": 1438799589000, "production": "A & E Home Entertainment", "viewer": {"meter": 42, "numReviews": 49, "rating": 3.3}}, "type": "movie", "year": 1992}