{"_id": "573a13d7f29313caabda2064", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Donnie Yen", "Tian Jing", "Andy On", "Ronald Cheng"], "countries": ["China"], "directors": ["Clarence Yiu-leung Fok"], "fullplot": "Chan Chi-Lung has been an infiltrator in Cheung Mo-Hung's Hong Kong triad gang for many years. After a failure of a recent negotiation by Lung with the other three local triad gangs on behalf of Hung makes the latter suspicious of Lung's identity. Hung sets to wipe out every undercover cop in his gang and as a result many cops are caught and wiped out. Sensing the danger, Lung requests to put an end to his undercover career from his captain, Cheung. However, Cheung sends Lung to Mainland China to infiltrate a business of \"Special Identity\" trading instead. The business is run by Hung's best protègè, Sunny, who was Lung's previous buddy in the gang. Cheung promises to reinstate Lung's police identity in conclusion of the mission once Sunny's business breaks down. Lung agrees, and joining him are local police officer Fang Jing and her chief Lei Peng from the Mainland Chinese police force. But before they can get to Sunny, the latter suddenly vanishes leaving Lung exposed and in great danger.", "genres": ["Action", "Crime", "Drama"], "imdb": {"id": 2118775, "rating": 5.5, "votes": 2359}, "languages": ["Cantonese", "Mandarin", "English"], "lastupdated": "2015-09-07 01:07:55.643000000", "metacritic": 47, "num_mflix_comments": 1, "plot": "A cop goes undercover in a ruthless underworld organization to stop a gang leader, only to put himself in great danger after being exposed by his former protègè and best friend.", "poster": "https://m.media-amazon.com/images/M/MV5BMjAyMzA0MzI2Nl5BMl5BanBnXkFtZTgwOTEyODE5MDE@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1382054400000, "runtime": 99, "title": "Special ID", "tomatoes": {"critic": {"meter": 44, "numReviews": 9, "rating": 4.8}, "dvd": 1399939200000, "fresh": 4, "lastUpdated": 1440614435000, "production": "Well Go USA", "rotten": 5, "viewer": {"meter": 26, "numReviews": 487, "rating": 2.8}, "website": "http://wellgousa.com/press/special-id"}, "type": "movie", "writers": ["Kam-Yuen Szeto"], "year": 2013}