{"_id": "573a13a7f29313caabd1a57b", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Patricia Ree Gilbert", "Don Fellows", "Jonathan Gordon", "Robert L. Rosen"], "countries": ["USA"], "directors": ["William Greaves"], "fullplot": "Filmmaker William Greaves is shooting a series of screen tests in New York City's Central Park for the two leads of a feature length movie, with the working title of \"Over the Cliff\". Simultaneously, he has a documentary filmmaking crew filming the behind the scenes making of the movie. In addition to seeing these two sets of footage (the film and the film of the film), the viewer also sees footage of a third film crew filming the these two in relation to what is happening overall as they film in the park while real life goes on around them, which in Bill's mind is part of the realism of the movie. \"Over the Cliff\" itself has no plot and no full script but only a working concept of sexuality being the movie's theme and snippets of scripted dialogue. This unstructured approach is to give the movie a sense of realism. The actors imply as much, but many of the crew, discussing in Grieves-less bullpen sessions, believe Greaves is unfocused and inept at what he is doing, while a minority believe his experimental process will yield a special and great end product.", "genres": ["Documentary"], "imdb": {"id": 296881, "rating": 7.2, "votes": 849}, "languages": ["English", "French", "Italian"], "lastupdated": "2015-06-08 00:30:07.853000000", "metacritic": 71, "num_mflix_comments": 1, "plot": "Filmmaker William Greaves auditioned acting students for a fictional drama, while simultaneously shooting the behind-the-scenes drama taking place.", "poster": "https://m.media-amazon.com/images/M/MV5BMTQ1ODYyODYyOV5BMl5BanBnXkFtZTcwNDM0MTA0MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 1130284800000, "runtime": 75, "title": "Symbiopsychotaxiplasm: Take One", "tomatoes": {"critic": {"meter": 89, "numReviews": 9, "rating": 7.8}, "dvd": 1165276800000, "fresh": 8, "lastUpdated": 1434741720000, "production": "Criterion Collection", "rotten": 1, "viewer": {"meter": 75, "numReviews": 573, "rating": 3.9}}, "type": "movie", "writers": ["William Greaves"], "year": 1968}