{"_id": "573a1399f29313caabced21c", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Aamir Khan", "Ayesha Jhulka", "Deepak Tijori", "Pooja Bedi"], "countries": ["India"], "directors": ["Mansoor Khan"], "fullplot": "The biggest sporting event for the school town of Nainital is the annual cycling race. Schools and colleges here range from those like Rajput and Xavier's for the spoilt rich kids to local ones like Model for the poorer kids. For the past two years the cycling race has been won by the arrogant Shekhar Malhotra (Deepak Tijori) of Rajput College. Sanju (Aamir Khan) and Ratan (Mamik) are bothers who attend Model and run a small local cafe. Their father (Kulbhushan Kharbanda) is obsessed by the desire to see Ratan become the cycling champion. Ratan on his part is the ideal son and elder brother to Sanju, good in everything he does and has been the runner-up to Shekhar in the cycling race. Sunju on the other hand is a prankster, not taking life seriously at all enjoying life with his friends among whom is Anjali (Ayesha Jhulka) who loves him silently. Sanju however turns his attention on the new girl on the block, Devika (Pooja Bedi) and convinces her he is rich. He uses the money his father has asked him to deposit in the bank to buy a costly necklace for Devika instead. When his father finds out, he chucks Sanju out of the house. At the annual college dance competition when Devika finds out that Sanju is from Model and poor, she dumps him turning her attention to Shekhar. All through Anjali is a silent pillar of support for Sanju. Shekhar and his friends injure Ratan, almost killing him to keep him out of the race. It is at this point that Sanju realizes he has to get serious and responsible in life and he enters the cycle race to do what a man must do...", "genres": ["Comedy", "Drama", "Romance"], "imdb": {"id": 104561, "rating": 8.3, "votes": 10067}, "languages": ["Hindi"], "lastupdated": "2015-08-19 00:12:23.127000000", "num_mflix_comments": 3, "plot": "A rich brat and a poor chap try to woo a girl, with their rivalry culminating in the most prestigious college event - the marathon cycle race.", "rated": "PG", "released": 706492800000, "runtime": 174, "title": "Jo Jeeta Wohi Sikandar", "tomatoes": {"dvd": 1156809600000, "lastUpdated": 1438367128000, "viewer": {"meter": 95, "numReviews": 4393, "rating": 4.2}}, "type": "movie", "writers": ["Nasir Hussain (dialogue)", "Mansoor Khan (screenplay)", "Mansoor Khan (story)"], "year": 1992}