{"_id": "573a13bcf29313caabd5784f", "awards": {"nominations": 16, "text": "Nominated for 1 Golden Globe. Another 1 win & 16 nominations.", "wins": 2}, "cast": ["Georgie Henley", "Skandar Keynes", "Ben Barnes", "Will Poulter"], "countries": ["USA"], "directors": ["Michael Apted"], "fullplot": "Lucy and Edmund Pevensie are stranded in Cambridge, living in the house of their obnoxious cousin Eustace, while the grown-ups Susan and Peter are living in the USA with their parents. When a painting of a ship sailing on the sea of Narnia overflows water in their room, Lucy, Edmund and Eustace are transported to the ocean of Narnia and rescued by King Caspian and the crew of the ship The Dawn Treader. Caspian explains that Narnia has been in peace for three years but before he took his throne back, his uncle tried to kill the seven lords of Telmar, who were the closest and most loyal friends of his father. They fled to The Lone Island and no one has ever heard anything about them. Now Caspian is seeking out the lords of Telmar with his Captain Drinian, the talking mouse Reepicheep and his loyal men. Soon, they discover that an evil form of green mist is threatening Narnia and the siblings and their cousin join Caspian in a quest to retrieve the seven swords of the seven lords of Telmar to save Narnia from evil.", "genres": ["Adventure", "Family", "Fantasy"], "imdb": {"id": 980970, "rating": 6.3, "votes": 95645}, "languages": ["English"], "lastupdated": "2015-09-03 00:38:15.210000000", "metacritic": 53, "num_mflix_comments": 3, "plot": "Lucy and Edmund Pevensie return to Narnia with their cousin Eustace where they meet up with Prince Caspian for a trip across the sea aboard the royal ship The Dawn Treader. Along the way they encounter dragons, dwarves, merfolk, and a band of lost warriors before reaching the edge of the world.", "poster": "https://m.media-amazon.com/images/M/MV5BNjQ2MDQzMzExNl5BMl5BanBnXkFtZTcwMTYzOTc5Mw@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 1291939200000, "runtime": 113, "title": "The Chronicles of Narnia: The Voyage of the Dawn Treader", "tomatoes": {"boxOffice": "$104.4M", "consensus": "Its leisurely, businesslike pace won't win the franchise many new fans, but Voyage of the Dawn Treader restores some of the Narnia franchise's lost luster with strong performances and impressive special effects.", "critic": {"meter": 49, "numReviews": 159, "rating": 5.7}, "dvd": 1302220800000, "fresh": 78, "lastUpdated": 1441994547000, "production": "20th Century Fox", "rotten": 81, "viewer": {"meter": 58, "numReviews": 156701, "rating": 3.5}, "website": "http://www.narnia.com/"}, "type": "movie", "writers": ["Christopher Markus (screenplay)", "Stephen McFeely (screenplay)", "Michael Petroni (screenplay)", "C.S. Lewis (novel)"], "year": 2010}