{"_id": "573a13b1f29313caabd370d5", "awards": {"nominations": 15, "text": "4 wins & 15 nominations.", "wins": 4}, "cast": ["Marylouise Burke", "Woody Harrelson", "L.Q. Jones", "Tommy Lee Jones"], "countries": ["USA"], "directors": ["Robert Altman"], "fullplot": "\"A Prairie Home Companion\", hosted by humorist Garrison Keillor, is a down home radio variety show recorded and performed live in front of an audience in a theater in St. Paul, Minnesota. A show from another era, \"A Prairie Home Companion\" has been canceled. The regulars are performing on the last show, including Dusty & Lefty, singing/guitar playing cowboys with a risquè sense of humor, and the Johnson Girls, a sister singing duo of Rhonda and Yolanda who have a penchant for talking over each other. As the show goes on, the regulars, backstage, talk about their lives in relation to the show. Other goings-on include Yolanda and others trying to convince her shy somber daughter, Lola, to sing on this last show. As all this goes on, a mysterious woman in a white trench coat who is on a mission wanders around the theater, while the show's dim security guard, Guy Noir, who usually has nothing to do security-wise, follows.", "genres": ["Comedy", "Drama", "Music"], "imdb": {"id": 420087, "rating": 6.9, "votes": 19096}, "languages": ["English", "Norwegian"], "lastupdated": "2015-08-20 01:16:13.843000000", "metacritic": 75, "num_mflix_comments": 2, "plot": "A look at what goes on backstage during the last broadcast of America's most celebrated radio show, where singing cowboys Dusty and Lefty, a country music siren, and a host of others hold court.", "poster": "https://m.media-amazon.com/images/M/MV5BMTYwOTgzMTA3NF5BMl5BanBnXkFtZTcwMjYxMDMzMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1149811200000, "runtime": 105, "title": "A Prairie Home Companion", "tomatoes": {"boxOffice": "$20.2M", "consensus": "The final film by the great Robert Altman, A Prairie Home Companion, the big screen adaptation of Garrison Keillor's radio broadcast, showcases plenty of the director's strengths: it's got a gigantic cast and plenty of quirky acting and dialogue. Much like the radio show, Companion features clever jokes, rousing tunes, and endearing characters. With strong work from Lindsay Lohan, Meryl Streep, Kevin Kline, and Tommy Lee Jones, it's a worthy swan song from one of the cinema's best.", "critic": {"meter": 81, "numReviews": 191, "rating": 7.1}, "dvd": 1099958400000, "fresh": 155, "lastUpdated": 1441904940000, "production": "Picturehouse", "rotten": 36, "viewer": {"meter": 59, "numReviews": 83882, "rating": 3}, "website": "http://www.aprairiehomecompanionmovie.com/"}, "type": "movie", "writers": ["Garrison Keillor (screenplay)", "Garrison Keillor (story)", "Ken LaZebnik (story)"], "year": 2006}