{"_id": "573a13b3f29313caabd3b197", "awards": {"nominations": 7, "text": "7 nominations.", "wins": 0}, "cast": ["Akshaye Khanna", "Kareena Kapoor", "Sunil Shetty", "Paresh Rawal"], "countries": ["India"], "directors": ["Priyadarshan"], "fullplot": "Angar Chand lives a wealthy lifestyle in a small town in India along with his wife, Parvati, and four sons, Balram, Kishan, Shakti and Jai. Since Balram is of marriageable age, he arranges his marriage with the daughter of Laxmi Devi, who decides to oppose this marriage. During the wedding ceremony, Laxmi Devi and her sons, Surajbhan, and Pratap forcibly remove their sister and accidentally kill Parvati. They subsequently get their sister married to Kashinath. An enraged Angar hacks Laxmi's husband to death, is arrested and sentenced to 14 years in prison. When he returns he makes it clear that women will not be permitted in his house and forbids his sons to ever marry. Then Jai, who is studying in Lala Lajpatrai Law College meets with Anjali, Laxmi's grand-daughter, who openly admits that she is attracted to him. Jai, at first rejects her, then decides to teach and her family a lesson. Both feign their love for each other, but subsequently admit the truth, and even Anjali admits that she wanted to come close to Jai to extract vengeance. Both go their separate ways, but subsequently find that they are indeed in love with each other. In order to get wed, Jai must first convince his elder brothers to get married albeit in vain as none of them even want to consider this option. Then Lucky, Jai's friend, finds out that Kishan. a seemingly celibate Bhagwan Hanuman's devotee, is leading a dual life as Murari, who has been married to a woman, Gopi, from Gangapur, for 7 years and has two children, a son and a daughter. When Angar finds out he kicks Kishan and Jai out of his house. Watch what happens when Anjali's marriage is finalized with Laxmi's advocate's son, while Pratap and Surajbhan approach Angar to help them stop Jai from disrupting this marriage on one hand, while Laxmi tells Jai to marry Anjali - setting off a deadly confrontations between the estranged sons and father.", "genres": ["Action", "Comedy", "Drama"], "imdb": {"id": 437238, "rating": 6.8, "votes": 3088}, "languages": ["Hindi"], "lastupdated": "2015-08-03 00:08:42.583000000", "plot": "A man and woman from feuding families each pretend to fall in love, as part of a revenge plot. Chaos ensues when their fake romance becomes a reality.", "poster": "https://m.media-amazon.com/images/M/MV5BNzU2ZTBlZmYtN2VhNC00ZDRjLWE4ZjgtYTEyMGIwYTMyN2I4XkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY1000_SX677_AL_.jpg", "released": 1101427200000, "title": "Hulchul", "tomatoes": {"dvd": 1190678400000, "lastUpdated": 1439664753000, "viewer": {"meter": 0, "numReviews": 33, "rating": 2.5}}, "type": "movie", "writers": ["K.P. Saxena (dialogue)", "Siddique (story)", "Neeraj Vora (screenplay)"], "year": 2004}