{"_id": "573a13a0f29313caabd048f4", "awards": {"nominations": 3, "text": "3 nominations.", "wins": 0}, "cast": ["Stellan Skarsgèrd", "Izabella Scorupco", "James D'Arcy", "Remy Sweeney"], "countries": ["USA"], "directors": ["Renny Harlin"], "fullplot": "Archeologist Lankester Merrin is asked to go to East Africa to excavate a church that has been found completely buried in sand. Merrin is also an ordained Roman Catholic priest who, still haunted by what he was forced to do during World War II in his native Holland, eschews any religion or belief. He's fascinated by what he finds and that it dates hundred of years before Christianity was introduced to the area. Accompanied by a young priest, Father Francis, to keep an eye on the religious elements of what they find, Merrin makes his way to the camp. There he meets a young doctor, Sarah and soon realizes there is an air of gloom that envelops the entire site. Workmen go mad and a young boy is mauled by a pack of hyenas while completely ignoring his younger brother Joseph. Inside the church itself they find signs of desecration. Merrin is forced to re-examine his lack of faith and come face to face with the devil.", "genres": ["Horror", "Mystery", "Thriller"], "imdb": {"id": 204313, "rating": 5.1, "votes": 27471}, "languages": ["English"], "lastupdated": "2015-09-05 00:50:17.290000000", "metacritic": 30, "plot": "Years before Father Lancaster Merrin helped save Regan MacNeil's soul, he first encounters the demon Pazuzu in East Africa. This is the tale of Father Merrin's initial battle with Pazuzu and the rediscovery of his faith.", "poster": "https://m.media-amazon.com/images/M/MV5BMjI0NzY1MzQ0MV5BMl5BanBnXkFtZTcwOTM1MTEzMw@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1092960000000, "runtime": 114, "title": "Exorcist: The Beginning", "tomatoes": {"boxOffice": "$41.8M", "consensus": "A mediocre, gory horror film, nowhere near the quality of the 1973 original.", "critic": {"meter": 11, "numReviews": 129, "rating": 3.5}, "dvd": 1130198400000, "fresh": 14, "lastUpdated": 1439922096000, "production": "Warner Bros. Pictures", "rotten": 115, "viewer": {"meter": 27, "numReviews": 80313, "rating": 2.8}, "website": "http://exorcistthebeginning.warnerbros.com/"}, "type": "movie", "writers": ["William Peter Blatty (movie The Exorcist)", "William Wisher Jr. (story)", "Caleb Carr (story)", "Alexi Hawley (screenplay)"], "year": 2004}