{"_id": "573a1395f29313caabce15c7", "awards": {"nominations": 2, "text": "Nominated for 1 BAFTA Film Award. Another 2 wins & 2 nominations.", "wins": 3}, "cast": ["Franco Citti", "Franca Pasut", "Silvana Corsini", "Paola Guidi"], "countries": ["Italy"], "directors": ["Pier Paolo Pasolini"], "fullplot": "In a seedy section of Rome, Vittorio Cataldi - \"Accattone\" (\"beggar\" in Italian) to those that know him - lives off the avails of prostitution, Maddalena being his one and only girl. He is married to Ascenza with who he has one young son named Iaio, but he does not live with them - they who live with her father and brother - provide for them, or play any important part of their lives. He generally hangs out with his similarly slack life friends playing cards and drinking. His source of income is threatened when Maddalena is injured being hit by a motorcyclist, then beaten by rivals of his, which leads to her being arrested and jailed for a year. Largely because of Iaio, Accattone contemplates going straight and getting a real job. Then he meets Stella, a young innocent woman who has had a hard life, but who is not as naive to the ways of the world as she first appears. Accattone falls in love with her, but as the thought of working a steady job now becomes abhorrent, contemplates pimping for Stella. As Accattone and Stella's relationship progresses, Accattone's past may come back to haunt him.", "genres": ["Drama"], "imdb": {"id": 54599, "rating": 7.9, "votes": 4589}, "languages": ["Italian"], "lastupdated": "2015-08-28 00:18:08.847000000", "plot": "A pimp with no other means to provide for himself finds his life spiraling out of control when his prostitute is sent to prison.", "poster": "https://m.media-amazon.com/images/M/MV5BYjY2MzhmOTItMWJiNi00YmRjLTg2MDgtODY4NWM1ZDY4MGUyXkEyXkFqcGdeQXVyMzQ5Njc3OTg@._V1_SY1000_SX677_AL_.jpg", "released": -55036800000, "runtime": 120, "title": "Accattone", "tomatoes": {"critic": {"meter": 100, "numReviews": 14, "rating": 7.6}, "dvd": 1112659200000, "fresh": 14, "lastUpdated": 1440354943000, "production": "Water Bearer Films Inc.", "rotten": 0, "viewer": {"meter": 89, "numReviews": 1362, "rating": 4.1}}, "type": "movie", "writers": ["Pier Paolo Pasolini (story)", "Pier Paolo Pasolini (screenplay)", "Sergio Citti (additional dialogue)"], "year": 1961}