{"_id": "573a13b2f29313caabd3a5fe", "awards": {"nominations": 1, "text": "1 win & 1 nomination.", "wins": 1}, "cast": ["Jonas Chernick", "Callum Keith Rennie", "Michelle Nolden", "Lindy Booth"], "countries": ["Canada"], "directors": ["Sean Garrity"], "fullplot": "Thirty-two year old Winnipeger Joel Rothman's personal life falls apart after his wife, Mari, catches him cheating. Following, he can't sleep which affects the parenting of his adolescent daughter Jenny. A therapist, he dismisses the work of counseling his patients. Because of his poor work, his Health Maintenance Organization (HMO), his employer, wants to transfer him to the small town of Gimli, which he doesn't want both for his own sake and Jenny's. As such, he begins to do whatever he can for his three remaining patients - Victor Koblinsky, Chandra Mergulhao and Sophie Winters - who he counsels in group therapy. Although each of the three has a different issue with which they are dealing, each does suffer from delusional thoughts the result of post-traumatic stress syndrome. Joel is under pressure from the HMO to certify all three, despite his assurance that all three are getting better. Ultimately, Victor, Chandra and Sophie have to convince him of what is reality and what is delusion.", "genres": ["Comedy", "Drama", "Mystery"], "imdb": {"id": 434165, "rating": 6.8, "votes": 254}, "languages": ["English"], "lastupdated": "2015-08-13 00:36:37.287000000", "plot": "Thirty-two year old Winnipeger Joel Rothman's personal life falls apart after his wife, Mari, catches him cheating. Following, he can't sleep which affects the parenting of his adolescent ...", "poster": "https://m.media-amazon.com/images/M/MV5BMjA0NDA1MDM2N15BMl5BanBnXkFtZTgwODA5NDY1MzE@._V1_SY1000_SX677_AL_.jpg", "released": 1126396800000, "runtime": 92, "title": "Lucid", "tomatoes": {"critic": {"meter": 14, "numReviews": 7, "rating": 4.8}, "fresh": 1, "lastUpdated": 1441307769000, "rotten": 6, "viewer": {"meter": 74, "numReviews": 689, "rating": 3.7}, "website": "http://www.lucidthemovie.com"}, "type": "movie", "writers": ["Sean Garrity", "Jonas Chernick"], "year": 2005}