{"_id": "573a13cdf29313caabd86061", "awards": {"nominations": 6, "text": "1 win & 6 nominations.", "wins": 1}, "cast": ["Daniel Brèhl", "Burghart Klauèner", "Thomas Thieme", "Justus von Dohnènyi"], "countries": ["Germany"], "directors": ["Sebastian Grobler"], "fullplot": "The young teacher Konrad Koch is hired to teach English at a strictly-run German school for boys in 1874. The reform-minded headmaster von Merfeld has hired Koch as one of the very first English teachers of all at a German secondary school in order to let a fresh new wind into his musty institution. Koch sees how badly this is needed in his very first class. Everything that the boys know about England is common prejudices handed down from one generation to the next. In order to stir up some enthusiasm for the foreign language, Oxford graduate Koch resorts to unusual means and introduces his students to a curious sport that comes from Britain: football. Unfortunately, Koch's unconventional ways soon make him many enemies: influential parents, local dignitaries and, above all, his colleagues, who only believe in Prussian drills and discipline. They all want to get rid of Koch at any price. But then his students take the initiative...", "genres": ["Drama", "Sport"], "imdb": {"id": 1686768, "rating": 6.8, "votes": 1228}, "languages": ["German", "English"], "lastupdated": "2015-09-12 00:00:27.040000000", "num_mflix_comments": 1, "plot": "An English teacher brings soccer from England to Germany in the late 19th Century by teaching it to his class.", "poster": "https://m.media-amazon.com/images/M/MV5BMGQwZGEwMTEtYTAzMC00NjNiLWI4MWUtNzI5OWY0MWRhMDRiL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMzA3Njg4MzY@._V1_SY1000_SX677_AL_.jpg", "released": 1298505600000, "runtime": 113, "title": "Der ganz groèe Traum", "tomatoes": {"lastUpdated": 1441994518000, "viewer": {"numReviews": 0, "rating": 0}}, "type": "movie", "writers": ["Sebastian Grobler (story)", "Raoul B. Reinert (story)", "Philipp Roth", "Johanna Stuttmann"], "year": 2011}