{"_id": "573a13c0f29313caabd62f0f", "awards": {"nominations": 2, "text": "2 nominations.", "wins": 0}, "cast": ["Kristen Bell", "Josh Duhamel", "Anjelica Huston", "Danny DeVito"], "countries": ["USA"], "directors": ["Mark Steven Johnson"], "fullplot": "Beth is a hard working career woman whose last relationship says that she puts her work above him so he left her. When he tells her he found another career woman and is willing to stick it out with her and is engaged to her, Beth feels that there is no one for her. And when she goes to Rome to attend her sister's impromptu wedding and after meeting the best man, Nick, she's attracted to him but after seeing him with another woman, she gets drunk and goes into the famed Fountain of Love and takes some coins thrown by people looking for love. When she goes back to New York four men start coming onto her. And Nick keeps calling her asking her out. She later learns that what she did--is a no no. It seems legend says that if you take a coin out of the fountain the person who threw it will fall in love with who took the coin. So she has to find a way to break the curse. And she wonders if Nick, whom she likes, is with her cause he wants to or if he is under the spell.", "genres": ["Comedy", "Romance"], "imdb": {"id": 1185416, "rating": 5.5, "votes": 47036}, "languages": ["English", "Italian"], "lastupdated": "2015-09-10 17:23:23.160000000", "metacritic": 25, "num_mflix_comments": 1, "plot": "Beth is a young, ambitious New Yorker who is completely unlucky in love. However, on a whirlwind trip to Rome, she impulsively steals some coins from a reputed fountain of love, and is then aggressively pursued by a band of suitors.", "poster": "https://m.media-amazon.com/images/M/MV5BMTM0OTQ3MjgzN15BMl5BanBnXkFtZTcwMjMyNzg3Mg@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1264723200000, "runtime": 91, "title": "When in Rome", "tomatoes": {"boxOffice": "$32.6M", "consensus": "A pair of young, attractive leads can't overcome When in Rome's reliance on unfunny gags and threadbare rom-com clichès.", "critic": {"meter": 17, "numReviews": 109, "rating": 3.4}, "dvd": 1276560000000, "fresh": 18, "lastUpdated": 1442251656000, "production": "Walt Disney Pictures", "rotten": 91, "viewer": {"meter": 41, "numReviews": 157813, "rating": 3}, "website": "http://www.WhenInRome-TheMovie.com/"}, "type": "movie", "writers": ["David Diamond", "David Weissman"], "year": 2010}