{"_id": "573a139af29313caabcf02db", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Jean-Claude Van Damme", "Roger Moore", "James Remar", "Janet Gunn"], "countries": ["USA", "Canada"], "directors": ["Jean-Claude Van Damme"], "fullplot": "Chris embarks on an odyssey of self-discovery that spans the globe. Kidnapped and enslaved by gun smugglers, sold by pirates and thrust into the murky underworld of gambling and kickboxing, Chris' journey takes him to forbidding Muay Thai Island where deadly martial arts are taught, the colonial splendor of British East Asia, the dank back alleys of Bangkok, desolate deserts once trod by the warriors of Genghis Khan and finally, the ancient Lost City. There he must face the ultimate test of his manhood in the fabled Ghang-gheng, the ancient winner-take-all competition in which the deadliest fighters from around the world employ the most spectacular feats of martial arts skills ever displayed in order to win the prized Golden Dragon. But fighting prowess alone will not be enough for Chris to triumph over such daunting foes. He must reach deep inside and access all of the determination, strength of character and sense of selfless honor within in order to triumph over this final obstacle on his long trek home.", "genres": ["Action", "Adventure", "Thriller"], "imdb": {"id": 117420, "rating": 5.4, "votes": 17223}, "languages": ["English"], "lastupdated": "2015-09-13 00:34:13.613000000", "num_mflix_comments": 1, "plot": "Chris embarks on an odyssey of self-discovery that spans the globe. Kidnapped and enslaved by gun smugglers, sold by pirates and thrust into the murky underworld of gambling and kickboxing,...", "poster": "https://m.media-amazon.com/images/M/MV5BMWIyYjMxZTMtZGUyNy00N2UwLTgwNjctOWQ1OGMzN2VlMDExXkEyXkFqcGdeQXVyNDc2NjEyMw@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 830476800000, "runtime": 95, "title": "The Quest", "tomatoes": {"critic": {"meter": 14, "numReviews": 21, "rating": 3.7}, "dvd": 1009929600000, "fresh": 3, "lastUpdated": 1440354896000, "production": "MCA Universal Home Video", "rotten": 18, "viewer": {"meter": 37, "numReviews": 20865, "rating": 2.7}}, "type": "movie", "writers": ["Frank Dux (story)", "Jean-Claude Van Damme (story)", "Steve Klein (screenplay)", "Paul Mones (screenplay)"], "year": 1996}