{"_id": "573a13ddf29313caabdb4dc6", "awards": {"nominations": 2, "text": "2 nominations.", "wins": 0}, "cast": ["John C. Reilly"], "countries": ["USA"], "directors": ["Alastair Fothergill", "Keith Scholey"], "fullplot": "In an epic story of breathtaking scale, Disneynature's new True Life Adventure \"Bears\" showcases a year in the life of a bear family as two impressionable young cubs are taught life's most important lessons. Set against a majestic Alaskan backdrop teeming with life, their journey begins as winter comes to an end and the bears emerge from hibernation to face the bitter cold. The world outside is exciting-but risky-as the cubs' playful descent down the mountain carries with it a looming threat of avalanches. As the season changes from spring to summer, the brown bears must work hard to find food-ultimately feasting at a plentiful salmon run-while staying safe from rival male bears and predators, including an ever-present wolf. \"Bears\" captures the fast-moving action and suspense of life in one of the planet's last great wildernesses-Alaska!", "genres": ["Documentary"], "imdb": {"id": 2458776, "rating": 7.4, "votes": 4294}, "languages": ["English"], "lastupdated": "2015-09-06 01:04:43.010000000", "metacritic": 68, "num_mflix_comments": 4, "plot": "A documentary that follows an Alaskan bear family as its young cubs are taught life's most important lessons.", "poster": "https://m.media-amazon.com/images/M/MV5BMjE2NTg1NzgyNl5BMl5BanBnXkFtZTgwMTM3MDYwMDE@._V1_SY1000_SX677_AL_.jpg", "rated": "G", "released": 1397779200000, "runtime": 78, "title": "Bears", "tomatoes": {"boxOffice": "$17.8M", "consensus": "Sweet, beautifully filmed, and admirably short on sugarcoating, Bears continues Disneynature's winning streak.", "critic": {"meter": 89, "numReviews": 56, "rating": 7}, "dvd": 1407801600000, "fresh": 50, "lastUpdated": 1440180124000, "production": "Walt Disney Pictures", "rotten": 6, "viewer": {"meter": 78, "numReviews": 22384, "rating": 4}, "website": "http://www.disneynature.com/"}, "type": "movie", "writers": ["Pamela Ribon (Narration Consultant)"], "year": 2014}