{"_id": "573a13b1f29313caabd35ff4", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Parviz Parastui", "Roya Taymourian", "Afarin Obeisi", "Mohammad Amir Naji"], "countries": ["Iran"], "directors": ["Majid Majidi"], "fullplot": "Blind since childhood, Youssef has a devoted wife, loving daughter, and successful university career, but his affliction fills him with secret torment. As if in answer to his prayers, a clinic restores his sight- a miracle that is double-edged. Although this new world of sight and color floods him with ecstacy- the breathtaking images seen through his reawakened eyes include a dazzling vista of snow-blanketed hills, a shower of molten gold sparks in a jewlery foundry, an array of lollipop lights behind a rain-speckled car window- it also plunges him into a labyrinth of confusion and temptations. A pretty student begins to enclipse his previously invisible wife; he silently watches a subway pickpoket, who fixes him with a look of withering complicity. Eager to claim the lost life he feels he is owed but unable to take the next step, Youssef is inflamed with possibility and paralyzed with egoism. A resonant metaphor for life's second chances and a powerful parable of sigh and insight, The Willow Tree's vivid imagery and emotional immediacy makes this Majid Majidi's most mature and ambitious film to date.", "genres": ["Drama"], "imdb": {"id": 415607, "rating": 7.5, "votes": 2728}, "languages": ["Persian"], "lastupdated": "2015-07-06 12:52:22.800000000", "metacritic": 74, "plot": "Youssef, a blind university professor, is suddenly diagnosed with a fatal disease and must undergo treatment in France. Back home, will he find the life he had before?", "poster": "https://m.media-amazon.com/images/M/MV5BODE3ODE3MDk1OF5BMl5BanBnXkFtZTcwNjY2MzE3MQ@@._V1_SY1000_SX677_AL_.jpg", "released": 1186099200000, "runtime": 96, "title": "The Willow Tree", "tomatoes": {"critic": {"meter": 88, "numReviews": 16, "rating": 7.6}, "dvd": 1211241600000, "fresh": 14, "lastUpdated": 1441996407000, "production": "New Yorker Films", "rotten": 2, "viewer": {"meter": 79, "numReviews": 17789, "rating": 3}, "website": "http://www.cinemajidi.com/willow"}, "type": "movie", "writers": ["Majid Majidi (idea)", "Majid Majidi (screenplay)", "Fouad Nahas (screenplay)", "Nasser Hashemzadeh (screenplay)"], "year": 2005}