{"_id": "573a1399f29313caabcecb44", "awards": {"nominations": 6, "text": "6 nominations.", "wins": 0}, "cast": ["Milla Jovovich", "Brian Krause", "Lisa Pelikan", "Courtney Barilla"], "countries": ["USA"], "directors": ["William A. Graham"], "fullplot": "While the general theme of this film resembles \"The Blue Lagoon\" (the film for which this is a sequel), the basic plot is quite different. We open the film with a ship finding the craft with our original characters in it, Richard and Emmeline dead and Paddy alive. Established in the first film, the only word Paddy ever says is \"Richard\", so the crew assumes Richard is the infant's name. Taken in by Sarah, a widow with an infant baby girl Lilli, Richard (Paddy) is cared for in a return to civilization. Struck by cholera, the crew of the ship start to die and the captain sets Sarah, Richard, Lilli and a healthy crew member on a lifeboat in an attempt to preserve their lives. With water and food running short, the crew member escorting Sarah and the children becomes dangerous, so Sarah takes the only course of action she feels suitable to preserve the children: she strikes him and throws him overboard. Taking control of the small craft, she eventually guides them back to the island of the first film. The infant Richard, recognizing where he is, finds his home and is very upset not to find his parents. Fixing up the hut and settling in the children, Sarah begins their life on the island, slowly teaching the children survival tools, as well as schooling them as though they were in school, and teaching them slowly about the facts of life, including Lilli's eventual growth to womanhood. When Sarah dies from pneumonia, she leaves the children far more prepared than Richard and Emmeline in the first film. Years later as the children grow into adulthood, the film skims the same themes as the first of their developing relationship, and introduces the characters to civilization when a ship, low on fresh water, stops on their island and offers to take them home. After a confrontation with one of the crew and the captain's daughter, Lilli finds herself pregnant and they decide to stay, as they feel the civilization the visitors have to offer will not compare to the life they lead on the island.", "genres": ["Adventure", "Drama", "Romance"], "imdb": {"id": 102782, "rating": 5, "votes": 13046}, "languages": ["English"], "lastupdated": "2015-09-07 00:19:24.087000000", "num_mflix_comments": 1, "plot": "In this sequel to the 1980 classic, two children are stranded on a beautiful island in the South Pacific. With no adults to guide them, the two make a simple life together and eventually become tanned teenagers in love.", "poster": "https://m.media-amazon.com/images/M/MV5BMTM1Mzk1MTItZWE3OS00ODgwLTgxNjAtZTMwMmY1YmYzY2RmL2ltYWdlXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 681091200000, "runtime": 102, "title": "Return to the Blue Lagoon", "tomatoes": {"consensus": "Despite its lush tropical scenery and attractive leads, Return to the Blue Lagoon is as ridiculous as its predecessor, and lacks the prurience and unintentional laughs that might make it a guilty pleasure.", "critic": {"meter": 0, "numReviews": 30, "rating": 2.2}, "dvd": 1036454400000, "fresh": 0, "lastUpdated": 1441992078000, "production": "Sony Pictures Home Entertainment", "rotten": 30, "viewer": {"meter": 42, "numReviews": 15689, "rating": 2.8}}, "type": "movie", "writers": ["Henry De Vere Stacpoole (book)", "Leslie Stevens (screenplay)"], "year": 1991}