{"_id": "573a13d8f29313caabda5c08", "awards": {"nominations": 6, "text": "1 win & 6 nominations.", "wins": 1}, "cast": ["Ethan Hawke", "Lena Headey", "Max Burkholder", "Adelaide Kane"], "countries": ["USA", "France"], "directors": ["James DeMonaco"], "fullplot": "In an America wracked by crime and overcrowded prisons, the government has sanctioned an annual 12-hour period in which any and all criminal activity-including murder-becomes legal. The police can't be called. Hospitals suspend help. It's one night when the citizenry regulates itself without thought of punishment. On this night plagued by violence and an epidemic of crime, one family wrestles with the decision of who they will become when a stranger comes knocking. When an intruder breaks into James Sandin's (Ethan Hawke) gated community during the yearly lockdown, he begins a sequence of events that threatens to tear a family apart. Now, it is up to James, his wife, Mary (Lena Headey), and their kids to make it through the night without turning into the monsters from whom they hide.", "genres": ["Horror", "Sci-Fi", "Thriller"], "imdb": {"id": 2184339, "rating": 5.6, "votes": 118028}, "languages": ["English"], "lastupdated": "2015-09-12 00:20:47.107000000", "metacritic": 41, "num_mflix_comments": 1, "plot": "In the future, a wealthy family is held hostage for harboring the target of a murderous syndicate during the Purge, a 12-hour period in which any and all crime is legalized.", "poster": "https://m.media-amazon.com/images/M/MV5BMTQzNTcwODEyM15BMl5BanBnXkFtZTcwMjM1MDI0OQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1370563200000, "runtime": 85, "title": "The Purge", "tomatoes": {"boxOffice": "$64.4M", "consensus": "Half social allegory, half home-invasion thriller, The Purge attempts to make an intelligent point, but ultimately devolves into numbing violence and tired clichès.", "critic": {"meter": 38, "numReviews": 137, "rating": 5.1}, "dvd": 1381190400000, "fresh": 52, "lastUpdated": 1440525686000, "production": "Universal Pictures", "rotten": 85, "viewer": {"meter": 36, "numReviews": 94008, "rating": 2.9}, "website": "http://www.facebook.com/thepurgemovie"}, "type": "movie", "writers": ["James DeMonaco"], "year": 2013}