{"_id": "573a13b9f29313caabd4e581", "awards": {"nominations": 22, "text": "Nominated for 3 Golden Globes. Another 22 wins & 22 nominations.", "wins": 25}, "cast": ["Anna Paquin", "Chevez Ezaneh", "August Schellenberg", "Duane Howard"], "countries": ["USA"], "directors": ["Yves Simoneau"], "fullplot": "Beginning just after the bloody Sioux victory over General Custer at Little Big Horn, Bury My Heart at Wounded Knee intertwines the perspectives of three characters: Charles Eastman, nè Ohiyesa, a young, Dartmouth-educated, Sioux doctor held up as living proof of the alleged success of assimilation; Sitting Bull, the proud Lakota chief who refuses to submit to U.S. government policies designed to strip his people of their identity, their dignity and their sacred land - the gold-laden Black Hills of the Dakotas; and Senator Henry Dawes, who was one of the architects of the government policy on Indian affairs. While Eastman and patrician schoolteacher Elaine Goodale work to improve life for the Indians on the reservation, Senator Dawes lobbies President Grant for more humane treatment, opposing the bellicose stance of General William Tecumseh Sherman. Hope rises for the Indians in the form of the prophet Wovoka and the Ghost Dance - a messianic movement that promises an end of their suffering under the white man. This hope is obliterated after the assassination of Sitting Bull and the massacre of hundreds of Indian men, women and children by the 7th Cavalry at Wounded Knee Creek on Dec. 29, 1890.", "genres": ["Drama", "History", "Western"], "imdb": {"id": 821638, "rating": 7.2, "votes": 4227}, "languages": ["English"], "lastupdated": "2015-08-04 00:20:45.977000000", "num_mflix_comments": 2, "plot": "A chronicle of how American Indians were displaced as the U.S. expanded west. Based on the book by Dee Brown.", "poster": "https://m.media-amazon.com/images/M/MV5BMTI2MzEyNjk2NV5BMl5BanBnXkFtZTcwNDYyMDQ1MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "TV-14", "released": 1180224000000, "runtime": 133, "title": "Bury My Heart at Wounded Knee", "tomatoes": {"dvd": 1189468800000, "lastUpdated": 1439837302000, "production": "Home Box Office (HBO)", "viewer": {"meter": 78, "numReviews": 3718, "rating": 3.9}, "website": "http://www.hbo.com/films/burymyheart/"}, "type": "movie", "writers": ["Daniel Giat (screenplay)", "Dee Brown (based on the book by)"], "year": 2007}