{"_id": "573a1395f29313caabce2243", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Michèle Mercier", "Robert Hossein", "Jean Rochefort", "Claude Giraud"], "countries": ["France", "West Germany", "Italy"], "directors": ["Bernard Borderie"], "fullplot": "In this first part of the Angèlique cycle, set in Mid-17th century France under the young Sun King Louis XIV, still struggling for his throne, while beggars and brigands roam the country, Angèlique de Sancè de Monteloup, fifth child of an impoverished country nobleman in the Poitou marshlands, expected to struggle for a meager subsistence, educated in a nunnery, is betrothed at 17 to Joffrey de Peyrac, the 12 years older rich but cripple Comte de (count of) Peyrac de Morens and seigneur (Lord) of Toulouse, scarred in the face and said to be a sorcerer, in fact practicing oriental mining techniques which make his vast fortune. For the sake of her family, Angèlique reluctantly agrees to the match but refuses the advances of her husband, who does not enforce his conjugal rights, wishing only to win her heart. As Angelique gradually discovers virtuous Peyrac's remarkable talents as scientist, musician and philosopher, she falls passionately in love with him. Joffrey's unusual way of life is threatened by the ambitious Archbishop of Toulouse, and soon the jealous young king Louis XIV: Joffrey is arrested for 'sorcery'. Angèlique single-handedly faces the royal court, surviving murder and poison attempts on herself in a fruitless effort to save Joffrey from the stake. Intent on revenge and survival on her own, Angèlique desperately joins the dark Paris underworld, finding it now ruled by her youth friend, farmer's son Nicolas, whose true love she had forsaken for her arranged marriage.", "genres": ["Adventure", "History", "Romance"], "imdb": {"id": 57846, "rating": 6.9, "votes": 1686}, "languages": ["French"], "lastupdated": "2015-07-30 00:27:19.567000000", "plot": "In the first of the Angèlique series, the beautiful feisty teenage heroine becomes entangled in a political assassination plot and is betrothed to a stranger who is twelve years her senior and a reputed sorcerer.", "poster": "https://m.media-amazon.com/images/M/MV5BMTg0Mzg1NTY1M15BMl5BanBnXkFtZTcwNzQ3MzQyMQ@@._V1_SY1000_SX677_AL_.jpg", "released": -159840000000, "runtime": 115, "title": "Angèlique", "tomatoes": {"dvd": 1209427200000, "lastUpdated": 1439839376000, "viewer": {"meter": 70, "numReviews": 114, "rating": 3.8}}, "type": "movie", "writers": ["Anne Golon (novel)", "Serge Golon (novel)", "Claude Brulè", "Bernard Borderie", "Francis Cosne", "Daniel Boulanger (dialogue)"], "year": 1964}