{"_id": "573a1395f29313caabce2e5e", "awards": {"nominations": 0, "text": "2 wins.", "wins": 2}, "cast": ["Tatsuya Nakadai", "Mikijirè Hira", "Kyèko Kishida", "Miki Irie"], "countries": ["Japan"], "directors": ["Hiroshi Teshigahara"], "fullplot": "A businessman facially scarred in a laboratory fire receives psychotherapy from a psychiatrist, and obtains an amazingly lifelike mask from the doctor. Soon after being fitted for the mask, he seduces his wife and succeeds. But his wife claims she was aware all along who he was and believed that both were just masquerading together as most couples usually do in different ways. Strangely enough, his personality seemingly begins to change after he puts on the mask as if the mask has influenced his personality. His new identity does not enable him to reintegrate into society after all. A subplot is inserted in fragments. A good-natured young woman, the right side of whose face is disfigured, has been hurt by others' inquisitive eyes and insults, and has been shunned by men. She asks her older brother, the only man who understands her pain and solitude, to make love to her, hiding from him the intent of killing herself after then.", "genres": ["Drama", "Sci-Fi"], "imdb": {"id": 61065, "rating": 8, "votes": 3926}, "languages": ["Japanese"], "lastupdated": "2015-08-25 00:14:29.900000000", "num_mflix_comments": 4, "plot": "A businessman with a disfigured face obtains a lifelike mask from his doctor, but the mask starts altering his personality.", "poster": "https://m.media-amazon.com/images/M/MV5BYjNmMWM4MjMtNGQ1YS00MWRjLTg4ZDktZjRlYjM5N2IwMTU5XkEyXkFqcGdeQXVyNTc1OTc3ODE@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": -80956800000, "runtime": 124, "title": "The Face of Another", "tomatoes": {"critic": {"meter": 100, "numReviews": 7, "rating": 7.5}, "dvd": 1184025600000, "fresh": 7, "lastUpdated": 1441131272000, "production": "Toho Company Ltd.", "rotten": 0, "viewer": {"meter": 92, "numReviews": 1684, "rating": 4.1}}, "type": "movie", "writers": ["Kèbè Abe (screenplay)", "Kèbè Abe (novel)"], "year": 1966}