{"_id": "573a13abf29313caabd24c6d", "awards": {"nominations": 10, "text": "10 wins & 10 nominations.", "wins": 10}, "cast": ["Ajay Devgn", "Urmila Matondkar", "Nana Patekar", "Rekha"], "countries": ["India"], "directors": ["Ram Gopal Varma"], "fullplot": "Manjeet Khosla lives with her widowed mom in Bombay, India. She gets married, gives birth to a son, and separates from her spouse. She goes to live on the 12th floor of an apartment building. Thereafter, she has an affair with Sanjay Thakkar, who is the son of the building Secretary. Shortly thereafter, she and her son fall down from their balcony and die. The building watchman testifies that Manjeet was depressed and suicidal. The apartment remains vacant for sometime, and then eventually new tenants, Vishal and his wife, Swati, move in. Vishal finds out about Manjeet's untimely death but keeps this information from Swati. When Swati finds out she is displeased with Vishal, but her anger dissolves quickly. Then Swati starts sleep-walking, leading Vishal to have her medically examined. After she recovers, she claims to see Manjeet in her apartment, as well as behaves strangely. Then the building watchman gets killed by having his neck and head turned backwards. Police Inspector Liyaqat Quereshi is assigned this case and initially questions Thakkar and Vishal. He keeps vigil on the apartment and finds out about Swati's sleep-walking habits and starts to suspect her. He also finds out that Swati is suffering from multiple personality disorder. Then Vishal asks Sarita, a psychic, for help - to which she agrees - and it is through her assistance that Vishal will find out that Manjeet did not kill herself, but she and her young son were killed and then thrown from the 12th floor of the building. The question remains: Who killed Manjeet, and what is the dead woman's connection with Swati and her ailments.", "genres": ["Horror", "Thriller"], "imdb": {"id": 341266, "rating": 6.4, "votes": 2118}, "languages": ["Hindi"], "lastupdated": "2015-08-10 00:30:16.267000000", "num_mflix_comments": 3, "plot": "Manjeet Khosla lives with her widowed mom in Bombay, India. She gets married, gives birth to a son, and separates from her spouse. She goes to live on the 12th floor of an apartment ...", "poster": "https://m.media-amazon.com/images/M/MV5BNWU3MDY0OTUtNGY3Mi00MDI0LWE2MGItYWQ2ZWQ1YTkzZTc3XkEyXkFqcGdeQXVyNjQ2MjQ5NzM@._V1_SY1000_SX677_AL_.jpg", "released": 1054252800000, "runtime": 113, "title": "Bhoot", "tomatoes": {"critic": {"meter": 60, "numReviews": 5, "rating": 5.2}, "dvd": 1057536000000, "fresh": 3, "lastUpdated": 1440271468000, "production": "Varma Corporation Limited [in]", "rotten": 2, "viewer": {"meter": 46, "numReviews": 561, "rating": 3.3}}, "type": "movie", "writers": ["Lalit Marathe", "Sameer Sharma"], "year": 2003}