{"_id": "573a1398f29313caabce8d86", "awards": {"nominations": 1, "text": "Nominated for 1 Golden Globe. Another 2 wins & 1 nomination.", "wins": 3}, "cast": ["Mariel Hemingway", "Eric Roberts", "Cliff Robertson", "Carroll Baker"], "countries": ["USA"], "directors": ["Bob Fosse"], "fullplot": "Paul Snider is a narcissistic, small time hustler who fancies himself a ladies man. His life changes when he meets Dorothy Stratten working behind the counter of a Dairy Queen. Dorothy is a pretty but naive high school senior. Paul immediately falls for Dorothy, who sees in Paul a wise, worldly person unlike herself. Paul believes Dorothy is Playboy material, the magazine he sees as only a springboard to bigger and better things. Paul's dream does become a reality: not only does Dorothy eventually marry him, she becomes the August 1979 Playboy Playmate and ultimately Playboy Playmate of 1979, which does indeed lead to the start of an acting career. As Dorothy's star rises, Paul's life is one of a hanger-on as those in Dorothy's new circle, including Playboy publisher Hugh M. Hefner and movie director Aram Nicholas, don't much like Paul. Paul is unable to eke out a life of his own without using Dorothy's name, which she increasingly is reluctant to provide to her husband. Those that know the couple know their relationship cannot continue as is, and it's only a matter of how it will change or end is the question.", "genres": ["Biography", "Drama"], "imdb": {"id": 86355, "rating": 6.6, "votes": 4093}, "languages": ["English"], "lastupdated": "2015-09-06 00:40:28.947000000", "num_mflix_comments": 1, "plot": "A successful young model finds trouble when her obsessive manager-turned-husband becomes dangerously jealous. Based on the true story of 1980 Playmate of the Year Dorothy Stratten.", "poster": "https://m.media-amazon.com/images/M/MV5BYWYzNTM0ZDktNzc3YS00NjA2LTk0OWMtMGM1YWQ1YWJjMzZiL2ltYWdlXkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 437270400000, "runtime": 103, "title": "Star 80", "type": "movie", "writers": ["Teresa Carpenter (article)", "Bob Fosse"], "year": 1983}