{"_id": "573a13aaf29313caabd216b7", "awards": {"nominations": 87, "text": "Won 2 Oscars. Another 75 wins & 87 nominations.", "wins": 77}, "cast": ["Sean Penn", "Tim Robbins", "Kevin Bacon", "Laurence Fishburne"], "countries": ["USA", "Australia"], "directors": ["Clint Eastwood"], "fullplot": "In the summer of 1975 in a neighborhood in Boston, 3 kids, Dave Boyle and two of his friends, Jimmy and Sean, are playing on the sidewalk when Dave gets abducted by two men and endures several days of sexual abuse. Eventually, Dave escapes traumatized throughout adulthood. Jimmy is an ex-con and a father of three, whose daughter Katie, is found dead and Dave becomes the number one suspect. Sean is a homicide detective, investigating Katie's murder, ends up finding himself faced with past and present demons as more is uncovered about Katie's murder. Learning Katie had a boyfriend, ballistics later turn up a gun belonging to the father, which then puts her boyfriend as the suspect. Will Sean find out who killed Katie? Will Jimmy make it through the investigation? And will Dave ever find out what really happened when he was abducted?", "genres": ["Crime", "Drama", "Mystery"], "imdb": {"id": 327056, "rating": 8, "votes": 316337}, "languages": ["English"], "lastupdated": "2015-09-04 00:01:25.617000000", "metacritic": 84, "plot": "With a childhood tragedy that overshadowed their lives, three men are reunited by circumstance when one has a family tragedy.", "poster": "https://m.media-amazon.com/images/M/MV5BMTIzNDUyMjA4MV5BMl5BanBnXkFtZTYwNDc4ODM3._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1066176000000, "runtime": 138, "title": "Mystic River", "tomatoes": {"boxOffice": "$90.1M", "consensus": "Anchored by the exceptional acting of its strong cast, Mystic River is a somber drama that unfolds in layers and conveys the tragedy of its story with visceral power.", "critic": {"meter": 87, "numReviews": 194, "rating": 7.7}, "dvd": 1086652800000, "fresh": 169, "lastUpdated": 1442077558000, "production": "WB", "rotten": 25, "viewer": {"meter": 89, "numReviews": 201497, "rating": 3.7}, "website": "http://mysticrivermovie.warnerbros.com/"}, "type": "movie", "writers": ["Brian Helgeland (screenplay)", "Dennis Lehane (novel)"], "year": 2003}