{"_id": "573a1392f29313caabcda6f7", "awards": {"nominations": 0, "text": "Nominated for 2 Oscars. Another 2 wins.", "wins": 4}, "cast": ["Katharine Hepburn", "Fred MacMurray", "Fred Stone", "Evelyn Venable"], "countries": ["USA"], "directors": ["George Stevens"], "fullplot": "In the small town of South Renford, Alice Adams comes from a working class background, although she aspires to be among the upper class. Alice's mother blames Alice's father for their low social standing, despite he working hard and Alice not blaming him for anything. Regardless, Alice tries to do whatever necessary to put on appearances of wealth and social standing despite everyone in that class in town knowing who she is, and thus largely ignoring her because of her false airs. First meeting at a society ball, Alice surprisingly catches the eye of Arthur Russell, surprisingly as he purportedly is engaged to dèbutante Mildred Palmer. As Alice continues to hide her true social standing from Arthur as he courts her, Mrs. Adams pressures Mr. Adams into doing something he doesn't want to do in an effort truly to become part of the business class, that measure which entails sinking all his money into a business venture. Beyond the time when Arthur finds out the true nature behind Alice's facade, other issues may bring the fragile Adams society house of cards tumbling down around them, and thus the happiness Alice is seeking with Arthur.", "genres": ["Comedy", "Drama", "Romance"], "imdb": {"id": 26056, "rating": 7.1, "votes": 2559}, "languages": ["English"], "lastupdated": "2015-09-05 00:25:24.923000000", "plot": "The misadventures of two social-climbing women in small town America.", "poster": "https://m.media-amazon.com/images/M/MV5BYTJkYmJmOTMtMjJmZi00OGE4LTgwNzYtY2Q4MzU1NjYxN2M0XkEyXkFqcGdeQXVyNjc0MzMzNjA@._V1_SY1000_SX677_AL_.jpg", "rated": "APPROVED", "released": -1077235200000, "runtime": 99, "title": "Alice Adams", "tomatoes": {"critic": {"meter": 93, "numReviews": 15, "rating": 7.8}, "dvd": 1041897600000, "fresh": 14, "lastUpdated": 1438455812000, "production": "Turner Home Entertainment", "rotten": 1, "viewer": {"meter": 71, "numReviews": 2370, "rating": 3.5}}, "type": "movie", "writers": ["Booth Tarkington (novel)", "Dorothy Yost (screen play)", "Mortimer Offner (screen play)", "Jane Murfin (screen play)"], "year": 1935}