{"_id": "573a13a3f29313caabd0e32a", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Lysa Apostle", "Joanne Baron", "Morena Baccarin", "Kylie Bax"], "countries": ["USA"], "directors": ["Michael Rymer"], "fullplot": "'Perfume' chronicles one week in the lives of over a dozen people involved in the magazine and entertainment business of New York City. The central characters include Italian designer Lorenzo Mancini who learns that he's dying from cancer and decides to get his affairs in order with his wife Irine and his business partner Guido. Lorenzo's son Mario is a recording promoter who's latest client is hip-hop rapper J.B.. Roberta is a designer hard-pressed to fill out a latest dress design for the next Broadway show her group is putting on. Other characters are Jamie, a crafty agent whose latest client, Camille finds success but affects their relationship in ways he never planned and fails to deal with. Leese Hotton is a has-been model/actress trying to make a comeback into the spotlight; Janice Crawford is a wealthy publisher and control freak whose problems escalate with the arrival of her estranged teenage daughter Halley whom Janice abandoned her and everything else for her career years ago.", "genres": ["Drama"], "imdb": {"id": 245356, "rating": 3.6, "votes": 739}, "languages": ["English"], "lastupdated": "2015-09-07 00:21:54.817000000", "plot": "A week in the lives of a group of models, photographers, agents, reporters, publicists and other characters during a wild modeling show in New York City.", "poster": "https://m.media-amazon.com/images/M/MV5BMTM1Mjc1NTUwNl5BMl5BanBnXkFtZTcwNTQwMzcyMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 980467200000, "runtime": 106, "title": "Perfume", "tomatoes": {"critic": {"meter": 11, "numReviews": 9, "rating": 4.8}, "dvd": 1019520000000, "fresh": 1, "lastUpdated": 1440443646000, "production": "LionsGate Entertainment", "rotten": 8, "viewer": {"meter": 51, "numReviews": 1483, "rating": 3}}, "type": "movie", "writers": ["Michael Rymer", "L.M. Kit Carson"], "year": 2001}