{"_id": "573a1398f29313caabceadac", "awards": {"nominations": 2, "text": "1 win & 2 nominations.", "wins": 1}, "cast": ["Carlo Verdone", "Christian De Sica", "Nancy Brilli", "Eleonora Giorgi"], "countries": ["Italy"], "directors": ["Carlo Verdone"], "fullplot": "Federica, mantenuta di lusso, riunisce nella sua villa al mare, dopo quindici anni dalla licenza liceale, un folto gruppo di ex-compagni di scuola: Maria Rita, single e psicologa; Gloria, ragazza madre; Valeria, giornalista ; Gioia, sterile e un po' fuori di testa; Jolanda, petulante zitella; Margherita, insoddisfatta moglie di un gelosissimo carabiniere; Francesco, imbellito ma insoddisfatto; Fabris, il bello della classe, peggiorato fisicamente e persino calvo; Luca, ex-marito di Valeria, vignettista satirico; Bruno, cantante fallito; Attemi, videomane; Armando, eterno bambinone; Gino, magistrato finto paralitico; Mauro, squallido politicante; Ottavio, insopportabile sapientone; Finocchiaro, burino macellaio; Piero \"il Patata\", estroverso professore di liceo, afflitto da una moglie volgare ed ingenuamente innamorato della sua allieva Cristina. Dal pomeriggio all'alba successiva, l'incontro rivela le illusioni, le nevrosi ed i fallimenti di una generazione piena di problemi. Alla fine tutti ripartono ; anche Federica, che è stata mollata dall'amante, deve lasciare la villa. Decidono sconsolatamente che, probabilmente, non si rivedranno piè.", "genres": ["Comedy", "Drama", "Romance"], "imdb": {"id": 94901, "rating": 7.2, "votes": 1106}, "languages": ["Italian"], "lastupdated": "2015-06-27 00:15:05.310000000", "plot": "Former high school friends meet for a party after 15 years, only to discover that much of the innocence and friendship is gone.", "released": 598665600000, "runtime": 115, "title": "Compagni di scuola", "tomatoes": {"lastUpdated": 1437070868000, "viewer": {"numReviews": 1, "rating": 4}}, "type": "movie", "writers": ["Carlo Verdone (story)", "Rossella Contessi (story)", "Leonardo Benvenuti (story)", "Piero De Bernardi (story)", "Carlo Verdone", "Leonardo Benvenuti", "Piero De Bernardi"], "year": 1988}