{"_id": "573a13a9f29313caabd2095f", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Mia Farrow", "Julia Whelan", "Cliff De Young", "Andrew McCarthy"], "countries": ["USA"], "directors": ["Robert Mandel"], "fullplot": "Marcia Carter thought her daughter was perfect mainly because she brought home good grades, and occasionally does volunteer work. What Marcia doesn't know, is that Zoey has been taking large amounts of her mothers medicine. Her mother then gets suspicious after Zoey passes out in the car, and after she fails a simple test. Marcia searches Zoey's backpack, and finds massive amounts of pills. She consults the local pharmacy about the pills, and the pharmacy indicates that the pills can be very lethal if mixed together. Marcia is then devastated, so she send Zoey to a rehab center. Zoey tells her parents that she is okay, but she really isn't. Zoey begins to take the drugs again, and as the story progresses, Zoey gets sicker, and sicker each day until she collapses right in front of her mother. Zoey is rushed to the hospital, and then thrown into another rehab center, this time, she cant get out unless she gets better. While in rehab, Zoey befriends another woman who has taken drugs. The woman eventually leaves, and Zoey is left alone. Her eyes are then opened up by a rather unfortunate occurrence...", "genres": ["Drama"], "imdb": {"id": 323495, "rating": 5.6, "votes": 294}, "languages": ["English"], "lastupdated": "2015-07-19 00:58:38.853000000", "plot": "The Secret Life of Zoey depicts the events that took place in Zoey Carter's life...", "poster": "https://m.media-amazon.com/images/M/MV5BODIyMjY3ODkxNV5BMl5BanBnXkFtZTgwNjQ3OTk1MDE@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1029715200000, "runtime": 92, "title": "The Secret Life of Zoey", "tomatoes": {"lastUpdated": 1441991021000, "production": "Viacom Productions", "viewer": {"meter": 29, "numReviews": 281, "rating": 3.4}}, "type": "movie", "writers": ["Betty Goldberg"], "year": 2002}