{"_id": "573a1391f29313caabcd96ac", "awards": {"nominations": 0, "text": "Nominated for 2 Oscars. Another 1 win.", "wins": 3}, "cast": ["Alfred Lunt", "Lynn Fontanne", "Roland Young", "Zasu Pitts"], "countries": ["USA"], "directors": ["Sidney Franklin"], "fullplot": "A Vienna based acting couple make magic when they perform together on stage. Unknown to the theater going public and despite being married for only six months, that magic seems no longer to translate to their personal life, where they are constantly arguing, even under their breaths during on-stage curtain calls. These arguments stem from the actress' moody behavior, which the actor believes means that she no longer loves him and that she is looking for another man to replace him in her personal life. He believes she even scans the audience for potential suitors, probably being most attracted to the soldier type. Their feuding is at a point where they take pot shots at each other about everything in their lives, even the quality of the other's acting. The actor may have a valid point as the actress has been receiving bouquets of roses of late and a Russian guardsman has been seen hanging around outside their home. The actor knows these things as he is that Russian guardsman (who is also a Russian prince) in disguise, he who is also sending the flowers as the guardsman. He wants to see if this guardsman can indeed woo his wife away from him, and thus show her for who she really is. He concocts a further scheme to pretend to be out of town for a 24 hour period on another acting engagement, during which time he will try and seduce her as the guardsman. But the actress may throw some wrenches into his plan.", "genres": ["Comedy", "Drama"], "imdb": {"id": 21931, "rating": 6.7, "votes": 334}, "languages": ["English"], "lastupdated": "2015-08-21 01:03:33.500000000", "plot": "A Vienna based acting couple make magic when they perform together on stage. Unknown to the theater going public and despite being married for only six months, that magic seems no longer to...", "poster": "https://m.media-amazon.com/images/M/MV5BMTU3NjMwMzgwNl5BMl5BanBnXkFtZTcwODk5NzAyMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PASSED", "released": -1203984000000, "runtime": 82, "title": "The Guardsman", "tomatoes": {"dvd": 722044800000, "lastUpdated": 1434393943000, "viewer": {"meter": 54, "numReviews": 93, "rating": 3.2}}, "type": "movie", "writers": ["Ferenc Molnèr (from the play by)", "Ernest Vajda (screen play)", "Claudine West (continuity)"], "year": 1931}