{"_id": "573a13baf29313caabd51370", "awards": {"nominations": 11, "text": "39 wins & 11 nominations.", "wins": 39}, "cast": ["Wagner Moura", "Andrè Ramiro", "Caio Junqueira", "Milhem Cortaz"], "countries": ["Brazil"], "directors": ["Josè Padilha"], "fullplot": "In 1997, before the visit of the pope to Rio de Janeiro, Captain Nascimento from BOPE (Special Police Operation Battalion) is assigned to eliminate the risks of the drug dealers in a dangerous slum nearby where the pope intends to be lodged. Captain Nascimento is trying to find a man to replace him because his wife is pregnant and he intends to quit the command and become a trainer of the new recruits. Meanwhile, the two idealistic friends Neto and Matias join the Military Police force expecting to become honest policemen and fight the criminals. However, they see only corruption, lack of competence and stupid bureaucracy in the Military Police, and after a serious incident in the Morro da Babilènia, they decide to join the BOPE. The lives of Capitain Nascimento, Neto and Matias are entwined along the next months, first in the tough training period and then in action against drug dealers. Nascimento believes that Neto could be his substitute, but his impulsive attitudes jeopardizes his choice. Later, the intelligent Matias seems to be the correct choice, but he needs to prove that he has heart.", "genres": ["Action", "Crime", "Drama"], "imdb": {"id": 861739, "rating": 8.1, "votes": 74302}, "languages": ["Portuguese"], "lastupdated": "2015-09-11 00:44:58.417000000", "metacritic": 33, "num_mflix_comments": 2, "plot": "1997, Captain Nascimento has to find a substitute for his occupation while trying to take down drug dealers and criminals before the Pope comes to Rio de Janeiro, Brazil.", "poster": "https://m.media-amazon.com/images/M/MV5BMGJjN2M1ZGMtNjg3ZC00MTA1LWEyZDItMjIzZTRlYzgzODRkXkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1192147200000, "runtime": 115, "title": "Elite Squad", "tomatoes": {"consensus": "Brutal, action heavy, Brazilian cop film with a pointless voiceover. Lacks flair, overdoes the violence and is never quite sure where its morals lie.", "critic": {"meter": 53, "numReviews": 34, "rating": 5.1}, "dvd": 1225152000000, "fresh": 18, "lastUpdated": 1439922412000, "production": "IFC Films", "rotten": 16, "viewer": {"meter": 87, "numReviews": 16434, "rating": 4.1}, "website": "http://www.tropadeeliteofilme.com.br"}, "type": "movie", "writers": ["Andrè Batista (book)", "John Kaylin (adaptation)", "Brèulio Mantovani", "Josè Padilha", "Rodrigo Pimentel (book)", "Rodrigo Pimentel", "Luiz Eduardo Soares (book)"], "year": 2007}