{"_id": "573a1394f29313caabcdf1c2", "awards": {"nominations": 8, "text": "Won 1 Oscar. Another 2 wins & 8 nominations.", "wins": 3}, "cast": ["Marlon Brando", "Jean Peters", "Anthony Quinn", "Joseph Wiseman"], "countries": ["USA"], "directors": ["Elia Kazan"], "fullplot": "In 1909, Emiliano Zapata, a well-born but penniless Mexican Mestizo from the southern state of Morelos, comes to Mexico City to complain that their arable land has been enclosed, leaving them only in the barren hills. His expressed dissatisfaction with the response of the President Diaz puts him in danger, and when he rashly rescues a prisoner from the local militia he becomes an outlaw. Urged on by a strolling intellectual, Fernando, he supports the exiled Don Francisco Madero against Diaz, and becomes the leader of his forces in the South as Francisco 'Pancho' Villa is in the North. Diaz flees, and Madero takes his place; but he is a puppet president, in the hands of the leader of the army, Huerta, who has him assassinated when he tries to express solidarity for the men who fought for him. Zapata and Villa return to arms, and, successful in victory, seek to find a leader for the country. Unwillingly, Zapata takes the job, but, a while later, he responds to some petitioners from his own village with no more reassurance than had Diaz years before. Realizing that with power his idealism has gone, he returns with them to Morelos - specifically to investigate their complaints against his brother Eufemio. New leaders take his place, and, egged on by the always surviving Fernando, they decide that Zapata is a threat to their regime.", "genres": ["Biography", "Drama", "History"], "imdb": {"id": 45296, "rating": 7.5, "votes": 6860}, "languages": ["English", "Spanish"], "lastupdated": "2015-08-24 00:44:46.167000000", "plot": "The story of Mexican revolutionary Emiliano Zapata, who led a rebellion against the corrupt, oppressive dictatorship of president Porfirio Diaz in the early 20th century.", "poster": "https://m.media-amazon.com/images/M/MV5BZjU5ZDIwNDQtYWVhOC00ZmFmLWIyYmItMTQ1ZjljYzNhYmRlXkEyXkFqcGdeQXVyNjUwNzk3NDc@._V1_SY1000_SX677_AL_.jpg", "released": -547862400000, "runtime": 113, "title": "Viva Zapata!", "tomatoes": {"critic": {"meter": 65, "numReviews": 17, "rating": 6.3}, "dvd": 1063065600000, "fresh": 11, "lastUpdated": 1440008873000, "production": "Fox", "rotten": 6, "viewer": {"meter": 78, "numReviews": 2753, "rating": 3.7}}, "type": "movie", "writers": ["John Steinbeck"], "year": 1952}