{"_id": "573a13c4f29313caabd6c34f", "awards": {"nominations": 21, "text": "Won 1 Oscar. Another 11 wins & 21 nominations.", "wins": 12}, "cast": ["Mikael Persbrandt", "Wil Johnson", "Eddy Kimani", "Emily Mulaya"], "countries": ["Denmark", "Sweden"], "directors": ["Susanne Bier"], "fullplot": "Anton is a doctor who commutes between his home in an idyllic town in Denmark, and his work at an African refugee camp. In these two very different worlds, he and his family are faced with conflicts that lead them to difficult choices between revenge and forgiveness. Anton and his wife Marianne, who have two young sons, are separated and struggling with the possibility of divorce. Their older, ten-year-old son Elias is being bullied at school, until he is defended by Christian, a new boy who has just moved from London with his father, Claus. Christian's mother recently lost her battle with cancer, and Christian is greatly troubled by her death. Elias and Christian quickly form a strong bond, but when Christian involves Elias in a dangerous act of revenge with potentially tragic consequences, their friendship is tested and lives are put in danger. Ultimately, it is their parents who are left to help them come to terms with the complexity of human emotions, pain and empathy.", "genres": ["Drama"], "imdb": {"id": 1340107, "rating": 7.7, "votes": 30712}, "languages": ["Danish", "Swedish", "English", "Arabic"], "lastupdated": "2015-09-07 00:41:20.240000000", "metacritic": 65, "plot": "The lives of two Danish families cross each other, and an extraordinary but risky friendship comes into bud. But loneliness, frailty and sorrow lie in wait.", "poster": "https://m.media-amazon.com/images/M/MV5BNDY2OTE5MzE0Nl5BMl5BanBnXkFtZTcwNDAyOTc2NA@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1282780800000, "runtime": 119, "title": "In a Better World", "tomatoes": {"boxOffice": "$1.0M", "consensus": "In a Better World is a sumptuous melodrama that tackles some rather difficult existential and human themes.", "critic": {"meter": 77, "numReviews": 115, "rating": 7.1}, "dvd": 1314662400000, "fresh": 89, "lastUpdated": 1440266914000, "production": "Sony Pictures Classics", "rotten": 26, "viewer": {"meter": 86, "numReviews": 6994, "rating": 3.9}, "website": "http://www.sonyclassics.com/inabetterworld"}, "type": "movie", "writers": ["Anders Thomas Jensen (screenplay)", "Susanne Bier (story)", "Anders Thomas Jensen (story)", "Per Nielsen (supervising writer)"], "year": 2010}