{"_id": "573a13bef29313caabd5cd38", "awards": {"nominations": 12, "text": "2 wins & 12 nominations.", "wins": 2}, "cast": ["Johnny Depp", "Michelle Pfeiffer", "Helena Bonham Carter", "Eva Green"], "countries": ["USA", "Australia"], "directors": ["Tim Burton"], "fullplot": "In the year 1752, Joshua and Naomi Collins, with young son Barnabas, set sail from Liverpool, England to start a new life in America. But even an ocean was not enough to escape the mysterious curse that has plagued their family. Two decades pass and Barnabas (Johnny Depp) has the world at his feet-or at least the town of Collinsport, Maine. The master of Collinwood Manor, Barnabas is rich, powerful and an inveterate playboy...until he makes the grave mistake of breaking the heart of Angelique Bouchard (Eva Green). A witch, in every sense of the word, Angelique dooms him to a fate worse than death: turning him into a vampire, and then burying him alive. Two centuries later, Barnabas is inadvertently freed from his tomb and emerges into the very changed world of 1972. He returns to Collinwood Manor to find that his once-grand estate has fallen into ruin. The dysfunctional remnants of the Collins family have fared little better, each harboring their own dark secrets. Matriarch Elizabeth Collins Stoddard (Michelle Pfeiffer) has called upon live-in psychiatrist, Dr. Julia Hoffman (Helena Bonham Carter), to help with her family troubles.", "genres": ["Comedy", "Horror"], "imdb": {"id": 1077368, "rating": 6.2, "votes": 182907}, "languages": ["English"], "lastupdated": "2015-09-11 00:40:24.370000000", "metacritic": 55, "num_mflix_comments": 2, "plot": "An imprisoned vampire, Barnabas Collins, is set free and returns to his ancestral home, where his dysfunctional descendants are in need of his protection.", "poster": "https://m.media-amazon.com/images/M/MV5BMjc0NzAyMzI1MF5BMl5BanBnXkFtZTcwMTE0NDQ1Nw@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1336694400000, "runtime": 113, "title": "Dark Shadows", "tomatoes": {"boxOffice": "$79.7M", "consensus": "The visuals are top notch but Tim Burton never finds a consistent rhythm, mixing campy jokes and gothic spookiness with less success than other Johnny Depp collaborations.", "critic": {"meter": 37, "numReviews": 231, "rating": 5.3}, "dvd": 1349136000000, "fresh": 86, "lastUpdated": 1442168012000, "production": "Warner Bros. Pictures", "rotten": 145, "viewer": {"meter": 46, "numReviews": 256187, "rating": 3.2}, "website": "http://darkshadowsmovie.warnerbros.com/"}, "type": "movie", "writers": ["Seth Grahame-Smith (screenplay)", "John August (story)", "Seth Grahame-Smith (story)", "Dan Curtis (television series)"], "year": 2012}