{"_id": "573a13b4f29313caabd40e6c", "awards": {"nominations": 7, "text": "1 win & 7 nominations.", "wins": 1}, "cast": ["Shah Rukh Khan", "Priyanka Chopra", "Arjun Rampal", "Isha Koppikar"], "countries": ["India"], "directors": ["Farhan Akhtar"], "fullplot": "In 2006, the drug trade is booming; trafficking between Asian and Europe is at an all time high. It is at this time that the Malaysian intelligence and Anti-Narcotic department are called upon for assistance by their Indian counterparts. There are rumors that the gang recently moved their operational headquarters. The cartel is headed by the dreaded Singhania, but what many people do not know is that the business is truly managed by his lieutenant, Don. A man who lives life on the edge, Don is constantly expanding the size of his empire while evading arrest or death at the hands of his enemies, both within and outside the law. He is unstoppable in his pursuit of absolute power. His chief pursuer is an Indian police officer, Desilva. He is a man who has sworn to put an end to this nexus of evil and knows that in capturing Don lies the key to unlock this puzzle. And one day he succeeds. Don is captured and Desilva puts his plan into action. Unknown to even his own department, Pesilva has recruited and trained a man who is a spitting image of Don. His name is Vijay. Vijay infiltrates the cartel and manages to give Desilva all the information he needs to bring it down. But in a bizarre twist of fate, Desilva is killed during a raid and the secret that Don is in fact Vijay, a police informer, is buried within him. The only people who realize that he is in fact an imposter are the members of Don's cartel, and they want their revenge. Vijay manages to escape and is now on the lookout for the one last piece of evidence that can get him out of this mess. Helping him on the quest are two people. The first is a Roma, a young woman who was working in the gang, but only to avenge her brother's death. He had been mercilessly killed by Don when he had decided join the gang. The other is Jasjit, the real father of Vijay's adopted son, Deepu. He owes Vijay for having looked after the boy while he was in prison. Wanted by the police, hunted day and night, forever on the run. The chase has begun.", "genres": ["Action", "Crime", "Thriller"], "imdb": {"id": 461936, "rating": 7.2, "votes": 20851}, "languages": ["Hindi"], "lastupdated": "2015-08-18 00:42:44.063000000", "num_mflix_comments": 1, "plot": "A simple man (Vijay) from the city of mumbai is recruited by a police officer to masquerade as the Don, the leader of an international gang of smugglers. But things go wrong, the officer is killed and now vijay is on his own, with only his lover (Roma) and a lame ex con artist to help him to prove his innocence.", "poster": "https://m.media-amazon.com/images/M/MV5BMzAyMWE0MjgtMDVjNS00ZDMyLWE4NjQtNWU2ZDgyYTlmMjdjXkEyXkFqcGdeQXVyNjQ2MjQ5NzM@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 1161302400000, "runtime": 171, "title": "Don", "tomatoes": {"boxOffice": "$2.2M", "dvd": 1165881600000, "lastUpdated": 1442250369000, "production": "UTV Communications", "viewer": {"meter": 79, "numReviews": 14072, "rating": 3.9}, "website": "http://www.donthefilm.com/"}, "type": "movie", "writers": ["Salim Khan (based on an original screenplay by)", "Javed Akhtar (based on an original screenplay by)", "Farhan Akhtar"], "year": 2006}