{"_id": "573a13b4f29313caabd3fa2e", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Tusshar Kapoor", "Riteish Deshmukh", "Isha Koppikar", "Neha Dhupia"], "countries": ["India"], "directors": ["Sangeeth Sivan"], "fullplot": "Karan Pandey and Rahul are two friends who work in a fashion designers office, and live in a rented apartment. When they are unable to pay the rent, they are dramatically evicted, but sneak their way back in within hours as the building is being renovated. Karan meets a beautiful woman, Kiran, and falls in love with her. He finds out that she is the girlfriend of his boss, D.K. Bose, lives in a bungalow in Malabar Hill, and owns a Mercedes. When Bose leaves for a business trip to America, Karan and Rahul move into his apartment and through his telephone Karan touches base with Kiran and begins his romance with her. In the meantime, Rahul is told by a street astrologer that he will find his soul-mate in a girl who has a birthmark on her right breast. Rahul does not find one but several women with a mark on their breast, and does recover from several embarrassing incidents. Then beautiful Urmila Martodkar walks into his life, birthmark and all. It looks like Karan and Rahul may have finally found their soul-mates - but what Karan does not know is that Kiran is not a girl, but is a gay boy; and what Rahul does not know is that gorgeous Urmila is a Sub-Inspector of Police who suspects Rahul of being a serial killer who has killed several women in Khar, Kalbadevi, Kanjurmarg, Kalyan, and several other places that start with \"K\". Watch what happens when the two realize that their lovers are not what they seem, and how they attempt to get out of the mess that they have created for themselves.", "genres": ["Comedy", "Mystery"], "imdb": {"id": 456500, "rating": 6.3, "votes": 1816}, "languages": ["Hindi"], "lastupdated": "2015-08-12 00:00:33.423000000", "plot": "Karan Pandey and Rahul are two friends who work in a fashion designers office, and live in a rented apartment. When they are unable to pay the rent, they are dramatically evicted, but sneak...", "poster": "https://m.media-amazon.com/images/M/MV5BMjA4MzM3ODE5MF5BMl5BanBnXkFtZTgwMzI1MDA2MDE@._V1_SY1000_SX677_AL_.jpg", "released": 1115337600000, "runtime": 172, "title": "Kyaa Kool Hai Hum", "tomatoes": {"lastUpdated": 1417953213000, "viewer": {"meter": 100, "numReviews": 83, "rating": 3.4}}, "type": "movie", "writers": ["Sachin Yardi (story)", "Pankaj Trivedi (story)"], "year": 2005}