{"_id": "573a13c5f29313caabd6ec3a", "awards": {"nominations": 2, "text": "2 nominations.", "wins": 0}, "cast": ["Cristin Milioti", "Mark Rendall", "Ali Liebert", "Kevin McDonald"], "countries": ["Canada"], "directors": ["Sook-Yin Lee"], "fullplot": "Twenty-one year old Sammy Smalls has self-esteem issues. She hides behind her frumpy clothes and the slight limp she sustained from a childhood illness. She works in a dead end job as an undercover shoplifter detector at a Big Apple Food Town, her boss Dirk who has his own brand of vigilante justice for the shoplifters. And she considers her parents, although loving in their own unique way, not good role models for her. She doesn't like people touching her in an emotional manner, the ticklish feeling she gets from such being yet another thing behind which she hides. As a result, she is sexually inexperienced. However, she does have a crush on Eugene Zaslavsky, a busker musician who performs outside her supermarket. Each considers the other a friend, but their attempt to take the friendship into a sexual realm results in utter disaster. Although they vow to remain friends, Eugene won't sleep with her again due to her sexual inexperience. So Sammy goes on an expedition for advice and sexual experience from whomever and where ever she can find it, except from Eugene. Eugene, not fully realizing it, also has self-image issues with which he must comes to terms before he can be a true friend and possibly more to Sammy.", "genres": ["Comedy", "Drama"], "imdb": {"id": 1372306, "rating": 5.8, "votes": 460}, "languages": ["English", "French"], "lastupdated": "2015-08-05 00:58:35.350000000", "num_mflix_comments": 2, "plot": "A romantic comedy about a girl with an unrequited crush on a boy who thinks she's bad in bed, so she goes out to get more \"experience\".", "released": 1252540800000, "runtime": 88, "title": "Year of the Carnivore", "tomatoes": {"dvd": 1243900800000, "lastUpdated": 1438971953000, "viewer": {"meter": 59, "numReviews": 190, "rating": 3.4}}, "type": "movie", "writers": ["Ken Chubb (story)", "Sook-Yin Lee (screenwriter)"], "year": 2009}