{"_id": "573a13d3f29313caabd9668d", "awards": {"nominations": 1, "text": "4 wins & 1 nomination.", "wins": 4}, "cast": ["Asrani", "Avtar Gill", "Gurpreet Guggi", "Greg Heffernan"], "countries": ["India"], "directors": ["Shirish Kunder"], "fullplot": "In 1947 when the maps of India and Pakistan were being drawn, an oversight ensured that the village of Paglapur didn't find a place in either country. The village had the distinction of housing the largest mental asylum in the region and in the mèlèe that ensued during partition, the asylum inmates broke loose, drove away the villagers and established their own republic in Paglapur. And that's how it stayed for the next 60 years! While the world outside changed, Paglapur remained isolated, with no electricity, television or sanity. Now, decades after the world forgot this village, a NASA scientist of Indian origin, Agastya and his beautiful wife find themselves on the road to Paglapur. Agastya is working on a top secret project for creating a device to communicate with aliens. So why is he in a village whose colorful inhabitants include a man who speaks in gibberish, another who thinks he is a lamp post and everyone else who think Mahatma Gandhi is still around, fighting for independence? And more importantly, what are they going to do that will soon turn the universe's spotlight on this forgotten village?", "genres": ["Comedy", "Sci-Fi"], "imdb": {"id": 1918886, "rating": 2.5, "votes": 3433}, "languages": ["Hindi"], "lastupdated": "2015-08-05 00:58:25.553000000", "plot": "In 1947 when the maps of India and Pakistan were being drawn, an oversight ensured that the village of Paglapur didn't find a place in either country. The village had the distinction of ...", "poster": "https://m.media-amazon.com/images/M/MV5BMjE0NjIxODMxN15BMl5BanBnXkFtZTcwMjM5MDcxOA@@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 1346371200000, "title": "Joker", "tomatoes": {"boxOffice": "$0.2M", "lastUpdated": 1436206727000, "production": "UTV Communications", "viewer": {"meter": 21, "numReviews": 819, "rating": 2.2}}, "type": "movie", "writers": ["Shirish Kunder (dialogue)", "Shirish Kunder (screenplay)", "Shirish Kunder (story)"], "year": 2012}