{"_id": "573a13c6f29313caabd7306c", "awards": {"nominations": 17, "text": "Nominated for 1 Oscar. Another 1 win & 17 nominations.", "wins": 2}, "cast": ["Hugh Grant", "Martin Freeman", "Imelda Staunton", "David Tennant"], "countries": ["UK", "USA"], "directors": ["Peter Lord", "Jeff Newitt"], "fullplot": "After years of humiliation and failed attempts to win the coveted Pirate of the Year Award, Pirate Captain and his oddball crew take on the cream of the pirating crop - Black Bellamy, Peg Leg Hastings and Cutlass Liz - in a race to pillage the most booty. They soon cross paths with lovelorn scientist Charles Darwin, who persuades the Captain that the crew's prized 'parrot', Polly, could be the answer to the 'untold riches' they are searching for. Their adventure takes them to Victorian London where they meet Darwin's sidekick 'man-panzee' Mister Bobo, and the notorious pirate-hating Queen Victoria herself. It soon unfolds that Darwin's motives for helping the crew are not what they seem, and the Queen has an evil hidden agenda of her own. The Pirate Captain must choose between basking in the glory of being crowned Pirate of the Year, or staying faithful to his trusted crew.", "genres": ["Animation", "Adventure", "Comedy"], "imdb": {"id": 1430626, "rating": 6.7, "votes": 34976}, "languages": ["English"], "lastupdated": "2015-08-31 00:06:31.107000000", "num_mflix_comments": 1, "plot": "Pirate Captain sets out on a mission to defeat his rivals Black Bellamy and Cutlass Liz for the Pirate of the year Award. The quest takes Captain and his crew from the shores of Blood Island to the foggy streets of Victorian London.", "poster": "https://m.media-amazon.com/images/M/MV5BNDhkOGZkZWMtNGI4Mi00ZWI3LTgyYTgtMDU4ZDI3NTNjMWFiXkEyXkFqcGdeQXVyNjk1Njg5NTA@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 1335484800000, "runtime": 88, "title": "The Pirates! Band of Misfits", "tomatoes": {"boxOffice": "$31.1M", "consensus": "It may not quite scale Aardman's customary delirious heights, but The Pirates! still represents some of the smartest, most skillfully animated fare that modern cinema has to offer.", "critic": {"meter": 86, "numReviews": 144, "rating": 7.2}, "dvd": 1346112000000, "fresh": 124, "lastUpdated": 1442428245000, "production": "Sony Pictures", "rotten": 20, "viewer": {"meter": 60, "numReviews": 85402, "rating": 3.5}, "website": "http://www.thepirates-movie.com/site/"}, "type": "movie", "writers": ["Gideon Defoe (book)", "Gideon Defoe (screenplay)"], "year": 2012}