{"_id": "573a13aff29313caabd32678", "awards": {"nominations": 2, "text": "2 nominations.", "wins": 0}, "cast": ["Kay Kay Menon", "Pavan Malhotra", "Aditya Srivastava", "Dibyendu Bhattacharya"], "countries": ["India"], "directors": ["Anurag Kashyap"], "fullplot": "A dramatic presentation of the bomb blasts that rocked Bombay on March 12, 1993, displays the police investigation, amidst allegations of human rights violations, led by DCP Rakesh Maria, in tracking down the suspects, especially Bashir Khan. Bashir managed to elude authorities by re-locating to Rajasthan, Uttar Pradesh, Delhi, and West Bengal, after finally being apprehended in Bombay. His confession and subsequent flashbacks showcases the apathy shown by authorities who refused to intervene during the destruction of the sacred Babri Masjid by Hindu Kar Sevaks, and the inability of the police to fulfill their mandate and protect the vulnerable, forcing many to flee to other locations. The subsequent aftermath that succeeded in irreversibly polarizing communities in Bombay; Pakistan's involvement in training and arms' supplies; the main alleged suspects, Dawood Ibrahim, and Mushtaq Memon, sought refuge in Dubai, United Arab Emirates, while Indian politicians made a cosmetic move to re-name Bombay; and of the little-known plot to assassinate right-winged politicians, Bal Thackeray and L.K. Advani.", "genres": ["Biography", "Crime", "Drama"], "imdb": {"id": 400234, "rating": 8.6, "votes": 6594}, "languages": ["Hindi"], "lastupdated": "2015-08-18 00:18:10.580000000", "metacritic": 76, "num_mflix_comments": 1, "plot": "Black Friday is a film about the investigations following the 1993 serial Bombay bomb blasts, told through the different stories of the people involved --police, conspirators, victims, middlemen.", "released": 1170979200000, "runtime": 143, "title": "Black Friday", "tomatoes": {"critic": {"meter": 86, "numReviews": 7, "rating": 7.1}, "dvd": 1170979200000, "fresh": 6, "lastUpdated": 1441906911000, "production": "Adlabs", "rotten": 1, "viewer": {"meter": 91, "numReviews": 3620, "rating": 4}}, "type": "movie", "writers": ["Anurag Kashyap (screenplay)", "Hussain Zaidi (book)", "Piyush Mishra (lyrics)"], "year": 2004}