{"_id": "573a13b1f29313caabd37aaf", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Miroslav Krobot", "Tilda Swinton", "Erika Bèk", "Jènos Derzsi"], "countries": ["Hungary", "Germany", "France"], "directors": ["Bèla Tarr", "ègnes Hranitzky"], "fullplot": "One night Maloin, a switchman at a seaside railway station situated by a ferry harbor, witnesses a terrible event. He is just watching the arrival of the last ferry at night from his control room on top of a high iron traverse from where he can see the whole bay. Suddenly he notices that the first of the disembarking passengers, a tall thin figure (a certain Brown as it will turn out later) leaves the harbor, but not on the usual route: after getting through customs, he goes around the dock and then withdraws into a dark corner, waiting. Opposite him, in front of the ship, another man soon appears and throws a suitcase towards the man on the shore. He goes and picks it up, then waits in an dark corner for the other man to join him. When he arrives, however, they begin to quarrel and finally, in the course of the vehement fight, due to a hit that turns out to be fatal, the shorter one falls in the water and sinks, clutching the suitcase in his hand. Maloin is watching the scene, astonished. In a state of fear and shock, he opens the door of his control room, but the sharp and loud creaking sound disturbs and frightens away the murderer. Brown is forced to flee before being able to fish out the suitcase from the water. After the murderer disappears down one of the streets behind the harbor, Maloin cautiously climbs down from his cabin to the shore. When he realizes that there is nothing he can do for the victim, he dredges up the suitcase. He takes it up to his control room and opens it: it is packed with money. He is dazzled. He does not go either to call the police or fetch the murderer; he just stares at the pile of money. He simply cannot believe his eyes. Then, after meticulously drying and counting the banknotes, he hides the suitcase in his closet and locks it. At dawn, when his colleague arrives, he acts as if nothing had happened. He returns home on his usual route. Nevertheless, this path is not the same anymore;", "genres": ["Crime", "Drama", "Mystery"], "imdb": {"id": 415127, "rating": 7.2, "votes": 2378}, "languages": ["French", "English"], "lastupdated": "2015-09-02 09:33:28.413000000", "num_mflix_comments": 2, "plot": "One night Maloin, a switchman at a seaside railway station situated by a ferry harbor, witnesses a terrible event. He is just watching the arrival of the last ferry at night from his ...", "poster": "https://m.media-amazon.com/images/M/MV5BNjAwMDRkZTktNTk4ZS00OThiLWJiYmEtYjFhODExODRlZjU2XkEyXkFqcGdeQXVyNTM0NTU5Mg@@._V1_SY1000_SX677_AL_.jpg", "released": 1201737600000, "runtime": 139, "title": "The Man from London", "tomatoes": {"consensus": "This dark, demanding film from art-house favorite Bela Tarr is by no means a typical crime procedural, but patient viewers will find much to admire.", "critic": {"meter": 70, "numReviews": 30, "rating": 5.9}, "dvd": 1129593600000, "fresh": 21, "lastUpdated": 1440181631000, "production": "IFC Films", "rotten": 9, "viewer": {"meter": 60, "numReviews": 887, "rating": 3.4}}, "type": "movie", "writers": ["Georges Simenon (novel)", "Bèla Tarr (screenplay)", "Lèszlè Krasznahorkai (screenplay)"], "year": 2007}