{"_id": "573a1395f29313caabce17e3", "awards": {"nominations": 3, "text": "Nominated for 1 Oscar. Another 3 wins & 3 nominations.", "wins": 4}, "cast": ["Rosalind Russell", "Alec Guinness", "Ray Danton", "Madlyn Rhue"], "countries": ["USA"], "directors": ["Mervyn LeRoy"], "fullplot": "Widowed Bertha Jacoby has led a relatively sheltered, monocultural existence in the same predominantly Jewish Brooklyn neighborhood for most of her adult life, and as such has fairly traditional Jewish values. She is taken aback not only when her son-in-law Jerry Black announces that he and Bertha's daughter Alice Black are moving to Tokyo on Jerry's next diplomatic corps assignment, but that they want her to move there with them so that she won't be all alone. Despite her anti-Japanese sentiments - David, her only son, having been killed in WWII in the Pacific Theater - Bertha reluctantly agrees. They will fly from New York to San Francisco, and sail from there. Against the odds, Bertha befriends on board the ship Koichi Asano, a wealthy widowed Japanese businessman with who Jerry and the American contingent will be entering into sensitive negotiations. Jerry and Alice are wary of Bertha and Mr. Asano's friendship, not only because of the cultural differences but because they believe Mr. Asano's sole motive may be to get the upper hand in the negotiations in going through Alice's mother. However, Bertha and Mr. Asano may have a deeper connection than either would have thought and that can overcome each of their deep seated cultural differences.", "genres": ["Comedy", "Family", "Drama"], "imdb": {"id": 55124, "rating": 6.7, "votes": 686}, "languages": ["English", "Japanese", "Yiddish", "German"], "lastupdated": "2015-08-04 01:23:09.867000000", "num_mflix_comments": 2, "plot": "A gentle love story about a Japanese businessman and widower, and a Brooklyn widow. But before a happy ending can ensue, they must learn again the lessons of tolerance, kindness and forgiveness.", "poster": "https://m.media-amazon.com/images/M/MV5BZTE0MjMxY2UtMDQ1NC00ZDBhLTg4YWMtODk4OGRhNGM2N2JmXkEyXkFqcGdeQXVyMTk2MzI2Ng@@._V1_SY1000_SX677_AL_.jpg", "released": -231292800000, "runtime": 156, "title": "A Majority of One", "tomatoes": {"lastUpdated": 1442511956000, "production": "Warner Bros.", "viewer": {"meter": 65, "numReviews": 227, "rating": 3.8}}, "type": "movie", "writers": ["Leonard Spigelgass (play)", "Leonard Spigelgass (screenplay)"], "year": 1961}