{"_id": "573a1392f29313caabcdb258", "awards": {"nominations": 3, "text": "Won 1 Oscar. Another 2 nominations.", "wins": 0}, "cast": ["Dorothy Lamour", "Jon Hall", "Mary Astor", "C. Aubrey Smith"], "countries": ["USA"], "directors": ["John Ford", "Stuart Heisler"], "fullplot": "In the Island of Manukura, a French colony in the South Seas, the joyful Terangi is a leader among the natives and the first mate of the Katopua, the tall ship of Captain Nagle. Terangi gets married with Marama and sooner he sails to Tahiti. While in a bar playing with other natives, Terangi is offended by an alcoholic racist French and he hits his face, breaking his jaw. Despite the testimony of Captain Nagle, Terangi is sentenced to six months of forced labor since the victim had political connections with the Powers That Be. Captain Nagle asks the Governor Eugene DeLaage to uses his influence to help Terangi, but the governor refuses. Terangi unsuccessfully tries to escape from the prison, and each attempt increases his sentence. Eight years later, he finally escapes and his jailbreak is celebrated in Manukura. Father Paul finds his canoe and brings Terangi to the island. But a devastating hurricane also arrives in the island threatening the dwellers.", "genres": ["Action", "Drama", "Romance"], "imdb": {"id": 29030, "rating": 7.3, "votes": 1650}, "languages": ["English"], "lastupdated": "2015-09-17 04:42:12.493000000", "plot": "A Polynesian sailor -- unjustly imprisoned after defending himself against a colonial bully -- is relentlessly persecuted by his island's martinet French governor.", "poster": "https://m.media-amazon.com/images/M/MV5BOWU3Y2ExNjUtM2MyNi00MDdiLTk5ZWYtOWJkZWZlN2M2MmY2XkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_SY1000_SX677_AL_.jpg", "rated": "PASSED", "released": -1006128000000, "runtime": 110, "title": "The Hurricane", "tomatoes": {"dvd": 916099200000, "lastUpdated": 1441912240000, "production": "Paramount Pictures", "viewer": {"meter": 60, "numReviews": 306, "rating": 3.6}}, "type": "movie", "writers": ["Dudley Nichols (screen play)", "Oliver H.P. Garrett (adaptation)", "Charles Nordhoff (from the novel by)", "James Norman Hall (from the novel by)"], "year": 1937}