{"_id": "573a13b4f29313caabd3fe73", "awards": {"nominations": 16, "text": "Nominated for 1 Oscar. Another 10 wins & 16 nominations.", "wins": 11}, "cast": ["Mads Mikkelsen", "Neeral Mulchandani", "Tanya Sharma", "Swini Khara"], "countries": ["Denmark", "Sweden", "UK", "Norway"], "directors": ["Susanne Bier"], "fullplot": "Jacob Pederson lives in shanty surroundings in Bombay, India, and assists in the running of Anand Orphanage and School. He had attempted a number of projects to assist orphans, including child prostitutes - all quite in vain. He has adopted a young male orphan, Pramod, and takes special care of him. With growing pressure on the facilities, which is on the verge bankruptcy, the orphanage receives an offer of funding from wealthy Danish citizen, Jorgen, which may put an end to its problems. In order to obtain the money, Jacob must travel to Copenhagen, meet with Jorgen, get financial assistance, and be back to celebrate Pramod's 8th birthday. He sets forth, is received by Christian Refner, an employee and future son-in-law of Jorgen. Jacob is shown all possible courtesy and even housed in a posh apartment. He subsequently meets with Jorgen, shows him video-tapes and submits that a few Kroner could really save several lives which would otherwise succumb to minor illnesses and infections. Jorgen views the videos, but does not display much interest. He invites Jacob to attend his daughter's wedding. Jacob does attend the ceremony, is introduced to Helene, Jorgen's wife; the bride, Anna; and Jorgen's twins - Martin and Morten. After the wedding ceremony, Christian makes a speech. Quite unconventionally, Anna also decides to make a speech - it is this speech that will shatter Jacob's world, slowly make him realize that this invitation to Copenhagen was a ploy to not only ensnare him but also prevent him from returning to India.", "genres": ["Drama"], "imdb": {"id": 457655, "rating": 7.8, "votes": 23579}, "languages": ["Danish", "Swedish", "English", "Hindi"], "lastupdated": "2015-09-17 03:38:17.007000000", "metacritic": 78, "plot": "A manager of an orphanage in India is sent to Copenhagen, Denmark, where he discovers a life-altering family secret.", "poster": "https://m.media-amazon.com/images/M/MV5BMjIxODEyOTQ5Ml5BMl5BanBnXkFtZTcwNjE3NzI5Mw@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1178841600000, "runtime": 120, "title": "After the Wedding", "tomatoes": {"boxOffice": "$1.5M", "consensus": "The cast brings After the Wedding's melodramatic script to life, creating a movie that is emotionally raw and satisfying.", "critic": {"meter": 87, "numReviews": 103, "rating": 7.4}, "dvd": 1184025600000, "fresh": 90, "lastUpdated": 1440098751000, "production": "IFC Films", "rotten": 13, "viewer": {"meter": 87, "numReviews": 83697, "rating": 3.7}, "website": "http://aftertheweddingmovie.com/"}, "type": "movie", "writers": ["Anders Thomas Jensen (screenplay)", "Susanne Bier (story)"], "year": 2006}