{"_id": "573a13b0f29313caabd32a36", "awards": {"nominations": 71, "text": "Nominated for 4 Oscars. Another 79 wins & 71 nominations.", "wins": 83}, "cast": ["Mathieu Amalric", "Emmanuelle Seigner", "Marie-Josèe Croze", "Anne Consigny"], "countries": ["France", "USA"], "directors": ["Julian Schnabel"], "fullplot": "Forty-three year old Elle magazine editor Jean-Dominique Bauby - Jean-Do to his friends - awakens not knowing where he is. He is in a Berck-sur-Mer hospital, where he has been for the past several weeks in a coma after suffering a massive stroke. Although his cognitive facilities are in tact, he quickly learns that he has what is called locked-in syndrome which has resulted in him being almost completely paralyzed, including not being able to speak. One of his few functioning muscles is his left eye. His physical situation and hospitalization uncomfortably bring together the many people in his life, including: Cèline Desmoulins, his ex-lover and mother of his children; Inès, his current lover; and his aged father who he calls Papinou. Among his compassionate recuperative team are his physical therapist Marie, and his speech therapist Henriette. Henriette eventually teaches him to communicate using a system where he spells out words: she reads out the letters of the alphabet in descending order of their use in the French language, and he blinks his functioning left eye when she reaches the appropriate letter. Although frustrating at start, he learns to communicate effectively but slowly using this method, so much so that with the help of Claude, a full time translator, he decides on the monumental and seemingly impossible task to keep to his pre-injury commitment of writing a book, changing its focus to life in his current state.", "genres": ["Biography", "Drama"], "imdb": {"id": 401383, "rating": 8, "votes": 86074}, "languages": ["French"], "lastupdated": "2015-09-16 00:11:07.253000000", "metacritic": 92, "num_mflix_comments": 2, "plot": "The true story of Elle editor Jean-Dominique Bauby who suffers a stroke and has to live with an almost totally paralyzed body; only his left eye isn't paralyzed.", "poster": "https://m.media-amazon.com/images/M/MV5BMTc3MjkzMDkxN15BMl5BanBnXkFtZTcwODAyMTU1MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1201824000000, "runtime": 112, "title": "The Diving Bell and the Butterfly", "tomatoes": {"boxOffice": "$5.9M", "consensus": "Breathtaking visuals and dynamic performances make The Diving Bell and the Butterfly a powerful biopic.", "critic": {"meter": 94, "numReviews": 164, "rating": 8.2}, "dvd": 1209427200000, "fresh": 154, "lastUpdated": 1442509519000, "production": "Miramax Films", "rotten": 10, "viewer": {"meter": 92, "numReviews": 149272, "rating": 4}, "website": "http://www.lescaphandre-lefilm.com/"}, "type": "movie", "writers": ["Ronald Harwood (screenplay)", "Jean-Dominique Bauby (book)"], "year": 2007}