{"_id": "573a139ff29313caabd0062d", "awards": {"nominations": 6, "text": "Nominated for 1 Oscar. Another 4 wins & 6 nominations.", "wins": 5}, "cast": ["Clint Eastwood", "Tommy Lee Jones", "Donald Sutherland", "James Garner"], "countries": ["USA", "Australia"], "directors": ["Clint Eastwood"], "fullplot": "When a Russian satellite orbiting the Earth starts to veer off course. It seems like the guidance system in the satellite is of American origin. It's important to try and fix it before it comes into the atmosphere. The NASA man, Bob Gerson tries to find out who designed it and discovers that it was designed by Frank Colvin, an Air Force pilot who 40 years ago was part of the team who was originally suppose to go to space but when NASA was formed and Gerson's influence they were dropped. Gerson asks Frank to help but Frank still holds a grudge. But after some prodding he agrees but only if he and his team can go there so he can fix it. Gerson reluctantly agrees so Frank recruits his former team members, Tank Sullica, Jerry O'Neill and Hawk Hawkins to join him. After some strenuous tests, they're cleared. And they go up with two other astronauts and check out the satellite and discover that they weren't told the whole truth.", "genres": ["Action", "Adventure", "Thriller"], "imdb": {"id": 186566, "rating": 6.4, "votes": 56843}, "languages": ["English"], "lastupdated": "2015-09-10 17:16:47.857000000", "metacritic": 73, "num_mflix_comments": 1, "plot": "When a retired engineer is called upon to rescue a failing satellite, he insists that his equally old teammates accompany him into space.", "poster": "https://m.media-amazon.com/images/M/MV5BMTk4NzAwOTkwMF5BMl5BanBnXkFtZTYwMDM3MTM3._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 965347200000, "runtime": 130, "title": "Space Cowboys", "tomatoes": {"boxOffice": "$89.4M", "consensus": "While the plot is overly cliched, the suberb acting by the stars (especially the tense interactions between Clint Eastwood and Tommy Lee Jones) and the spectacular special effects make this a movie worth seeing.", "critic": {"meter": 78, "numReviews": 119, "rating": 6.7}, "dvd": 987465600000, "fresh": 93, "lastUpdated": 1442083633000, "production": "Warner Bros. Pictures", "rotten": 26, "viewer": {"meter": 53, "numReviews": 72490, "rating": 3}, "website": "http://www.spacecowboys.net"}, "type": "movie", "writers": ["Ken Kaufman", "Howard Klausner"], "year": 2000}