{"_id": "573a1397f29313caabce8b29", "awards": {"nominations": 5, "text": "5 nominations.", "wins": 0}, "cast": ["Dennis Quaid", "Bess Armstrong", "Simon MacCorkindale", "Louis Gossett Jr."], "countries": ["USA"], "directors": ["Joe Alves"], "fullplot": "Michael Brody and Sean Brody, the sons of former Amity police chief Martin Brody, work at Florida's Sea World, a seaside park run by Calvin Bouchard. Sean befriends Kelly Ann Bukowski, and Michael's girlfriend Kathryn Morgan is Sea World's head scientist who always works with Sea World's dolphins Cindy and Sandy. In its man-made lagoon, about 40 feet under the water, Sea World opens the Undersea Kingdom, a new set of underwater glass tunnels that have their own control room, and Calvin's friend Philip FitzRoyce is there to do some filming. When Sea World diver Shelby Overman vanishes, everyone is worried. Michael and Kathryn head into the water, where they find a baby great white shark and decide to bring it to Sea World to put it on display, but at Sea World, the baby shark dies. When Overman's body is found, Michael vomits when he sees it. Kathryn looks at the body and knows that the baby shark could not have been the shark that killed Overman, because the baby shark's bite radius is too small its 35-foot-long mother killed Overman. When Kathryn and Michael tell Calvin and Philip about the shark, they all try to evacuate the park, including the park's beach, as they try their best to protect Sea World's visitors from the shark.", "genres": ["Horror"], "imdb": {"id": 85750, "rating": 3.5, "votes": 26047}, "languages": ["English"], "lastupdated": "2015-08-21 00:04:45.343000000", "num_mflix_comments": 1, "plot": "The sons of police chief Brody must protect civilians at a Sea World theme park after a 35-foot shark becomes trapped in the park with them.", "poster": "https://m.media-amazon.com/images/M/MV5BM2QwYjhiMzQtN2RiYS00MzgxLThmNzItMmJlNmMyMmQyYTA3XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 427680000000, "runtime": 99, "title": "Jaws 3-D", "tomatoes": {"critic": {"meter": 11, "numReviews": 27, "rating": 2.9}, "dvd": 1054598400000, "fresh": 3, "lastUpdated": 1442078883000, "production": "MCA Universal Home Video", "rotten": 24, "viewer": {"meter": 18, "numReviews": 187187, "rating": 2.4}}, "type": "movie", "writers": ["Peter Benchley (suggested by the novel \"Jaws\")", "Richard Matheson (screenplay)", "Carl Gottlieb (screenplay)", "Guerdon Trueblood (story)"], "year": 1983}