{"_id": "573a1394f29313caabce0b0d", "awards": {"nominations": 1, "text": "1 win & 1 nomination.", "wins": 1}, "cast": ["Chhabi Biswas", "Sardar Akhtar", "Gangapada Basu", "Bismillah Khan"], "countries": ["India"], "directors": ["Satyajit Ray"], "fullplot": "Huzur Biswamghar Roy is a rich landowner who lives in a palace with his wife and son and his many servants. His passion - his wife would call it his addiction - is music and he spends a great deal of his fortune on concerts held for the locals in his magnificent music room. His wealth is in decline however. His lands are being eroded by the local river and he pays for the concert he arranges for his son's coming of age party by selling some of the family jewels. When his neighbor Ganguli invites him to a party at his house, Roy decides to one up him and organizes a lavish party for the same day - costing him the last of the jewels. After his wife and son are killed in a storm, Roy becomes something of a recluse, closing up the music room. Now, many years later he decides to have one final concert, spending the last of his money to again outdo - and spite - Ganguli.", "genres": ["Drama", "Music"], "imdb": {"id": 51792, "rating": 8.1, "votes": 3127}, "languages": ["Bengali"], "lastupdated": "2015-08-26 00:28:15.807000000", "num_mflix_comments": 1, "plot": "Depicts the end days of a decadent zamindar (landlord) in Bengal, and his efforts to uphold his family prestige even when faced with economic adversity.", "poster": "https://m.media-amazon.com/images/M/MV5BNmVhOWViMGQtMDBmNS00YmM3LTlmOGItMjRmN2VjNWExNWIzXkEyXkFqcGdeQXVyNzM0MTUwNTY@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "runtime": 95, "title": "The Music Room", "tomatoes": {"critic": {"meter": 100, "numReviews": 19, "rating": 9.1}, "dvd": 1311033600000, "fresh": 19, "lastUpdated": 1441993014000, "rotten": 0, "viewer": {"meter": 93, "numReviews": 928, "rating": 4.3}}, "type": "movie", "writers": ["Tarashankar Banerjee (based on the story by)", "Satyajit Ray (script)", "Santi P. Choudhury (assistant screenplay writer)"], "year": 1958}