{"_id": "573a13caf29313caabd7d5de", "awards": {"nominations": 10, "text": "6 wins & 10 nominations.", "wins": 6}, "cast": ["Joan Rivers", "Jocelyn Pickett", "Bill Sammeth", "Larry A. Thompson"], "countries": ["USA"], "directors": ["Ricki Stern", "Anne Sundberg"], "fullplot": "This documentary follows one year in the life of Joan Rivers, who sees herself first and foremost as an actress, with her life as a comedienne/writer just an extension of being an actress. Now at age 75, Rivers has faced her ups and downs in her forty plus year career, the year leading up to filming being a down compared to what she would have wanted, which is a calendar full of engagements with several engagements each day. That want is in part to support her opulent personal lifestyle, but is more a need to bolster her own sense of self-worth as a basically insecure person who is probably best known now for her overuse of cosmetic surgery rather than her professional work. She feels that Kathy Griffin, who she admires, is now getting all the engagements she would have gotten in her prime. During this year, Rivers is seen going from engagement to engagement, some big - such as a Kennedy Center Honors for George Carlin, a double bill with Don Rickles in New York, and her own celebrity roast on Comedy Central (which she really isn't looking forward to) - and some not so big. But perhaps the most important of these to her is the opening of her new play, which she is testing in Edinburgh, important in that she wants to be seen as an actress; and an appearance on a celebrity version of The Apprentice (2004), important in that it will mark her first appearance on NBC since being blacklisted by them for her disagreement with Johnny Carson over the start of her own talk show on rival Fox back in 1989. Through the year, several long time supporters are at her side, including daughter Melissa Rivers, personal assistant 'Jocelyn Pickett', and manager Bill Sammeth, but all is not smooth even in this part of her life.", "genres": ["Documentary", "Biography", "Comedy"], "imdb": {"id": 1568150, "rating": 7.4, "votes": 3119}, "languages": ["English"], "lastupdated": "2015-09-01 00:07:26.913000000", "metacritic": 79, "num_mflix_comments": 1, "plot": "A documentary on the life and career of Joan Rivers, made as the comedienne turns 75 years old.", "poster": "https://m.media-amazon.com/images/M/MV5BMjI3MTc5MzAwMV5BMl5BanBnXkFtZTcwNzgzNzE1Mw@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1278028800000, "runtime": 84, "title": "Joan Rivers: A Piece of Work", "tomatoes": {"boxOffice": "$2.9M", "consensus": "Penetrating Rivers' coarse image, this compelling documentary offers an honest, behind-the-scenes look at her career -- and at show business in general.", "critic": {"meter": 91, "numReviews": 101, "rating": 7.6}, "dvd": 1292284800000, "fresh": 92, "lastUpdated": 1440356134000, "production": "IFC Films", "rotten": 9, "viewer": {"meter": 81, "numReviews": 12204, "rating": 3.7}, "website": "http://www.ifcfilms.com/films/joan-rivers-a-piece-of-work"}, "type": "movie", "writers": ["Ricki Stern"], "year": 2010}