{"_id": "573a139df29313caabcfa4dc", "awards": {"nominations": 4, "text": "2 wins & 4 nominations.", "wins": 2}, "cast": ["Vin Diesel", "Radha Mitchell", "Cole Hauser", "Keith David"], "countries": ["USA"], "directors": ["David Twohy"], "fullplot": "The space transport vessel \"Hunter-Gratzner\" carrying 40 people on-board crashes on a desert planet when the ship is struck in a meteor storm. There are only 11 survivors, among them are pilot Carolyn Fry (Who has assumed command after the ship's captain is killed), bounty hunter William J. Johns, religious man Abu Al-Walid, Antiques dealer Paris P. Ogilvie, runaway teenager Jack, settlers John 'Zeke' Ezekiel and his lover Sharon 'Shazza' Montgomery, and Richard B. Riddick, a dangerous escaped convict. Marooned, the survivors discover the barren and hot desert-scape has sunlight from three suns. Not only must they find food and water and worry about Riddick, the survivors find themselves being hunted by the planet's flesh-eating alien inhabitants when the planet is engulfed in darkness, which happens every 22 years, as they emerge from underground to hunt and eat all signs of life. Fry and the survivors find Riddick is their best chance of survival, as Riddick has surgically-enhanced eyes that allow him to see in the dark as they set out to find a way of escaping from the planet and getting to a escape shuttle, before they all get eaten by the creatures on the surface.", "genres": ["Action", "Horror", "Sci-Fi"], "imdb": {"id": 134847, "rating": 7.1, "votes": 182308}, "languages": ["English", "Arabic"], "lastupdated": "2015-08-30 01:55:07.863000000", "metacritic": 49, "num_mflix_comments": 1, "plot": "A commercial transport ship and its crew are marooned on a planet full of bloodthirsty creatures that only come out to feast at night. But then, they learn that a month-long eclipse is about to occur.", "poster": "https://m.media-amazon.com/images/M/MV5BNTNmYzE1OWYtZDdjNC00OTdhLTg1YjUtYWJlZTVkMzkzNmVkXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 950832000000, "runtime": 109, "title": "Pitch Black", "tomatoes": {"consensus": "Despite an interesting premise (and a starmaking turn from Vin Diesel), Pitch Black is too derivative and formulaic to fully recommend to sci-fi or action fans.", "critic": {"meter": 57, "numReviews": 104, "rating": 5.6}, "dvd": 972345600000, "fresh": 59, "lastUpdated": 1442079005000, "production": "Gramercy Pictures/ USA Films", "rotten": 45, "viewer": {"meter": 77, "numReviews": 277289, "rating": 3.5}, "website": "http://www.pitch-black.com/blackbox/index.html"}, "type": "movie", "writers": ["Jim Wheat (story)", "Ken Wheat (story)", "Jim Wheat (screenplay)", "Ken Wheat (screenplay)", "David Twohy (screenplay)"], "year": 2000}