{"_id": "573a139af29313caabcef3b2", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Margaret Cho", "Bruce Davison", "Lee Grant", "Devon Gummersall"], "countries": ["USA"], "directors": ["Randal Kleiser"], "fullplot": "\"You won't leave me, will you?\" Nick asks Brandon shortly after revealing to him the results of his last blood test for HIV. \"I don't want to die alone.\" In spite of Brandon's protestations, the two soon find the love they had shared for many years in ruins. One year after their breakup, Nick is confronted with a ravaged immune system and a CT Scan and lab values which, along with his worsening forgetfulness, clenches the diagnosis of Progressive Multifocal Leukoencephalopathy (PML) -- a condition he has seen claim his friends and one which he vows will not take him. Due to the aggressive nature of the disease, he has only a few days of conscious life remaining. His plan, he announces to family and \"extended family,\" is to voluntarily end his life himself before the disease renders him unrecognizable to those he loves and he, in turn, is unable to recognize them. Uninvited to the farewell party, Brandon's presence is greeted with jeers from those who see him as having abandoned Nick is his time of greatest need.", "genres": ["Drama"], "imdb": {"id": 113443, "rating": 7.1, "votes": 2261}, "languages": ["English"], "lastupdated": "2015-09-02 00:31:25.833000000", "num_mflix_comments": 2, "plot": "\"You won't leave me, will you?\" Nick asks Brandon shortly after revealing to him the results of his last blood test for HIV. \"I don't want to die alone.\" In spite of Brandon's protestations...", "poster": "https://m.media-amazon.com/images/M/MV5BMjU0YjM4NzktNDJlZi00ZmNjLWI1MWQtOTIxMDI4NWY0NGYwXkEyXkFqcGdeQXVyMTA0MjU0Ng@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 827452800000, "runtime": 110, "title": "It's My Party", "tomatoes": {"critic": {"meter": 47, "numReviews": 15, "rating": 5.7}, "dvd": 1054598400000, "fresh": 7, "lastUpdated": 1437416970000, "production": "MGM Home Entertainment", "rotten": 8, "viewer": {"meter": 78, "numReviews": 4138, "rating": 3.7}}, "type": "movie", "writers": ["Randal Kleiser"], "year": 1996}