{"_id": "573a1394f29313caabce07d6", "awards": {"nominations": 2, "text": "2 nominations.", "wins": 0}, "cast": ["Romy Schneider", "Karlheinz Bèhm", "Magda Schneider", "Gustav Knuth"], "countries": ["Austria"], "directors": ["Ernst Marischka"], "fullplot": "The young Empress Sissi is staying at the Gèdèlle Palace in Hungary with her little daughter and some court people. Here she can be herself, liberated from all the strict court rules in Austria. She spends her days with Count Andrassy, riding in the woods. At a ball in his castle he declares his love for her. Because of this Sissi feels forced to break her relationship with him, and moves back to Vienna. It is soon discovered that she is seriously ill in tuberculosis. Dr. Seeburger doesn't think she will survive the winter, but a change of climate might help. After some months on Madeira Sissi's illness is even worse. Her mother, Duchess Ludovika, then decides to go to Madeira to help Sissi recapture the joy of life. When Dr. Seeburger examines Sissy at Corfu some weeks later, he finds her fully recovered. The Austrian ministers suggest that Emperor Franz Joseph should combine his reunion with Sissy with an official visit to Lombardy-Venetia. Austria is much hated there, but needs a good relationship with this country. The ministers think that Sissi can bring forth a miraculous change of sentiments in Lombardy-Venetia, just as she did in Hungary.", "genres": ["Drama", "History", "Romance"], "imdb": {"id": 50974, "rating": 6.5, "votes": 3235}, "languages": ["German", "Greek", "Hungarian", "Italian", "Portuguese"], "lastupdated": "2015-09-07 01:08:09.333000000", "num_mflix_comments": 2, "plot": "The final film in a highly romanticized trilogy about Elisabeth \"Sissi\" of Austria finds the young empress traveling throughout Europe.", "poster": "https://m.media-amazon.com/images/M/MV5BZDViZTIwMzQtYzQ0MS00MjM5LWJjMTQtZTM0NTExZmJhM2QxXkEyXkFqcGdeQXVyNDE5MTU2MDE@._V1_SY1000_SX677_AL_.jpg", "runtime": 109, "title": "Sissi: The Fateful Years of an Empress", "tomatoes": {"dvd": 1189468800000, "lastUpdated": 1440530193000, "viewer": {"meter": 81, "numReviews": 2120, "rating": 3.9}}, "type": "movie", "writers": ["Ernst Marischka"], "year": 1957}