{"_id": "573a13c2f29313caabd67eb2", "awards": {"nominations": 4, "text": "4 nominations.", "wins": 0}, "cast": ["Sudeep", "Amruta Khanvilkar", "Ahsaas Channa", "Ashwini Khalsekar"], "countries": ["India"], "directors": ["Ram Gopal Varma"], "fullplot": "Wealthy Mumbai-based Rajiv while carrying out excavation comes across an ancient statute of Bhagwan Shri Ganpati. His workers request him to build a small temple, but he refuses although his family, including his mother and wife, Arati, & maid, Laxmi, worship a variety of Hindu Deities including Satyanarayan Devji and Bhagwan Shri Hanuman. When Rajiv finds that two of his associates, Anshuman and Madhu, have embezzled money, he humiliates and fires them on the spot. Madhu decides to avenge this humiliation by putting Rajiv's daughter, Raksha, under a black magic spell. The family calls in Dr. Pandey - who does not find anything physically wrong with her but hastily changes his mind after re-examining her at their residence, and calls in Psychiatrist Seema Walke. Arati and her mother-in-law are convinced that Raksha is possessed and call in a Tantri, but Rajiv decides to admit her in a hospital under the care of the aforementioned doctors. He will soon regret this decision after a series of accidents at his building site, and be compelled to seek the assistance of an exorcist when he finds Raksha's life threatened by inexplicable forces.", "genres": ["Drama", "Horror", "Mystery"], "imdb": {"id": 1267500, "rating": 3.9, "votes": 913}, "languages": ["Hindi", "Marathi", "English"], "lastupdated": "2015-08-19 00:25:56.877000000", "num_mflix_comments": 1, "plot": "An atheist is forced to consult an exorcist after his daughter shows signs of being possessed.", "poster": "https://m.media-amazon.com/images/M/MV5BOTk4NWIxZmItYzgxMy00ZDUxLTg2NjAtMWM2MTZjNGRhNzFkXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY1000_SX677_AL_.jpg", "released": 1219363200000, "runtime": 110, "title": "Phoonk", "tomatoes": {"dvd": 1234310400000, "lastUpdated": 1441131559000, "viewer": {"meter": 20, "numReviews": 244, "rating": 2.4}}, "type": "movie", "writers": ["Milind Gadagkar", "Sandeep Nath (lyrics)", "Prashant Pandey (lyrics)"], "year": 2008}