{"_id": "573a1399f29313caabced287", "awards": {"nominations": 5, "text": "Nominated for 2 Golden Globes. Another 6 wins & 5 nominations.", "wins": 8}, "cast": ["Tom Hanks", "Geena Davis", "Lori Petty", "Madonna"], "countries": ["USA"], "directors": ["Penny Marshall"], "fullplot": "During World War II when all the men are fighting the war, most of the jobs that were left vacant because of their absence were filled in by women. The owners of the baseball teams, not wanting baseball to be dormant indefinitely, decide to form teams with women. So scouts are sent all over the country to find women players. One of the scouts, passes through Oregon and finds a woman named Dottie Hinson, who is incredible. He approaches her and asks her to try out but she's not interested. However, her sister, Kit who wants to get out of Oregon, offers to go. But he agrees only if she can get her sister to go. When they try out, they're chosen and are on the same team. Jimmy Dugan, a former player, who's now a drunk, is the team manager. But he doesn't feel as if it's a real job so he drinks and is not exactly doing his job. So Dottie steps up. After a few months when it appears the girls are not garnering any attention, the league is facing closure till Dottie does something that grabs attention. And it isn't long Dottie is the star of the team and Kit feels like she's living in her shadow.", "genres": ["Comedy", "Drama", "Sport"], "imdb": {"id": 104694, "rating": 7.2, "votes": 66350}, "languages": ["English"], "lastupdated": "2015-09-07 00:06:58.937000000", "metacritic": 67, "num_mflix_comments": 3, "plot": "Two sisters join the first female professional baseball league and struggle to help it succeed amidst their own growing rivalry.", "poster": "https://m.media-amazon.com/images/M/MV5BNjQ1NTQyYjktZDc5My00NDA1LWI1NmItY2ViNjQ0NDk4NmRjXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 709948800000, "runtime": 128, "title": "A League of Their Own", "tomatoes": {"consensus": "Sentimental and light, but still thoroughly charming, A League of Their Own is buoyed by solid performances from a wonderful cast.", "critic": {"meter": 77, "numReviews": 57, "rating": 6.7}, "dvd": 873763200000, "fresh": 44, "lastUpdated": 1440008575000, "production": "Columbia Pictures", "rotten": 13, "viewer": {"meter": 84, "numReviews": 365832, "rating": 3.4}}, "type": "movie", "writers": ["Kim Wilson (story)", "Kelly Candaele (story)", "Lowell Ganz (screenplay)", "Babaloo Mandel (screenplay)"], "year": 1992}