{"_id": "573a1392f29313caabcdb600", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Jean Gabin", "Simone Simon", "Fernand Ledoux", "Blanchette Brunoy"], "countries": ["France"], "directors": ["Jean Renoir"], "fullplot": "Jacques Lantier is a train engineer who is prone to violent seizures, a condition he attributes to his forefathers' habit of excessive drinking. Roubaud is a train conductor on the same railroad that Lantier works on, married to the much younger Sèverine. When Roubaud catches wind of his wife's affair with her godfather, the wealthy M. Grandmorin, he kills him during a train journey in a fit of jealousy. He makes sure that Sèverine is also present, making her an accomplice to murder. Lantier, despite having witnessed them quite clearly in the train corridor, hides the fact during the investigation as he is attracted to Sèverine. They both begin an affair, all the while Roubaud becomes increasingly withdrawn and starts to gamble. Sèverine urges Lantier to kill her husband so that they would be free but she is unaware of Lantier's unfortunate condition.", "genres": ["Crime", "Drama", "Film-Noir"], "imdb": {"id": 29957, "rating": 7.8, "votes": 4625}, "languages": ["French"], "lastupdated": "2015-08-26 00:24:58.057000000", "num_mflix_comments": 2, "plot": "In this classic adaptation of Emile Zola's novel, a tortured train engineer falls in love with a troubled married woman who has helped her husband commit a murder.", "poster": "https://m.media-amazon.com/images/M/MV5BMTcyNzUxMTYwNl5BMl5BanBnXkFtZTgwMzIxNjQ0MjE@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": -942537600000, "runtime": 100, "title": "La Bète Humaine", "tomatoes": {"critic": {"meter": 93, "numReviews": 14, "rating": 8.1}, "dvd": 1139875200000, "fresh": 13, "lastUpdated": 1435778640000, "production": "Criterion Collection", "rotten": 1, "viewer": {"meter": 83, "numReviews": 1894, "rating": 3.9}}, "type": "movie", "writers": ["èmile Zola (novel)", "Jean Renoir (screenplay)"], "year": 1938}