{"_id": "573a1399f29313caabcedf95", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Alan Bates", "Richard Harris", "River Phoenix", "Dermot Mulroney"], "countries": ["France", "Netherlands", "UK", "USA"], "directors": ["Sam Shepard"], "fullplot": "It's 1873, Indian Territory. Talbot Roe is going mad with grief over losing his Indian wife, Awbonnie. In an effort to save him, his father, Prescott Roe, seeks to purchase the dead wife's sister, Velada, from the same traveling carnival he acquired Awbonnie. The girls' father, carnival master Eamon McCree, is willing to do business, but her step-brother, Reeves, protests, putting an end to the negotiation. Desperate, Prescott kidnaps Velada and promises her the means to be rid of her father in return for comforting Talbot out of his obsession. In Talbot's madness, he guards his wife's corpse, preventing her from passing to the beyond. As a result, Awbonnie's ghost begins haunting and cursing everyone involved in the transaction of selling her as a wife. Meanwhile, Reeves and Eamon search the prairie for Velada. Drunken Eamon several times wants to turn back and leave his daughter to her own devices, but Reeves refuses. At the site of a hunting party of Indians, Eamon panics and loses his mount. Reeves continues the search alone, leaving behind the drunk, rapist father who only cared for himself, with whom he has always been disgusted. Meanwhile, the other carnival members pack up and head back east, glad to be rid of the unreasonable carnival master. At the grave-site, Talbot is distrustful of everyone who tries to separate him from Awbonnie's corpse. Her angry ghost causes a commotion with runaway horses and Prescott manages to throw what's left of the corpse on the fire. As soon as he does, Talbot seems to come to his senses, and Velada sees Awbonnie's spirit appear in the flames, finally at peace. Talbot and Prescott are able to walk away from the grave-site somewhat resigned to Awbonnie's death, and Velada presumably collects the horses and gold from her agreement with Prescott. Eamon is eventually captured by Indians and looks to be headed for an ill-fated ending.", "genres": ["Drama", "Horror", "Western"], "imdb": {"id": 108135, "rating": 5.2, "votes": 816}, "languages": ["English"], "lastupdated": "2015-08-27 00:42:47.963000000", "num_mflix_comments": 1, "plot": "Mad with grief after the death of his Kiowa wife, Talbot awaits death under a tree with her body beside him. She begins to haunt him because he won't burn her. His father, who bought him the wife, thinks her sister might reason with him.", "poster": "https://m.media-amazon.com/images/M/MV5BMTI2MzMxMzkxOV5BMl5BanBnXkFtZTcwNTMzMjkyMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 791164800000, "runtime": 102, "title": "Silent Tongue", "tomatoes": {"critic": {"meter": 38, "numReviews": 16, "rating": 4.9}, "dvd": 1115078400000, "fresh": 6, "lastUpdated": 1439578249000, "production": "Trimark", "rotten": 10, "viewer": {"meter": 49, "numReviews": 1373, "rating": 3.1}}, "type": "movie", "writers": ["Sam Shepard"], "year": 1993}