{"_id": "573a13d1f29313caabd90336", "awards": {"nominations": 3, "text": "2 wins & 3 nominations.", "wins": 2}, "cast": ["Molly Malcolm", "Marcos Lèpez", "Lynn Owens", "Richard Jones"], "countries": ["Spain", "France"], "directors": ["Cosima Dannoritzer"], "fullplot": "Once upon a time..... products were made to last. Then, at the beginning of the 1920s, a group of businessmen were struck by the following insight: 'A product that refuses to wear out is a tragedy of business' (1928). Thus Planned Obsolescence was born. Shortly after, the first worldwide cartel was set up expressly to reduce the life span of the incandescent light bulb, a symbol for innovation and bright new ideas, and the first official victim of Planned Obsolescence. During the 1950s, with the birth of the consumer society, the concept took on a whole new meaning, as explained by flamboyant designer Brooks Stevens: 'Planned Obsolescence, the desire to own something a little newer, a little better, a little sooner than is necessary...'. The growth society flourished, everybody had everything, the waste was piling up (preferably far away in illegal dumps in the Third World) - until consumers started rebelling... Can the modern growth society survive without Planned Obsolescence? Did the eternal light bulb ever exist? How can a tiny chip 'kill' a product? How did two artists from New York manage to extend the lives of millions of iPods? Is Planned Obsolescence itself becoming obsolete?", "genres": ["Documentary"], "imdb": {"id": 1825163, "rating": 8.1, "votes": 1400}, "languages": ["English", "French", "Catalan", "German", "Spanish"], "lastupdated": "2015-09-10 17:56:53.103000000", "num_mflix_comments": 1, "plot": "This is the story of companies who engineered their products to fail.", "released": 1292457600000, "runtime": 75, "title": "The Light Bulb Conspiracy", "tomatoes": {"lastUpdated": 1442078607000, "viewer": {"numReviews": 13, "rating": 4.2}, "website": "http://www.facebook.com/pages/The-Light-Bulb-Conspiracy/181469828550173?ref=sgm"}, "type": "movie", "writers": ["Cosima Dannoritzer"], "year": 2010}