{"_id": "573a1399f29313caabcee824", "awards": {"nominations": 6, "text": "4 wins & 6 nominations.", "wins": 4}, "cast": ["Tim Roth", "Edward Furlong", "Moira Kelly", "Vanessa Redgrave"], "countries": ["USA"], "directors": ["James Gray"], "fullplot": "This film tells a bitter tale of a dysfunctional family. Joshua, a cold-blooded professional killer, returns to his Brighton Beach boyhood home for a \"job.\" He knows it will be difficult to return to the Russian-immigrant community of his youth--in his eyes, we see anticipation of the inevitable emotional pain and psychic turmoil that seeing his forsaken family and estranged companions will bring him. To do his job, and try to maintain some semblence of sanity, he has had to wall off his humanity from even himself. Seeing his kid brother, who adores him, talking with his dying mother, who still loves him, and yes, arguing with his abusive father, begins to wreak havoc with his personal defenses. As his steely demeanor begins to dissolve, we are shown the soul of a hit-man crumbling away, piece by piece. Finally, all that he now allows himself to admit that he loves is agonizingly torn away from him and he is left with the ultimate punishment for his transgressions.", "genres": ["Crime", "Drama"], "imdb": {"id": 110365, "rating": 6.8, "votes": 5346}, "languages": ["English"], "lastupdated": "2015-08-16 00:17:54.057000000", "num_mflix_comments": 1, "plot": "This film tells a bitter tale of a dysfunctional family. Joshua, a cold-blooded professional killer, returns to his Brighton Beach boyhood home for a \"job.\" He knows it will be difficult to...", "poster": "https://m.media-amazon.com/images/M/MV5BMTU2MzUyNzc5OV5BMl5BanBnXkFtZTcwODc4OTUyMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 800841600000, "runtime": 98, "title": "Little Odessa", "tomatoes": {"critic": {"meter": 61, "numReviews": 18, "rating": 5.6}, "dvd": 921542400000, "fresh": 11, "lastUpdated": 1442083805000, "production": "Live Home Video", "rotten": 7, "viewer": {"meter": 73, "numReviews": 4034, "rating": 3.4}}, "type": "movie", "writers": ["James Gray"], "year": 1994}