{"_id": "573a13b9f29313caabd4e63f", "awards": {"nominations": 10, "text": "6 wins & 10 nominations.", "wins": 6}, "cast": ["Shane Jacobson", "Travis Golland", "Chris Davis", "Alf Scerri"], "countries": ["Australia"], "directors": ["Clayton Jacobson"], "fullplot": "From the biggest festival to the smallest church social, Kenny Smyth delivers porta-loos to them all. Ignored and unappreciated, he is one of the cogs in society's machinery; a knight in shining overalls taking care of business with his faithful 'Splashdown' crew. Follow Kenny as he tackles every septic challenge that comes his way, culminating in a pilgrimage to that Mecca of waste management, the International Pumper and Cleaner Expo in Nashville Tennessee - or as Kenny affectionately calls it, \"Poo HQ\". With fly-on-the-wall honesty and wit, 'KENNY' lifts the lid on one of Australia's roughest diamonds as he juggles family tensions, fatherhood and sewage with charm, humour and unflinching dignity. \"It takes a certain kind of person to do what I do... No-one's ever impressed; no-one's ever fascinated... If you're a fireman, all the kids will want to jump on the back of the truck and follow you to a fire. There's going to be no kids willing to do that with me. So, I don't do it to impress people - it's a job, it's my trade, and I actually think I'm pretty good at it.\" - Kenny Smyth Part philosopher, part comedian and all heart, KENNY is living proof that in sewage, like life, the best will always rise to the top.", "genres": ["Comedy"], "imdb": {"id": 822389, "rating": 7.3, "votes": 5113}, "languages": ["English"], "lastupdated": "2015-08-14 01:06:40.927000000", "plot": "From the biggest festival to the smallest church social, Kenny Smyth delivers porta-loos to them all. Ignored and unappreciated, he is one of the cogs in society's machinery; a knight in ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTc5MDg2ODk1NV5BMl5BanBnXkFtZTcwMjU1MTc3MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1215734400000, "runtime": 99, "title": "Kenny", "tomatoes": {"critic": {"meter": 100, "numReviews": 18, "rating": 7.5}, "dvd": 1222732800000, "fresh": 18, "lastUpdated": 1441994391000, "production": "Xenon Pictures", "rotten": 0, "viewer": {"meter": 86, "numReviews": 8937, "rating": 3.9}, "website": "http://www.xenonpictures.com/kenny/"}, "type": "movie", "writers": ["Clayton Jacobson", "Shane Jacobson"], "year": 2006}