{"_id": "573a13e1f29313caabdbbd9c", "awards": {"nominations": 18, "text": "Nominated for 1 Oscar. Another 11 wins & 18 nominations.", "wins": 12}, "cast": ["Vivian Maier", "John Maloof", "Daniel Arnaud", "Simon Amèdè"], "countries": ["USA"], "directors": ["John Maloof", "Charlie Siskel"], "fullplot": "Real estate agent John Maloof explains how a trip to a local auction house, in search for old pictures to use for a history book about his neighborhood, resulted in him bidding and winning a box full of old negatives. John goes through the massive quantity of negatives, describes how impressed he is by the quality of the images, becomes quickly determined they are not reverent to his project and just puts them away. That could have very likely had been the end of the story, if the power of the images had not pushed him to fall in love with photography. John confides that his photo hobby quickly motivated him to set up a darkroom and devote large amounts of time shooting. As he learned more about photography, he recognized that those negatives he had bought, then stored, were the work of a real master. In an attempt to confirm his suspicion, he selected about 100 images and put them online with the hope that the feedback would confirm his judgement as to the strength of the images.", "genres": ["Documentary", "Biography", "Mystery"], "imdb": {"id": 2714900, "rating": 7.7, "votes": 6498}, "languages": ["English", "French"], "lastupdated": "2015-08-22 00:33:39.123000000", "metacritic": 75, "num_mflix_comments": 5, "plot": "A documentary on the late Vivian Maier, a nanny whose previously unknown cache of 100,000 photographs earned her a posthumous reputation as one of the most accomplished street photographers.", "poster": "https://m.media-amazon.com/images/M/MV5BMTcyODk4NzU5OV5BMl5BanBnXkFtZTgwMjE4OTk2MDE@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 1397692800000, "runtime": 83, "title": "Finding Vivian Maier", "tomatoes": {"boxOffice": "$1.5M", "consensus": "Narratively gripping, visually striking, and ultimately thought-provoking, Finding Vivian Maier shines an overdue spotlight on its subject's long-hidden brilliance.", "critic": {"meter": 94, "numReviews": 90, "rating": 7.6}, "dvd": 1406592000000, "fresh": 85, "lastUpdated": 1439922765000, "production": "IFC Films", "rotten": 5, "viewer": {"meter": 89, "numReviews": 8302, "rating": 4.1}, "website": "http://www.findingvivianmaier.com/"}, "type": "movie", "writers": ["John Maloof", "Charlie Siskel"], "year": 2013}