{"_id": "573a13a0f29313caabd05f2c", "awards": {"nominations": 5, "text": "5 wins & 5 nominations.", "wins": 5}, "cast": ["Janet McTeer", "Michael Q. Davis", "Michael Goodwin", "Gregory Russell Cook"], "countries": ["USA"], "directors": ["Maggie Greenwald"], "fullplot": "After being denied a promotion at the university where she teaches, Doctor Lily Penleric, a brilliant musicologist, impulsively visits her sister, who runs a struggling rural school in Appalachia. There she stumbles upon the discovery of her life - a treasure trove of ancient Scots-Irish ballads, songs that have been handed down from generation to generation, preserved intact by the seclusion of the mountains. With the goal of securing her promotion, Lily ventures into the most isolated areas of the mountains to collect the songs and finds herself increasingly enchanted - not only by the rugged purity of the music, but also by the raw courage and endurance of the local people as they carve out meaningful lives against the harshest conditions. It is not, however, until she meets Tom - a handsome, hardened war veteran and talented musician - that she's forced to examine her motivations. Is the \"Songcatcher,\" as Tom insists, no better than the men who exploit the people and extort their land?", "genres": ["Drama", "Music"], "imdb": {"id": 210299, "rating": 7.2, "votes": 2710}, "languages": ["English"], "lastupdated": "2015-08-21 00:41:12.563000000", "metacritic": 63, "num_mflix_comments": 1, "plot": "After being denied a promotion at the university where she teaches, Doctor Lily Penleric, a brilliant musicologist, impulsively visits her sister, who runs a struggling rural school in ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTYwODg2OTUyNV5BMl5BanBnXkFtZTcwMjY2NTc0MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 996192000000, "runtime": 109, "title": "Songcatcher", "tomatoes": {"boxOffice": "$1.6M", "consensus": "The story may be a bit too melodramatic, but great performances abound in Songcatcher. The real reason to see the movie, however, is the hypnotic music.", "critic": {"meter": 74, "numReviews": 88, "rating": 6.3}, "dvd": 1003795200000, "fresh": 65, "lastUpdated": 1442340809000, "production": "Lions Gate", "rotten": 23, "viewer": {"meter": 78, "numReviews": 2432, "rating": 3.6}, "website": "http://www.songcatcherthefilm.com"}, "type": "movie", "writers": ["Maggie Greenwald"], "year": 2000}