{"_id": "573a13b8f29313caabd4cc42", "awards": {"nominations": 4, "text": "4 wins & 4 nominations.", "wins": 4}, "cast": ["Bradley Cooper", "Leslie Bibb", "Brooke Shields", "Vinnie Jones"], "countries": ["USA"], "directors": ["Ryèhei Kitamura"], "fullplot": "The photographer Leon lives with his girlfriend and waitress Maya waiting for a chance to get in the photo business. When Maya contacts their friend Jurgis, he schedules a meeting for Leon with the successful owner of arts gallery Susan Hoff; she analyzes Leon's work and asks him to improve the quality of his photos. During the night, the upset Leon decides to wander on the streets taking pictures with his camera, and he follows three punks down to the subway station; when the gang attacks a young woman, Leon defends her and the guys move on. On the next morning, Leon discovers that the woman is missing. He goes to the police station, but Detective Lynn Hadley does not give much attention to him and discredits his statement. Leon becomes obsessed to find what happened with the stranger and he watches the subway station. When he sees the elegant butcher Mahogany in the train, Leon believes he might be a murderer and stalks him everywhere, in the beginning of his journey to the darkness.", "genres": ["Horror", "Thriller"], "imdb": {"id": 805570, "rating": 6.2, "votes": 44685}, "languages": ["English"], "lastupdated": "2015-08-20 00:14:05.703000000", "metacritic": 58, "plot": "A photographer, Leon's obsessive pursuit of dark subject matter leads him into the path of a serial killer, Mahogany, the subway murderer who stalks late night commuters, ultimately butchering them in the most gruesome ways imaginable.", "poster": "https://m.media-amazon.com/images/M/MV5BMTEwNTk0NDUwNDdeQTJeQWpwZ15BbWU3MDQ3NzcyNjE@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1218067200000, "runtime": 100, "title": "The Midnight Meat Train", "tomatoes": {"boxOffice": "$34.4k", "consensus": "A creative and energetic adaptation of a Clive Barker short story, with enough scares and thrills to be a potential cult classic.", "critic": {"meter": 71, "numReviews": 28, "rating": 6.2}, "dvd": 1234828800000, "fresh": 20, "lastUpdated": 1442252797000, "production": "Lionsgate Films", "rotten": 8, "viewer": {"meter": 50, "numReviews": 142881, "rating": 3.1}, "website": "http://www.midnightmeattrainthemovie.com/"}, "type": "movie", "writers": ["Jeff Buhler (screenplay)", "Clive Barker (short story \"The Midnight Meat Train\")"], "year": 2008}