{"_id": "573a1393f29313caabcde47a", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Toshirè Mifune", "Takashi Shimura", "Miki Sanjè", "Kenjiro Uemura"], "countries": ["Japan"], "directors": ["Akira Kurosawa"], "fullplot": "In 1944, in WWII, Dr. Kyoji Fujisaki cuts his finger with the scalpel during a surgery in a field hospital and is infected by spirochete from his patient Susumu Nakada. After the blood test, he realizes that he has contracted syphilis, but he does not have the necessary medicine to treat the disease. He advises Nakada to seek medical treatment for his disease. In 1946, after the war, he breaks off his six years engagement with his beloved fiancèe Misao Matsumoto but he does not tell the truth but lets her go and find another man to get married. The hopeless apprentice, nurse Rui Minegishi, witnesses Kioji injecting Salvarsan to treat his syphilis, and first she misunderstands why the doctor is sick. Later, after discovering the truth about his disease, she changes her behavior and becomes the confident listener of the doctor's inner feelings. When Kyoji accidentally meets Nakada in the police station of his town and finds that his wife is pregnant, he warns the reckless man about the risk of his lack of responsibility to his wife and baby.", "genres": ["Drama"], "imdb": {"id": 41870, "rating": 7.5, "votes": 1700}, "languages": ["Japanese"], "lastupdated": "2015-09-02 00:14:20.680000000", "num_mflix_comments": 1, "plot": "A surgeon gets syphilis from a patient when he cuts himself during an operation. The doctor's life is destroyed, but unlike the patient, he doesn't destroy others along with him.", "poster": "https://m.media-amazon.com/images/M/MV5BZjU2N2Y4NTQtNWU1Yi00YmUyLThlZTEtMTBlYThmN2JlZTQ4XkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_SY1000_SX677_AL_.jpg", "released": 312768000000, "runtime": 95, "title": "The Quiet Duel", "tomatoes": {"dvd": 1158624000000, "lastUpdated": 1437418537000, "viewer": {"meter": 72, "numReviews": 756, "rating": 3.7}}, "type": "movie", "writers": ["Kazuo Kikuta (play)", "Akira Kurosawa", "Senkichi Taniguchi"], "year": 1949}