{"_id": "573a13c3f29313caabd6ad93", "awards": {"nominations": 14, "text": "10 wins & 14 nominations.", "wins": 10}, "cast": ["Tio Hardiman", "Ameena Matthews", "Toya Batey", "Cobe Williams"], "countries": ["USA"], "directors": ["Steve James"], "fullplot": "The Interrupters tells the moving and surprising stories of three Violence Interrupters who try to protect their Chicago communities from the violence they once employed. From acclaimed director Steve James and bestselling author Alex Kotlowitz, this film is an unusually intimate journey into the stubborn, persistence of violence in our cities. Shot over the course of a year out of Kartemquin Films, The Interrupters captures a period in Chicago when it became a national symbol for the violence in our cities. During that period, the city was besieged by high-profile incidents, most notably the brutal beating of Derrion Albert, a Chicago High School student, whose death was caught on videotape. The film's main subjects work for an innovative organization, CeaseFire, which believes that the spread of violence mimics the spread of infectious diseases, and so the treatment should be similar: go after the most infected, and stop the infection at its source. The singular mission of the \"Violence Interrupters\" - who have credibility on the streets because of their own personal histories -- is to intervene in conflicts before they explode into violence. In The Interrupters, Ameena Matthews, whose father is Jeff Fort, one of the city's most notorious gang leaders, was herself a drug ring enforcer. But having children and finding solace in her Muslim faith pulled her off the streets and grounded her. In the wake of Derrion Albert's death, Ameena becomes a close confidante to his mother, and helps her through her grieving. Ameena, who is known among her colleagues for her fearlessness, befriends a feisty teenaged girl who reminds her of herself at that age. The film follows that friendship over the course of many months, as Ameena tries to nudge the troubled girl in the right direction. Cobe Williams, scarred by his father's murder, was in and out of prison, until he had had enough. His family - particularly a young son - helped him find his footing. Cobe disarms others with his humor and his general good nature. His most challenging moment comes when he has to confront a man so bent on revenge that Cobe has to pat him down to make sure he's put away his gun. Like Ameena, he gets deeply involved in the lives of those he encounters, including a teenaged boy just out of prison and a young man from his old neighborhood who's squatting in a foreclosed home. Eddie Bocanegra is haunted by a murder he committed when he was seventeen. His CeaseFire work is a part of his repentance for what he did. Eddie is most deeply disturbed by the aftereffects of the violence on children, and so he spends much of his time working with younger kids in an effort to both keep them off the streets and to get support to those who need it - including a 16-year-old girl whose brother died in her arms. Soulful and empathic, Eddie, who learned to paint in prison, teaches art to children, trying to warn them of the debilitating trauma experienced by those touched by the violence. The Interrupters follows Ameena, Cobe and Eddie as they go about their work, and while doing so reveals their own inspired journeys of hope and redemption. The film attempts to make sense of what CeaseFire's Tio Hardiman calls, simply, \"the madness\".", "genres": ["Documentary", "Crime"], "imdb": {"id": 1319744, "rating": 7.5, "votes": 2974}, "languages": ["English"], "lastupdated": "2015-09-16 13:00:59.003000000", "metacritic": 86, "num_mflix_comments": 2, "plot": "A year in the life of a city grappling with urban violence.", "poster": "https://m.media-amazon.com/images/M/MV5BMjI3MjM0ODcxOV5BMl5BanBnXkFtZTcwOTg1MjIwNg@@._V1_SY1000_SX677_AL_.jpg", "rated": "UNRATED", "released": 1313107200000, "runtime": 125, "title": "The Interrupters", "tomatoes": {"boxOffice": "$0.3M", "consensus": "Impeccably crafted and edited, The Interrupters is a tough and honest documentary about street violence that truly has the power to inspire change.", "critic": {"meter": 99, "numReviews": 85, "rating": 8.3}, "dvd": 1329091200000, "fresh": 84, "lastUpdated": 1439921810000, "production": "Cinema Guild", "rotten": 1, "viewer": {"meter": 82, "numReviews": 5318, "rating": 4}, "website": "http://interrupters.kartemquin.com/"}, "type": "movie", "writers": ["Alex Kotlowitz (New York Times magazine article)"], "year": 2011}