{"_id": "573a13b8f29313caabd4d806", "awards": {"nominations": 9, "text": "Won 1 Oscar. Another 6 wins & 9 nominations.", "wins": 7}, "cast": ["Karl Markovics", "August Diehl", "Devid Striesow", "Martin Brambach"], "countries": ["Austria", "Germany"], "directors": ["Stefan Ruzowitzky"], "fullplot": "The Counterfeiters is the true story of the largest counterfeiting operation in history, set up by the Nazis in 1936. Salomon \"Sally\" Sorowitsch is the king of counterfeiters. He lives a mischievous life of cards, booze, and women in Berlin during the Nazi-era. Suddenly his luck runs dry when arrested by Superintendent Friedrich Herzog. Immediately thrown into the Mauthausen concentration camp, Salomon exhibits exceptional skills there and is soon transferred to the upgraded camp of Sachsenhausen. Upon his arrival, he once again comes face to face with Herzog, who is there on a secret mission. Hand-picked for his unique skill, Salomon and a group of professionals are forced to produce fake foreign currency under the program Operation Bernhard. The team, which also includes detainee Adolf Burger, is given luxury barracks for their assistance. But while Salomon attempts to weaken the economy of Germany's allied opponents, Adolf refuses to use his skills for Nazi profit and would like to do something to stop Operation Bernhard's aid to the war effort. Faced with a moral dilemma, Salomon must decide whether his actions, which could prolong the war and risk the lives of fellow prisoners, are ultimately the right ones.", "genres": ["Crime", "Drama", "War"], "imdb": {"id": 813547, "rating": 7.6, "votes": 34603}, "languages": ["German", "Russian", "English", "Hebrew"], "lastupdated": "2015-09-01 00:30:29.193000000", "metacritic": 78, "num_mflix_comments": 1, "plot": "The story of the Operation Bernhard, the largest counterfeiting operation in history, carried out by Germany during WWII.", "poster": "https://m.media-amazon.com/images/M/MV5BNDI2NGQwNWItNmRkYy00MzIxLWExMzUtZmU3NTE2NDQ5NzEzXkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1208476800000, "runtime": 98, "title": "The Counterfeiters", "tomatoes": {"boxOffice": "$5.4M", "consensus": "The Counterfeiters is a gripping account of one prisoner's moral dilemma, superbly portrayed by Karl Markovics.", "critic": {"meter": 94, "numReviews": 121, "rating": 7.7}, "dvd": 1217894400000, "fresh": 114, "lastUpdated": 1440440956000, "production": "Sony Pictures Classics", "rotten": 7, "viewer": {"meter": 88, "numReviews": 20949, "rating": 3.9}, "website": "http://www.sonyclassics.com/thecounterfeiters/"}, "type": "movie", "writers": ["Adolf Burger (book)", "Stefan Ruzowitzky (screenplay)"], "year": 2007}