{"_id": "573a13a7f29313caabd1a274", "awards": {"nominations": 2, "text": "7 wins & 2 nominations.", "wins": 7}, "cast": ["Tadanobu Asano", "Nao èmori", "Shin'ya Tsukamoto", "Paulyn Sun"], "countries": ["Japan"], "directors": ["Takashi Miike"], "fullplot": "When a Yakuza boss named Anjo disappears with 300 million yen, his chief henchman, a sadomasochistic man named Kakihara, and the rest of his mob goons go looking for him. After capturing and torturing a rival Yakuza member looking for answers, they soon realize they have the wrong man and begin looking for the man named Jijii who tipped them off in the first place. Soon enough Kakihara and his men encounter Ichi, a psychotic, sexually-repressed young man with amazing martial arts abilities and blades that come out of his shoes. One by one Ichi takes out members of the Yakuza and all the while Kakihara intensifies his pursuit of Ichi and Ichi's controller Jijii. What will happen as the final showdown happens between the tortured and ultra-violent Ichi and the pain-craving Kakihara?", "genres": ["Action", "Comedy", "Crime"], "imdb": {"id": 296042, "rating": 7.1, "votes": 40329}, "languages": ["Japanese", "Cantonese", "English"], "lastupdated": "2015-09-10 17:49:43.467000000", "metacritic": 50, "num_mflix_comments": 2, "plot": "As sadomasochistic yakuza enforcer Kakihara searches for his missing boss he comes across Ichi, a repressed and psychotic killer who may be able to inflict levels of pain that Kakihara has only dreamed of.", "poster": "https://m.media-amazon.com/images/M/MV5BNDZmOWE3M2YtMDNkNC00YzFmLTljZTItNTk3NTlkODIxNGE3XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1027555200000, "runtime": 129, "title": "Ichi the Killer", "tomatoes": {"consensus": "Ichi The Killer is a thoroughly shocking gorefest that will surely entertain those with strong stomachs and a penchant for brutal violence.", "critic": {"meter": 64, "numReviews": 36, "rating": 6.2}, "dvd": 1069113600000, "fresh": 23, "lastUpdated": 1440185004000, "rotten": 13, "viewer": {"meter": 82, "numReviews": 49475, "rating": 3.8}}, "type": "movie", "writers": ["Hideo Yamamoto (comic)", "Sakichi Satè (screenplay)"], "year": 2001}