{"_id": "573a1399f29313caabcedbb6", "awards": {"nominations": 10, "text": "1 win & 10 nominations.", "wins": 1}, "cast": ["Robert Downey Jr.", "Charles Grodin", "Alfre Woodard", "Kyra Sedgwick"], "countries": ["USA"], "directors": ["Ron Underwood"], "fullplot": "In 1959, in San Francisco, the telephone operator Penny Washington leaves her three children to work in her night shift. The shy singer Harrison Winslow is afraid of the stage and quits his audition. The waitress Julia is proposed by her boyfriend and she does not accept; then she regrets and leaves her job to seek him out. The smalltime thief Milo Peck tries to retrieve a collection of stamps that he had stolen from a boy. They embark in a bus and the driver Hal distracts while driving and has a serious accident, and driver and passengers die. Meanwhile, Frank Reilly is driving his pregnant wife Eva Reilly to the hospital. Frank successfully escapes from the bus but Eva is nervous and delivers her baby in the car. The souls of the four passengers become the guardian angels and the invisible friends of the boy Thomas Reilly. Seven years later, Penny, Julia, Harrison and Milo conclude that they are harming the boy and they decide to become invisible also to him. Thirty and something years later, Hal returns with his bus to take them four and the quartet learns that they had all those years to resolve the issues of their lives. They ask Hal to stall and give some more time for them to resolve their unfinished lives and they decide to come back to Thomas, who is now a tough businessman and indecisive in his relationship with girlfriend Anne, and ask him to help them to resolve their issues and become free souls. In the end, Thomas also becomes a better man.", "genres": ["Comedy", "Drama", "Fantasy"], "imdb": {"id": 107091, "rating": 6.9, "votes": 12298}, "languages": ["English"], "lastupdated": "2015-07-31 00:04:37.753000000", "num_mflix_comments": 1, "plot": "A businessman is reunited with the four lost souls who were his guardian angels during childhood, all with a particular purpose to joining the afterlife.", "poster": "https://m.media-amazon.com/images/M/MV5BZTQ4NGEzZjQtNzI3Mi00NjhiLWI0M2QtYTNkMmFkMTA2ZmQ5XkEyXkFqcGdeQXVyNDk3NzU2MTQ@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 745200000000, "runtime": 104, "title": "Heart and Souls", "tomatoes": {"critic": {"meter": 55, "numReviews": 22, "rating": 5.4}, "dvd": 911260800000, "fresh": 12, "lastUpdated": 1442083147000, "production": "MCA Universal Home Video", "rotten": 10, "viewer": {"meter": 76, "numReviews": 19417, "rating": 3.4}, "website": "http://www.heartandsoulfilm.org/"}, "type": "movie", "writers": ["Gregory Hansen (short film)", "Gregory Hansen (screen story)", "Erik Hansen (screen story)", "Brent Maddock (screen story)", "S.S. Wilson (screen story)", "Brent Maddock (screenplay)", "S.S. Wilson (screenplay)", "Gregory Hansen (screenplay)", "Erik Hansen (screenplay)"], "year": 1993}