{"_id": "573a1395f29313caabce3157", "awards": {"nominations": 12, "text": "Won 5 Oscars. Another 18 wins & 12 nominations.", "wins": 23}, "cast": ["Sidney Poitier", "Rod Steiger", "Warren Oates", "Lee Grant"], "countries": ["USA"], "directors": ["Norman Jewison"], "fullplot": "Detective Virgil Tibbs is caught up in the racial tension of the US South when he is arrested after the murder of a prominent businessman. Tibbs was simply waiting for his next train at the station in Sparta, Mississippi and the confusion is soon resolved but when local police chief Gillespie learns that Tibbs is the Philadelphia PD's number one homicide expert, he reluctantly asks for his assistance. The murdered man, Mr. Colbert, had come to Sparta from the North to build a new factory and his wife and business associates immediately point the finger at Endicott, the most powerful man in the county and the one who had the most to lose if a major new employer comes to the area. Tibbs' life is clearly in danger but he perseveres in a highly charged and racially explosive environment until the killer is found.", "genres": ["Crime", "Drama", "Mystery"], "imdb": {"id": 61811, "rating": 8, "votes": 45143}, "languages": ["English"], "lastupdated": "2015-08-21 00:15:34.407000000", "num_mflix_comments": 5, "plot": "An African American police detective is asked to investigate a murder in a racially hostile southern town.", "poster": "https://m.media-amazon.com/images/M/MV5BZjZhZTZkNWItZGE1My00MTRkLWI2ZDktMWZkZTIxZWYxOTgzXkEyXkFqcGdeQXVyNDY2MTk1ODk@._V1_SY1000_SX677_AL_.jpg", "rated": "APPROVED", "released": -69984000000, "runtime": 109, "title": "In the Heat of the Night", "tomatoes": {"consensus": "Tense, funny, and thought-provoking all at once, and lifted by strong performances from Sydney Poitier and Rod Steiger, director Norman Jewison's look at murder and racism in small-town America continues to resonate today.", "critic": {"meter": 95, "numReviews": 39, "rating": 8.1}, "dvd": 978998400000, "fresh": 37, "lastUpdated": 1442436949000, "production": "MGM", "rotten": 2, "viewer": {"meter": 92, "numReviews": 22512, "rating": 3.9}}, "type": "movie", "writers": ["Stirling Silliphant (screenplay)", "John Ball (based on a novel by)"], "year": 1967}