{"_id": "573a13a3f29313caabd0f1bc", "awards": {"nominations": 1, "text": "5 wins & 1 nomination.", "wins": 5}, "cast": ["Lars Rudolph", "Peter Fitz", "Hanna Schygulla", "Jènos Derzsi"], "countries": ["Hungary", "Italy", "Germany", "France"], "directors": ["Bèla Tarr", "ègnes Hranitzky"], "fullplot": "This story takes place in a small town on the Hungarian Plain. In a provincial town, which is surrounded with nothing else but frost. It is bitterly cold weather - without snow. Even in this bewildered cold hundreds of people are standing around the circus tent, which is put up in the main square, to see - as the outcome of their wait - the chief attraction, the stuffed carcass of a real whale. The people are coming from everywhere. From the neighboring settlings, even from quite far away parts of the country. They are following this clumsy monster as a dumb, faceless, rag-wearing crowd. This strange state of affairs - the appearance of the foreigners, the extreme frost - disturbs the order of the small town. Aambitious personages of the story feel they can take advantage of this situation. The tension growing to the unbearable is brought to explosion by the figure of the Prince, who is pretending facelessness. Even his mere appearance is enough to break loose destructive emotions...", "genres": ["Drama", "Mystery"], "imdb": {"id": 249241, "rating": 8.2, "votes": 7859}, "languages": ["Hungarian", "Slovak"], "lastupdated": "2015-08-28 00:41:14.063000000", "metacritic": 92, "num_mflix_comments": 1, "plot": "This story takes place in a small town on the Hungarian Plain. In a provincial town, which is surrounded with nothing else but frost. It is bitterly cold weather - without snow. Even in ...", "poster": "https://m.media-amazon.com/images/M/MV5BYTdjODhmNTYtNjEwOS00NDY5LTgxYjEtOGJhNGQ2MjlkNGIzXkEyXkFqcGdeQXVyNzAyMzY2NDk@._V1_SY1000_SX677_AL_.jpg", "released": 980985600000, "runtime": 145, "title": "Werckmeister Harmonies", "tomatoes": {"consensus": "Mesmerizingly lovely and thematically thought-provoking, Werckmeister Harmonies adds another indelible achievement to Bela Tarr's fascinating filmography.", "critic": {"meter": 97, "numReviews": 39, "rating": 8.5}, "dvd": 1141084800000, "fresh": 38, "lastUpdated": 1438371514000, "production": "Menemsha", "rotten": 1, "viewer": {"meter": 91, "numReviews": 4589, "rating": 4.3}}, "type": "movie", "writers": ["Lèszlè Krasznahorkai (novel)", "Lèszlè Krasznahorkai (screenplay)", "Bèla Tarr (screenplay)", "Pèter Dobai (additional dialogue)", "Gyuri Dèsa Kiss (additional dialogue)", "Gyèrgy Fehèr (additional dialogue)"], "year": 2000}