{"_id": "573a13c7f29313caabd73a78", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Elizabeth Canner", "Darby Stephens", "Virgil Place", "Leland Wilson"], "countries": ["USA"], "directors": ["Elizabeth Canner"], "fullplot": "Filmmaker Liz Canner takes a job editing erotic videos for a drug trial for a pharmaceutical company. Her employer is developing what they hope will be the first Viagra drug for women that wins FDA approval to treat a new disease: Female Sexual Dysfunction (FSD). Liz gains permission to film the company for her own documentary. Initially, she plans to create a movie about science and pleasure but she soon begins to suspect that her employer, along with a cadre of other medical companies, might be trying to take advantage of women (and potentially endanger their health) in pursuit of billion dollar profits. ORGASM INC. is a powerful look inside the medical industry and the marketing campaigns that are literally and figuratively reshaping our everyday lives around health, illness, desire -- and that ultimate moment: orgasm.", "genres": ["Documentary"], "imdb": {"id": 1439562, "rating": 6.1, "votes": 418}, "languages": ["English"], "lastupdated": "2015-09-13 00:34:32.583000000", "metacritic": 64, "num_mflix_comments": 1, "plot": "Extraordinary behind-the-scenes access reveals a drug company's fevered race to develop the first FDA-approved Viagra for women - and offers a humorous but sobering look inside the cash-fueled pharmaceutical industry.", "poster": "https://m.media-amazon.com/images/M/MV5BMTg1NDIyMjQ4OV5BMl5BanBnXkFtZTcwNDkyMzY0NA@@._V1_SY1000_SX677_AL_.jpg", "released": 1297382400000, "runtime": 73, "title": "Orgasm Inc.", "tomatoes": {"boxOffice": "$47.6k", "critic": {"meter": 86, "numReviews": 21, "rating": 7.6}, "dvd": 1308614400000, "fresh": 18, "lastUpdated": 1437503160000, "production": "Astrea Media", "rotten": 3, "viewer": {"meter": 56, "numReviews": 1016, "rating": 3.3}, "website": "http://www.orgasminc.org/"}, "type": "movie", "year": 2009}