{"_id": "573a13b2f29313caabd39a54", "awards": {"nominations": 9, "text": "12 wins & 9 nominations.", "wins": 12}, "cast": ["Phoebe Kut", "Hollie Lo", "Vivian Wu", "Chit-Man Chan"], "countries": ["Canada"], "directors": ["Julia Kwan"], "fullplot": "Chinese-Canadian Eve Eng was born in 1966, in the year of the fire horse. In Chinese culture, fire horse children are notorious for being troublesome. In 1975, nine year old Eve is looking for some meaning for her life, especially after her mother, May-Lin Eng, miscarries, and her paternal grandmother passes away, the latter event particularly concerning not so much for the event itself but the circumstances leading to the death. The Engs follow traditional Buddhist philosophy, primarily as a cultural tradition. While her husband Frank Eng is away in China dealing with his mother's burial, May-Lin doesn't stop their eldest daughter, Karena Eng, from pursuing knowledge of and eventual faith in Christianity, most specifically Catholicism. May-Lin sees it as a cushion for ensuring a good life and good after-life, as much of Christian teaching follows that of Buddhism anyway. Eve follows in her sister's footsteps. While Karena becomes a devout Catholic to the expense of her Buddhist upbringing, Eve takes whatever she can from wherever she can to apply to her life for it to make sense, often with disastrous or confusing results. It isn't until she comes face to face with the fire horse that life becomes a little more understandable for Eve.", "genres": ["Drama"], "imdb": {"id": 431045, "rating": 7.1, "votes": 513}, "languages": ["English", "Cantonese"], "lastupdated": "2015-06-16 00:40:28.543000000", "num_mflix_comments": 1, "plot": "Chinese-Canadian Eve Eng was born in 1966, in the year of the fire horse. In Chinese culture, fire horse children are notorious for being troublesome. In 1975, nine year old Eve is looking ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTk5MTA1NTAyNF5BMl5BanBnXkFtZTcwMjA1MTE1MQ@@._V1_SY1000_SX677_AL_.jpg", "released": 1136073600000, "runtime": 92, "title": "Eve and the Fire Horse", "tomatoes": {"critic": {"meter": 83, "numReviews": 12, "rating": 7.1}, "dvd": 1185235200000, "fresh": 10, "lastUpdated": 1438022734000, "rotten": 2, "viewer": {"meter": 85, "numReviews": 1570, "rating": 3.8}, "website": "http://www.eveandthefirehorse.com"}, "type": "movie", "writers": ["Julia Kwan"], "year": 2005}