{"_id": "573a1397f29313caabce673f", "awards": {"nominations": 4, "text": "Nominated for 1 Oscar. Another 6 wins & 4 nominations.", "wins": 7}, "cast": ["Art Carney", "Lily Tomlin", "Bill Macy", "Eugene Roche"], "countries": ["USA"], "directors": ["Robert Benton"], "fullplot": "Ira Wells is an aged retired Los Angeles based private investigator, who is slightly overweight, needs to wear a hearing aid, has a bum leg and an ulcer-laden stomach, and can only afford to rent a room in a house as a place to live. He decides to come out of retirement when a still active contemporary, Harry Regan, shows up on his doorstep with a bullet wound to the gut, from which he eventually dies. Ira wants to find out who killed Harry. Ira is contacted by another long-time acquaintance, Charlie Hatter, a self-proclaimed loser and Hollywood hack, about Harry's last case, something about which probably led to Harry's death. Harry's client was Margo Sterling, a former client of Charlie's who is a flaky penniless new-ageist actress/agent/dress maker. She hired Harry to retrieve her missing cat, Winston, who is still being held ransom by an acquaintance named Brian Hemphill. Ira learns from Margo that Brian hired her to transport goods for him, she unconcerned that those goods probably stolen and the drop-off person probably a fence. Brian stole Winston because Margo \"borrowed\" some money from one of those jobs. Ira will also eventually learn that Brian was recently involved in a high profile robbery gone wrong, that resulted in one person dead. With all these things Brian was involved in, Ira has to figure out what would be the reason for someone wanting to kill Harry. As big a problem for loner Ira is Margo, who wants to add another \"/\" to her already large resume, namely that of private investigator partner despite its inherent dangers.", "genres": ["Comedy", "Mystery", "Thriller"], "imdb": {"id": 76301, "rating": 7, "votes": 1302}, "languages": ["English"], "lastupdated": "2015-09-14 23:36:35.213000000", "plot": "A grumpy semi-retired private investigator partners with a quirky female client to catch the people who murdered his partner.", "poster": "https://m.media-amazon.com/images/M/MV5BMWI5MjM4NjQtN2I1OC00NzY4LTliOTQtZmU3Mzc0ODk1MTM5L2ltYWdlXkEyXkFqcGdeQXVyNDkzNTM2ODg@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 236822400000, "runtime": 93, "title": "The Late Show", "tomatoes": {"critic": {"meter": 100, "numReviews": 13, "rating": 8}, "dvd": 1080604800000, "fresh": 13, "lastUpdated": 1442087089000, "production": "Warner Home Video", "rotten": 0, "viewer": {"meter": 78, "numReviews": 1072, "rating": 3.5}}, "type": "movie", "writers": ["Robert Benton"], "year": 1977}