{"_id": "573a13acf29313caabd2944f", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Kirsten Dunst", "Paul Bettany", "Sam Neill", "Jon Favreau"], "countries": ["UK", "France", "USA"], "directors": ["Richard Loncraine"], "fullplot": "Peter Colt, an English tennis player in his thirties whose ranking slipped from 11th to 119th in the world, considers he never really had to fight for anything as his wealthy but all but close family easily put him through studies and allowed him to pursue his tennis ambitions, bravely exchanges jokes with his German sparring partner Dieter Prohl, in a similar position, but feels it's about time to admit he's getting too old to compete with fitter coming men (or boys) and intends, after a last Wimbledon, to take a job with the prestigious tennis club instead. Just then, by accident, he bumps into Lizzie Bradbury, the American rising star of female tennis, falls in love with her and finds her interest in him changes his entire perception, even gives him the strength to win again. But where will it lead them, especially when her overprotective father-manager Dennis Bradbury proves determined to nip their relationship in the bud, believing it detrimental to her career?", "genres": ["Comedy", "Romance", "Sport"], "imdb": {"id": 360201, "rating": 6.3, "votes": 48979}, "languages": ["English", "Italian"], "lastupdated": "2015-09-07 00:26:29.203000000", "metacritic": 59, "plot": "A pro tennis player has lost his ambition and has fallen in rank to 119. Fortunately for him, he meets a young player on the women's circuit who helps him recapture his focus for Wimbledon.", "poster": "https://m.media-amazon.com/images/M/MV5BYzI5NjRiMTMtOGIzYS00N2FlLWI4MWMtM2VkNWMyYTgzNTdhXkEyXkFqcGdeQXVyMjA5MTIzMjQ@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1095379200000, "runtime": 98, "title": "Wimbledon", "tomatoes": {"boxOffice": "$16.8M", "consensus": "A predictable, bland rom-com, but Bettany proves to be an appealing lead.", "critic": {"meter": 60, "numReviews": 144, "rating": 5.9}, "dvd": 1104192000000, "fresh": 87, "lastUpdated": 1440093771000, "production": "Universal Pictures", "rotten": 57, "viewer": {"meter": 57, "numReviews": 95192, "rating": 3}, "website": "http://www.wimbledonmovie.com"}, "type": "movie", "writers": ["Adam Brooks", "Jennifer Flackett", "Mark Levin"], "year": 2004}