{"_id": "573a13b1f29313caabd36698", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Daniela Denby-Ashe", "Richard Armitage", "Tim Pigott-Smith", "Sinèad Cusack"], "countries": ["UK"], "fullplot": "This series operates on many levels. At the heart of the series is the tempestuous relationship between Margaret Hale, a young woman from a southern middle class family who finds herself uprooted to the north, and John Thornton, a formerly poverty-stricken cotton mill owner terrified of losing the viability of his business. Around them are class struggles between the workers and mill owners and ideological struggles between the industrial North and the agrarian South. After moving North, Margaret's father befriends his student Mr. Thornton. Margaret has already formed her opinion of Mr. Thornton independently after seeing him treat his workers harshly. As the series progresses, she and we the audience begin to learn that his strict treatment is due to an overarching concern for his mill and by extension, his employees. John Thornton, on the other hand, is attracted to Margaret's independence and position in society as a well-educated Southerner. As in \"Pride and Prejudice\" the marriage proposal comes in the middle of the series and is rejected by Margaret. Contrary to \"Pride and Prejudice\" it is mirrored in social upheaval as the entire town is brought to its knees by a strike. The latter half of the series is an unraveling of the former misunderstandings ending in a romantic reconciliation which is again mirrored by reconciliation between workers and mill owners.", "genres": ["Drama", "Romance"], "imdb": {"id": 417349, "rating": 9, "votes": 16583}, "languages": ["English"], "lastupdated": "2015-08-13 00:01:17.833000000", "plot": "North and South is a four part adaptation of Elizabeth Gaskell's love story of Margaret Hale, a middle class southerner who is forced to move to the northern town of Milton.", "poster": "https://m.media-amazon.com/images/M/MV5BNjMwZTdjMmQtMzMxOS00Nzc3LWE3NDgtYWM2OTYyYzQxMTA0XkEyXkFqcGdeQXVyMTgxOTIzNzk@._V1_SY1000_SX677_AL_.jpg", "released": 1120262400000, "runtime": 235, "title": "North & South", "tomatoes": {"consensus": "This shocking pre-teen drama manages, through realistic performances and a sense of empathy, to avoid exploitation and instead deliver something honest and haunting.", "critic": {"meter": 73, "numReviews": 77, "rating": 6.7}, "dvd": 1160438400000, "fresh": 56, "lastUpdated": 1442078047000, "production": "IFC Films", "rotten": 21, "viewer": {"meter": 79, "numReviews": 19660, "rating": 3.3}, "website": "http://www.12andholdingmovie.com/"}, "type": "movie", "year": 2004}