{"_id": "573a13a2f29313caabd0ab60", "awards": {"nominations": 1, "text": "6 wins & 1 nomination.", "wins": 6}, "cast": ["Nanako Matsushima", "Miki Nakatani", "Yèko Takeuchi", "Hitomi Satè"], "countries": ["Japan"], "directors": ["Hideo Nakata"], "fullplot": "Reiko Asakawa is researching into a 'Cursed Video' interviewing teenagers about it. When her niece Tomoko dies of 'sudden heart failure' with an unnaturally horrified expression on her face, Reiko investigates. She finds out that some of Tomoko's friends, who had been on a holiday with Tomoko the week before, had died on exactly the same night at the exact same time in the exact same way. Reiko goes to the cabin where the teens had stayed and finds an 'unlabeled' video tape. Reiko watched the tape to discover to her horror it is in fact the 'cursed videotape'. Ex-Husband Ryuji helps Reiko solve the mystery, Reiko makes him a copy for further investigation. Things become more tense when their son Yoichi watches the tape saying Tomoko had told him to. Their discovery takes them to a volcanic island where they discover that the video has a connection to a psychic who died 30 years ago, and her child Sadako...", "genres": ["Horror", "Mystery", "Thriller"], "imdb": {"id": 178868, "rating": 7.3, "votes": 47211}, "languages": ["Japanese"], "lastupdated": "2015-08-30 21:37:03.600000000", "num_mflix_comments": 1, "plot": "Ruthlessly murdered by her father, the ghost of a seer's daughter kills all those who watch a wired video after 7 days; unless the viewer finds the escape clause.", "poster": "https://m.media-amazon.com/images/M/MV5BYTA0ZmE4NWUtNTgzZS00ZmE0LWFlNjItNzFkMWVmOGQxNGY3L2ltYWdlXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "UNRATED", "released": 886204800000, "runtime": 96, "title": "Ring", "tomatoes": {"consensus": "Ringu combines supernatural elements with anxieties about modern technology in a truly frightening and unnerving way.", "critic": {"meter": 97, "numReviews": 36, "rating": 7.6}, "dvd": 1046736000000, "fresh": 35, "lastUpdated": 1441995375000, "rotten": 1, "viewer": {"meter": 81, "numReviews": 46006, "rating": 3.6}}, "type": "movie", "writers": ["Hiroshi Takahashi (screenplay)", "Kèji Suzuki (novel)"], "year": 1998}