{"_id": "573a13cbf29313caabd80f9a", "awards": {"nominations": 3, "text": "1 win & 3 nominations.", "wins": 1}, "cast": ["Britt Robertson", "Samuel Levi", "Gregg Sulkin", "Joey Pollari"], "countries": ["USA"], "directors": ["Stuart Gillard"], "fullplot": "Allie Pennington, the daughter of two Knights-of-the-Round-Table scholars, begins classes at Avalon High where, new to the area, she slowly discovers herself involved in the prophecy of King Arthur's reincarnation. Her being there is no accident. The Order of the Bear, an ancient secret society awaiting Arthur's return, may be at hand, and Allie's own parents, if not members of the Order, are at least Order wannabes. Allie becomes quickly linked to two classmates: Will, the school's revered pretty-boy quarterback (whose girlfriend is having relations on the side with his best friend, and whose dark, brooding step-brother lurks about threateningly), is the most obvious Arthur candidate. Miles, the observant and witty school geek, suffers psychic flashes that always prove true and may be the reincarnation of Merlin. As the Arthur prophecy seems to indeed be unfolding before her, Allie finds herself in the protectorate role, guarding Will against the forces of Mordred who're out to destroy Arthur at his every appearance down the centuries, whose destruction would plunge the world into another Dark Age.", "genres": ["Drama", "Family", "Fantasy"], "imdb": {"id": 1614950, "rating": 5.7, "votes": 3288}, "languages": ["English"], "lastupdated": "2015-09-13 00:04:41.813000000", "num_mflix_comments": 3, "plot": "A teenage girl moves to a new high school where she slowly discovers herself involved in the reincarnation of King Arthur.", "poster": "https://m.media-amazon.com/images/M/MV5BZTM4MmQyOTItOGZhYi00ZWMzLTgyMWMtNDIwZTM2NGJkYzAxXkEyXkFqcGdeQXVyNDgyODgxNjE@._V1_SY1000_SX677_AL_.jpg", "released": 1289520000000, "title": "Avalon High", "type": "movie", "writers": ["Julie Sherman Wolfe (teleplay)", "Amy Talkington (teleplay)", "Meg Cabot (novel)"], "year": 2010}