{"_id": "573a13c7f29313caabd74357", "awards": {"nominations": 1, "text": "1 win & 1 nomination.", "wins": 1}, "cast": ["Shareefa Daanish", "Julie Estelle", "Ario Bayu", "Sigi Wimala"], "countries": ["Singapore", "Indonesia"], "directors": ["Kimo Stamboel", "Timo Tjahjanto"], "fullplot": "Two newly weds Adjie and Astrid, along with 3 of their best friends decided to have an interstate road trip as a last attempt to reconcile Adjie with his estranged little sister Ladya. Their trip is however abruptly interrupted when they run into Maya, a strange girl out of nowhere, who wanders aimlessly into their path. \"I've been robbed\" is all she has to say. The friends unanimously decided to give her a ride to her isolated house by the end of the woods. Maya introduces Adjie and friends to her blue-blooded mother Dara, a woman of ageless enigma and few spoken words. Dara insists that their kindness should be repaid with a dinner feast. This is where the night turns into a crimson-hell for the 6 friends, who find themselves trapped and hunted down by Dara and her cult-like family of her three deadly protègès, born and raised to systematically eliminate unsuspecting passers-by for one nefarious reason. Slaughtered one by one, everybody will bleed, the darkest of nights never looked so red.", "genres": ["Horror"], "imdb": {"id": 1447791, "rating": 6.5, "votes": 1639}, "languages": ["Indonesian"], "lastupdated": "2015-08-06 00:03:54.240000000", "num_mflix_comments": 2, "plot": "Two newly weds Adjie and Astrid, along with 3 of their best friends decided to have an interstate road trip as a last attempt to reconcile Adjie with his estranged little sister Ladya. ...", "poster": "https://m.media-amazon.com/images/M/MV5BMjE4MDU1MTg4Nl5BMl5BanBnXkFtZTgwMjI5NDE2MDE@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 1383264000000, "runtime": 95, "title": "Macabre", "tomatoes": {"lastUpdated": 1442347485000, "production": "Salient Media", "viewer": {"meter": 57, "numReviews": 164, "rating": 3.2}}, "type": "movie", "writers": ["Kimo Stamboel", "Timo Tjahjanto"], "year": 2009}