{"_id": "573a13d6f29313caabd9e93c", "awards": {"nominations": 2, "text": "2 wins & 2 nominations.", "wins": 2}, "cast": ["Dannis Hackney", "Bobby Hackney", "David Hackney", "Robbie Duncan"], "countries": ["USA"], "directors": ["Mark Christopher Covino", "Jeff Howlett"], "fullplot": "Before Bad Brains, the Sex Pistols or even the Ramones, there was a band called Death. Punk before punk existed, three teenage brothers in the early '70s formed a band in their spare bedroom, began playing a few local gigs and even pressed a single in the hoped of getting signed. But this was the era of Motown and emerging disco. Record companies found Death's music - and band name - too intimidating, and the group were never given a fair shot, disbanding before they even completed one album. Equal parts electrifying rockumentary and epic family love story, A Band Called Death chronicles the incredible fairy-tale journey of what happened almost three decades later, when a dusty 1974 demo tape made it way out of the attic and found an audience several generations younger. Playing music impossible ahead of its time, Death is now being credited as the first black punk band (hell...the first punk band!), and are finally receiving their long overdue recognition as true rock pioneers.", "genres": ["Documentary", "Biography", "Music"], "imdb": {"id": 2064713, "rating": 7.5, "votes": 2561}, "languages": ["English"], "lastupdated": "2015-08-26 00:16:47.070000000", "metacritic": 77, "plot": "A documentary on the 1970s punk trio Death, and their new-found popularity decades after they disbanded.", "poster": "https://m.media-amazon.com/images/M/MV5BMTU1NjAzMjc1M15BMl5BanBnXkFtZTcwOTk4NDY0OQ@@._V1_SY1000_SX677_AL_.jpg", "released": 1372377600000, "runtime": 96, "title": "A Band Called Death", "tomatoes": {"boxOffice": "$0.1M", "consensus": "A Band Called Death is not only a fascinating portrait of a pioneering rock group, but also a tribute to family ties and perseverance in the face of hardship.", "critic": {"meter": 94, "numReviews": 48, "rating": 7.7}, "dvd": 1376352000000, "fresh": 45, "lastUpdated": 1440965498000, "production": "Drafthouse Films", "rotten": 3, "viewer": {"meter": 85, "numReviews": 5135, "rating": 4}, "website": "http://drafthousefilms.com/film/a-ban"}, "type": "movie", "year": 2012}