{"_id": "573a13c2f29313caabd671b9", "awards": {"nominations": 6, "text": "1 win & 6 nominations.", "wins": 1}, "cast": ["Henry Cavill", "Mickey Rourke", "Stephen Dorff", "Freida Pinto"], "countries": ["USA"], "directors": ["Tarsem Singh"], "fullplot": "Eons after the Gods won their mythic struggle against the Titans, a new evil threatens the land. Mad with power, King Hyperion (Mickey Rourke) has declared war against humanity. Amassing a bloodthirsty army of soldiers disfigured by his own hand, Hyperion has scorched Greece in search of the legendary Epirus Bow, a weapon of unimaginable power forged in the heavens by Ares. Only he who possesses this bow can unleash the Titans, who have been imprisoned deep within the walls of Mount Tartaros since the dawn of time and thirst for revenge. In the king's hands, the bow would rain destruction upon mankind and annihilate the Gods. But ancient law dictates the Gods must not intervene in man's conflict. They remain powerless to stop Hyperion...until a peasant named Theseus (Henry Cavill) comes forth as their only hope. Secretly chosen by Zeus, Theseus must save his people from Hyperion and his hordes. Rallying a band of fellow outsiders - including visionary priestess Phaedra (Freida Pinto) and cunning slave Stavros (Stephen Dorff) - one hero will lead the uprising, or watch his homeland fall into ruin and his Gods vanish into legend.", "genres": ["Action", "Drama", "Fantasy"], "imdb": {"id": 1253864, "rating": 6.1, "votes": 130019}, "languages": ["English", "Greek"], "lastupdated": "2015-08-25 00:02:31.040000000", "metacritic": 46, "plot": "Theseus is a mortal man chosen by Zeus to lead the fight against the ruthless King Hyperion, who is on a rampage across Greece to obtain a weapon that can destroy humanity.", "poster": "https://m.media-amazon.com/images/M/MV5BMTMzMjA2MjA2N15BMl5BanBnXkFtZTcwMTkwNTc5Ng@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1320969600000, "runtime": 110, "title": "Immortals", "tomatoes": {"boxOffice": "$83.5M", "consensus": "The melding of real sets, CG work, and Tarsem's signature style produces fireworks, though the same can't be said for Immortals slack, boring storytelling.", "critic": {"meter": 35, "numReviews": 114, "rating": 5}, "dvd": 1330992000000, "fresh": 40, "lastUpdated": 1442083722000, "production": "Relativity Media", "rotten": 74, "viewer": {"meter": 48, "numReviews": 67743, "rating": 3.2}, "website": "http://www.immortalsmovie.com"}, "type": "movie", "writers": ["Charley Parlapanides", "Vlas Parlapanides"], "year": 2011}