{"_id": "573a13b7f29313caabd4a269", "awards": {"nominations": 14, "text": "14 nominations.", "wins": 0}, "cast": ["Adam Sandler", "Kevin James", "Jessica Biel", "Dan Aykroyd"], "countries": ["USA"], "directors": ["Dennis Dugan"], "fullplot": "Chuck Levine and Larry Valentine are friends and Brooklyn firefighting partners. Widower Larry, who still mourns the death of his wife Paula, is having problems changing the beneficiary on his insurance policy from Paula's name to his children's. He is worried about his children's future if he were to be killed in the line of duty, and is contemplating quitting his job for something less risky, but he also does not want to forfeit his firefighter's pension as he also see it as a safety net for his children. Larry saves Chuck's life on one of their calls. So when Chuck tells Larry that he owes him one, Larry takes him up on his offer. Larry's favor: despite both being heterosexual, that they enter into a domestic partnership, in name and paper only, to provide that much needed protection for Larry's children. Chronic womanizer Chuck reluctantly but eventually agrees. The one person who knows for a certainty that they are both straight is their boss, Captain Phineas J. Tucker. Their plan hits a snag when Larry believes that they are being investigated by the pension department for possible fraud, which means that Chuck has to move in with him and his kids. They consult the advice of a lawyer, Alex McDonough, who adds an extra layer of complexity to the situation as Chuck in particular is attracted to her and believes she could be the one and only for him. Her legal advice coupled with her wanting Chuck to be her new best girlfriend makes it even harder on him.", "genres": ["Comedy", "Romance"], "imdb": {"id": 762107, "rating": 6, "votes": 111858}, "languages": ["English"], "lastupdated": "2015-08-20 00:17:33.437000000", "metacritic": 37, "num_mflix_comments": 419, "plot": "Two straight, single Brooklyn firefighters pretend to be a gay couple in order to receive domestic partner benefits.", "poster": "https://m.media-amazon.com/images/M/MV5BMTM4NDQ3NDQ3Nl5BMl5BanBnXkFtZTcwMjE4NjY0MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1184889600000, "runtime": 115, "title": "I Now Pronounce You Chuck & Larry", "tomatoes": {"boxOffice": "$119.7M", "consensus": "Whether by way of inept comedy or tasteless stereotypes, I Now Pronounce You Chuck And Larry falters on both levels.", "critic": {"meter": 14, "numReviews": 156, "rating": 3.6}, "dvd": 1194307200000, "fresh": 22, "lastUpdated": 1442510283000, "production": "Universal Pictures", "rotten": 134, "viewer": {"meter": 69, "numReviews": 1307201, "rating": 3.5}, "website": "http://www.chuckandlarry.com/"}, "type": "movie", "writers": ["Barry Fanaro (screenplay)", "Alexander Payne (screenplay)", "Jim Taylor (screenplay)", "Lew Gallo (treatment)"], "year": 2007}