{"_id": "573a13c1f29313caabd63797", "awards": {"nominations": 7, "text": "16 wins & 7 nominations.", "wins": 16}, "cast": ["Maxim Gaudette", "Sèbastien Huberdeau", "Karine Vanasse", "Martin Watier"], "countries": ["Canada"], "directors": ["Denis Villeneuve"], "fullplot": "On December 6, 1989, a lone gunman walked into Montrèal's ècole Polytechnique, a post-secondary institution focusing primarily in engineering, and began a shooting massacre. This event and its aftermath are shown from the perspective of three people. The first is the shooter himself, who blamed the problems in his life on who he considered feminists, such as female engineering students, who were his primary targets. This event was the culmination of a seven year plan, which had a self-defined end. The second is female mechanical engineering student Valèrie, who earlier that day had an interview for her dream internship, working on an aerospace project. The interview process itself was a disturbing one for her in the stereotypical view by the male interviewer, who did not believe that females could work in the business and still have aspirations to have a family. And the third is Jean-Franèois, Valèrie's friend and fellow mechanical engineering student, who was one of the few who did whatever he could to help the targeted women.", "genres": ["Crime", "Drama", "History"], "imdb": {"id": 1194238, "rating": 7.2, "votes": 4736}, "languages": ["French"], "lastupdated": "2015-08-22 00:15:27.187000000", "metacritic": 61, "num_mflix_comments": 1, "plot": "A dramatization of the Montreal Massacre of 1989 where several female engineering students were murdered by an unstable misogynist.", "poster": "https://m.media-amazon.com/images/M/MV5BMTMwODQ5MzY1Ml5BMl5BanBnXkFtZTcwNTc4MDE1Mg@@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 1262304000000, "runtime": 77, "title": "Polytechnique", "tomatoes": {"critic": {"meter": 85, "numReviews": 13, "rating": 7}, "fresh": 11, "lastUpdated": 1442163672000, "production": "Alliance Atlantis Vivafilm", "rotten": 2, "viewer": {"meter": 72, "numReviews": 1629, "rating": 3.7}}, "type": "movie", "writers": ["Jacques Davidts (scenario and dialogue)", "Denis Villeneuve (collaboration)", "Eric Leca (collaboration)"], "year": 2009}