{"_id": "573a13eff29313caabdd9420", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Alec Owen", "Patton Oswalt", "Paul Prado", "Brian Firenzi"], "countries": ["USA"], "directors": ["Tomm Jacobsen", "Michael Rousselet", "Jon Salmon"], "fullplot": "DUDE BRO PARTY MASSACRE III follows BRENT CHIRINO as he enters the oil-misted halls of the DELTA BI THETA fraternity. Brent isn't just any pledge... he's a legacy. And it's a legacy of death. See, Brent is here to solve the mystery of his identical twin brother BROCK's murder, and he'll do anything to crack the case... even attempt the frat's most daring prank of all time. After the Deltas' senior prank causes two commercial jets to collide over an orphanage, they're punished to a weekend at The Old Sorority House by the Lake. But they're not the only ones there... a mysterious killer named MOTHERFACE lurks nearby. She knows the bros' deepest fears... and she's taking advantage of those fears to pick them off, one by shirtless one, in increasingly gory ways. It's a race against time for Brent to discover the mysteries of his brother's death before Motherface butchers them all!", "genres": ["Comedy", "Horror"], "imdb": {"id": 3699692, "rating": 6.2, "votes": 452}, "languages": ["English"], "lastupdated": "2015-09-05 00:56:23.760000000", "num_mflix_comments": 2, "plot": "In the wake of two back-to-back mass murders on Chico's frat row, loner Brent Chirino must infiltrate the ranks of a popular fraternity to investigate his twin brother's murder at the hands of the serial killer known as \"Motherface.\"", "poster": "https://m.media-amazon.com/images/M/MV5BMTc1MDc4NTg3Nl5BMl5BanBnXkFtZTgwODg4OTc3NTE@._V1_SY1000_SX677_AL_.jpg", "released": 1436227200000, "runtime": 91, "title": "Dude Bro Party Massacre III", "type": "movie", "writers": ["Alec Owen (screenplay)", "Jon Salmon", "Michael E. Peter", "Ben Gigli", "Timothy Ciancio", "Michael Rousselet", "Tomm Jacobsen", "Joey Scoma", "Mike James", "Brian Firenzi"], "year": 2015}