{"_id": "573a13cbf29313caabd81378", "awards": {"nominations": 2, "text": "1 win & 2 nominations.", "wins": 1}, "cast": ["Elon Musk", "Louie Psihoyos", "Jane Goodall", "Leilani Mènter"], "countries": ["USA", "China", "Hong Kong", "Indonesia", "Mexico", "UK"], "directors": ["Louie Psihoyos"], "fullplot": "Scientists predict we may lose half the species on the planet by the end of the century. They believe we have entered the sixth major extinction event in Earth's history. Number five took out the dinosaurs. This era is called the Anthropocene, or 'Age of Man', because the evidence shows that humanity has sparked this catastrophic loss. We are the only ones who can stop it as well. The Oceanic Preservation Society, the group behind the Academy Awardè winning film THE COVE, is back for \"Racing Extinction\". Along with some new innovators, OPS will bring a voice to the thousands of species on the very edge of life. An unlikely team of activists is out to expose the two worlds endangering species across the globe. The first threat to the wild comes from the international trade of wildlife. Bogus markets are being created at the expense of creatures who have survived on this planet for millions of years. The other threat is all around us, hiding in plain sight. There's a hidden world that the oil and gas companies don't want the rest of us to see. Director Louie Psihoyos has concocted an ambitious mission to call attention to our impact on the planet, while inspiring others to embrace the solutions that will ensure a thriving planet for future generations.", "genres": ["Documentary", "Action", "Adventure"], "imdb": {"id": 1618448, "rating": 7.9, "votes": 83}, "languages": ["English"], "lastupdated": "2015-08-24 01:11:30.743000000", "plot": "A documentary that follows undercover activists trying to stave off a man-made mass extinction.", "poster": "https://m.media-amazon.com/images/M/MV5BMTQyNTk0ODU5Ml5BMl5BanBnXkFtZTgwMTc2NzA0NDE@._V1_SY1000_SX677_AL_.jpg", "released": 1422057600000, "runtime": 90, "title": "Racing Extinction", "type": "movie", "writers": ["Mark Monroe"], "year": 2015}