{"_id": "573a13b3f29313caabd3de31", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Stellan Skarsgèrd", "Gabriel Mann", "Clara Bellar", "Billy Crawford"], "countries": ["USA"], "directors": ["Paul Schrader"], "fullplot": "Lankester Merrin is a archaeologist by profession but an ordained Roman Catholic priest who has lost his faith and abandoned his vocation. He is haunted by what he was forced to do in his native Holland during World War II. The church he's excavated in Northern Kenyan dates to the Byzantine period but this puts its construction hundreds of years before Christianity was introduced to the area. the church was buried to the rooftop in sand and as its structure is exposed, a madness slowly descends on the camp. the local tribesmen are prepared to go to war and demand that the church be buried. Soon, two British soldiers are found dead and their commanding officer, Major Granville, shoots a innocent civilian in cold blood. As fear descends upon everyone in the camp, it becomes apparent that a young disabled boy, Cheche, is possessed by the devil forcing Merrin to re-examine his own beliefs.", "genres": ["Drama", "Horror", "Thriller"], "imdb": {"id": 449086, "rating": 5.4, "votes": 7619}, "languages": ["English"], "lastupdated": "2015-09-04 00:13:20.490000000", "metacritic": 55, "plot": "Years before Father Lancaster Merrin helped save Regan MacNeil's soul, he first encounters the demon Pazuzu in East Africa. Merrin's initial battle with Pazuzu leads to the rediscovery of his faith.", "poster": "https://m.media-amazon.com/images/M/MV5BODVlMzg1NDQtNjU3MC00Mjk0LThhN2ItZmVmZGIwMjYyZmYyXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1116547200000, "runtime": 117, "title": "Dominion: Prequel to the Exorcist", "tomatoes": {"boxOffice": "$0.2M", "consensus": "While director Schrader's attempt at a literate, internal exposition on evil temptations and human sin is admirable, this prequel suffers from hit-and-miss psychological tension, poor visual effects, and weak writing -- an overambitious failure of a horror movie.", "critic": {"meter": 30, "numReviews": 46, "rating": 4.7}, "dvd": 1130198400000, "fresh": 14, "lastUpdated": 1440355694000, "production": "Warner Bros.", "rotten": 32, "viewer": {"meter": 25, "numReviews": 17551, "rating": 2.7}}, "type": "movie", "writers": ["William Wisher Jr.", "Caleb Carr"], "year": 2005}