{"_id": "573a1399f29313caabcec06a", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["George O'Hanlon", "Mel Blanc", "Penny Singleton", "Tiffany"], "countries": ["USA"], "directors": ["Joseph Barbera", "William Hanna"], "fullplot": "The Jetsons have made their film debut in a film about family, friends, and all that stuff. George's tightwad boss, Mr. Spacely, is determined to get his remote factor on his ore asteroid miles away to make 1,000,000 sprocketts, but all the vice-presidents sent to run it have disappeared for some reason, so Mr. Spacely must find someone else to run it: it would have to be someone mighty brave, and mighty stupid. So who does he pick? George Jetson. So George packs up his family: Jane, his sensible and loving wife; Judy- his rebellious teenage daughter who's gotten a new boyfriend: a super galactical rock star; Elroy- basketball champ who's losing faith in his father; and Rosie, his sassy maid. So while Judy meets another boy and enjoys a huge shopping mall, George sets off to work with his new friend, a robot foreman named Rudy 2. The factory is soon sabotaged on opening day, so George intends to investigate and disappears. So it's up to Elroy and his new friends to rescue George. Along for the ride are Judy and Jane. A wild futuristic romp on a screen bigger than your TV.", "genres": ["Animation", "Comedy", "Family"], "imdb": {"id": 99878, "rating": 5.5, "votes": 3220}, "languages": ["English"], "lastupdated": "2015-09-13 00:24:56.947000000", "num_mflix_comments": 1, "plot": "George Jetson is forced to uproot his family when Mr. Spacely promotes him to take charge of a new factory on a distant planet.", "poster": "https://m.media-amazon.com/images/M/MV5BMGQ3MGRhZTAtZDEwYy00NjBhLTkzNDktYzY4M2JjZDQxMmRhXkEyXkFqcGdeQXVyMzM4MjM0Nzg@._V1_SY1000_SX677_AL_.jpg", "rated": "G", "released": 647222400000, "runtime": 82, "title": "Jetsons: The Movie", "tomatoes": {"critic": {"meter": 21, "numReviews": 14, "rating": 4.3}, "dvd": 1240876800000, "fresh": 3, "lastUpdated": 1441910653000, "production": "MCA Universal Home Video", "rotten": 11, "viewer": {"meter": 46, "numReviews": 25856, "rating": 3}}, "type": "movie", "writers": ["Dennis Marks", "Carl Sautter (additional dialogue)"], "year": 1990}