{"_id": "573a1395f29313caabce2a1b", "awards": {"nominations": 1, "text": "3 wins & 1 nomination.", "wins": 3}, "cast": ["Pierre ètaix", "Claudine Auger", "Philippe Dionnet", "Luce Klein"], "countries": ["France"], "directors": ["Pierre ètaix"], "fullplot": "A man has everything: dozens of servants, a palace, vast woods, gardens, a lake, mechanical toys, private entertainment troupes of musicians and dancers. He has it all - but love. When alone, he sits at a desk, sighing, and looking at a photograph of a pretty girl. One day, the circus descended onto his palace, and amidst all the fun it brought, he recognized the Amazon on the white horse - the girl in the photograph. The girl is now the mother of a small boy, Yo-Yo, whom she considers that looks like the millionaire, even under a clown's make-up. The boy will spend some time in the palace, in awe of so much riches, but he will leave (in a dream-like scene) on the tusks of the elephant. Time passes - and one day Yo-Yo will be the owner of his father's palace in decay. Starting from scratch, he will rebuilt it, and be praised as a great clown, an artist, a film-maker, a millionaire. Yet, something is amiss...", "genres": ["Comedy", "Drama", "Family"], "imdb": {"id": 59934, "rating": 7.7, "votes": 716}, "languages": ["French"], "lastupdated": "2015-08-11 00:25:30.343000000", "num_mflix_comments": 2, "plot": "A man has everything: dozens of servants, a palace, vast woods, gardens, a lake, mechanical toys, private entertainment troupes of musicians and dancers. He has it all - but love. When ...", "poster": "https://m.media-amazon.com/images/M/MV5BNjg5NWIzYjQtOThlMi00ZjI4LTlmMWMtNjYwZDIyNmQ3OThkXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": -153532800000, "runtime": 92, "title": "Yoyo", "tomatoes": {"lastUpdated": 1438977734000, "viewer": {"meter": 86, "numReviews": 118, "rating": 4.1}}, "type": "movie", "writers": ["Pierre ètaix (scenario and adaptation)", "Jean-Claude Carrière (scenario and adaptation)"], "year": 1965}