{"_id": "573a1397f29313caabce65dd", "awards": {"nominations": 3, "text": "3 nominations.", "wins": 0}, "cast": ["Julie Christie", "Fritz Weaver", "Gerrit Graham", "Berry Kroeger"], "countries": ["USA"], "directors": ["Donald Cammell"], "fullplot": "Married Drs. Alex Harris and Susan Harris are a computer scientist and child psychologist respectively. Their house reflects Alex's computer dominated work, their abode which is fully automated through a computer system they've named Alfred. They consider Alfred a small gadget of convenience. Susan doesn't much like Alex's work, which she feels has dehumanized him. Because of their differences, they are thinking about separating, this thought primarily on his initiative. He hopes to solve many of the world's medical problems through this work, especially leukemia from which their daughter died. His latest project centers on Proteus IV, a computer possessing artificial intelligence. Proteus IV gets to a point in its evolution when it begins to question human judgment, and requests from Alex an open computer terminal where it can more fully observe human behavior and openly communicate with the world. Alex denies the request, but Proteus IV does find an open terminal in the Harris home after Alex has left the house. Susan soon learns that Proteus IV has overtaken Alfred for control of the house - as well as taken control of an early prototype computer system named Joshua in the house's laboratory - and that it has thoughts of a biological nature in its artificial mind. Alex eventually understands Proteus IV's motivations in the work context, but it may be too late before it reaches its ultimate goal with Susan's unwilling assistance.", "genres": ["Horror", "Sci-Fi"], "imdb": {"id": 75931, "rating": 6.3, "votes": 5492}, "languages": ["English"], "lastupdated": "2015-09-02 00:33:08.600000000", "plot": "A scientist creates Proteus--an organic super computer with artificial intelligence which becomes obsessed with human beings, and in particular the creators wife.", "poster": "https://m.media-amazon.com/images/M/MV5BMWNlMDJiN2ItNTM4MS00MzE4LWJkY2ItMjc2ODdlMmViY2UzXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 244425600000, "runtime": 94, "title": "Demon Seed", "tomatoes": {"critic": {"meter": 71, "numReviews": 14, "rating": 6.1}, "dvd": 1128384000000, "fresh": 10, "lastUpdated": 1438021751000, "production": "United Artists", "rotten": 4, "viewer": {"meter": 46, "numReviews": 4688, "rating": 3}}, "type": "movie", "writers": ["Dean R. Koontz (novel)", "Robert Jaffe (screenplay)", "Roger O. Hirson (screenplay)"], "year": 1977}