{"_id": "573a13a4f29313caabd0f574", "awards": {"nominations": 4, "text": "4 nominations.", "wins": 0}, "cast": ["Kirsten Dunst", "Jay Hernandez", "Bruce Davison", "Herman Osorio"], "countries": ["USA"], "directors": ["John Stockwell"], "fullplot": "When fate steps in and brings together two high school seniors from opposite sides of the track, it's something crazy/beautiful in this sexy, fun and energetic story of first love. Nicole (Kirsten Dunst) is the 17-year-old troubled daughter of a wealthy congressman who never met a rule she didn't break. Carlos (Jay Hernandez) is a grade A student with big dreams who endures a two-hour bus ride every morning to attend high school in an upscale L.A. neighbourhood. Their innocent flirtations quickly develop into passionate love, but Nicole's self-destructive behaviour threatens their relationship and puts Carlos' promising future in jeopardy. Will their intense passion keep them together despite the objections of their families or will Carlos be forced to plan his future without Nicole? Surprises lie at every turn in this wildly seductive and critically acclaimed drama.", "genres": ["Drama", "Romance"], "imdb": {"id": 250224, "rating": 6.5, "votes": 20649}, "languages": ["English"], "lastupdated": "2015-09-01 00:04:44.460000000", "metacritic": 61, "num_mflix_comments": 1, "plot": "At Pacific Palisades High, a poor Latino falls hard for a troubled girl from the affluent neighborhood.", "poster": "https://m.media-amazon.com/images/M/MV5BMjE1NTYyMjI0MF5BMl5BanBnXkFtZTYwMTM4Mzc3._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 993772800000, "runtime": 99, "title": "Crazy/Beautiful", "tomatoes": {"boxOffice": "$16.2M", "consensus": "The story is not new, but the film gets credit for trying to move away from the genre's cliches. Kirsten Dunst and newcomer Jay Hernandez give believable performances.", "critic": {"meter": 63, "numReviews": 99, "rating": 5.7}, "dvd": 1005609600000, "fresh": 62, "lastUpdated": 1441905433000, "production": "Touchstone Pictures", "rotten": 37, "viewer": {"meter": 69, "numReviews": 64327, "rating": 3.1}, "website": "http://www.crazybeautiful.com"}, "type": "movie", "writers": ["Phil Hay", "Matt Manfredi"], "year": 2001}