{"_id": "573a1396f29313caabce4e90", "awards": {"nominations": 7, "text": "Nominated for 5 Oscars. Another 8 wins & 7 nominations.", "wins": 13}, "cast": ["Richard Dreyfuss", "Ron Howard", "Paul Le Mat", "Charles Martin Smith"], "countries": ["USA"], "directors": ["George Lucas"], "fullplot": "It's the proverbial end of the summer 1962 in a small southern California town. It's the evening before best friends and recent high school graduates, Curt Henderson and Steve Bolander, are scheduled to leave town to head to college back east. Curt, who received a lucrative local scholarship, is seen as the promise that their class holds. But Curt is having second thoughts about leaving what Steve basically sees as their dead end town. Curt's beliefs are strengthened when he spots an unknown beautiful blonde in a T-bird who mouths the words \"I love you\" to him. As Curt tries to find that blonde while trying to get away from a local gang who have him somewhat hostage, Curt may come to a decision about his immediate future. Outgoing class president Steve, on the other hand, wants to leave, despite meaning that he will leave girlfriend, head cheerleader and Curt's sister, Laurie Henderson, behind. Steve and Laurie spend the evening \"negotiating\" the state of their relationship. Meanwhile, two of their friends cruise around town for the evening. Steve has left his car to meek and mild-mannered Terry \"Toad\" Fields to look after during his absence. The wheels give Toad a new sense of confidence, which he uses to try and impress Debbie Dunham, a more experienced girl generally out of his league. And John Milner, who is seen as the king of the street race in his souped-up yellow deuce coupe, tries to get rid of precocious pre-teen, Carol Morrison, who has somehow become his passenger for the evening, while dealing with the challenge of bold out-of-towner, Bob Falfa.", "genres": ["Comedy", "Drama", "Romance"], "imdb": {"id": 69704, "rating": 7.5, "votes": 59850}, "languages": ["English"], "lastupdated": "2015-09-11 00:00:04.147000000", "plot": "A couple of high school grads spend one final night cruising the strip with their buddies before they go off to college.", "poster": "https://m.media-amazon.com/images/M/MV5BMjI5NjM5MjIyNF5BMl5BanBnXkFtZTgwNjg2MTUxMDE@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 113011200000, "runtime": 110, "title": "American Graffiti", "tomatoes": {"consensus": "One of the most influential of all teen films, American Graffiti is a funny, nostalgic, and bittersweet look at a group of recent high school grads' last days of innocence.", "critic": {"meter": 95, "numReviews": 43, "rating": 8.4}, "dvd": 905817600000, "fresh": 41, "lastUpdated": 1439920906000, "production": "Universal Pictures", "rotten": 2, "viewer": {"meter": 84, "numReviews": 63367, "rating": 3.6}}, "type": "movie", "writers": ["George Lucas", "Gloria Katz", "Willard Huyck"], "year": 1973}