{"_id": "573a13c1f29313caabd65f6e", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Tomorowo Taguchi", "Sarara Tsukifune", "Haruki Ichikawa", "Shunsuke Matsuoka"], "countries": ["Japan"], "directors": ["Daisuke Tengan"], "fullplot": "Its streets overrun with children, the village of Kaname has distinguished itself with the highest birth rate in Japan. Its citizens are excited-tomorrow, the Prime Minister arrives to formally celebrate Kaname's demographic distinction. The spirit is festive, except for one 14-year-old girl. She knows the secret of Kaname's fecundity, and she's typing up a tell-all letter to a prominent journalist, revealing the crazy, complicated tale. It all began 14 years ago... Betrayed and disgraced, big-city reporter Kazuya Mizuno is banished to a desk at Kaname's boring little town newspaper. But Kaname isn't as boring as it seems on the surface. Not with characters around like Shimeko, a girl genius with a childlike lack of propriety, and her ace fisherman/folk-singer dad. Or the overbearing and unpleasant local Shinto priest, a former Christian cultist. Or Endo, Kazuya's new colleague, a bitter drunk after his son's suicide. Or Kin, a former (?) Marxist terrorist, now a hermit on his boat engaging in secret \"research.\" Or perhaps most importantly Teruko, the hypnotically beautiful bar owner, the focus of all manner of innuendo and intrigue. Something mysterious, even mystical, is going on Kaname, and hapless Kazuya is about to be thrown into the middle of it.", "genres": ["Drama"], "imdb": {"id": 1233491, "rating": 7, "votes": 73}, "languages": ["Japanese"], "lastupdated": "2015-07-18 00:11:12.053000000", "num_mflix_comments": 3, "plot": "Its streets overrun with children, the village of Kaname has distinguished itself with the highest birth rate in Japan. Its citizens are excited-tomorrow, the Prime Minister arrives to ...", "released": 1211587200000, "runtime": 160, "title": "The Most Beautiful Night in the World", "tomatoes": {"lastUpdated": 1440268972000, "viewer": {"meter": 50, "numReviews": 55, "rating": 3.1}}, "type": "movie", "writers": ["Daisuke Tengan (screenplay)"], "year": 2008}