{"_id": "573a1393f29313caabcde2c4", "awards": {"nominations": 1, "text": "1 win & 1 nomination.", "wins": 1}, "cast": ["Sam Wanamaker", "Lea Padovani", "Kathleen Ryan", "Charles Goldner"], "countries": ["UK"], "directors": ["Edward Dmytryk"], "fullplot": "One of the few (if any at the time this film was made) films shot in England with New York City's 'Little Italy\" as the locale. This was Edward Dmytryk's first film after he had refused to tell a Congressional Committee whether or not he was, or had ever been, a member of the Communist Party. This is a 'runaway production' shot in England for political reasons and not for the usual USA tax-break reasons. Geremio, a young Italian immigrant to New York City, works as a bricklayer and is courting an Italian girl, Annunziata, by mail. He lies to her that he owns his own home and, after they are married, has to rent one for their three-day honeymoon. The years pass and they are unable to save enough money to get out of their slum tenement, and the 1929 depression brings even harder times to the family that now includes three children. Geremio, in order to make enough money to care for his family, exploits his \"comrades\" in dangerous construction work. This practice leads to the accidental death of his best friend, and, in grief, Geremio also becomes unfaithful to his wife. The messages of the film -- life is aimless and no man can judge the true worth of another man -- are pounded on for most of the two-hour running time.", "genres": ["Drama"], "imdb": {"id": 41416, "rating": 7.2, "votes": 198}, "languages": ["English"], "lastupdated": "2015-05-10 00:16:59.860000000", "num_mflix_comments": 3, "plot": "One of the few (if any at the time this film was made) films shot in England with New York City's 'Little Italy\" as the locale. This was Edward Dmytryk's first film after he had refused to ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTU2ODk4MzM5NF5BMl5BanBnXkFtZTcwNTA5MTYxMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PASSED", "released": -613785600000, "runtime": 120, "title": "Give Us This Day", "tomatoes": {"dvd": 1055808000000, "lastUpdated": 1439143583000, "viewer": {"meter": 100, "numReviews": 30, "rating": 3.9}}, "type": "movie", "writers": ["Pietro Di Donato (novel)", "Ben Barzman (adaptation)", "John Penn (adaptation)"], "year": 1949}