{"_id": "573a13a9f29313caabd1ea58", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Ashley Judd", "Samuel L. Jackson", "Andy Garcia", "David Strathairn"], "countries": ["Germany", "USA"], "directors": ["Philip Kaufman"], "fullplot": "Jessica Shepard is an on the rise police officer of San Francisco's esteemed police department, after having solved a big case about a serial killer. Her mentor John Mills is proud of Jessica as a father would be of his daughter, since Mills was the partner of Jessica's late father. With a newly established promotion, Jessica finds that she might once again have to prove herself in a department that takes no prisoners. Not to mention a new partner named Mike Delmarco, who might be Jessica's next closest thing to a confidant. However, a man has been found dead and the two officers are brought into the investigation. What they find is a surprise when the dead in question was a man Jessica slept with, he being part of a list of one night stands that Jessica has engaged in. Now under suspicion and a terrible drinking problem gnawing at her, Jessica will have to prove to her superiors and to her skeptical partner that she's not the one behind the murders and Mills is one of the few people standing behind her. This is a story about a woman trying to find the perpetrator of these horrible crimes, before she herself might end as one of them.", "genres": ["Crime", "Drama", "Mystery"], "imdb": {"id": 315297, "rating": 5.2, "votes": 16211}, "languages": ["English", "Italian", "Spanish"], "lastupdated": "2015-09-07 00:22:55.867000000", "metacritic": 26, "plot": "Jessica, whose father killed her mother and committed suicide, is a police officer. While investigating a murder, she finds herself in the center of her own investigation, when her former lovers start dying.", "poster": "https://m.media-amazon.com/images/M/MV5BMTg1OTk4NDA3M15BMl5BanBnXkFtZTcwMDYzOTQyMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1077840000000, "runtime": 97, "title": "Twisted", "tomatoes": {"boxOffice": "$25.0M", "consensus": "An implausible, overheated potboiler that squanders a stellar cast, Twisted is a clichèd, risible whodunit.", "critic": {"meter": 1, "numReviews": 135, "rating": 2.9}, "dvd": 1093910400000, "fresh": 2, "lastUpdated": 1439923390000, "production": "Paramount Pictures", "rotten": 133, "viewer": {"meter": 31, "numReviews": 18998, "rating": 2.8}, "website": "http://www.twistedmovie.com"}, "type": "movie", "writers": ["Sarah Thorp"], "year": 2004}