{"_id": "573a13d8f29313caabda5f31", "awards": {"nominations": 0, "text": "2 wins.", "wins": 2}, "cast": ["Ciara Hanna", "Emily O'Brien", "Jackie Moore", "Russell Geoffrey Banks"], "countries": ["USA", "Thailand"], "directors": ["James Cullen Bressack"], "fullplot": "Three young, beautiful girls arrive in Thailand to teach English for the summer, some with noble intentions and some just wanting an adventure, but none were prepared for the massacre that awaited them. The nightmare begins when their new friends go missing, vivid bloody dreams haunt their sleep and a stolen statue leads them down a dark path into Thai folklore and magic that has been long forgotten. Their situation continues to become worse once they realize it's not WHAT that is haunting them but WHO: an eight-year girl, brutally murdered and sacrificed by her family decades ago who wants nothing more than to watch them bleed. This is not a story about redemption. This is not a story about good versus evil. This is not a story about the will to survive. This is a story about Vanida - a child viciously tortured by her own family, who will stop at nothing for revenge - one appendage at a time.", "genres": ["Horror", "Thriller"], "imdb": {"id": 2187444, "rating": 5.8, "votes": 1630}, "languages": ["English"], "lastupdated": "2015-09-06 00:12:33.883000000", "num_mflix_comments": 2, "plot": "It was supposed to be an adventure of a lifetime as three young girls spend the summer in Thailand. But their adventure quickly becomes a nightmare when the trio unleashes the spirit of a murdered child with only one thing on her mind - revenge.", "poster": "https://m.media-amazon.com/images/M/MV5BYTFhZWM2MzYtZGQyZi00MGQ3LTllZjctNTk4YzU2YTM3ZjAxXkEyXkFqcGdeQXVyMjUxOTAxNzI@._V1_SY1000_SX677_AL_.jpg", "released": 1424390400000, "runtime": 90, "title": "Pernicious", "tomatoes": {"lastUpdated": 1442086358000, "production": "Benetone Films", "viewer": {"meter": 92, "numReviews": 292, "rating": 4.8}, "website": "http://www.perniciousmovie.com/"}, "type": "movie", "writers": ["James Cullen Bressack (story)", "James Cullen Bressack", "Taryn Hillin"], "year": 2014}