{"_id": "573a13d9f29313caabdaa675", "awards": {"nominations": 1, "text": "1 win & 1 nomination.", "wins": 1}, "cast": ["Paula Garcès", "Annabella Sciorra", "Bill Camp", "Philip Ettinger"], "countries": ["USA"], "directors": ["Michael Walker"], "fullplot": "Set entirely on the posh east end of Long Island (where it was filmed), THE MAID'S ROOM centers around Drina, an attractive, intelligent immigrant who takes a job for the season as live-in maid to the Crawfords, a privileged New York family who maintain a splendid home in the Hamptons. The job could be worse, since Mr. and Mrs. Crawford spend most of their time in the city, but their teenage son, Brandon, who is starting Princeton in the fall, is summering at the beach, and Drina must look after him and his spoiled friends. Since the maid's room is next to the garage, Drina can't help noticing when Brandon returns late one night, noisily and obviously drunk. The next day, she sees that Brandon's car is battered and bloodied and, when she reads in the local paper that there has been a fatal hit and run, it's clear who's responsible. Knowing the Crawford's will do anything to protect their precious son, Drina realizes that, for once, she has some power over her employers. Though the situation is intoxicating, it also places her in far more danger than she imagines.", "genres": ["Thriller"], "imdb": {"id": 2263814, "rating": 4.5, "votes": 569}, "languages": ["English"], "lastupdated": "2015-08-25 01:07:53.760000000", "metacritic": 39, "num_mflix_comments": 1, "plot": "THE MAID'S ROOM is a psychological thriller that explores the complex relationships between truth and justice, hubris and power, wealth and fear.", "poster": "https://m.media-amazon.com/images/M/MV5BYTMwZTdhYzEtNjVhNi00NTVlLWE5ZWItNjM3Nzc1YTVlNjNhXkEyXkFqcGdeQXVyMTMxMTY0OTQ@._V1_SY1000_SX677_AL_.jpg", "released": 1407456000000, "runtime": 98, "title": "The Maid's Room", "tomatoes": {"critic": {"meter": 27, "numReviews": 11, "rating": 4.7}, "fresh": 3, "lastUpdated": 1442264078000, "production": "Paladin Films", "rotten": 8, "viewer": {"meter": 33, "numReviews": 159, "rating": 2.3}, "website": "http://www.facebook.com/TheMaidsRoom"}, "type": "movie", "writers": ["Michael Walker"], "year": 2013}