{"_id": "573a1394f29313caabcdecdd", "awards": {"nominations": 2, "text": "Nominated for 2 Oscars. Another 1 win & 2 nominations.", "wins": 3}, "cast": ["Kathryn Grayson", "Ava Gardner", "Howard Keel", "Joe E. Brown"], "countries": ["USA"], "directors": ["George Sidney"], "fullplot": "The \"Cotton Blossom\", owned by the Hawk family, is the show boat where everyone comes for great musical entertainment down south. Julie Laverne and her husband are the stars of the show. After, a snitch on board calls the local police that Julie (who's half- African-American) is married to a whiteman, they are forced to leave the show boat. The reason being, that down south interracial marriages are forbidden. Magnolia Hawk, Captain Andy Hawks daughter, becomes the new show boat attraction and her leading man is Gaylord Ravenal, a gambler. The two instantly fall in love, and marry, without Parthy Hawks approval. Magnolia and Gaylord leave the, \"Cotton Blossom\", for a whirl wind honeymoon and being to live in a Pl: fantasy world. Magnolia soon faces reality quickly, that gambling means more to Gaylord than anything else. Magnolia confront Gaylord and after he gambles away their fortune he leaves her - not knowing she is pregnant. Magnolia is left penniless and pregnant, and is left to fend for herself, and make a new start.", "genres": ["Drama", "Family", "Musical"], "imdb": {"id": 44030, "rating": 7, "votes": 3359}, "languages": ["English"], "lastupdated": "2015-09-01 00:28:41.770000000", "num_mflix_comments": 1, "plot": "The daughter of a riverboat captain falls in love with a charming gambler, but their fairytale romance is threatened when his luck turns sour.", "poster": "https://m.media-amazon.com/images/M/MV5BNmI4MGE2OGItNWU0ZS00NjczLTkwM2MtMzAyNDYxYTJkNjA2L2ltYWdlXkEyXkFqcGdeQXVyNjQzNDI3NzY@._V1_SY1000_SX677_AL_.jpg", "rated": "PASSED", "released": -576633600000, "runtime": 108, "title": "Show Boat", "tomatoes": {"critic": {"meter": 89, "numReviews": 9, "rating": 6.9}, "dvd": 872640000000, "fresh": 8, "lastUpdated": 1441910898000, "production": "MGM Home Entertainment", "rotten": 1, "viewer": {"meter": 71, "numReviews": 5427, "rating": 3.4}}, "type": "movie", "writers": ["John Lee Mahin (screen play)", "Jerome Kern (based on the immortal musical play \"Show Boat\" by)", "Oscar Hammerstein II (based on the immortal musical play \"Show Boat\" by)", "Edna Ferber (from the novel by)"], "year": 1951}