{"_id": "573a13b4f29313caabd40e18", "awards": {"nominations": 1, "text": "12 wins & 1 nomination.", "wins": 12}, "cast": ["Yasuhi Nakamura", "Reika Kirishima", "Sè Yamanaka", "Yuka Itaya"], "countries": ["Japan"], "directors": ["Kenji Uchida"], "fullplot": "In one long Friday evening, Takeshi Miyata, a straight-arrow businessman, will encounter a number of people (some only fleetingly) who have intertwining fates. After six months he is still mourning the loss of his girlfriend, Ayumi and is lured from his apartment when his childhood friend, the detective Yusuke Kanda, telephones invoking Ayumi's name. Arriving late at the appointed restaurant, Kanda says Ayumi is getting married and chides Miyata over not finding a new girlfriend. He then spontaneously invites a solitary diner, Maki, to join them. Although she is silently vowing to be alone because of bitterness over her engagement being broken just the day before, she quickly agrees. Kanda makes a sudden exit, leaving his friend to contend with the despondent and homeless girl. The two return to his apartment, but as Ayumi appears wanting some of her things she left behind, Maki says she must leave. Meanwhile, Miyata remains oblivious to the fact that both Kanda and Ayumi are being threatened by Asai, a Yakusa mob boss, and his mob over the disappearance of the \"money\" from Asai's safe.", "genres": ["Comedy", "Drama", "Romance"], "imdb": {"id": 461857, "rating": 7.8, "votes": 784}, "languages": ["Japanese"], "lastupdated": "2015-08-20 01:16:38.580000000", "num_mflix_comments": 1, "plot": "In one long Friday evening, Takeshi Miyata, a straight-arrow businessman, will encounter a number of people (some only fleetingly) who have intertwining fates. After six months he is still ...", "released": 1136419200000, "runtime": 98, "title": "A Stranger of Mine", "tomatoes": {"lastUpdated": 1442163733000, "viewer": {"meter": 91, "numReviews": 840, "rating": 3.9}}, "type": "movie", "writers": ["Kenji Uchida"], "year": 2005}