{"_id": "573a13a3f29313caabd0ef69", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Jackie Shroff", "Hrithik Roshan", "Kareena Kapoor", "Amrish Puri"], "countries": ["India"], "directors": ["Subhash Ghai"], "fullplot": "Raj Singh Puri is best friends with L.K. Malhotra who is in turn younger brother to J.K. Malhotra. The brothers are business tycoons and Raj works in their company. Raj is father to three young daughters, the first one gets married through arrangement but the second one marries her lover. After a few weeks at her in-laws, the second daughter returns home asking for divorce. After this Raj and her last daughter become strictly against love and relationships. All this changes when Isha (the third daughter) falls in love with the heir to the Malhotra empire, Ronit, L.K. Malhotra's son. The ask for Raj's blessing but he bluntly refuses and Isha understandingly shuns Ronit and Raj arranges for Ronit to be married to the daughter of another tycoon. Ronit is unhappy and makes Raj realize that his fiancè's family is not right for them and Raj approaches the Malhotras to break off the engagement however J.K. Malhotra shuns him by calling him poor and small. The other Malhotras join forces to make J.K. to realize his mistake and Ronit is finally married to Isha.", "genres": ["Musical", "Drama", "Romance"], "imdb": {"id": 248617, "rating": 4.4, "votes": 2228}, "languages": ["Hindi"], "lastupdated": "2015-08-18 00:47:33.390000000", "num_mflix_comments": 4, "plot": "Raj Singh Puri is best friends with L.K. Malhotra who is in turn younger brother to J.K. Malhotra. The brothers are business tycoons and Raj works in their company. Raj is father to three ...", "poster": "https://m.media-amazon.com/images/M/MV5BMjQyZGUzMDItNDgyMi00MWVkLWI3NjgtYWE2MjlhYmRjOGQ5XkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY1000_SX677_AL_.jpg", "released": 993600000000, "runtime": 171, "title": "Yaadein...", "tomatoes": {"dvd": 1008633600000, "lastUpdated": 1442513905000, "production": "Rajshri Media", "viewer": {"meter": 57, "numReviews": 4466, "rating": 3.4}}, "type": "movie", "writers": ["Subhash Ghai (dialogue)", "Subhash Ghai (screenplay)", "Amrik Gill (dialogue)", "Aatish Kapadia (screenplay)", "Anuradha Tiwari (screenplay)"], "year": 2001}