{"_id": "573a13bbf29313caabd53ae7", "awards": {"nominations": 3, "text": "5 wins & 3 nominations.", "wins": 5}, "cast": ["Yoshino Kimura", "Bertrand Beyern", "Camille Solari"], "countries": ["Netherlands"], "directors": ["Heddy Honigmann"], "fullplot": "Père-Lachaise - one of the world's most famous and beautiful cemeteries - is the final resting-place of a gifted group of artists from all eras and corners of the world. Some - such as Piaf, Proust, Jim Morrison and Chopin - are worshiped to this day. Others have fallen into oblivion, or are visited occasionally by a single admirer. In Forever we see the mysterious, calming and consoling beauty of this unique cemetery through the eyes of people of flesh and blood. Many come for their 'own' beloved: husbands, wives, family and friends. Others Honor 'their' artist by leaving behind a personal message or a flower. While admirers share with us the importance of art and beauty in their lives, the graveyard gradually reveals itself as a source of inspiration for the living. Death offers little consolation except for the passing of time, the melancholia of a moss-covered tomb, and the beauty and power of a piece of music, a poem or a painting", "genres": ["Documentary"], "imdb": {"id": 906743, "rating": 7.7, "votes": 272}, "languages": ["English", "French"], "lastupdated": "2015-08-12 00:40:43.673000000", "plot": "Forever is a film about the power and vitality of art and a place where love and death go hand in hand and beauty lives on: the Père-Lachaise cemetery in Paris.", "poster": "https://m.media-amazon.com/images/M/MV5BMTQ3NTY5Mzc3OV5BMl5BanBnXkFtZTcwNDA0Mjc5Mg@@._V1_SY1000_SX677_AL_.jpg", "rated": "UNRATED", "released": 1189555200000, "runtime": 95, "title": "Forever", "tomatoes": {"critic": {"meter": 89, "numReviews": 19, "rating": 7.5}, "dvd": 1240272000000, "fresh": 17, "lastUpdated": 1439838772000, "production": "First Run/Icarus Films", "rotten": 2, "viewer": {"meter": 89, "numReviews": 344, "rating": 4.2}}, "type": "movie", "writers": ["Ester Gould (scenario)", "Heddy Honigmann (scenario)", "Judith Vreriks (scenario)"], "year": 2006}