{"_id": "573a13c3f29313caabd6a777", "awards": {"nominations": 16, "text": "5 wins & 16 nominations.", "wins": 5}, "cast": ["Julieta Zylberberg", "Ailèn Salas", "Osmar Nèèez", "Marta Lubos"], "countries": ["Argentina", "France", "Spain"], "directors": ["Diego Lerman"], "fullplot": "Buenos Aires, March 1982. On the streets of the Argentinean capital, people are challenging the military dictatorship. The walls of the school are thick and redoubtable. A secure promise of the guaranteed preservation of the good old days of school routine from anything that may happen outside its walls in the neighbouring streets, in Buenos Aires itself, in the Argentina of 1982. Marèa Teresa is a classroom assistant at that school, an innocent - or maybe just ignorant - mistress of ceremonies, a bystander. She is twenty years old. She started work when it was still summer and Mr. Biasutto, the chief classroom assistant, made quite clear to her at her first interview the sort of attitude she is expected to adopt with students because it would not be an easy task to arrive at what he called 'the optimum surveillance point': Always on the 'qui vive', never missing a thing, but never giving cause for alarm amongst the students. A surveillance which would pick up on everything but would never be picked up on itself. A fleeting look on the face of the pervert, or the warden, or maybe the master. But if everything is out of order -even for her-, everything is transgression. And when Marèa Teresa, hot on the trail of the merest, possibly imaginary wisp of tobacco smoke, starts hiding in the boys lavatories to catch smokers in flagrante delicto and haul them up before the authorities, slowly morphing the whole procedure into a clandestine habit of dubious piquancy; not exactly breaking the rules but bending them willy nilly, twisting, diverting them come what may but, of course, with utter correctness and obeisance to a surveillance emanating from the inflexible custodianship of a complete and atrocious normality. Surveillance, custodianship that could possibly be enforced beyond the boundaries of this enclosed world, because beyond the sheer masonry encasing this school, where the future ruling classes have studied and are studying, there is another world, there is an entire country that has virtually nothing to do with it.", "genres": ["Drama"], "imdb": {"id": 1313254, "rating": 6.3, "votes": 423}, "languages": ["Spanish"], "lastupdated": "2015-08-24 01:03:05.040000000", "num_mflix_comments": 1, "plot": "Spying on her students, a teacher finds an exciting hobby.", "poster": "https://m.media-amazon.com/images/M/MV5BMjAzMDQ0NzkwOV5BMl5BanBnXkFtZTgwNjAwNzUxMTE@._V1_SY1000_SX677_AL_.jpg", "released": 1282176000000, "runtime": 97, "title": "The Invisible Eye", "tomatoes": {"lastUpdated": 1440008557000, "production": "Agat Films", "viewer": {"meter": 42, "numReviews": 81, "rating": 3.3}, "website": "http://www.lamiradainvisible.com.ar/"}, "type": "movie", "writers": ["Martèn Kohan (novel)", "Diego Lerman (screenplay)", "Marèa Meira"], "year": 2010}