{"_id": "573a1398f29313caabce9963", "awards": {"nominations": 2, "text": "1 win & 2 nominations.", "wins": 1}, "cast": ["Jack Lemmon", "Marcello Mastroianni", "Daria Nicolodi", "Isa Danieli"], "countries": ["Italy"], "directors": ["Ettore Scola"], "fullplot": "Robert Traven, a dyspeptic, edgy American businessman, arrives in Naples and is received by a friendly but officious local company representative. Exhausted by the pressures and inconveniences of a long flight, he is looking forward to rest and relaxation in his hotel room when he is visited by buoyant and upbeat Antonio Jassiello, a clerk in a bank record room, who is surprised when his old friend from the War does not recognize him. The annoyed and exhausted Traven feels he's being scammed, and the two part on bad terms. Jassiello does leave a photo of Traven and his sister taken 40 years earlier, and the time and the setting seen to stir the American's memory, so he seeks out Antonio to apologize. Jassiello brings him back home to renew acquaintances with his family including his now middle-aged, married sister, Her hospitable husband is friendly and not the least bit jealous, and Traven soon discovers why he has not faded from their memories as they have from his. Antonio has been long forging letters from Bob, claiming all manner of heroics as he globe-trots around the world. Jassiello and his family's warmth and genuine affection for him causes Traven to prioritize the family's needs over his best interests and his company's.", "genres": ["Comedy", "Drama"], "imdb": {"id": 89529, "rating": 6.4, "votes": 475}, "languages": ["Italian", "English"], "lastupdated": "2015-08-14 00:55:42.427000000", "num_mflix_comments": 3, "plot": "A businessman from the United States returns to Italy for the first time in four decades only to discover that an old girlfriend of his, along with her brother, have involved him in a massive hoax.", "poster": "https://m.media-amazon.com/images/M/MV5BMDY4OTViZGUtZjJmZC00ZGRiLThiOGMtODkyM2M0NDFkNjFlXkEyXkFqcGdeQXVyMjUyNDk2ODc@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 498960000000, "runtime": 104, "title": "Macaroni", "type": "movie", "writers": ["Ruggero Maccari (screenplay)", "Furio Scarpelli (screenplay)", "Ettore Scola (screenplay)"], "year": 1985}