{"_id": "573a13aff29313caabd32587", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Tracy Coogan", "Graham Sibley", "Tonya Cornelisse", "David M. Wallace"], "countries": ["USA"], "directors": ["David Gebroe"], "fullplot": "Zombie Honeymoon is a romantic horror film about a young married couple, madly in love, on their honeymoon. One day on the beach, the groom Danny is attacked and killed by a man who rises up out of the water with no explanation, leaps on top of him, and vomits blood into his mouth. Danny is resuscitated ten minutes later, and seems to look and act totally normal. However, his wife Denise finds out that that's not the case at all. It turns out that Danny has become a zombie. However, instead of becoming a \"Night Of The Living Dead\"-style creature right off the bat, he disintegrates gradually, in a manner akin to cancer or AIDS. He and his wife Denise do their best to cope with his slipping away, not to mention the fact that he can't stop killing and eating people. As their best friends arrive for a weekend visit, she makes him promise her that they're off-limits. He agrees, but finds it more and more difficult to control himself. She hangs in there because he's the love of her life, but it becomes more and more apparent that her life is in jeopardy as well.", "genres": ["Drama", "Horror", "Romance"], "imdb": {"id": 399934, "rating": 4.8, "votes": 2079}, "languages": ["English"], "lastupdated": "2015-08-25 01:02:43.383000000", "metacritic": 63, "num_mflix_comments": 2, "plot": "Zombie Honeymoon is a gore-soaked exploration of how far the boundaries of true love can be pushed without reaching a breaking point.", "poster": "https://m.media-amazon.com/images/M/MV5BMTIzMjMzOTEwN15BMl5BanBnXkFtZTcwMTY1MjcyMQ@@._V1_SY1000_SX677_AL_.jpg", "released": 1098489600000, "runtime": 83, "title": "Zombie Honeymoon", "tomatoes": {"critic": {"meter": 82, "numReviews": 11, "rating": 6.9}, "dvd": 1139875200000, "fresh": 9, "lastUpdated": 1439835669000, "production": "Sky Whisper Productions", "rotten": 2, "viewer": {"meter": 31, "numReviews": 4688, "rating": 2.7}, "website": "http://www.zombiehoneymoon.com/"}, "type": "movie", "writers": ["David Gebroe"], "year": 2004}