{"_id": "573a13d7f29313caabda28f3", "awards": {"nominations": 1, "text": "1 win & 1 nomination.", "wins": 1}, "cast": ["Hodding Carter III", "Frank De Felitta", "Yvette Johnson", "Leroy Jones"], "countries": ["USA"], "directors": ["Raymond De Felitta"], "fullplot": "In 1965, filmmaker Frank De Felitta made a documentary film for NBC News about the changing times in the American South and the tensions of life in the Mississippi Delta during the civil rights struggle. The film was broadcast in May of 1966 and outraged many Southern viewers, in part, because it included an extraordinary scene featuring a local African-American waiter named Booker Wright. Wright, who worked at a local \"whites only\" restaurant in Greenwood MS, went on record to deliver a stunning, heartfelt and inflammatory monologue exploding the myth about who he was and how he felt about his position serving the local white community. The fallout for Booker Wright was extreme: He lost his job, and was beaten and ostracized by those that considered him \"one of their own.\" Forty-five years after Booker's television appearance, Frank De Felitta's son, director Raymond De Felitta, takes a journey into the Mississippi Yazoo Delta with Booker Wright's granddaughter in search of who Booker Wright was, the mystery surrounding his courageous life and untimely murder, and the role Frank De Felitta's NBC News documentary may have played in it.", "genres": ["Documentary", "History", "Mystery"], "imdb": {"id": 2129930, "rating": 7.7, "votes": 107}, "languages": ["English"], "lastupdated": "2015-07-18 00:55:20.960000000", "metacritic": 78, "plot": "While filming a documentary in Mississippi in 1965, Frank De Felitta forever changed the life of an African-American waiter and his family. In 2011, Frank's son returns to the Delta to examine the repercussions of that fateful encounter.", "poster": "https://m.media-amazon.com/images/M/MV5BMTM5MDMwNDI3Nl5BMl5BanBnXkFtZTcwNDMwNDM2Nw@@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 1335398400000, "runtime": 90, "title": "Booker's Place: A Mississippi Story", "tomatoes": {"boxOffice": "$5.0k", "critic": {"meter": 100, "numReviews": 15, "rating": 7.3}, "dvd": 1352160000000, "fresh": 15, "lastUpdated": 1441134001000, "production": "Tribeca Films", "rotten": 0, "viewer": {"meter": 83, "numReviews": 209, "rating": 4.2}, "website": "http://www.tribecafilm.com/tribecafilm/booker_s_place__a_mississippi_story-film3"}, "type": "movie", "year": 2012}