{"_id": "573a1396f29313caabce52e7", "awards": {"nominations": 0, "text": "Nominated for 1 Oscar. Another 1 win.", "wins": 2}, "cast": ["Monique van de Ven", "Rutger Hauer", "Tonny Huurdeman", "Wim van den Brink"], "countries": ["Netherlands"], "directors": ["Paul Verhoeven"], "fullplot": "Sort of a cross between \"Love Story\" and an earthy Rembrandt painting, this movie stars Rutger Hauer as a gifted Dutch sculptor who has a stormy, erotic, and star-crossed romance with a beautiful young girl. The story follows the arc of their relationship and his interaction with her family. Told in flashback form, initially Hauer is seen as a libertine lothario collector, taking trophies from his sexual conquests and pasting them in a book. He sees a sculpture he made of his lost lover and goes into a flashback of his relationship with his wife. He meets the girl, falls in love with/marries her, and we meet her parents: a charming, well meaning, bumbling father, and his shrew of a wife, who's convinced Hauer's too much of a bohemian to make a good mate for her daughter. Eventually, the petty jealousies, the sexual hijinks, and the climactic vomit scene prove too much for the marriage, and sculptor and his lady fair separate. Flash forward several months, and Hauer finds the girl back in Holland after an American sojourn. Their reunion is short lived; the somewhat melodramatic ending mirrors \"Love Story\".", "genres": ["Drama", "Romance"], "imdb": {"id": 70842, "rating": 7.1, "votes": 7292}, "languages": ["Dutch", "English"], "lastupdated": "2015-08-19 00:44:27.750000000", "plot": "Sort of a cross between \"Love Story\" and an earthy Rembrandt painting, this movie stars Rutger Hauer as a gifted Dutch sculptor who has a stormy, erotic, and star-crossed romance with a ...", "poster": "https://m.media-amazon.com/images/M/MV5BMjhkMWYzOWQtYTVkYy00YmUwLWE3ZjctYWI4YTQ3MDNhYzM1L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTAwNzgxMzQ@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 147225600000, "runtime": 108, "title": "Turkish Delight", "tomatoes": {"critic": {"meter": 80, "numReviews": 5, "rating": 7.2}, "dvd": 1178755200000, "fresh": 4, "lastUpdated": 1439753108000, "production": "Cinemation Industries", "rotten": 1, "viewer": {"meter": 80, "numReviews": 2213, "rating": 3.9}}, "type": "movie", "writers": ["Gerard Soeteman", "Jan Wolkers (novel)"], "year": 1973}