{"_id": "573a1393f29313caabcdc093", "awards": {"nominations": 5, "text": "Won 1 Oscar. Another 4 nominations.", "wins": 0}, "cast": ["Ginger Rogers", "Dennis Morgan", "James Craig", "Eduardo Ciannelli"], "countries": ["USA"], "directors": ["Sam Wood"], "fullplot": "Kitty Foyle works as secretary to Philadelphia socialite Wynnewood Statfford VI, in his attempt to succeed in establishing a magazine during the depression. They fall in love, and she always thinks he will ask her to marry him. The magazine fails, and she leaves for New York and another job in a department store. There she meets Dr. Mark Eisen who loves her, but Wyn Stafford shows up and asks Kitty to marry him. She initially refuses citing the differences in their social backgrounds. She feels that Philadelphia socialites would never accept her. Wyn agrees to leave behind Philadelphia and move to New York. They are married in New York. Weeks later they go to Philadelphia to let family know about the marriage. The family is overbearing and obnoxious to Kitty. She leaves, and eventually divorces Wyn. Kitty finds she is pregnant, and eventually delivers a still-born. Wyn marries a rich socialite, and by chance, Kitty meets his wife and son. This is difficult because she still loves Wyn. Eventually Mark Eisen proposes and Kitty agrees and finally reevaluates her life and decisions, and is able to let Wyn go and be happy.", "genres": ["Drama", "Romance"], "imdb": {"id": 32671, "rating": 7.1, "votes": 2102}, "languages": ["English"], "lastupdated": "2015-08-24 00:22:43.290000000", "num_mflix_comments": 1, "plot": "Kitty Foyle, a hard-working white-collar girl from a Philadelphia, Pennsylvania low, middle-class family, meets and falls in love with young socialite Wyn Strafford but his family is against her.", "poster": "https://m.media-amazon.com/images/M/MV5BODZkZTcwNzQtODBiNy00ZTNjLTlhMjctZDViZjQzMGIyZDg5XkEyXkFqcGdeQXVyNjc0MzMzNjA@._V1_SY1000_SX677_AL_.jpg", "rated": "APPROVED", "released": -915580800000, "runtime": 108, "title": "Kitty Foyle", "tomatoes": {"critic": {"meter": 75, "numReviews": 8, "rating": 7}, "dvd": 1138665600000, "fresh": 6, "lastUpdated": 1439319269000, "production": "Media Home Entertainment", "rotten": 2, "viewer": {"meter": 73, "numReviews": 898, "rating": 3.7}}, "type": "movie", "writers": ["Christopher Morley (A novel by)", "Dalton Trumbo (screen play)", "Donald Ogden Stewart (additional dialogue)"], "year": 1940}