{"_id": "573a13bcf29313caabd572fb", "awards": {"nominations": 4, "text": "3 wins & 4 nominations.", "wins": 3}, "cast": ["Zac Efron", "Leslie Mann", "Thomas Lennon", "Matthew Perry"], "countries": ["USA"], "directors": ["Burr Steers"], "fullplot": "At 17 Mike O'Donnell is on top of the world: he's the star of his high school basketball team, is a shoo-in for a college scholarship, and is dating his soul-mate, Scarlet. But at what's supposed to be his big game where a college scout is checking him out, Scarlet reveals that she's pregnant. Mike decides to leave the game and asks Scarlet to marry him, which she does. During their marriage, Mike can only whine about the life he lost because he married her, so she throws him out. When he also loses his job, he returns to the only place he's happy at, his old high school. While looking at his high school photo, a janitor asks him if he wishes he could be 17 again and he says yes. One night while driving he sees the janitor on a bridge ready to jump, and goes after him. When he returns to his friend Ned's house, where he has been staying, he sees that he is 17 again. He decides to take this opportunity to get the life he lost.", "genres": ["Comedy", "Drama", "Fantasy"], "imdb": {"id": 974661, "rating": 6.4, "votes": 134896}, "languages": ["English"], "lastupdated": "2015-09-14 02:15:52.053000000", "metacritic": 48, "num_mflix_comments": 3, "plot": "About a guy whose life didn't quite turn out how he wanted it to and wishes he could go back to high school and change it. He wakes up one day and is seventeen again and gets the chance to rewrite his life.", "poster": "https://m.media-amazon.com/images/M/MV5BMjA2NTI1Mzg3N15BMl5BanBnXkFtZTcwMjYwNjAzMg@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1239926400000, "runtime": 102, "title": "17 Again", "tomatoes": {"boxOffice": "$64.1M", "consensus": "Though it uses a well-worn formula, 17 Again has just enough Zac Efron charm to result in a harmless, pleasurable teen comedy.", "critic": {"meter": 55, "numReviews": 142, "rating": 5.4}, "dvd": 1249948800000, "fresh": 78, "lastUpdated": 1442166582000, "production": "New Line Cinema", "rotten": 64, "viewer": {"meter": 67, "numReviews": 465063, "rating": 3.6}, "website": "http://www.17againmovie.com/"}, "type": "movie", "writers": ["Jason Filardi"], "year": 2009}