{"_id": "573a1396f29313caabce464e", "awards": {"nominations": 3, "text": "Nominated for 2 Golden Globes. Another 1 nomination.", "wins": 0}, "cast": ["Walter Matthau", "Elaine May", "Jack Weston", "George Rose"], "countries": ["USA"], "directors": ["Elaine May"], "fullplot": "Henry Graham is a man with a problem: he has run through his entire inheritance, and is completely unequipped to provide for himself. His childhood guardian, Uncle Harry (a deliciously mean-spirited James Coco), refuses to give him a dime, and Henry, completely unwilling to exercise the only solution he sees--suicide-- devises a plan with the help of his imaginative butler: he can make money the old-fashioned way--he can marry it. With a temporary loan from Uncle Harry to tide him over, Henry has six weeks to find a bride, marry her, and repay the money, or else he must forfeit all his property to his uncle. With only days remaining, Henry meets clumsy, painfully shy heiress Henrietta Lowell (played by director Elaine May). She's the answer to his prayers--if only Henry can overcome the obstacles placed in his path by Uncle Harry, Henrietta's lawyer, and Henry's own reluctance to wed.", "genres": ["Comedy", "Romance"], "imdb": {"id": 67482, "rating": 7.5, "votes": 2634}, "languages": ["English"], "lastupdated": "2015-09-03 00:35:27.663000000", "num_mflix_comments": 1, "plot": "Henry Graham is a man with a problem: he has run through his entire inheritance, and is completely unequipped to provide for himself. His childhood guardian, Uncle Harry (a deliciously ...", "poster": "https://m.media-amazon.com/images/M/MV5BZGE1YTk0YzUtMDRlNC00NWM5LWE3MWMtMjk1ZWM1MDdjM2IxL2ltYWdlXkEyXkFqcGdeQXVyMjI4MjA5MzA@._V1_SY1000_SX677_AL_.jpg", "rated": "G", "released": 48729600000, "runtime": 102, "title": "A New Leaf", "tomatoes": {"critic": {"meter": 100, "numReviews": 15, "rating": 8.2}, "dvd": 1398211200000, "fresh": 15, "lastUpdated": 1441991612000, "production": "Howard W. Koch Productions", "rotten": 0, "viewer": {"meter": 84, "numReviews": 890, "rating": 4}}, "type": "movie", "writers": ["Elaine May", "Jack Ritchie (story)"], "year": 1971}