{"_id": "573a13baf29313caabd51bf9", "awards": {"nominations": 5, "text": "5 nominations.", "wins": 0}, "cast": ["Douglas Silva", "Darlan Cunha", "Jonathan Haagensen", "Rodrigo dos Santos"], "countries": ["Brazil"], "directors": ["Paulo Morelli"], "fullplot": "In the slum in Morro da Sinuca, a couple of days before turning eighteen year-old, Laranjinha tells his best friend and also orphan Acerola that he misses his unknown father. Acerola decides to help his needy friend to find his father and they discover that he is in prison convicted for killing a man during a robbery and near to be released on parole. Meanwhile, Acerola's wife and babysitter Cris is invited to work in Sèo Paulo and she sees the chance to raise money to buy a house of her own; she tells Acerola that he must take care of their son Clayton alone for one year. When the owner of the hill and Laranjinha's cousin Madrugadèo is betrayed by his right-hand Nefasto, he is expelled from the slum and Laranjinha and Acerola have also to leave the hill. While Madrugadèo plots a plan to invade and recover the hill with the support of the gang of the drug lord from Morro do Careca, Acerola and Laranjinha unravel the past of their fathers.", "genres": ["Crime", "Drama"], "imdb": {"id": 870090, "rating": 7.3, "votes": 12344}, "languages": ["Portuguese"], "lastupdated": "2015-09-04 08:58:30.187000000", "metacritic": 63, "num_mflix_comments": 2, "plot": "Best buddies Acerola and Laranjinha, about to turn 18, discover things about their missing fathers' pasts which will shatter their solid friendship, in the middle of a war between rival drug gangs from Rio's favelas.", "poster": "https://m.media-amazon.com/images/M/MV5BMTI4NTg4ODU0NF5BMl5BanBnXkFtZTcwNjA1MjU1MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1188518400000, "runtime": 106, "title": "City of Men", "tomatoes": {"boxOffice": "$0.2M", "consensus": "Brutal and unflinching, City of Men is both a harrowing look at Brazil's favela life, and a touching tale of youths rushed into adulthood.", "critic": {"meter": 76, "numReviews": 79, "rating": 6.7}, "dvd": 1214870400000, "fresh": 60, "lastUpdated": 1440269875000, "production": "Miramax Films", "rotten": 19, "viewer": {"meter": 78, "numReviews": 7115, "rating": 3.8}, "website": "http://cityofmen-themovie.com/"}, "type": "movie", "writers": ["Elena Soarez (screenplay)", "Roberto Moreira (screenplay)", "Paulo Morelli (story)", "Elena Soarez (story)", "Brèulio Mantovani (inspired by the characters created by)"], "year": 2007}