{"_id": "573a13bef29313caabd5dc3f", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["William Ash", "Christine Bottomley", "Andreas Wisniewski", "Claire Keelan"], "countries": ["UK"], "directors": ["Mark Tonderai"], "fullplot": "Tired and irritable, Zakes Abbott drives home along the motorway, his girlfriend, Beth, asleep beside him. Failing to spot his exit he speeds across the causeway, cutting up a white van and barely avoiding an accident. Apoplectic with rage, the truck driver gives chase, and as he violently overtakes the tailgate flips up revealing a woman bound and bloodied in the back. But before there is time for a second look, the door is slammed shut and Zakes is left bewildered and wondering if what he saw was real. Later at a service station, Zakes' fears grow when Beth goes missing, and as he begins a frantic search, he is enticed into a deadly game of cat and mouse on the deserted motorway. But being the sole witness to the earlier scene, how does he convince others of his desperate need for help? Playing on our most primal fears, this taut suspense thriller challenges a world where we constantly turn responsibility over to someone else and asks the question: what do you do when there is no one else there?", "genres": ["Horror", "Thriller"], "imdb": {"id": 1093369, "rating": 6, "votes": 5472}, "languages": ["English"], "lastupdated": "2015-08-22 00:25:39.657000000", "num_mflix_comments": 1, "plot": "A young couple on a motorway journey are drawn into a game of cat and mouse with a truck driver following a near accident.", "poster": "https://m.media-amazon.com/images/M/MV5BZGZkY2MyMzgtOGViMy00ZGUzLWIyNTAtY2U1MGUxNWQ1ODYyXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "released": 1236902400000, "runtime": 91, "title": "Hush", "tomatoes": {"critic": {"meter": 43, "numReviews": 7, "rating": 4.9}, "dvd": 1288051200000, "fresh": 3, "lastUpdated": 1440613798000, "production": "IFC Films", "rotten": 4, "viewer": {"meter": 37, "numReviews": 1563, "rating": 2.9}}, "type": "movie", "writers": ["Mark Tonderai"], "year": 2008}