{"_id": "573a13c1f29313caabd64713", "awards": {"nominations": 2, "text": "4 wins & 2 nominations.", "wins": 4}, "cast": ["Onni Tommila", "Tommi Korpela", "Lauri Tilkanen", "Leea Klemola"], "countries": ["Finland", "Germany"], "directors": ["Zaida Bergroth"], "fullplot": "In 1972, Rupert, 8 and Evert, 6 are two lovable and wildly imaginative brothers, lost in their cowboys-and-Indians fantasies and in the playground romances with the neighborhood girls. In the background is the warm but explosive and unstable mother, and the charming but unreliable father. The family has moved to a new house, the future looks bright. Everything starts to fall apart when Rupert finds a hidden letter. There are terrible fights and hushed whispers, then mom is taken somewhere to rest for a while. Later on there is confusing talk about a new mom. The brothers make a blood oath: One can't lie or die or one has to pay the other a million or more for the rest of his life. Rupert tries to hold the family together. But finally things get too complicated, and real tragedy waits in the wings of the fantasy plays. In 1982 the guilt-ridden 18-year-old Rupert tries to remember and understand the events of the past amidst the chaos of the present. If he doesn't find absolution, the family tragedy will be repeated and the curse will live on. Dad is coming home and the blood oath is about to be broken.", "genres": ["Drama"], "imdb": {"id": 1208728, "rating": 6.6, "votes": 477}, "languages": ["Finnish"], "lastupdated": "2015-09-02 00:39:09.397000000", "num_mflix_comments": 1, "plot": "In 1972, Rupert, 8 and Evert, 6 are two lovable and wildly imaginative brothers, lost in their cowboys-and-Indians fantasies and in the playground romances with the neighborhood girls. In ...", "released": 1252022400000, "runtime": 123, "title": "Last Cowboy Standing", "tomatoes": {"lastUpdated": 1432578320000, "viewer": {"meter": 63, "numReviews": 193, "rating": 3.5}}, "type": "movie", "writers": ["Antti Raivio (play)", "Jan Forsstrèm (screenplay)", "Zaida Bergroth (screenplay)", "Antti Raivio (screenplay)"], "year": 2009}