{"_id": "573a13a0f29313caabd05f95", "awards": {"nominations": 2, "text": "3 wins & 2 nominations.", "wins": 3}, "cast": ["Ian Holm", "Jeffrey Golden", "Jo Vukelich", "Marcus Monroe"], "countries": ["UK", "USA"], "directors": ["James Marsh"], "fullplot": "Wisconsin Death Trip is an intimate, shocking and sometimes hilarious account of the disasters that befell one small town in Wisconsin during the final decade of the 19th century. The film is inspired by Michael Lesy's book of the same name which was first published in 1973. Lesy discovered a striking archive of black and white photographs in the town of Black River Falls dating from the 1890s and married a selection of these images to extracts from the town's newspaper from the same decade. The effect was surprising and disturbing. The town of Black River Falls seems gripped by some peculiar malaise and the weekly news is dominated by bizarre tales of madness, eccentricity and violence amongst the local population. Suicide and murder are commonplace. People in the town are haunted by ghosts, possessed by devils and terrorized by teenage outlaws and arsonists. Like the book, the film is constructed entirely from authentic news reports from the Black River Falls' newspaper with occasional excerpts from the records of the nearby Mendota Asylum for the Insane. The film also makes use of the haunting black and white photographs taken by the resident portrait photographer of Black River Falls at the end of the 19th century. Contemporary color documentary footage of the town today is also included at the end of each section of the film that take place over the course of four seasons.", "genres": ["Drama", "History"], "imdb": {"id": 210389, "rating": 6.7, "votes": 1147}, "languages": ["English"], "lastupdated": "2015-08-08 00:07:16.833000000", "metacritic": 40, "num_mflix_comments": 1, "plot": "Wisconsin Death Trip is an intimate, shocking and sometimes hilarious account of the disasters that befell one small town in Wisconsin during the final decade of the 19th century. The film ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTM2ODM0MDQzNl5BMl5BanBnXkFtZTcwODA1NTAwMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 952560000000, "runtime": 76, "title": "Wisconsin Death Trip", "tomatoes": {"critic": {"meter": 75, "numReviews": 24, "rating": 6.3}, "dvd": 1077580800000, "fresh": 18, "lastUpdated": 1437418362000, "rotten": 6, "viewer": {"meter": 65, "numReviews": 910, "rating": 3.5}, "website": "http://www.wisconsindeathtrip.com"}, "type": "movie", "writers": ["Michael Lesy (book)", "James Marsh"], "year": 1999}