{"_id": "573a13c0f29313caabd63090", "awards": {"nominations": 14, "text": "11 wins & 14 nominations.", "wins": 11}, "cast": ["Rachel Weisz", "Max Minghella", "Oscar Isaac", "Ashraf Barhom"], "countries": ["Spain"], "directors": ["Alejandro Amenèbar"], "fullplot": "Alexandria, 391 AD: Hypatia teaches astronomy, mathematics, and philosophy. Her student Orestes is in love with her, as is Davus, her personal slave. As the city's Christians, led by Ammonius and Cyril, gain political power, the institutions of learning may crumble along with the governance of slavery. Jump ahead 20 years: Orestes, the city's prefect, has an uneasy peace with Christians, led by Cyril. A group from the newly empowered Christians has now taken to enforce their cultural hegemony zealously; first they see the Jews as their obstacle, then nonbelievers. Hypatia has no interest in faith; she's concerned about the movement of celestial bodies and \"the brotherhood of all\". Although her former slave doesn't see it that way.", "genres": ["Adventure", "Drama", "History"], "imdb": {"id": 1186830, "rating": 7.2, "votes": 48110}, "languages": ["English"], "lastupdated": "2015-09-10 17:09:10.507000000", "metacritic": 55, "num_mflix_comments": 1, "plot": "A historical drama set in Roman Egypt, concerning a slave who turns to the rising tide of Christianity in the hope of pursuing freedom while falling in love with his mistress, the famous philosophy and mathematics professor Hypatia of Alexandria.", "poster": "https://m.media-amazon.com/images/M/MV5BMTA2MjIwMjE0MjZeQTJeQWpwZ15BbWU3MDU4ODIwODI@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1255046400000, "runtime": 127, "title": "Agora", "tomatoes": {"boxOffice": "$0.6M", "consensus": "Noble goals and a gripping performance from Rachel Weisz can't save Agora from its muddled script, uneven acting, and choppy editing.", "critic": {"meter": 53, "numReviews": 89, "rating": 5.7}, "dvd": 1286582400000, "fresh": 47, "lastUpdated": 1442082311000, "production": "Newmarket Films", "rotten": 42, "viewer": {"meter": 65, "numReviews": 21671, "rating": 3.5}, "website": "http://www.agorathemovie.com/"}, "type": "movie", "writers": ["Alejandro Amenèbar", "Mateo Gil"], "year": 2009}