{"_id": "573a13bcf29313caabd56589", "awards": {"nominations": 47, "text": "Nominated for 3 Oscars. Another 19 wins & 47 nominations.", "wins": 22}, "cast": ["Kate Winslet", "Leonardo DiCaprio", "Christopher Fitzgerald", "Jonathan Roumie"], "countries": ["USA", "UK"], "directors": ["Sam Mendes"], "fullplot": "It's 1955. Frank and April Wheeler, in the seventh year of their marriage, have fallen into a life that appears to most as being perfect. They live in the Connecticut suburbs with two young children. Frank commutes to New York City where he works in an office job while April stays at home as a housewife. But they're not happy. April has forgone her dream of becoming an actress, and Frank hates his job - one where he places little effort - although he has never figured out what his passion in life is. One day, April suggests that they move to Paris - a city where Frank visited during the war and loved, but where April has never been - as a means to rejuvenate their life. April's plan: she would be the breadwinner, getting a lucrative secretarial job for one of the major international organizations, while Frank would have free time to find himself and whatever his passion. Initially skeptical, Frank ultimately agrees to April's plan. When circumstances change around the Wheelers, April decides she will do whatever she has to to get herself out of her unhappy existence.", "genres": ["Drama", "Romance"], "imdb": {"id": 959337, "rating": 7.3, "votes": 141182}, "languages": ["English"], "lastupdated": "2015-08-19 00:02:33.983000000", "metacritic": 69, "num_mflix_comments": 5, "plot": "A young couple living in a Connecticut suburb during the mid-1950s struggle to come to terms with their personal problems while trying to raise their two children.", "poster": "https://m.media-amazon.com/images/M/MV5BMTczNDgzMjczOV5BMl5BanBnXkFtZTcwOTU3MzMwMg@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1232668800000, "runtime": 119, "title": "Revolutionary Road", "tomatoes": {"boxOffice": "$22.9M", "consensus": "Brilliantly acted and emotionally powerful, Revolutionary Road is a handsome adaptation of Richard Yates' celebrated novel.", "critic": {"meter": 67, "numReviews": 203, "rating": 6.6}, "dvd": 1243900800000, "fresh": 137, "lastUpdated": 1442341683000, "production": "Paramount Vantage", "rotten": 66, "viewer": {"meter": 71, "numReviews": 105793, "rating": 3.5}, "website": "http://www.revolutionaryroadmovie.com"}, "type": "movie", "writers": ["Justin Haythe (screenplay)", "Richard Yates (novel)"], "year": 2008}