{"_id": "573a1399f29313caabcedfac", "awards": {"nominations": 3, "text": "Nominated for 1 Oscar. Another 2 wins & 3 nominations.", "wins": 3}, "cast": ["Stockard Channing", "Will Smith", "Donald Sutherland", "Ian McKellen"], "countries": ["USA"], "directors": ["Fred Schepisi"], "fullplot": "New Yorkers Ouisa and Flan Kittredge are upper class private art dealers, pretentious but compassionate. Their prized possession is a double sided Kandinsky, one side that represents control, the other side chaos. They relay a story to their friends and acquaintances that over time becomes legendary. It is their encounter with a young black man who they had never met or heard of but who comes stumbling upon their front door one evening as they are courting an important investor, Geoffrey Miller, who could make them wealthy beyond what they could have dreamed. That black man is Paul Poitier, who has just arrived in the city, was just mugged outside their building and is sporting a minor knife wound to the abdomen. He is a friend of the Kittredge's children, who are attending Harvard, but more importantly is the son of actor/director Sidney Poitier. Tomorrow, Paul is meeting up with his father who is in town directing a movie of \"Cats\". Beyond the attraction of talking Paul into getting them roles in the movie, Ouisa, Flan and Geoffrey all end up being captivated by the charm, charisma, pedigree and eloquence of Paul, who the Kittredges, after tending to his wounds, invite to stay the night. Their encounter with Paul ends up being an all too familiar story, which they will soon learn, and leads the Kittredges on a search for Paul after he leaves their abode the next morning. In that search, Ouisa, in particular, begins to view critically their life and just how much compassion they really have.", "genres": ["Comedy", "Drama", "Mystery"], "imdb": {"id": 108149, "rating": 6.9, "votes": 15568}, "languages": ["English"], "lastupdated": "2015-09-02 00:40:01.680000000", "plot": "An affluent New York couple find their lives touched, intruded upon, and compelled by a mysterious young black man who is never quite who he says he is.", "poster": "https://m.media-amazon.com/images/M/MV5BMTQ5ODk1NTI4NV5BMl5BanBnXkFtZTcwNDYzMjI3NA@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 755308800000, "runtime": 112, "title": "Six Degrees of Separation", "tomatoes": {"consensus": "Though it betrays its theatrical roots, Six Degrees of Separation largely succeeds thanks to astute direction and fine performances -- particularly from an against-type Will Smith.", "critic": {"meter": 88, "numReviews": 32, "rating": 7.1}, "dvd": 966297600000, "fresh": 28, "lastUpdated": 1440439465000, "production": "MGM Home Entertainment", "rotten": 4, "viewer": {"meter": 71, "numReviews": 16347, "rating": 3.4}}, "type": "movie", "writers": ["John Guare (play)", "John Guare (screenplay)"], "year": 1993}