{"_id": "573a13b2f29313caabd3acef", "awards": {"nominations": 11, "text": "2 wins & 11 nominations.", "wins": 2}, "cast": ["Benedict Cumberbatch", "Jared Harris", "Jamie Sives", "Richard McCabe"], "countries": ["UK"], "fullplot": "In the early 1800s young Edmund Talbot travels on a not too sea-worthy ship to New South Wales to take up a post with its governor. He keeps a journal, recording his impressions of crew and passengers. He gets on well with the Captain, Anderson, an amateur botanist who grows plants in his cabin, but, due to a social gaffe, well-meaning young parson Colley falls foul of the captain, later getting drunk and having gay sex with crew members. Despite Edmund's efforts to broker an understanding he remains in his cabin, where he literally wastes away. Edmund has a sexual encounter with the comely Zenobia, travelling with her parents, but he comes to realize that they are not related at all, merely a sexual threesome. Miss Granham, travelling to take up the job of a governess, falls for the older Mr. Prettiman, whom Edmund despises as a free-thinker, though they eventually reconcile. Prettiman is badly injured in a fall and Miss Granham agrees to marry him immediately, with flowers provided by the captain, and he recovers. Wheeler, Edmund's steward, is less fortunate. He is thrown overboard as a Jonah, and, although he survives, it is all too much for him. A broken mast leaves the ship drifting dangerously towards an ice-field but the scientifically-minded Lieutenant Benet mends it in time. Arriving in Australia, Edmund's friend Lieutenant Summers is given his own ship but dies when it catches fire. Edmund is re-united with the lovely Marian, who has been travelling on another vessel, the' Alcyone,' which met up with Edmund's ship in mid-ocean and he was instantly smitten by her. He has come 'to the ends of the Earth' and, unlike several of his fellow travellers, found contentment.", "genres": ["Drama"], "imdb": {"id": 435995, "rating": 7.4, "votes": 1170}, "languages": ["English"], "lastupdated": "2015-07-24 00:55:27.507000000", "num_mflix_comments": 1, "plot": "In 1812, young British aristocrat Edmund Talbot travels by ship to Australia, and learns more about himself and about life than he had ever bargained for.", "poster": "https://m.media-amazon.com/images/M/MV5BMjAxMTE5Njg3M15BMl5BanBnXkFtZTcwNzg0OTAzMQ@@._V1_SY1000_SX677_AL_.jpg", "released": 1120608000000, "runtime": 267, "title": "To the Ends of the Earth", "tomatoes": {"lastUpdated": 1430249732000, "viewer": {"numReviews": 0, "rating": 0}}, "type": "movie", "year": 2005}