{"_id": "573a1398f29313caabce9366", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Steve Guttenberg", "Kim Cattrall", "G.W. Bailey", "Bubba Smith"], "countries": ["USA"], "directors": ["Hugh Wilson"], "fullplot": "The year is 1984 and the mayoress has removed set personal criteria form the requirements to join the police force. No longer is sex, weight, height and orientation a factor. This now allows for an insurgence of people applying. The Police Academy series follows a select group of misfits in their quest to become police men and women. The first film of the series follows these misfits in their time at the Police Academy. The main focus is on a petty criminal called Mahoney. Mahoney is busted for criminal damage and as punishment is forced to go to Police Academy. Mahoney initially feels that this isn't the right place for him and he makes it his mission to be thrown out as he is not allowed to quit. As the classes go by and the training exercises are played out, Mahoney soon realizes that he is actually enjoying the academy and does want to become a police officer. We are also introduced to the gun maniac Tackelberry, the very tall Hightower, voluptuous Callahan, squeaky Hooks, human beat box and sound effects master Jones and the ever confuzzled Commandant Lassard. This group become good friends and become the base for the rest of the series of films.", "genres": ["Comedy"], "imdb": {"id": 87928, "rating": 6.6, "votes": 80278}, "languages": ["English"], "lastupdated": "2015-09-05 00:24:11.847000000", "metacritic": 41, "num_mflix_comments": 1, "plot": "A group of good-hearted but incompetent misfits enter the police academy, but the instructors there are not going to put up with their pranks.", "poster": "https://m.media-amazon.com/images/M/MV5BMjNiMWVhNjAtMzgyYS00NzRhLWJmNGUtNzdiOGFhMmY5NDUwL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 448848000000, "runtime": 96, "title": "Police Academy", "type": "movie", "writers": ["Neal Israel (screenplay)", "Pat Proft (screenplay)", "Hugh Wilson (screenplay)", "Neal Israel (story)", "Pat Proft (story)"], "year": 1984}