{"_id": "573a1393f29313caabcddb29", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Margaret Lockwood", "Dennis Price", "Cecil Parker", "Dermot Walsh"], "countries": ["UK"], "directors": ["Brian Desmond Hurst"], "fullplot": "Much to the consternation of the local townsfolk, the very rich Copper John Brodrick begins to develop a copper mine on Hungry Hill. He imports Cornish workers hoping to eventually entice the locals into working for him. His son, known as Greyhound John, isn't so sure anything will endear them to the locals. The opposition to the Brodricks is lead by the Donovan family and he gives them fair warning to stay off the property. When one of the protesters is killed while trying to help himself to some of the copper, the townspeople attack the facilities resulting in a great many more deaths - including one of Brodrick's sons, Henry - when the gunpowder store explodes. It marks the true beginning of a feud that will last for decades. Brodrick rebuilds his facilities and Greyhound John returns from London where he is studying the law after his sister tells him Fanny Rosa has also returned. A cave-in at the mine kills another member of the Donovan family but the younger John contracts typhoid and dies. Copper John lives on hoping his grandson Johnny will take over but he joins the army. When he finally inherits the estate, he has his own troubles to deal with.", "genres": ["Drama"], "imdb": {"id": 39479, "rating": 7.3, "votes": 365}, "languages": ["English"], "lastupdated": "2015-07-31 00:07:58.177000000", "num_mflix_comments": 1, "plot": "Story of a feud that has gone on between two Irish families for more than 50 years.", "poster": "https://m.media-amazon.com/images/M/MV5BMjEzODM3NDE2NV5BMl5BanBnXkFtZTgwNjMzNzk1MDE@._V1_SY1000_SX677_AL_.jpg", "rated": "APPROVED", "released": -701913600000, "runtime": 92, "title": "Hungry Hill", "tomatoes": {"lastUpdated": 1440698524000, "production": "Paramount Pictures", "viewer": {"meter": 58, "numReviews": 100, "rating": 3.6}}, "type": "movie", "writers": ["Daphne Du Maurier (novel)", "Terence Young (screenplay)", "Daphne Du Maurier (screenplay)", "Francis Crowdy (additional dialogue)"], "year": 1947}