{"_id": "573a1395f29313caabce1b8d", "awards": {"nominations": 1, "text": "1 win & 1 nomination.", "wins": 1}, "cast": ["Maurice Chevalier", "Hayley Mills", "George Sanders", "Wilfrid Hyde-White"], "countries": ["USA"], "directors": ["Robert Stevenson"], "fullplot": "An earthquake, a flash flood, an avalanche, a volcano, alligators, jaguars, mutineers, and a man-eating Maoris dog the steps of a shipping company owner, a scientist, and the two children of a lost sea captain as they circle the earth along the 37th parallel per instructions in a bottled note the scientist has recovered from a shark's stomach. Only certain facts are discern from the stained note, especially the words \"37 parallel.\" Teen-age Mary Grant (Hayley Mills), her younger brother , Robert Keith Hamshere, and the scientist, French Professor Jacques Paganel (Maurice Chevalier), trick their way aboard the grand yacht, \"Persevero,\" during a bon-voyage party to see the owner of the shipping company, Lord Edward Glenarvan (Wilfrid Hyde-White),the epitome of British aloofness. With the urging of his own son, John (Michael Anderson Jr.'), Glenarvan's luxurious side-wheeler sets sail for the coastal town of Concepcion, Chile in the search for the missing Captain Grant.", "genres": ["Adventure", "Family", "Fantasy"], "imdb": {"id": 56095, "rating": 6.7, "votes": 1805}, "languages": ["English", "French"], "lastupdated": "2015-08-30 00:46:59.773000000", "num_mflix_comments": 3, "plot": "In 19th century England young Mary Grant and her brother Robert Grant embark on a dangerous quest to find their missing father,sea captain Grant,who vanished somewhere along the Chilean coast.", "poster": "https://m.media-amazon.com/images/M/MV5BZDc1OTllMTUtMWJjMC00MjExLWJhNGMtOTU4NmE5YmM4YzgzXkEyXkFqcGdeQXVyMjU5OTg5NDc@._V1_SY1000_SX677_AL_.jpg", "rated": "APPROVED", "released": -221875200000, "runtime": 98, "title": "In Search of the Castaways", "tomatoes": {"dvd": 1115078400000, "lastUpdated": 1440442905000, "viewer": {"meter": 66, "numReviews": 4578, "rating": 3.5}}, "type": "movie", "writers": ["Lowell S. Hawley (screenplay)"], "year": 1962}