{"_id": "573a13acf29313caabd27087", "awards": {"nominations": 1, "text": "5 wins & 1 nomination.", "wins": 5}, "cast": ["Jeremy Sisto", "Erik Palladino", "Bianca Lawson", "Oz Perkins"], "countries": ["USA"], "directors": ["Matthew Leutwyler"], "fullplot": "Six friends take a road trip to Galveston in an RV for the wedding of their friend, Kelly. The driver, Johnny, gets lost and they arrive in the small town of Lovelock and his friends Sara, Kate, Melody, Christian, and David, decide to spend the night in the Bed and Breakfast owned by the creepy Mr. Robert Wise. David has an argument with the chef of the inn, Henri, and when the chef is found dead and Mr. Wise has a heart attack in the middle of the night, the local Sheriff suspects the group of travelers and tells his Deputy, Enus to seize the keys to their RV and stay in Lovelock for the duration of the investigation. Then the Sheriff arrests \"The Mysterious Drifter\" who soon becomes his prime suspect. When the clumsy Johnny accidentally breaks an ancient exotic wooden box belonging to Mr. Wise, he releases the terrible, monstrous \"Kuman Thong\" and the evil spirit held inside escapes and possesses all the local town folk, transforming them into zombies. Ultimately, \"The Mysterious Drifter\", becomes our Hero. He is a long time student of powers from \"the other side\", and a relentless hunter of the dreaded, evil \"Kuman Thong\". He is the only one who knows how to fight and kill the evil spirit, which he does with the help of Sara and Melody, saving only the two remaining girls and himself, before leaving the destroyed horrible and destroyed Bed & Breakfast, and the pitiful ravaged town of Lovelock behind for good, while leaving the road wide open for a \"killer\" sequel", "genres": ["Comedy", "Horror", "Musical"], "imdb": {"id": 350774, "rating": 5.8, "votes": 5097}, "languages": ["English", "French", "American Sign Language"], "lastupdated": "2015-09-16 07:18:31.360000000", "metacritic": 34, "num_mflix_comments": 3, "plot": "A night at a local bed and breakfast turns into a bloody supernatural fight to the death.", "poster": "https://m.media-amazon.com/images/M/MV5BNTQ0NDQ3MzA4M15BMl5BanBnXkFtZTcwMDcyNDAzMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1153353600000, "runtime": 88, "title": "Dead & Breakfast", "tomatoes": {"critic": {"meter": 50, "numReviews": 18, "rating": 5.8}, "dvd": 1125964800000, "fresh": 9, "lastUpdated": 1438803921000, "production": "Anchor Bay Entertainment", "rotten": 9, "viewer": {"meter": 59, "numReviews": 10692, "rating": 3.2}, "website": "http://www.dandbfilm.com"}, "type": "movie", "writers": ["Matthew Leutwyler (story)", "Jun Tan (story)", "Billy Burke (story)", "Matthew Leutwyler (screenplay)"], "year": 2004}