{"_id": "573a13bcf29313caabd56a26", "awards": {"nominations": 6, "text": "6 nominations.", "wins": 0}, "cast": ["Robert Bixby", "Humphrey Bogart", "Warren Buffett", "George Bush"], "countries": ["USA"], "directors": ["Patrick Creadon"], "fullplot": "I.O.U.S.A. examines the rapidly growing national debt and its consequences for the United States and its citizens. As the Baby Boomer generation prepares to retire, will there even be any Social Security benefits left to collect? Burdened with an ever-expanding government and military, increased international competition, overextended entitlement programs, and debts to foreign countries that are becoming impossible to honor, America must mend its spendthrift ways or face an economic disaster of epic proportions. Throughout history, the American government has found it nearly impossible to spend only what has been raised through taxes. The film blends interviews with both average American taxpayers and government officials to demystify the nation's financial practices and policies. The film follows U.S. Comptroller General David Walker as he crisscrosses the country explaining America's unsustainable fiscal policies to its citizens. The film interweaves archival footage and economic data to paint a profile of America's current economic situation. The film also proffers potential financial scenarios and propose solutions about how to recreate a fiscally sound nation for future generations.", "genres": ["Documentary"], "imdb": {"id": 963807, "rating": 7.6, "votes": 1708}, "languages": ["English", "Mandarin"], "lastupdated": "2015-09-14 08:37:32.807000000", "metacritic": 70, "plot": "Few are aware that America may be on the brink of a financial meltdown. I.O.U.S.A. explores the country's shocking current fiscal condition and ways to avoid a national economic disaster.", "poster": "https://m.media-amazon.com/images/M/MV5BMTI1MzQ0MDAxMV5BMl5BanBnXkFtZTcwODg3NDA4MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 1226620800000, "runtime": 85, "title": "I.O.U.S.A.", "tomatoes": {"boxOffice": "$0.6M", "consensus": "A potent and lithely constructed documentary about America's financial crisis, I.O.U.S.A grabs you with figures but holds you with irreverent wit.", "critic": {"meter": 88, "numReviews": 64, "rating": 7.2}, "dvd": 1239062400000, "fresh": 56, "lastUpdated": 1441136482000, "production": "Roadside Attractions", "rotten": 8, "viewer": {"meter": 86, "numReviews": 1789, "rating": 3.9}, "website": "http://www.iousathemovie.com"}, "type": "movie", "writers": ["Patrick Creadon", "Christine O'Malley", "Addison Wiggin (story)", "Addison Wiggin", "Kate Incontrera (story)", "William Bonner (book)"], "year": 2008}