{"_id": "573a13adf29313caabd29a98", "awards": {"nominations": 10, "text": "10 wins & 10 nominations.", "wins": 10}, "cast": ["Christian Bale", "Jennifer Jason Leigh", "Aitana Sènchez-Gijèn", "John Sharian"], "countries": ["Spain", "USA"], "directors": ["Brad Anderson"], "fullplot": "Trevor Reznik is a machinist in a factory. An extreme case of insomnia has led to him not sleeping in a year, and his body withering away to almost nothing. He has an obsessive compulsion to write himself reminder notes and keep track of his dwindling weight, both scribbled on yellow stickies in his apartment. The only person he lets into his life in an emotional sense is Stevie, a prostitute, although he has an infatuation with Maria, a single mother waitress working in an airport diner. His co-workers don't associate with and mistrust him because of not knowing what is going on in his life that has led to his emaciated physical appearance. A workplace incident further alienates him with his coworkers, and in conjunction with some unfamiliar pieces of paper he finds in his apartment, Trevor believes that someone or some people - probably one or some of his coworkers - are out to get him, using a phantom employee named Ivan as their front. As Trevor goes on a search for evidence as to Ivan's schemes and whereabouts, Trevor may come to a true understanding of what has caused his insomnia.", "genres": ["Drama", "Thriller"], "imdb": {"id": 361862, "rating": 7.7, "votes": 258272}, "languages": ["English", "Spanish"], "lastupdated": "2015-09-10 18:00:13.327000000", "metacritic": 61, "num_mflix_comments": 2, "plot": "An industrial worker who hasn't slept in a year begins to doubt his own sanity.", "poster": "https://m.media-amazon.com/images/M/MV5BNjk1NzBlY2YtNjJmNi00YTVmLWI2OTgtNDUxNDE5NjUzZmE0XkEyXkFqcGdeQXVyNTc1NTQxODI@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1102032000000, "runtime": 101, "title": "The Machinist", "tomatoes": {"boxOffice": "$0.9M", "consensus": "Brad Anderson's dark psychological thriller about a sleepless factory worker is elevated by Christian Bale astonishingly committed performance.", "critic": {"meter": 77, "numReviews": 141, "rating": 6.6}, "dvd": 1118102400000, "fresh": 108, "lastUpdated": 1442079127000, "production": "Paramount Classics", "rotten": 33, "viewer": {"meter": 83, "numReviews": 154196, "rating": 3.7}, "website": "http://www.machinistmovie.com"}, "type": "movie", "writers": ["Scott Kosar"], "year": 2004}