{"_id": "573a13a5f29313caabd13e50", "awards": {"nominations": 2, "text": "1 win & 2 nominations.", "wins": 1}, "cast": ["Charlotte Gainsbourg", "Yvan Attal", "Terence Stamp", "Noèmie Lvovsky"], "countries": ["France"], "directors": ["Yvan Attal"], "fullplot": "Paris can boast a population of 2,125,246. Of these 1,153,000 are women and 10,000 are actresses. Yvan, a young sports writer, is married to one who is very well known - Charlotte. They try to live a normal life, but her fame makes it difficult - autograph hunters interrupt their dinners, cops about to serve traffic summonses let them off with a warning and a smile when they recognize her, and impossible-to-get restaurant reservations magically appear when Charlotte makes the calls instead of Yvan. All this threatens and challenges his male ego, but Yvan is able to take her stardom in stride. Until, that is, a man at a bar asks him if he gets jealous watching his wife make love in the nude to another man on screen. It has never seriously bothered him before, but the stranger sows the first seed of doubt in his head...", "genres": ["Comedy", "Drama", "Romance"], "imdb": {"id": 269499, "rating": 6.6, "votes": 3164}, "languages": ["French", "English"], "lastupdated": "2015-08-09 01:20:12.127000000", "metacritic": 57, "num_mflix_comments": 1, "plot": "A \"normal\" guy who is married to a hot actress gets worried that she is involved with her costar. This worry turns into jealousy and causes problems in their relationship. This is a story about trust and a comedy about the actions between men and women.", "poster": "https://m.media-amazon.com/images/M/MV5BMTY3OTUyNDE0M15BMl5BanBnXkFtZTYwNzg2Nzg5._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1005696000000, "runtime": 95, "title": "My Wife Is an Actress", "tomatoes": {"boxOffice": "$0.7M", "consensus": "My Wife is an Actress is a delightful, snappy romantic comedy.", "critic": {"meter": 66, "numReviews": 73, "rating": 6.3}, "dvd": 1039478400000, "fresh": 48, "lastUpdated": 1439666155000, "production": "Sony Pictures Classics", "rotten": 25, "viewer": {"meter": 65, "numReviews": 3124, "rating": 3.4}, "website": "http://www.sonyclassics.com/mywifeisanactress/index-flash.html"}, "type": "movie", "writers": ["Yvan Attal"], "year": 2001}