{"_id": "573a13c3f29313caabd6b3ec", "awards": {"nominations": 1, "text": "1 win & 1 nomination.", "wins": 1}, "cast": ["Karen O'Toole"], "countries": ["USA"], "directors": ["Geralyn Pezanoski"], "fullplot": "MINE is the powerful story about the essential bond between humans and animals told against the backdrop of one of the worst natural disasters in U.S. history. MINE explores how tragedy intensifies that bond and is told from the perspective of original guardians, rescuers, and adoptive parents of the voiceless victims of Katrina. These individuals are all connected by two things, the tragic aftermath of Katrina and their love of animals. In response to an unprecedented crisis, thousands of pets needed to be transported around the country and adopted even when their displaced guardians still desperately wanted them. Meanwhile, many adoptive guardians have forged strong bonds with their new pets, nurturing them back to health from the traumas they suffered during and after the storm. When two families love the same pet, conflicts inevitably arise over who is the rightful \"owner\" and what is right for the animal. At the center of this tension are pets who are loved like family, but by law are considered property. This begs the question, who is looking out for the best interest of the animals? Set in a post-Katrina landscape of poverty, loss and moral uncertainty, MINE presents the complexity of an intensely emotional situation that has no simple answers. A tragedy of this scale reveals the worst and brings out the best in humankind and presents an opportunity for us to bring about meaningful social change. MINE is a compelling, character-driven story that challenges us see the way we treat animals in our society as a reflection of how we treat ourselves - and each other.", "genres": ["Documentary"], "imdb": {"id": 1326247, "rating": 7.6, "votes": 227}, "languages": ["English"], "lastupdated": "2015-08-16 00:24:35.213000000", "num_mflix_comments": 2, "plot": "MINE is the powerful story about the essential bond between humans and animals told against the backdrop of one of the worst natural disasters in U.S. history. MINE explores how tragedy ...", "poster": "https://m.media-amazon.com/images/M/MV5BMjIxMDU2MTY2OV5BMl5BanBnXkFtZTcwMDc5MDg5Mg@@._V1_SY1000_SX677_AL_.jpg", "released": 1235865600000, "runtime": 80, "title": "Mine", "tomatoes": {"critic": {"meter": 80, "numReviews": 15, "rating": 6.7}, "dvd": 1272931200000, "fresh": 12, "lastUpdated": 1441135972000, "production": "Film Movement", "rotten": 3, "viewer": {"meter": 89, "numReviews": 245, "rating": 4}, "website": "http://minethemovie.com/"}, "type": "movie", "writers": ["Erin Essenmacher", "Geralyn Pezanoski (creator)"], "year": 2009}