{"_id": "573a13adf29313caabd2beb7", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Roger Carel", "Lorènt Deutsch", "Sara Forestier", "Jacques Frantz"], "countries": ["France", "Denmark"], "directors": ["Stefan Fjeldmark", "Jesper Mèller"], "fullplot": "After another raid in an empty village, the chief of the Vikings Timandahaf misunderstands the explanation of his druid Cryptograf that \"fear gives wings to the dwellers\" and believes that fear actually makes the villagers fly. They decide to chase the champion of fear in Gaul to learn how to fly and make them invincible warriors. Meanwhile, the nephew of Vitalstatistix, Justforkix, is sent from Parisium to the Gaulish village to become a man and Asterix and Obelix are assigned to train the youngster. The stupid son of Cryptograf, Olaf, listens to a conversation of the coward Justforkix with Asterix and Obelix and kidnaps him. While returning to the Viking village, Justforkix meets Abba, the daughter of Timandahaf, and they fall in love for each other. But the Machiavellian and ambitious Cryptograf plan to marry his son Olaf with Abba and become powerful. In the end, Asterix realizes that it is not fear that gives wings, it is love.", "genres": ["Animation", "Adventure", "Comedy"], "imdb": {"id": 371552, "rating": 6, "votes": 7477}, "languages": ["French", "English"], "lastupdated": "2015-08-19 00:29:48.860000000", "num_mflix_comments": 2, "plot": "After another raid in an empty village, the chief of the Vikings Timandahaf misunderstands the explanation of his druid Cryptograf that \"fear gives wings to the dwellers\" and believes that ...", "poster": "https://m.media-amazon.com/images/M/MV5BZjMzMmEwNmYtNWNjOS00NDVmLWJkNDUtNTlkMWZhMTM3Y2MyL2ltYWdlXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_SY1000_SX677_AL_.jpg", "released": 1147996800000, "runtime": 78, "title": "Asterix and the Vikings", "type": "movie", "writers": ["Renè Goscinny (comic book)", "Albert Uderzo (comic book)", "Jean-Luc Goossens (script and dialogue)", "Stefan Fjeldmark (collaboration)", "Philip LaZebnik (additional dialogue)"], "year": 2006}