{"_id": "573a13aff29313caabd2fd40", "awards": {"nominations": 9, "text": "11 wins & 9 nominations.", "wins": 11}, "cast": ["Paul Kaye", "Beatriz Batarda", "Kate Magowan", "Mike Wilmot"], "countries": ["UK", "Canada"], "directors": ["Michael Dowse"], "fullplot": "Former musician Frankie Wilde is a legend within the Ibiza club scene for being the most inspired DJ around. On top of that, he has a beautiful model wife named Sonja Slowinski, although many within his social circle don't see her as being a good influence on him. But Frankie has disappeared from the Ibiza club scene now for a year, with most only speculating that his life has degenerated into squalor based on his excessive lifestyle in Ibiza. In reality, Frankie's current disappearance and his ultimate fate is due in part to his excessive substance abuse, especially of cocaine, but also partly due to exposure to continual loud music and a physical disorder: he went completely deaf, with no possibility of getting his hearing back. As he went from partial hearing to total deafness, Frankie believed he could still eke out a living as a DJ without telling many of his descent into total deafness. As Frankie went through a self-imposed isolation to deal with his deafness in his own unique way, it wasn't until he killed the giant badger that haunted him that he could reinvent himself and his life. He did this with the help of a young woman named Penelope Garcia. After his reinvention, Frankie first tried to capture his old glory but his current disappearance ends up being really for his and Penelope's sake.", "genres": ["Biography", "Comedy", "Drama"], "imdb": {"id": 388139, "rating": 7.4, "votes": 15937}, "languages": ["English"], "lastupdated": "2015-09-10 17:08:48.953000000", "metacritic": 56, "num_mflix_comments": 3, "plot": "Former musician Frankie Wilde is a legend within the Ibiza club scene for being the most inspired DJ around. On top of that, he has a beautiful model wife named Sonja Slowinski, although ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTY0OTY2MzMyN15BMl5BanBnXkFtZTcwNzE5NTgyMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1117152000000, "runtime": 90, "title": "It's All Gone Pete Tong", "type": "movie", "writers": ["Michael Dowse"], "year": 2004}