{"_id": "573a13aaf29313caabd21fed", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Michel Serrault", "Claire Bouanich", "Nade Dieu", "Jacques Bouanich"], "countries": ["France"], "directors": ["Philippe Muyl"], "fullplot": "This is the story of a young girl named Elsa who was raised by a single mother (Isabelle) in the city. Isabelle and Elsa begin the film moving in next door to an elderly man who collects butterflies (Julien). Isabelle who \"spends a lot of time with her friends\" does not pay much attention to her daughter who walks home because her mother forgot to pick her up from school. After meeting her new neighbor, Elsa finds out about the butterflies and in short annoys Julien for a while. Julien receives a mystery package from a fellow entomologist. Julien sets out on his annual attempt to find a rare species of butterfly that he had once promised his son he would find (son dead) in the French country side, specifically a region known as Vercors. Elsa stows away in his car. After being discovered she convinces him to let her come to Vercors with him. They bond while hiking and camping until Julien, who is initially annoyed by Elsa, near the end of the film seems to have a grandfather-granddaughter relationship with her. Elsa falls in a well. The police arrest Julien. Elsa tells everyone it is cool. Isabelle starts paying attention to her child. Julien and Elsa are friends. The mystery package contained a caterpillar which turned out to become the rare species of butterfly Julien set out to find. The species is called Isabelle. So Elsa finds her mother (Isabelle) and Julien finds the butterfly (Isabelle). Surprisingly happy feel for a french film.", "genres": ["Comedy", "Drama"], "imdb": {"id": 329485, "rating": 7.2, "votes": 2306}, "languages": ["French"], "lastupdated": "2015-08-20 01:04:14.093000000", "metacritic": 64, "num_mflix_comments": 2, "plot": "The plot summary says that the old man seeks a particular butterfly because of the request of his brother. Having just seen the movie, two of us are certain that it was his son, not his brother.", "poster": "https://m.media-amazon.com/images/M/MV5BNDc3Nzk1OTk0N15BMl5BanBnXkFtZTgwNzEwNjY2MDE@._V1_SY1000_SX677_AL_.jpg", "released": 1040169600000, "runtime": 85, "title": "The Butterfly", "tomatoes": {"critic": {"meter": 80, "numReviews": 20, "rating": 6.6}, "dvd": 1098144000000, "fresh": 16, "lastUpdated": 1439402607000, "production": "First Run Features", "rotten": 4, "viewer": {"meter": 85, "numReviews": 3750, "rating": 3.8}, "website": "http://www.firstrunfeatures.com/cs_butterfly.html"}, "type": "movie", "writers": ["Philippe Muyl"], "year": 2002}