{"_id": "573a13b0f29313caabd34c60", "awards": {"nominations": 4, "text": "3 wins & 4 nominations.", "wins": 3}, "cast": ["Peter Mullan", "Brenda Blethyn", "Sean McGinley", "Jamie Sives"], "countries": ["UK"], "directors": ["Gaby Dellal"], "fullplot": "After decades of laboring as a Glasgow shipbuilder, Frank Redmond, a no-nonsense 55-year-old working-class man, suddenly finds himself laid off. For the first time in his life, he is without a job or a sense of direction, and he's too proud to ask for guidance. His best mates - rascally Danny, timid Norman and cynical Eddie - are there for him, but Frank still feels desperately alone. An offhand remark from Danny inspires Frank to challenge himself. Already contemplating the state of his relationships with loving wife Joan and all-but-estranged son Rob, Frank is determined to shore up his own self-confidence. He will attempt the near impossible - swimming the English Channel. As Frank plunges headlong into his new daily life, his astonished friends are swept along with him. Prodded by stalwart fish-and-chips shop owner Chan, the men support Frank, train him - and keep their goal secret from his wife and son. Frank is unable to confide in those closest to him, but as the big day and moment of truth draw near, there is a sea change. Frank's family confronts him, and he realizes that he must repair his strained family ties. As Frank and those closest to him discover - or re-discover - reserves of love and compassion, he realizes that he is also swimming from one part of his life to another.", "genres": ["Comedy", "Drama", "Romance"], "imdb": {"id": 410400, "rating": 7, "votes": 2668}, "languages": ["English"], "lastupdated": "2015-09-13 00:27:49.950000000", "metacritic": 62, "plot": "Frank determines to salvage his self-esteem and tackle his demons by attempting the ultimate test of endurance - swimming the English Channel.", "poster": "https://m.media-amazon.com/images/M/MV5BMTU3MTAxNDM2M15BMl5BanBnXkFtZTcwMDE3NDIzMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1125619200000, "runtime": 98, "title": "On a Clear Day", "tomatoes": {"boxOffice": "$90.7k", "consensus": "Another blue-collar inspirational feel-good British dramedy, On A Clear Day succeeds on the strength of lead actor Peter Mullan's performance and Gaby Dellal's competent direction.", "critic": {"meter": 67, "numReviews": 67, "rating": 6.2}, "dvd": 1152576000000, "fresh": 45, "lastUpdated": 1440271294000, "production": "Focus Features", "rotten": 22, "viewer": {"meter": 72, "numReviews": 12436, "rating": 3.4}}, "type": "movie", "writers": ["Alex Rose"], "year": 2005}