{"_id": "573a1397f29313caabce8bfa", "awards": {"nominations": 1, "text": "Nominated for 1 BAFTA Film Award. Another 1 win & 1 nomination.", "wins": 2}, "cast": ["Graham Chapman", "John Cleese", "Terry Gilliam", "Eric Idle"], "countries": ["UK"], "directors": ["Terry Jones", "Terry Gilliam"], "fullplot": "Why are we here, what's it all about? The Monty Python-team is trying to sort out the most important question on Earth: what is the meaning of life? They do so by exploring the various stages of life, starting with birth. A doctor seems more interested in his equipment than in delivering the baby or caring for the mother, a Roman Catholic couple have quite a lot of children because 'every sperm is sacred'. In the growing and learning part of life, catholic schoolboys attend a rather strange church service and ditto sex education lesson. Onto war, where an officer's plan to attack is thwarted by his underlings wanting to celebrate his birthday and an officer's leg is bitten off by presumably an African tiger. At middle age a couple orders 'philosophy' at a restaurant, after which the film continues with live organ transplants. The autumn years are played in a restaurant, which, after being treated to the song 'Isn't It Awfully Nice to Have a Penis?' by an entertainer, sees the arrival of an extremely fat man. He can eat a lot, but also throw up quite copiously. The Grim Reaper brings for the final stage of human life, death, a visit to a mansion, where the people are rather interested in him. But life doesn't stop at death. It's onto heaven, where it's always Christmas.", "genres": ["Comedy", "Musical"], "imdb": {"id": 85959, "rating": 7.6, "votes": 77643}, "languages": ["English"], "lastupdated": "2015-09-16 11:49:52.407000000", "plot": "The comedy team takes a look at life in all its stages in their own uniquely silly way.", "poster": "https://m.media-amazon.com/images/M/MV5BZWJkNGY5MDAtYmVkMy00NzdiLTk5MzctMzA0MjMxMDY2NGYwXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 417916800000, "runtime": 107, "title": "The Meaning of Life", "tomatoes": {"critic": {"meter": 90, "numReviews": 30, "rating": 7.4}, "dvd": 1062460800000, "fresh": 27, "lastUpdated": 1440007877000, "production": "Universal Pictures", "rotten": 3, "viewer": {"meter": 83, "numReviews": 201410, "rating": 3.7}}, "type": "movie", "writers": ["Graham Chapman", "John Cleese", "Terry Gilliam", "Eric Idle", "Terry Jones", "Michael Palin"], "year": 1983}