{"_id": "573a13b0f29313caabd32981", "awards": {"nominations": 3, "text": "Nominated for 1 Primetime Emmy. Another 2 nominations.", "wins": 0}, "cast": ["Barry Pepper", "Elizabeth Mitchell", "Ernest Whitted", "Andrea Powell"], "countries": ["USA"], "directors": ["Russell Mulcahy"], "fullplot": "Biographical story of Dale Earnhardt, Sr. starts with his young life and growing up with his father, Ralph, who raced for a living, but initially wanted more for his son. When Dale quits high school to start driving full time, his father aids him and shows a reluctant pride when he is initially successful. Armed with many of his father's philosophies, Dale pushed himself to be the best. His aggressive track mannerisms earned himself fans and detractors. Fellow racer Neil Bonnett was one of those long time friends and whose death deeply affected Dale. Darrell Waltrip clearly was a detractor and the two men's rivalry is clearly depicted. Off the track, Dale's determination to make it impacts two marriages. Third wife Theresa was closer to racing and met Dale when he had started his rise into the Winston Cup circuit. The story also looks at his relationship with his children, particularly son Kerry from his first marriage and whom he did not see again after age 5 until Kerry in his late teens showed up to meet his father again. Similar to his own father, Dale drove Dale Jr. to be the best, including temporarily sending him to military school when his grades slipped, but like his father, Dale Jr. only wanted to race. Contains mild profanity.", "genres": ["Biography", "Drama", "Sport"], "imdb": {"id": 401088, "rating": 6.9, "votes": 1343}, "languages": ["English"], "lastupdated": "2015-06-15 00:34:29.767000000", "plot": "Barry Pepper portrays legendary race car drive Dale Earnhardt, who died in 2001 during the last lap of the Daytona 500.", "poster": "https://m.media-amazon.com/images/M/MV5BNzM1MDYyOTc4MF5BMl5BanBnXkFtZTcwOTc0MzQ0MQ@@._V1_SY1000_SX677_AL_.jpg", "released": 1102723200000, "runtime": 92, "title": "3: The Dale Earnhardt Story", "tomatoes": {"dvd": 1285459200000, "lastUpdated": 1440530605000, "viewer": {"meter": 83, "numReviews": 755, "rating": 4.1}}, "type": "movie", "writers": ["Robert Eisele"], "year": 2004}