{"_id": "573a13bdf29313caabd598d0", "awards": {"nominations": 2, "text": "1 win & 2 nominations.", "wins": 1}, "cast": ["Chris Marquette", "Brooke Nevin", "Kinsey Packard", "E. Quincy Sloan"], "countries": ["USA"], "directors": ["Kyle Rankin"], "fullplot": "Our hero, Cooper, awakes to find himself nauseous, weak and covered in webbing, hanging from the ceiling of an office where, just minutes ago, he started his new job. As he struggles out of his slimy prison he comes face to face with his opponent - a grotesque, powerful and very angry bug. All 3 ft of it. And so begins a hideous, nail-biting, comedic, all-action adventure to find a safe haven while constantly outwitting an infestation of monstrous proportions. As Cooper embarks on his journey, he befriends a ragtag group of survivors including Sara, a feisty attractive female. Although the situation is dire, Cooper can't help himself from trying to solve his dating problem while trying to save his life. Will they make it to safety before they are picked off one by one? And what other surprises are in store for our group of unlikely heroes?", "genres": ["Action", "Comedy", "Horror"], "imdb": {"id": 1020543, "rating": 6, "votes": 7445}, "languages": ["English"], "lastupdated": "2015-08-06 00:04:08.617000000", "plot": "A slacker awakes to find himself weak and wrapped in a webbing; after realizing that the world has been taken over by giant alien insects, he wakes a ragtag group of strangers and together they fight for survival.", "poster": "https://m.media-amazon.com/images/M/MV5BMDgzOTI4NGUtZmNkNC00ZjIwLThmYTctNmQzYWFjZDg0YTlkXkEyXkFqcGdeQXVyMTMxMTY0OTQ@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1259366400000, "runtime": 91, "title": "Infestation", "tomatoes": {"dvd": 1255392000000, "lastUpdated": 1440614014000, "production": "Icon Productions", "viewer": {"meter": 33, "numReviews": 1812, "rating": 2.9}, "website": "http://www.infestationthemovie.com/"}, "type": "movie", "writers": ["Kyle Rankin"], "year": 2009}