{"_id": "573a1397f29313caabce8095", "awards": {"nominations": 1, "text": "Nominated for 1 BAFTA Film Award. Another 2 wins & 1 nomination.", "wins": 3}, "cast": ["Alan Bates", "Maggie Smith", "Isabelle Adjani", "Anthony Higgins"], "countries": ["UK", "France"], "directors": ["James Ivory"], "fullplot": "It's 1927 Paris. Following the conviction of her art dealer husband, Stephan Zelli, for theft for which he was handed a one-year prison sentence, Marya Zelli, originally from West India, moves in with her acquaintances, expatriate Brits H.J. and Lois Heidler. Marya knows that H.J. in particular has more in mind than just providing her lodging out of the goodness of his heart. From behind bars, Stephan encourages Marya to move in with them not knowing H.J.'s intentions. Marya agrees in part because she, being a foreigner, cannot get work and would thus become destitute otherwise. She learns she is the latest in a long line of lodgers. She also learns that H.J. and Lois' marriage is not all that it appears on the surface. The Heidler's hold on Marya becomes stronger when they convince her that Stephan not only has no money but has no future in France after his release. Their collective lives become more complicated when Stephan is released from jail and tries to figure out what he's going to do with his life to regain the high standard of living to which he became accustomed.", "genres": ["Drama", "Romance"], "imdb": {"id": 82964, "rating": 6.3, "votes": 784}, "languages": ["English", "French"], "lastupdated": "2015-09-06 00:22:17.993000000", "plot": "Marya finds herself penniless after her art dealer husband, Stephan, is convicted of theft. Marya accepts the hospitality of a strange couple, H.J. and Lois Heidler, who lets her live in their house.", "poster": "https://m.media-amazon.com/images/M/MV5BNWQ4YmIyMDktZDQ5Zi00ZjE2LWJmMTgtY2ZkMTA3N2UxZTMyXkEyXkFqcGdeQXVyMjQzMzQzODY@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 372816000000, "runtime": 101, "title": "Quartet", "tomatoes": {"dvd": 1077580800000, "lastUpdated": 1438454459000, "production": "Criterion Collection", "viewer": {"meter": 33, "numReviews": 598, "rating": 2.9}}, "type": "movie", "writers": ["Jean Rhys (novel)", "Ruth Prawer Jhabvala (screenplay)", "Michel Maingois (French dialogue)"], "year": 1981}