{"_id": "573a1396f29313caabce5a56", "awards": {"nominations": 0, "text": "7 wins.", "wins": 7}, "cast": ["Shashi Kapoor", "Amitabh Bachchan", "Neetu Singh", "Nirupa Roy"], "countries": ["India"], "directors": ["Yash Chopra"], "fullplot": "The movie tells the story of two brothers, Vijay and Ravi Verma, who follow different career paths: Vijay is a smuggler and Ravi the policeman who is asked to hunt Vijay down. Vijay Verma (Amitabh Bachchan) and Ravi Verma (Shashi Kapoor) are the sons of a trade unionist, Anand Verma(Satyen Kappu), who was defeated and disgraced by the management of his firm using his family as bait. Unable to bear the public disgrace father deserts the family, and the sons are raised by their mother(Nirupa Roy)who brings them to Bombay City, who suffers the trials and tribulations of a poor single mother. Vijay Verma, the elder brother, grows up with an acute awareness of his father's humiliation and is victimized for his father's supposed misdeeds. In the process of fighting for his rights Vijay, who starts out as a boot polisher and becomes a dockyard worker in his youth, becomes a smuggler and a leading figure of the underworld.", "genres": ["Action", "Crime", "Drama"], "imdb": {"id": 72860, "rating": 8.1, "votes": 4753}, "languages": ["Hindi"], "lastupdated": "2015-09-17 04:37:47.103000000", "num_mflix_comments": 3, "plot": "As a youth, Vijay struggles as a dockworker. Eventually, he becomes a leading figure of the underworld, while younger brother, Ravi, is an educated, upright policeman. But in the end, it all comes down to, who does mother love more?", "poster": "https://m.media-amazon.com/images/M/MV5BMTU2NTYyOTA3NV5BMl5BanBnXkFtZTcwMDMyNjEzMQ@@._V1_SY1000_SX677_AL_.jpg", "released": 294364800000, "runtime": 174, "title": "Deewaar", "tomatoes": {"dvd": 1080604800000, "lastUpdated": 1442336779000, "viewer": {"meter": 85, "numReviews": 1174, "rating": 4}}, "type": "movie", "writers": ["Javed Akhtar (dialogue)", "Javed Akhtar (screenplay)", "Javed Akhtar (story)", "Salim Khan (dialogue)", "Salim Khan (screenplay)", "Salim Khan (story)"], "year": 1975}