{"_id": "573a13acf29313caabd28ca3", "awards": {"nominations": 4, "text": "4 nominations.", "wins": 0}, "cast": ["Richard Gere", "Jennifer Lopez", "Susan Sarandon", "Lisa Ann Walter"], "countries": ["USA"], "directors": ["Peter Chelsom"], "fullplot": "John Clark is a middle aged Chicago estate lawyer. He loves his family, which includes his wife Beverly, but their combined busy schedules and getting caught in a rut after two decades of marriage has left him feeling unfulfilled. While taking the el train home every night, he notices the same young, beautiful contemplative woman staring out of one of the windows of Miss Mitzi's Dance Studio, which specializes in ballroom. He is intrigued enough with her beauty and sadness to go in one evening on his way home. He learns that she is Paulina, one of the instructors and a former world class ballroom dancer. Because of her, he signs up for beginner group dance lessons, regardless of them being taught by Miss Mitzi herself, and not Paulina. As time progresses, John gets caught up in the lives of those at Miss Mitzi's: his two fellow classmates - overweight Vern who wants to learn to dance for his upcoming wedding, and Chic, who wants to impress the ladies - and two of the studio's competitive amateurs, opinionated and brash Bobbie, who is looking for a dance partner, and one person who surprises John and who just wants to be able to show his true colors to the world while hiding under a mask. But as Paulina slowly allows herself to be involved in their lives as well, despite she vowing not to fraternize with the students, John comes to the spoken realization of what he was looking for when he first spotted Paulina in the window. Similarly, each of those at the dance studio are looking for their small place in life with the right person, Paulina included. John may not get the happy ending that he wants as Beverly, based on circumstances, believes he is having an affair.", "genres": ["Comedy", "Drama", "Romance"], "imdb": {"id": 358135, "rating": 6.1, "votes": 33059}, "languages": ["English"], "lastupdated": "2015-08-24 00:18:11.447000000", "metacritic": 47, "plot": "A romantic comedy where a bored, overworked Estate Lawyer, upon first sight of a beautiful instructor, signs up for ballroom dancing lessons.", "poster": "https://m.media-amazon.com/images/M/MV5BMTcwODUwMTMxN15BMl5BanBnXkFtZTcwNzc3MjcyMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1097798400000, "runtime": 106, "title": "Shall We Dance", "tomatoes": {"boxOffice": "$57.8M", "consensus": "The cast is warmly appealing, but with the loss of cultural context and addition of big-name celebrities, this American version loses the nuances of the original.", "critic": {"meter": 46, "numReviews": 152, "rating": 5.4}, "dvd": 1107216000000, "fresh": 70, "lastUpdated": 1439834540000, "production": "Miramax Films", "rotten": 82, "viewer": {"meter": 57, "numReviews": 205320, "rating": 3}, "website": "http://www.miramax.com/shallwedance/"}, "type": "movie", "writers": ["Masayuki Suo", "Audrey Wells (screenplay)"], "year": 2004}