{"_id": "573a13a7f29313caabd1b779", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Robert Carlyle", "Vanessa Feltz", "Ricky Tomlinson", "Kathy Burke"], "countries": ["UK", "Germany"], "directors": ["Shane Meadows"], "fullplot": "Originally from the Midlands, Jimmy is currently living in Glasgow eking out a living as a hapless petty crook. One day, he sees his old family and friends - including his older foster sister Carol, her boyfriend/his old buddy Charlie, Jimmy's ex-wife and Carol's best friend Shirley, and Jimmy's pre-teen daughter Marlene - on a television talk show, they baring their souls to a national audience. He has not seen any of them in years. Of note on the show, Shirley rejects the marriage proposal of her slightly awkward live-in boyfriend Dek. Jimmy sees her answer to Dek as a reason to head back to the Midlands to reunite with his past, especially with Shirley and Marlene. Dek, already humiliated, is less than thrilled to see Jimmy back in their lives. In the ensuing duel between Jimmy and Dek for Shirley and Marlene's affections, others get caught up in the crossfire. Meanwhile, three of Jimmy's equally hapless crook friends from Glasgow come looking for him, Jimmy who left them high and dry at their latest heist and who absconded with all the money.", "genres": ["Comedy", "Drama", "Romance"], "imdb": {"id": 301684, "rating": 6.1, "votes": 3428}, "languages": ["English"], "lastupdated": "2015-08-25 00:20:54.993000000", "metacritic": 56, "plot": "After seeing his ex-girlfriend (Henderson) turn down a nationally televised marriage proposal, a small-time crook (Carlyle) returns to his hometown to try and win back her heart.", "poster": "https://m.media-amazon.com/images/M/MV5BMTU2ODkzOTExOV5BMl5BanBnXkFtZTYwMzk0NTk2._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1031270400000, "runtime": 104, "title": "Once Upon a Time in the Midlands", "tomatoes": {"consensus": "Though the concept is interesting and quirky, the drama fails to deliver.", "critic": {"meter": 51, "numReviews": 75, "rating": 5.6}, "dvd": 1076371200000, "fresh": 38, "lastUpdated": 1440613591000, "production": "Sony Pictures Classics", "rotten": 37, "viewer": {"meter": 46, "numReviews": 3541, "rating": 3.1}, "website": "http://www.sonyclassics.com/onceupon"}, "type": "movie", "writers": ["Paul Fraser", "Shane Meadows"], "year": 2002}