{"_id": "573a13cbf29313caabd7f77a", "awards": {"nominations": 8, "text": "5 wins & 8 nominations.", "wins": 5}, "cast": ["Ben Affleck", "Olga Kurylenko", "Rachel McAdams", "Javier Bardem"], "countries": ["USA"], "directors": ["Terrence Malick"], "fullplot": "Neil (Ben Affleck) is an American traveling in Europe who meets and falls in love with Marina (Olga Kurylenko), a Ukrainian divorcèe who is raising her 10-year-old daughter Tatiana in Paris. The lovers travel to Mont St. Michel, the island abbey off the coast of Normandy, basking in the wonder of their newfound romance. Neil makes a commitment to Marina, inviting her to relocate to his native Oklahoma with Tatiana. He takes a job as an environmental inspector and Marina settles into her new life in America with passion and vigor. After a holding pattern, their relationship cools. Marina finds solace in the company of another exile, the Catholic priest Father Quintana (Javier Bardem), who is undergoing a crisis of faith. Work pressures and increasing doubt pull Neil further apart from Marina, who returns to France with Tatiana when her visa expires. Neil reconnects with Jane (Rachel McAdams), an old flame. They fall in love until Neil learns that Marina has fallen on hard times. Gripped by a sense of responsibility - and his own crisis of faith - he rekindles with Marina after another trip to France. She returns with him to Oklahoma, resuming her American life. But the old sorrows eventually return.", "genres": ["Drama", "Romance"], "imdb": {"id": 1595656, "rating": 6, "votes": 18788}, "languages": ["English", "French", "Spanish", "Italian", "Sign Languages", "Russian"], "lastupdated": "2015-09-14 05:38:04.433000000", "metacritic": 58, "num_mflix_comments": 1, "plot": "After falling in love in Paris, Marina and Neil come to Oklahoma, where problems arise. Their church's Spanish-born pastor struggles with his faith, while Neil encounters a woman from his childhood.", "poster": "https://m.media-amazon.com/images/M/MV5BMTAwNzk1NjM2ODZeQTJeQWpwZ15BbWU3MDE1MjQwMjk@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1361491200000, "runtime": 112, "title": "To the Wonder", "type": "movie", "writers": ["Terrence Malick"], "year": 2012}