{"_id": "573a1396f29313caabce34c4", "awards": {"nominations": 6, "text": "Won 1 Oscar. Another 9 wins & 6 nominations.", "wins": 10}, "cast": ["Steve McQueen", "Robert Vaughn", "Jacqueline Bisset", "Don Gordon"], "countries": ["USA"], "directors": ["Peter Yates"], "fullplot": "High profile San Francisco Police Lieutenant Frank Bullitt is asked personally by ambitious Walter Chalmers, who is in town to hold a US Senate subcommittee hearing on organized crime, to guard Johnny Ross, a Chicago based mobster who is about to turn evidence against the organization at the hearing. Chalmers wants Ross' safety at all cost, or else Bullitt will pay the consequences. Bullitt and his team of Sergeant Delgetti and Detective Carl Stanton have Ross in protective custody for 48 hours over the weekend until Ross provides his testimony that upcoming Monday. Bullitt's immediate superior, Captain Samuel Bennet, gives Bullitt full authority to lead the case, no questions asked for any move Bullitt makes. When an incident occurs early during their watch, Bullitt is certain that Ross and/or Chalmers are not telling them the full story to protect Ross properly. Without telling Bennet or an incensed Chalmers, Bullitt clandestinely moves Ross while he tries to find out who is after Ross, and why Ross has seemingly made it so easy for \"them\" to find him. As Bullitt enlists the help of his live-in artist girlfriend Cathy over the weekend and as she sees for the first time with what he deals every day, she wonders if he is indeed the man with whom she should be.", "genres": ["Action", "Crime", "Mystery"], "imdb": {"id": 62765, "rating": 7.5, "votes": 43049}, "languages": ["English"], "lastupdated": "2015-09-07 00:08:54.533000000", "plot": "An all guts, no glory San Francisco cop becomes determined to find the underworld kingpin that killed the witness in his protection.", "poster": "https://m.media-amazon.com/images/M/MV5BYTQwNjkyMzctMjY1My00Y2U0LWE5MGEtNWY4M2FhZGYwODE1XkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": -38102400000, "runtime": 114, "title": "Bullitt", "tomatoes": {"consensus": "Steve McQueen is cool as ice in this thrilling police procedural that also happens to contain the arguably greatest car chase ever.", "critic": {"meter": 97, "numReviews": 34, "rating": 7.8}, "dvd": 879811200000, "fresh": 33, "lastUpdated": 1440357435000, "production": "Warner Home Video", "rotten": 1, "viewer": {"meter": 85, "numReviews": 39414, "rating": 3.8}}, "type": "movie", "writers": ["Alan Trustman (screenplay)", "Harry Kleiner (screenplay)", "Robert L. Fish (novel)"], "year": 1968}