{"_id": "573a13a9f29313caabd1fc1f", "awards": {"nominations": 6, "text": "6 wins & 6 nominations.", "wins": 6}, "cast": ["Ricardo Darèn", "Cecilia Roth", "Hèctor Alterio", "Fernanda Mistral"], "countries": ["Argentina", "Spain", "Italy"], "directors": ["Marcelo Pièeyro"], "fullplot": "The film is seen through the eyes of a ten-year-old boy, Harry (Matèas del Pozo), who does not know that Argentina's 1976 coup d'ètat is impacting his life. After witnessing the \"disappearance\" of dissident friends, a human rights lawyer (Ricardo Darèn) and his research scientist wife (Cecilia Roth) flee the city and hide from the military police in a vacant summer house. With them are their two kids: Harry, who is fascinated with the escape artistry of Harry Houdini, and El Enano, his little brother. (Translated as \"Little Guy\" in the English subtitles, played by Milton de la Canal. The actual translation is \"dwarf\".) The family adopts new identities and attempts to lead a normal life. Later, they are joined by a student who is using the alias Lucas (Tomès Fonzi). Their new life is difficult, but a visit with their estranged grandparents (Fernanda Mistral and Hèctor Alterio) reveals that they are still a close-knit family. Subtly hinted, however, and used as a metaphor, is the mother's constant smoking and El Enano's renewed bed-wetting. Both serve to show how stressful and precarious their situation is.", "genres": ["Drama"], "imdb": {"id": 320042, "rating": 7.2, "votes": 2445}, "languages": ["Spanish", "Swahili"], "lastupdated": "2015-08-13 00:37:35.520000000", "num_mflix_comments": 2, "plot": "The film is seen through the eyes of a ten-year-old boy, Harry (Matèas del Pozo), who does not know that Argentina's 1976 coup d'ètat is impacting his life. After witnessing the \"...", "released": 1034812800000, "runtime": 106, "title": "Kamchatka", "tomatoes": {"lastUpdated": 1441991614000, "production": "Buena Vista International", "viewer": {"meter": 79, "numReviews": 799, "rating": 3.8}}, "type": "movie", "writers": ["Marcelo Figueras", "Marcelo Pièeyro"], "year": 2002}