{"_id": "573a139cf29313caabcf66d1", "awards": {"nominations": 15, "text": "Nominated for 1 Golden Globe. Another 8 wins & 15 nominations.", "wins": 9}, "cast": ["Vanessa Paradis", "Daniel Auteuil", "Frèdèric Pfluger", "Demetre Georgalas"], "countries": ["France"], "directors": ["Patrice Leconte"], "fullplot": "It's night on a Paris bridge. A girl leans over Seine River with tears in her eyes and a violent yearning to drown her sorrows. Out of nowhere someone takes an interest in her. He is Gabor, a knife thrower who needs a human target for his show. The girl, Adele, has never been lucky and nowhere else to go. So she follows him. They travel along the northern bank of the Mediterranean to perform and in the process win a big fortune through gambling. Although both of them continue a platonic relationship, the sex-starved girl attempts to sleep with handsome guys she encounters throughout the journey. Finally, Adele falls in love with a newly-wed groom and both of them elope to Greece, while Gabor is stuck in Turkey. Then Adele is dumped by the groom. Only by now both Gabor and Adele realize that luck isn't with them unless they get together again. But both of them are so broke that they can't even feed themselves, let alone getting back to Paris and reunite...", "genres": ["Comedy", "Drama", "Romance"], "imdb": {"id": 144201, "rating": 7.7, "votes": 10362}, "languages": ["French", "Italian", "Greek"], "lastupdated": "2015-08-20 00:52:01.203000000", "metacritic": 75, "num_mflix_comments": 2, "plot": "It's night on a Paris bridge. A girl leans over Seine River with tears in her eyes and a violent yearning to drown her sorrows. Out of nowhere someone takes an interest in her. He is Gabor,...", "poster": "https://m.media-amazon.com/images/M/MV5BMTA4MjI5NzAzOTJeQTJeQWpwZ15BbWU2MDc5NjcwOQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 922838400000, "runtime": 90, "title": "The Girl on the Bridge", "tomatoes": {"critic": {"meter": 90, "numReviews": 40, "rating": 7.4}, "dvd": 1217289600000, "fresh": 36, "lastUpdated": 1437761959000, "production": "Paramount Classics", "rotten": 4, "viewer": {"meter": 90, "numReviews": 7112, "rating": 4.1}}, "type": "movie", "writers": ["Serge Frydman (dialogue)", "Serge Frydman (screenplay)"], "year": 1999}