{"_id": "573a1397f29313caabce7556", "awards": {"nominations": 12, "text": "Won 3 Oscars. Another 14 wins & 12 nominations.", "wins": 17}, "cast": ["John Collin", "Tony Church", "Nastassja Kinski", "Brigid Erin Bates"], "countries": ["France", "UK"], "directors": ["Roman Polanski"], "fullplot": "Wessex County, England during the Victorian era. Christian values dominate what are social mores. These mores and her interactions with two men play a large part in what happens in the young life of peasant girl, the shy, innocent, proper yet proud Tess Durbeyfield. The first of these men is Alec d'Urberville. After learning from a local historian that they are really descendants of the aristocratic d'Urberville family which has died out due to lack of male heirs, Tess' parents send her to a nearby mansion where they know some d'Urbervilles actually reside. This move is in order for the family to gain some benefit from their heritage. Upon her arrival at the mansion, Tess quickly learns that the family of Tess' \"cousin\" Alec are not true d'Urbervilles, but rather an opportunistic lot who bought the family name in order to improve their own standing in life. Tess is pulled between what she was sent to accomplish for her family against her general disdain for Alec, who will give her anything she wants in return for sexual favors. The second of these men is Angel Clare, the son of a parson and an apprentice farmer. Angel and Tess fall in love with each other. Tess has to decide if she will divulge to Angel her past relationship with Alec, which if she does may jeopardize their own relationship. But if she doesn't, Tess also has to figure out if the secret will haunt her and thus jeopardize their relationship in other ways.", "genres": ["Drama", "Romance"], "imdb": {"id": 80009, "rating": 7.3, "votes": 10134}, "languages": ["English"], "lastupdated": "2015-08-30 00:47:44.570000000", "num_mflix_comments": 2, "plot": "A strong-willed young peasant girl becomes the affection of two men.", "poster": "https://m.media-amazon.com/images/M/MV5BMWM1YjgwOTMtM2IzMi00ZGE2LWI3YzAtMjZmNjBhNGU4ZTcyXkEyXkFqcGdeQXVyMzk3NTUwOQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 345427200000, "runtime": 186, "title": "Tess", "tomatoes": {"critic": {"meter": 85, "numReviews": 20, "rating": 7.1}, "dvd": 1096329600000, "fresh": 17, "lastUpdated": 1441907641000, "production": "Criterion Collection", "rotten": 3, "viewer": {"meter": 78, "numReviews": 6163, "rating": 3.6}}, "type": "movie", "writers": ["Gèrard Brach (screenplay)", "Roman Polanski (screenplay)", "John Brownjohn (screenplay)", "Thomas Hardy (novel)"], "year": 1979}