{"_id": "573a1394f29313caabcdfa1f", "awards": {"nominations": 7, "text": "Won 1 Oscar. Another 6 wins & 7 nominations.", "wins": 7}, "cast": ["Humphrey Bogart", "Audrey Hepburn", "William Holden", "Walter Hampden"], "countries": ["USA"], "directors": ["Billy Wilder"], "fullplot": "Linus and David Larrabee are the two sons of a very wealthy family. Linus is all work -- busily running the family corporate empire with no time for a wife and family. David is all play -- technically employed in the family business but never showing up for work, spending all his time entertaining, and having been married and divorced three times. Sabrina Fairchild is the young, shy, and awkward daughter of the household chauffeur, who has been infatuated with David all her life, but whom David hardly notices till she goes away to Paris for two years and returns an elegant, sophisticated, beautiful woman. Suddenly, she finds she's captured David's attention, but just as she does so, she finds herself also falling in love with Linus, and she finds that Linus is also falling in love with her.", "genres": ["Comedy", "Drama", "Romance"], "imdb": {"id": 47437, "rating": 7.7, "votes": 40723}, "languages": ["English", "French"], "lastupdated": "2015-09-12 00:23:36.170000000", "metacritic": 72, "num_mflix_comments": 3, "plot": "A playboy becomes interested in the daughter of his family's chauffeur. But it's his more serious brother who would be the better man for her.", "poster": "https://m.media-amazon.com/images/M/MV5BYmFlNTA1NWItODQxNC00YjFmLWE3ZWYtMzg3YTkwYmMxMjY2XkEyXkFqcGdeQXVyMTMxMTY0OTQ@._V1_SY1000_SX677_AL_.jpg", "rated": "UNRATED", "released": -481334400000, "runtime": 113, "title": "Sabrina", "tomatoes": {"consensus": "With its humorous script and its stars' immense charm, Sabrina remains a resonant romantic gem.", "critic": {"meter": 91, "numReviews": 33, "rating": 7.6}, "dvd": 986860800000, "fresh": 30, "lastUpdated": 1442344334000, "production": "Paramount Home Video", "rotten": 3, "viewer": {"meter": 89, "numReviews": 54844, "rating": 3.8}}, "type": "movie", "writers": ["Billy Wilder (written for the screen by)", "Samuel A. Taylor (written for the screen by)", "Ernest Lehman (written for the screen by)", "Samuel A. Taylor (from the play by)"], "year": 1954}