{"_id": "573a13aef29313caabd2c9ef", "awards": {"nominations": 6, "text": "1 win & 6 nominations.", "wins": 1}, "cast": ["Nicole Kidman", "Will Ferrell", "Shirley MacLaine", "Michael Caine"], "countries": ["USA"], "directors": ["Nora Ephron"], "fullplot": "Out in California's San Fernando Valley, Isabel is trying to reinvent herself. A naève, good-natured witch, she is determined to disavow her supernatural powers and lead a normal life. At the same time, across town, Jack Wyatt a tall, charming actor is trying to get his career back on track. He sets his sights on an updated version of the beloved 1960s situation comedy Bewitched, re-conceived as a starring vehicle for himself in the role of the mere-mortal Darrin. Fate steps in when Jack accidentally runs into Isabel. He is immediately attracted to her and her nose, which bears an uncanny resemblance to the nose of Elizabeth Montgomery, who played Samantha in the original TV version of Bewitched. He becomes convinced she could play the witch Samantha in his new series. Isabel is also taken with Jack, seeing him as the quintessential mortal man with whom she can settle down and lead the normal life she so desires. It turns out they're both right--but in ways neither of them ever imagined.", "genres": ["Comedy", "Fantasy", "Romance"], "imdb": {"id": 374536, "rating": 4.8, "votes": 56066}, "languages": ["English", "Spanish"], "lastupdated": "2015-08-27 00:03:03.790000000", "metacritic": 34, "num_mflix_comments": 2, "plot": "Thinking he can overshadow an unknown actress in the part, an egocentric actor unknowingly gets a witch cast in an upcoming television remake of the classic show \"Bewitched\".", "poster": "https://m.media-amazon.com/images/M/MV5BNmNmYzJhODQtZWEyMS00NzUyLWFmYTAtZjYzMDNlNWU3NzVjXkEyXkFqcGdeQXVyNTUyMzE4Mzg@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1119571200000, "runtime": 102, "title": "Bewitched", "type": "movie", "writers": ["Nora Ephron", "Delia Ephron", "Sol Saks (television series)"], "year": 2005}