{"_id": "573a13d8f29313caabda8616", "awards": {"nominations": 5, "text": "3 wins & 5 nominations.", "wins": 3}, "cast": ["Selton Mello", "Camila Pitanga", "Rodrigo Santoro"], "countries": ["Brazil"], "directors": ["Luiz Bolognesi"], "fullplot": "In 1566, in Guanabara, the Tupinambè warrior Abeguar is in love with Janaèna. When a jaguar attacks Abeguar and Janaèna, he jumps off a cliff with her and he flies. The shaman advises Abeguar that he was the chosen one by the god Munhè to lead his tribe and fight against the evil Anhangè. When the tribe leader Piatè joins the French in the fight against the Portuguese, the entire Tupinambès are slaughtered and Abeguar turns into a bird that flies for more than two hundred years to find Janaina. In 1825, the warrior is Manuel Balaio that lives with Janaèna and their two daughters in Maranhèo. When one of his daughters is raped by the abusive police commander, Balaio leads the oppressed locals against the police and they take down the Caxias city. The government sends Duque de Caxias and his troops that vanquish the rebels and Balaio turns into a bird again that flies for more than one hundred and forty years to find Janaèna again. In 1968, in Rio, the warrior is Cau, but Janaèna is a revolutionary student that lives with another insurgent. When Cau and Janaèna are arrested by the repressive police, Cau rats the insurgents to protect Janaèna from the torture and he becomes an outcast by his former fellows. Only the jailer Feijèo talks to him and Cau teaches him politics. With the amnesty, Cau moves to the slums with Feijèo and becomes a teacher and member of the criminal group Falange Vermelha. When the police invade the slum, Cau turns into a bird again that flies for more than one hundred years to find Janaèna again. In 2096, in Rio de Janeiro, very few people can afford water that is mostly used in the ethanol plantations by the governmental company Aquabrès. The warrior is now a journalist and Janaèna a call-girl. When the president of Aquabrès is kidnapped by a group of insurgents, the warrior sees Janaèna on television and heads to Aquabrès to save her.", "genres": ["Animation", "Drama", "History"], "imdb": {"id": 2231208, "rating": 7.1, "votes": 715}, "languages": ["Portuguese"], "lastupdated": "2015-08-24 00:31:18.900000000", "num_mflix_comments": 2, "plot": "Revolves around the love between an immortal hero and Janaèna, the woman he has been in love with for 600 years, through Brazil's colonization, slavery, military regime and the future, in 2096, in the midst of wars for water.", "poster": "https://m.media-amazon.com/images/M/MV5BOTQ0MzAyODM0MF5BMl5BanBnXkFtZTcwNDA1MTA4OQ@@._V1_SY1000_SX677_AL_.jpg", "released": 1365120000000, "runtime": 98, "title": "Rio 2096: A Story of Love and Fury", "tomatoes": {"lastUpdated": 1442338251000, "viewer": {"numReviews": 67, "rating": 3.3}}, "type": "movie", "writers": ["Luiz Bolognesi"], "year": 2013}