{"_id": "573a139bf29313caabcf2970", "awards": {"nominations": 0, "text": "2 wins.", "wins": 2}, "cast": ["Jason Scott Lee", "Louise Lombard", "Sean Pertwee", "Lysette Anthony"], "countries": ["USA", "Luxembourg", "UK", "Germany"], "directors": ["Russell Mulcahy"], "fullplot": "Centuries ago, under the sands of ancient Egypt, a prince was buried and his tomb eternally curses so that no man would ever again suffer from his evil ways. But hundreds of years later on a greedy search for treasure, a group of archaeologists break the curses seal of the tomb. Every man vanishes without a trace, leaving behind only a log book - and a deadly warning of the legend of the bloodthursty TALOS. Fifty years later the log book ends up in the hands of the granddaughter of the head archaeologist, and she defiantly sets out to retrace his steps. Discovering the forbidden treasure, she recovers a sacred amulet and once again unleashes the savage power of the tomb. Racing through the streets of London, and against the force of a rare interplanetary lineup, she, along with the help of her original dig team and an American detective, desperately try to turn back the inhuman curse and to keep Talos from destroying all in his path in an attempt to gain immortal power.", "genres": ["Adventure", "Fantasy", "Horror"], "imdb": {"id": 127919, "rating": 3.7, "votes": 2420}, "languages": ["English"], "lastupdated": "2015-08-16 00:35:53.527000000", "num_mflix_comments": 2, "plot": "Centuries ago, under the sands of ancient Egypt, a prince was buried and his tomb eternally curses so that no man would ever again suffer from his evil ways. But hundreds of years later on ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTU5NjcyNDc1Ml5BMl5BanBnXkFtZTYwMTk0Mjk4._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 918864000000, "runtime": 88, "title": "Tale of the Mummy", "tomatoes": {"critic": {"meter": 17, "numReviews": 6, "rating": 4.2}, "dvd": 998956800000, "fresh": 1, "lastUpdated": 1442083780000, "production": "Miramax", "rotten": 5, "viewer": {"meter": 17, "numReviews": 3180, "rating": 2.7}}, "type": "movie", "writers": ["Keith Williams (story)", "Russell Mulcahy (story)", "John Esposito (screenplay)", "Russell Mulcahy (screenplay)"], "year": 1998}