{"_id": "573a1395f29313caabce280d", "awards": {"nominations": 3, "text": "Nominated for 2 Oscars. Another 1 nomination.", "wins": 0}, "cast": ["George Segal", "Tom Courtenay", "James Fox", "Patrick O'Neal"], "countries": ["USA"], "directors": ["Bryan Forbes"], "fullplot": "When Singapore surrendered to the Japanese in 1942 the Allied POWs, mostly British but including a few Americans, were incarcerated in Changi prison. This was a POW detention center like no other. There were no walls or barbed-wire fences for the simple reason that there was no place for the prisoners to escape to. Included among the prisoners is the American Cpl. King, a wheeler dealer who has managed to established a pretty good life for himself in the camp. While most of the prisoners are near starvation and have uniforms that are in tatters, King eats well and and has crisp clean clothes to wear every day. His nemesis is Lt. Robin Grey, the camp Provost who attempts to keep good order and discipline. He knows that King is breaking camp rules by bartering with the Japanese but can't quite get the evidence he needs to stop him. King soon forms a friendship with Lt. Peter Marlowe an upper class British officer who is fascinated with King's èlan and no rules approach to life. As the story develops, it reveals the hypocrisy of the British class system and for King, the fact that his position in Changi's \"society\" is tenuous as best.", "genres": ["War", "Drama"], "imdb": {"id": 59358, "rating": 7.6, "votes": 2933}, "languages": ["English", "Malay", "Japanese"], "lastupdated": "2015-09-01 00:57:16.380000000", "num_mflix_comments": 2, "plot": "A fast-taking wheeler-dealer corporal in a Malaysian POW camp during WWII uses bribery and larceny to take de facto control of the camp from his senior officers.", "poster": "https://m.media-amazon.com/images/M/MV5BOGUyYzkxY2QtZDg0Ni00M2VjLTkwNzctMWNjYjFlYTdkZGJiXkEyXkFqcGdeQXVyMjI4MjA5MzA@._V1_SY1000_SX677_AL_.jpg", "rated": "APPROVED", "released": -131932800000, "runtime": 134, "title": "King Rat", "tomatoes": {"dvd": 1052179200000, "lastUpdated": 1441044084000, "production": "Columbia Pictures", "viewer": {"meter": 85, "numReviews": 1398, "rating": 3.7}}, "type": "movie", "writers": ["James Clavell (based on a novel by)", "Bryan Forbes (written for the screen by)"], "year": 1965}