{"_id": "573a13e0f29313caabdbae7c", "awards": {"nominations": 2, "text": "2 wins & 2 nominations.", "wins": 2}, "cast": ["Yè Aoi", "Jessica Boone", "Ayano Fukuda", "Arata Furuta"], "countries": ["Japan"], "directors": ["Shinji Aramaki"], "fullplot": "2977: For many years a mighty battle has been raging across the galaxies as 500 billion humans, whose forebears were exiled from Earth, plan to return to what is still called home. Forced to flee a ravaged Earth, humans have now depleted the corners of the galaxy to which they fled. Earth has now become the most valued and precious resource of all, controlled by the corrupt Gaia Coalition which governs the human race across the different galaxies. Having been exiled and vilified during the battle of the Homecoming War, Captain Harlock and his trusted crew of the Arcadia battle cruiser are the only hope mankind has of discovering the secrets that the Gaia have kept hidden. The Coalition has demanded Harlock's death and the Gaia Fleet's new leader, Ezra, calls on his younger brother, Logan, to infiltrate the Arcadia and then assassinate Harlock, thus forever eradicating the one man standing between the Coalition and their complete control of the Universe. Logan must make a very personal sacrifice and discover that things are not always as they seem. All the while Captain Harlock and his crew will continue his mission, seeking revenge against the Coalition and establishing the return to Earth.", "genres": ["Animation", "Adventure", "Sci-Fi"], "imdb": {"id": 2668134, "rating": 6.5, "votes": 6897}, "languages": ["Japanese"], "lastupdated": "2015-08-31 00:53:50.403000000", "plot": "Mankind is dying. Only one man can do anything about it, Space Captain Harlock, but the Gaia Coalition will stop at nothing to end him.", "poster": "https://m.media-amazon.com/images/M/MV5BMzY3ZDNhZjgtYzVhYy00MTgwLWJjYjgtMjQwZGFjNGU1MTBjXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 1406851200000, "runtime": 115, "title": "Harlock: Space Pirate", "tomatoes": {"dvd": 1425254400000, "lastUpdated": 1442164127000, "viewer": {"meter": 56, "numReviews": 982, "rating": 3.3}}, "type": "movie", "writers": ["Leiji Matsumoto (manga)", "Harutoshi Fukui (screenplay)", "Kiyoto Takeuchi (screenplay)"], "year": 2013}