{"_id": "573a13def29313caabdb67ed", "awards": {"nominations": 7, "text": "2 wins & 7 nominations.", "wins": 2}, "cast": ["Rupert Evans", "Antonia Campbell-Hughes", "Hannah Hoekstra", "Kelly Byrne"], "countries": ["Ireland", "UK"], "directors": ["Ivan Kavanagh"], "fullplot": "Film archivist David (Rupert Evans) has been having a rough time lately, as he suspects that his wife Alice (Hannah Hoekstra) has been cheating on him with Alex (Carl Shaaban), one of her work clients. This stress is compounded when David's work partner Claire (Antonia Campbell-Hughes) gives him a reel of to-be-archived footage that shows that his house was the setting for a brutal murder in 1902. Becoming progressively more unsettled and unhinged, David begins to believe that a spectral presence is in his house and ends up following his wife to a nearby canal, where he discovers that she is indeed having an affair with Alex. When Alice goes missing shortly afterwards, David contacts the police- only to become the prime suspect in her disappearance. As the police grow more convinced that David has murdered his wife, he struggles to find proof of his growing suspicion that something otherworldly was instead responsible.", "genres": ["Horror", "Mystery", "Thriller"], "imdb": {"id": 2517658, "rating": 5.9, "votes": 6033}, "languages": ["English"], "lastupdated": "2015-08-17 00:24:44.283000000", "metacritic": 55, "plot": "Film archivist David (Rupert Evans) has been having a rough time lately, as he suspects that his wife Alice (Hannah Hoekstra) has been cheating on him with Alex (Carl Shaaban), one of her ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTg2MTQ0MDIxNV5BMl5BanBnXkFtZTgwODM5NTg2NTE@._V1_SY1000_SX677_AL_.jpg", "released": 1412899200000, "runtime": 92, "title": "The Canal", "tomatoes": {"critic": {"meter": 82, "numReviews": 17, "rating": 6}, "dvd": 1421020800000, "fresh": 14, "lastUpdated": 1442080561000, "production": "The Orchard", "rotten": 3, "viewer": {"meter": 52, "numReviews": 892, "rating": 3.2}, "website": "http://www.thecanalthemovie.com"}, "type": "movie", "writers": ["Ivan Kavanagh"], "year": 2014}