{"_id": "573a13a9f29313caabd1e69d", "awards": {"nominations": 24, "text": "Nominated for 2 Golden Globes. Another 10 wins & 24 nominations.", "wins": 12}, "cast": ["Bill Nighy", "Gregor Fisher", "Rory MacGregor", "Colin Firth"], "countries": ["UK", "USA", "France"], "directors": ["Richard Curtis"], "fullplot": "Against the backdrop of aged has-been rock star Billy Mack's Christmas themed comeback cover of \"Love Is All Around\" which he knows is crap and makes no bones about it much to his manager Joe's chagrin as he promotes the record, several interrelated stories about romantic love and the obstacles to happiness through love for Londoners are presented in the five weeks preceding Christmas. Daniel's wife has just passed away, leaving him to take care of his adolescent stepson Sam by himself. Daniel is uncertain how to deal with Sam and his problems without his wife present, especially in light of a potential budding romance within their household. Juliet and Peter have just gotten married. They believe that Peter's best friend and best man Mark hates Juliet but won't say so to his or her face. Others looking at the situation from the outside believe Mark is jealous of Juliet as he is in love with Peter himself. Jamie, a writer, is taking a writing retreat by himself in rural France following catching his latest girlfriend in an indiscretion. Jamie ends up spending much time in France with Aurèlia, the Portuguese woman hired as the housekeeper. The question becomes not only if they can communicate their day-to-day needs with each other as she speaks no English, he speaks no Portuguese, and neither speaks French well, but communicate what seems to be their increasing mutual attraction to each other. Sarah has been in love with her co-worker Karl for the two years they have worked together, this attraction which everyone in their workplace knows about. Sarah has to decide if she can be forward enough to express this love directly to Karl, especially in light of what has been her personal priority of dealing with a family issue. Harry and Karen have been in a stable long term marriage. His new assistant Mia drops hints to him that she would like them to be romantically involved. Harry has to decide whether to fall to the temptation, especially considering being married to a perceptive wife. Single and relatively young David is the newly elected Prime Minister. At 10 Downing Street, he is attracted to one of the new household servants, slightly overweight Natalie, but isn't sure what to do about it seeing as to their respective positions, the probable public scrutiny, and an incident involving the visiting U.S. President. Socially unaware Colin believes that the lack of romantic love in his life is all the fault of standoffish British women. As such, he decides to take decisive albeit somewhat unusual geographic action. And John and Judy are movie body doubles. They can communicate with each other straightforwardly while they are simulating sex filming a movie, but they may not be able to translate the feelings behind that simulation in real life to each other.", "genres": ["Comedy", "Drama", "Romance"], "imdb": {"id": 314331, "rating": 7.7, "votes": 292304}, "languages": ["English", "Portuguese", "French"], "lastupdated": "2015-09-05 00:57:24.743000000", "metacritic": 55, "num_mflix_comments": 383, "plot": "Follows the lives of eight very different couples in dealing with their love lives in various loosely interrelated tales all set during a frantic month before Christmas in London, England.", "poster": "https://m.media-amazon.com/images/M/MV5BMTY4NjQ5NDc0Nl5BMl5BanBnXkFtZTYwNjk5NDM3._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1068768000000, "runtime": 135, "title": "Love Actually", "tomatoes": {"boxOffice": "$59.4M", "consensus": "A sugary tale overstuffed with too many stories. Still, the cast charms.", "critic": {"meter": 63, "numReviews": 192, "rating": 6.4}, "dvd": 1083024000000, "fresh": 120, "lastUpdated": 1441990991000, "production": "Universal Pictures", "rotten": 72, "viewer": {"meter": 73, "numReviews": 31624521, "rating": 3.1}, "website": "http://www.loveactually.com/"}, "type": "movie", "writers": ["Richard Curtis"], "year": 2003}