{"_id": "573a1396f29313caabce4188", "awards": {"nominations": 0, "text": "Nominated for 2 Golden Globes. Another 2 wins.", "wins": 4}, "cast": ["Jack Lemmon", "Sandy Dennis", "Sandy Baron", "Anne Meara"], "countries": ["USA"], "directors": ["Arthur Hiller"], "fullplot": "George and Gwen Kellerman live in the small, quiet town of Twin Oaks, Ohio with their two young children and pet dog. George has a strong sense of what is right and wrong, especially as it applies to himself and Gwen, but he still looks to her for validation. Working for a plastics company, George believes he is a shoo-in for the company's Vice-President of Sales, New York Division job, a position located in New York City. George is looking forward to their future life in New York City, with all the amenities and benefits living in the big city has to offer. For George's 9 am interview, George and Gwen plan on taking a flight that lands in New York at 8 pm the evening before, which gives them time for dinner at New York's finest restaurant, The Four Seasons, and a comfortable night's stay at the Waldorf-Astoria Hotel before the interview. But nothing on this trip goes according to plan. In fact, what can go wrong, does. Because of circumstances, it even looks as if George may miss his interview. As the fifteen hours preceding the planned interview progress, George and Gwen have to decide if they are going to let New York get the better of them or if they are going to get the better of New York.", "genres": ["Comedy"], "imdb": {"id": 66193, "rating": 7.1, "votes": 5355}, "languages": ["English", "Spanish"], "lastupdated": "2015-08-05 01:21:13.320000000", "num_mflix_comments": 2, "plot": "George and Gwen Kellerman live in the small, quiet town of Twin Oaks, Ohio with their two young children and pet dog. George has a strong sense of what is right and wrong, especially as it ...", "poster": "https://m.media-amazon.com/images/M/MV5BN2ExYTE1YTYtYzQxNi00NjNkLWI3OWMtZjY5NTU0MTViN2U1XkEyXkFqcGdeQXVyMTA0MjU0Ng@@._V1_SY1000_SX677_AL_.jpg", "rated": "G", "released": 12700800000, "runtime": 101, "title": "The Out of Towners", "tomatoes": {"critic": {"meter": 50, "numReviews": 12, "rating": 5.6}, "dvd": 1069718400000, "fresh": 6, "lastUpdated": 1441304204000, "production": "Paramount Pictures", "rotten": 6, "viewer": {"meter": 69, "numReviews": 4270, "rating": 3.5}}, "type": "movie", "writers": ["Neil Simon"], "year": 1970}