{"_id": "573a13b6f29313caabd4718d", "awards": {"nominations": 13, "text": "14 wins & 13 nominations.", "wins": 14}, "cast": ["Ajay Devgn", "Kareena Kapoor", "Saif Ali Khan", "Konkona Sen Sharma"], "countries": ["India"], "directors": ["Vishal Bhardwaj"], "fullplot": "Advocate Raghunath Mishra has arranged the marriage of his daughter, Dolly, with Rajan, knowing fully well that Dolly loves Omkara Shukla. Before the marriage could take place, the groom's party is attacked, they flee, and Dolly is reportedly abducted. Raghunath is able to trace Dolly to Omkara, a criminal and hit-man, a verbal confrontation ensues until Politician Bhaisaab telephonically intervenes, and a crestfallen Raghunath faces the reality that Dolly was not abducted but is here with Omkara by her own free will. He warns Omkara, and departs. Shortly thereafter, Bhaisaab is shot at and wounded, announces that Omkara should stand in the next election, and as a result, Omkara appoints one of his lieutenants', Keshav Upadhyay in his place as the 'Bahubali\". Omkara realizes that he may have blundered in having Keshav succeed him, as Keshav is unable to control his temper when under the influence of alcohol, which puts him in the bad books of Omkara. Then Omkara suspects that Keshav is having an affair with Dolly, as both had been fellow-collegians. With Omkara's marriage with Dolly getting close, he asks his other lieutenant, Ishwar Tyagi, to obtain proof of Keshav's affair with Dolly or face the consequences, as Omkara remembers Raghunath's warning that when a daughter is not true to her father, she will never be true to anyone. Watch what happens when Ishwar produces proof shortly after the marriage, and the impact this has on Dolly, Omkara, Keshav, Ishwar, and Ishwar's wife, Indu.", "genres": ["Action", "Crime", "Drama"], "imdb": {"id": 488414, "rating": 8.2, "votes": 9800}, "languages": ["Hindi"], "lastupdated": "2015-08-20 00:03:10.343000000", "num_mflix_comments": 4, "plot": "Shakespeare's masterpiece \"Othello\" set in modern India. A politically-minded enforcer's misguided trust in his lieutenant leads him to suspect his wife of infidelity.", "poster": "https://m.media-amazon.com/images/M/MV5BY2NmNjlhYzQtMWU5MS00YTVmLWIyOWEtOGFmY2ZjMjY2ZGRkXkEyXkFqcGdeQXVyMTMxMTY0OTQ@._V1_SY1000_SX677_AL_.jpg", "released": 1154044800000, "runtime": 155, "title": "Omkara", "tomatoes": {"dvd": 1161648000000, "lastUpdated": 1439147110000, "viewer": {"numReviews": 36, "rating": 4}}, "type": "movie", "writers": ["Vishal Bhardwaj (screenplay)", "Robin Bhatt (screenplay)", "Abhishek Chaubey (screenplay)", "Vishal Bhardwaj (dialogue)", "William Shakespeare (play)"], "year": 2006}