{"_id": "573a1396f29313caabce3e7e", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Donald Sutherland", "Ellen Burstyn", "Meg Mazursky", "Glenna Sargent"], "countries": ["USA"], "directors": ["Paul Mazursky"], "fullplot": "Bohemian Alex Morrison has just finished directing his first feature length movie. In its previews, the movie is considered a critical, artistic and surefire commercial success. As such, Alex seemingly has his choice of what his next project will be. Alex has a few thoughts in his mind, such as a biopic of Lenny Bruce, or a movie about a black uprising in Los Angeles. As he makes the rounds both in the Hollywood community and European movie centers for ideas, he fantasizes about movie scenarios of those everyday situations he is in. These fantasies are influenced by his movie idols, some who he meets such as Italian director Federico Fellini and French actress Jeanne Moreau. Concurrently, he is considering what to do about his personal life. He, his wife Beth and their two daughters live a middle class lifestyle. He is wondering whether it makes sense to \"move up\", which means that movie making not only has to achieve his main purpose of saying something meaningful, but also has to be commercially successful. That need for commercial success may ultimately take artistic control out of his hands.", "genres": ["Comedy", "Drama"], "imdb": {"id": 65380, "rating": 5.2, "votes": 573}, "languages": ["English"], "lastupdated": "2015-07-26 00:55:32.913000000", "num_mflix_comments": 1, "plot": "Bohemian Alex Morrison has just finished directing his first feature length movie. In its previews, the movie is considered a critical, artistic and surefire commercial success. As such, ...", "poster": "https://m.media-amazon.com/images/M/MV5BNzE2YzhiYmMtMWRlZC00ZTljLWJmMDktYmU1ZDI2OGEzNGM2XkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 34214400000, "runtime": 110, "title": "Alex in Wonderland", "tomatoes": {"dvd": 752889600000, "lastUpdated": 1438716750000, "production": "Warner Home Video", "viewer": {"meter": 37, "numReviews": 225, "rating": 3}}, "type": "movie", "writers": ["Paul Mazursky", "Larry Tucker"], "year": 1970}