{"_id": "573a1398f29313caabce8e37", "awards": {"nominations": 2, "text": "4 wins & 2 nominations.", "wins": 4}, "cast": ["Jeroen Krabbè", "Renèe Soutendijk", "Thom Hoffman", "Dolf de Vries"], "countries": ["Netherlands"], "directors": ["Paul Verhoeven"], "fullplot": "The morbid Catholic writer Gerard Reve who is bisexual, alcoholic and has frequent visions of death is invited to give a lecture in the literature club of Vlissingen. While in the railway station in Amsterdam, he feels attracted to a handsome man who embarks on another train. Gerard is introduced to the treasurer of the club and beautician Christine Halsslag, a wealthy widow who owns the Spider beauty shop, and they engage in a one night stand. On the next morning, Gerard sees the picture of Christine's boyfriend Herman and recognizes him as the man he saw in the train station. He urges her to bring Herman to her house to spend a couple of days together, but with the secret intention of seducing the man. Christine travels to Kèln to bring her boyfriend and Gerard stays alone in her house. He drinks whiskey and snoops through her safe, finding three film reels with names of men; he decides to watch the footage and discovers that Christine had married each; all of whom died in tragic accidents. Later Gerard believes Christine is a Black Widow and questions whether Herman or he will be her doomed fourth husband.", "genres": ["Drama", "Mystery", "Thriller"], "imdb": {"id": 86543, "rating": 7.3, "votes": 4960}, "languages": ["Dutch"], "lastupdated": "2015-08-06 00:52:45.710000000", "num_mflix_comments": 3, "plot": "A man who has been having visions of an impending danger begins an affair with a woman who may lead him to his doom.", "poster": "https://m.media-amazon.com/images/M/MV5BOTZjM2U3YzUtY2U2YS00OWNiLWIyYWYtMTMyZmEwMmNhYzhiXkEyXkFqcGdeQXVyNjE5MjUyOTM@._V1_SY1000_SX677_AL_.jpg", "rated": "UNRATED", "released": 417312000000, "runtime": 102, "title": "The 4th Man", "type": "movie", "writers": ["Gerard Reve (novel)", "Gerard Soeteman"], "year": 1983}