{"_id": "573a13c9f29313caabd799b0", "awards": {"nominations": 3, "text": "2 wins & 3 nominations.", "wins": 2}, "cast": ["Pablo Escobar", "Luis Carlos Galèn", "Sebastian Marroquèn", "Marèa Isabel Santos"], "countries": ["Argentina", "Colombia"], "directors": ["Nicolas Entel"], "fullplot": "This is the incredible story of Pablo Escobar, the infamous boss of Colombia's Medellin drug cartel, told for the very first time by his son, Sebastian and his widow Maria Isabel Santos. In Nicolas Entel's film Sebastian tells of his extraordinary childhood, growing up with a father he loved but whom he knew to be Colombia's enemy number one. He tells of times of extraordinary luxury and extravagance, and other times on the run. And Sebastian and his widow open the family vaults to share their private and long hidden archives. But this is also the story of two of Escobar's most prominent victims, the Minister of Justice and a politician about to be elected President of Colombia, as told by their sons. They were among hundreds that Escobar had killed in the 1980's. The film follows Sebastian as he tries to break the cycle of revenge and assassination by seeking reconciliation with the sons of his father's victims.", "genres": ["Documentary"], "imdb": {"id": 1523980, "rating": 7.3, "votes": 716}, "languages": ["Spanish"], "lastupdated": "2015-08-21 00:06:18.390000000", "num_mflix_comments": 1, "plot": "This is the incredible story of Pablo Escobar, the infamous boss of Colombia's Medellin drug cartel, told for the very first time by his son, Sebastian and his widow Maria Isabel Santos. In...", "poster": "https://m.media-amazon.com/images/M/MV5BMTc0NTc4NTU3MF5BMl5BanBnXkFtZTcwMzc5MTIzNA@@._V1_SY1000_SX677_AL_.jpg", "released": 1260403200000, "runtime": 94, "title": "Sins of My Father", "tomatoes": {"lastUpdated": 1438193812000, "production": "Gravitas Ventures", "viewer": {"meter": 63, "numReviews": 70, "rating": 3.3}, "website": "http://streetthemovie.com/"}, "type": "movie", "writers": ["Nicolas Entel", "Pablo Farina"], "year": 2009}