{"_id": "573a13d9f29313caabda8ccd", "awards": {"nominations": 4, "text": "2 wins & 4 nominations.", "wins": 2}, "cast": ["Cameron Deane Stewart", "Justin Deeley", "Meaghan Martin", "Andrew Caldwell"], "countries": ["USA"], "directors": ["Gary Entin"], "fullplot": "\"GEOGRAPHY CLUB\" is based on Brent Hartinger's best-selling critically acclaimed novel: \"What am I looking for?\" asks 16-year old Russell Middlebrook of himself as he heads off on his newest adventure. Russell is still going on dates with girls, while Kevin will do anything to prevent his football teammates from finding out what he is concealing, Min and Terese tell everyone they're really just good friends, and Ike can't figure out who he is or what he wants to be. But the truth is too hard to hide - at least from each other - so they form the Geography Club. Nobody else will discover the truth about them as no other students in their right minds would ever join a club that sounds so boring. Their secrets will be safe from classmates. But are they? \"Geography Club\" is a smart, fast, moving and funny account of contemporary teenagers as they discover their own sexual identities, dreams and values and not merely live out their parents' desires and ambitions. Russell, Kevin, Min, Terese and Ike may not learn about actual places in their undercover social club, but they daringly explore the danger-filled, clique-mined landscape of Goodkind High School and courageously begin their journey in the exciting, still uncharted terrain of the human heart.", "genres": ["Comedy"], "imdb": {"id": 2235902, "rating": 6.5, "votes": 3361}, "languages": ["English"], "lastupdated": "2015-09-15 22:13:46.730000000", "metacritic": 57, "num_mflix_comments": 2, "plot": "At Goodkind High School, a group of students with varying sexual orientations form an after-school club as a discreet way to share their feelings and experiences.", "poster": "https://m.media-amazon.com/images/M/MV5BMTEwNzk2MjIxNTZeQTJeQWpwZ15BbWU4MDM1MDE4MjAx._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1391558400000, "runtime": 84, "title": "Geography Club", "tomatoes": {"critic": {"meter": 64, "numReviews": 11, "rating": 5.2}, "dvd": 1394496000000, "fresh": 7, "lastUpdated": 1440266594000, "production": "Breaking Glass Pictures", "rotten": 4, "viewer": {"meter": 53, "numReviews": 716, "rating": 3.4}, "website": "http://www.geographyclub.com/"}, "type": "movie", "writers": ["Edmund Entin (screenplay)", "Brent Hartinger (novel)"], "year": 2013}