{"_id": "573a13e4f29313caabdc1146", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Aubrey Plaza", "Parker Posey", "Liam Aiken", "James Urbaniak"], "countries": ["USA"], "directors": ["Hal Hartley"], "fullplot": "NED RIFLE is the third and final chapter of Hal Hartley's tragicomic epic begun with HENRY FOOL (1997, TIFF) and continued with FAY GRIM (2007). At once a saga concerning the Grim family of Queens and how their lives are turned upside down by the arrival of the self-proclaimed genius Henry Fool, the trilogy is also an illustration of America's grappling with ideas, art, politics, and religion over the course of 20 years. In this swiftly paced and expansive conclusion, Henry and Fay's son Ned sets out to find and kill his father for destroying his mother's life. But his aims are frustrated by the troublesome, sexy and hilarious Susan, whose connection to Henry predates even his arrival in the lives of the Grim family.", "genres": ["Drama"], "imdb": {"id": 2925768, "rating": 6.3, "votes": 397}, "languages": ["English"], "lastupdated": "2015-08-24 01:09:06.917000000", "metacritic": 67, "num_mflix_comments": 2, "plot": "Henry and Fay's son Ned sets out to find and kill his father for destroying his mother's life. But his aims are frustrated by the troublesome Susan, whose connection to Henry predates even his arrival in the lives of the Grim family.", "poster": "https://m.media-amazon.com/images/M/MV5BNDk1MTE5MzEzN15BMl5BanBnXkFtZTgwMjIxODA1MjE@._V1_SY1000_SX677_AL_.jpg", "rated": "UNRATED", "released": 1427846400000, "runtime": 85, "title": "Ned Rifle", "tomatoes": {"consensus": "Ned Rifle serves as a satisfying conclusion to Hal Hartley's \"Henry Fool\" trilogy - and one of the strongest late-period works from a distinguished filmography.", "critic": {"meter": 81, "numReviews": 27, "rating": 6.4}, "fresh": 22, "lastUpdated": 1439233547000, "production": "Possible Films", "rotten": 5, "viewer": {"meter": 65, "numReviews": 329, "rating": 3.7}, "website": "http://www.possiblefilms.com/2014/08/ned-rifle/"}, "type": "movie", "writers": ["Hal Hartley"], "year": 2014}