{"_id": "573a13b4f29313caabd416a9", "awards": {"nominations": 10, "text": "10 nominations.", "wins": 0}, "cast": ["Oscar Kightley", "Iaheto Ah Hi", "Shimpal Lelisi", "Robbie Magasiva"], "countries": ["New Zealand"], "directors": ["Chris Graham"], "fullplot": "Meet best friends Michael, Albert, Stanley and Sefa; the ladies' man, the good boy, the weird one and the party boy. They're staring down the barrel of their thirtieth birthdays, but still act as if they're sixteen; they get drunk, they chase the wrong women and they have a remarkable record of misbehaving and causing chaos at every wedding they attend. But now Michael's younger brother Sione is getting married, and everything is about to change. Sione is their boy, the kid they used to look after, who grew up while they were still partying. And to ensure his big day isn't spoiled by his boys and their idiot antics, Sione has issued an ultimatum; the guys all have to bring dates to the wedding. And not just any dates; real girlfriends, someone they've made a commitment to. They have one month. So just how hard can it be to get a date for your best boy's wedding?", "genres": ["Comedy", "Romance"], "imdb": {"id": 464184, "rating": 6.4, "votes": 1326}, "languages": ["English"], "lastupdated": "2015-08-14 00:48:53.317000000", "metacritic": 58, "plot": "Four raucous Samoans are banned from their best friend's wedding. To get in, they have to prove themselves as mature individuals by getting and keeping girlfriends.", "poster": "https://m.media-amazon.com/images/M/MV5BMjA0MTk2MDQ1N15BMl5BanBnXkFtZTcwMDE0MDczMQ@@._V1_SY1000_SX677_AL_.jpg", "released": 1143676800000, "runtime": 97, "title": "Samoan Wedding", "tomatoes": {"critic": {"meter": 83, "numReviews": 6, "rating": 7.2}, "dvd": 1171324800000, "fresh": 5, "lastUpdated": 1441995039000, "production": "Magnolia Pictures", "rotten": 1, "viewer": {"meter": 79, "numReviews": 7420, "rating": 3.9}, "website": "http://www.sioneswedding.com/"}, "type": "movie", "writers": ["James Griffin", "Oscar Kightley"], "year": 2006}