{"_id": "573a13cbf29313caabd7ec91", "awards": {"nominations": 36, "text": "Nominated for 1 Oscar. Another 9 wins & 36 nominations.", "wins": 10}, "cast": ["Angelina Jolie", "Elle Fanning", "Sharlto Copley", "Lesley Manville"], "countries": ["USA", "UK"], "directors": ["Robert Stromberg"], "fullplot": "A beautiful, pure-hearted young woman, Maleficent has an idyllic life growing up in a peaceable forest kingdom, until one day when an invading army threatens the harmony of the land. Maleficent rises to be the land's fiercest protector, but she ultimately suffers a ruthless betrayal - an act that begins to turn her pure heart to stone. Bent on revenge, Maleficent faces a battle with the invading king's successor and, as a result, places a curse upon his newborn infant Aurora. As the child grows, Maleficent realizes that Aurora holds the key to peace in the kingdom - and perhaps to Maleficent's true happiness as well.", "genres": ["Action", "Adventure", "Family"], "imdb": {"id": 1587310, "rating": 7, "votes": 220651}, "languages": ["English"], "lastupdated": "2015-08-24 00:00:23.307000000", "metacritic": 56, "num_mflix_comments": 2, "plot": "A vengeful fairy is driven to curse an infant princess, only to discover that the child may be the one person who can restore peace to their troubled land.", "poster": "https://m.media-amazon.com/images/M/MV5BMjAwMzAzMzExOF5BMl5BanBnXkFtZTgwOTcwMDA5MTE@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 1401408000000, "runtime": 97, "title": "Maleficent", "type": "movie", "writers": ["Linda Woolverton (screenplay)", "Charles Perrault (based on the story \"La Belle au bois dormant\" by)", "Erdman Penner (based on the motion picture \"Sleeping Beauty\"", " story adaptation by)", "Joe Rinaldi (based on the motion picture \"Sleeping Beauty\"", " screenplay by)", "Winston Hibler (based on the motion picture \"Sleeping Beauty\"", " screenplay by)", "Bill Peet (based on the motion picture \"Sleeping Beauty\"", " screenplay by)", "Ted Sears (based on the motion picture \"Sleeping Beauty\"", " screenplay by)", "Ralph Wright (based on the motion picture \"Sleeping Beauty\"", " screenplay by)", "Milt Banta (based on the motion picture \"Sleeping Beauty\"", " screenplay by)"], "year": 2014}