{"_id": "573a13c6f29313caabd717b0", "awards": {"nominations": 2, "text": "2 nominations.", "wins": 0}, "cast": ["Vin Diesel", "Jordi Mollè", "Matt Nable", "Katee Sackhoff"], "countries": ["UK", "USA"], "directors": ["David Twohy"], "fullplot": "The infamous Riddick has been left for dead on a sun-scorched planet that appears to be lifeless. Soon, however, he finds himself fighting for survival against alien predators more lethal than any human he's encountered. The only way off is for Riddick to activate an emergency beacon and alert mercenaries who rapidly descend to the planet in search of their bounty. The first ship to arrive carries a new breed of merc, more lethal and violent, while the second is captained by a man whose pursuit of Riddick is more personal. With time running out and a storm on the horizon that no one could survive, his hunters won't leave the planet without Riddick's head as their trophy.", "genres": ["Action", "Sci-Fi", "Thriller"], "imdb": {"id": 1411250, "rating": 6.4, "votes": 112948}, "languages": ["English"], "lastupdated": "2015-08-25 01:01:25.273000000", "metacritic": 49, "num_mflix_comments": 2, "plot": "Left for dead on a sun-scorched planet, Riddick finds himself up against an alien race of predators. Activating an emergency beacon alerts two ships: one carrying a new breed of mercenary, the other captained by a man from Riddick's past.", "poster": "https://m.media-amazon.com/images/M/MV5BMTk5NzYwMzQ4MV5BMl5BanBnXkFtZTcwMjE5MTI1OQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1378425600000, "runtime": 119, "title": "Riddick", "tomatoes": {"boxOffice": "$42.0M", "consensus": "It may not win the franchise many new converts, but this back-to-basics outing brings Riddick fans more of the brooding sci-fi action they've come to expect.", "critic": {"meter": 58, "numReviews": 156, "rating": 5.4}, "dvd": 1389657600000, "fresh": 91, "lastUpdated": 1442339047000, "production": "Universal Classics", "rotten": 65, "viewer": {"meter": 54, "numReviews": 95343, "rating": 3.4}, "website": "http://www.riddickmovie.com/"}, "type": "movie", "writers": ["David Twohy", "Jim Wheat (based on characters created by)", "Ken Wheat (based on characters created by)"], "year": 2013}