{"_id": "573a13d3f29313caabd941a3", "awards": {"nominations": 0, "text": "3 wins.", "wins": 3}, "cast": ["Daniel Auteuil", "Raphaèl Personnaz", "Jean-Pierre Darroussin", "Victoire Bèlèzy"], "countries": ["France"], "directors": ["Daniel Auteuil"], "fullplot": "\"Marius\" takes place in Marseilles' Old Port, at the La Marine Bar, owned by Cèsar and his son Marius. Marius' biggest dream is to embark on one of the boats passing by his dad's bar and to set off to a faraway land. Fanny, a young and pretty seafood peddler, has secretly been in love with Marius since her childhood; Marius, never admitting it, has always loved Fanny. One day, a sailor drops by La Marine and offers him a job on an exploratory ship. Trying to hold him off and to make him jealous, Fanny confesses his love to him and provokes a fight between Marius and one of Cèsar's old friends, Panisse, a boat merchant, who despite his old age, has been courting Fanny for a while. Torn between the call of the sea and his love for her, Marius abandons his dream to be with Fanny who gives herself to him. As Cèsar and Honorine, Fanny's mother, are getting ready for the wedding, Marius changes his mind, drawn back to the call of the sea. Sacrificing her love, Fanny convinces Marius to embark on his journey, leaving her behind. Devastated but holding back her tears, she hides Marius' decision to his father.", "genres": ["Drama"], "imdb": {"id": 1872102, "rating": 6.8, "votes": 588}, "languages": ["French"], "lastupdated": "2015-09-10 17:14:34.513000000", "metacritic": 50, "num_mflix_comments": 1, "plot": "\"Marius\" takes place in Marseilles' Old Port, at the La Marine Bar, owned by Cèsar and his son Marius. Marius' biggest dream is to embark on one of the boats passing by his dad's bar and to...", "poster": "https://m.media-amazon.com/images/M/MV5BMTQ4MzAzNjM0OF5BMl5BanBnXkFtZTgwMTY1MjE0MzE@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 1404432000000, "runtime": 93, "title": "Marius", "tomatoes": {"critic": {"meter": 56, "numReviews": 9, "rating": 5.7}, "fresh": 5, "lastUpdated": 1438970466000, "production": "Kino Lorber", "rotten": 4, "viewer": {"meter": 56, "numReviews": 221, "rating": 3.5}, "website": "http://www.kinolorber.com/video.php?product_id=782"}, "type": "movie", "writers": ["Marcel Pagnol (play)", "Daniel Auteuil (adaptation)"], "year": 2013}