{"_id": "573a139af29313caabcf0f33", "awards": {"nominations": 2, "text": "Won 1 BAFTA Film Award. Another 3 wins & 2 nominations.", "wins": 4}, "cast": ["Cher", "Judi Dench", "Joan Plowright", "Maggie Smith"], "countries": ["Italy", "UK"], "directors": ["Franco Zeffirelli"], "fullplot": "1935. A group of elderly British women, who the Italians have named the Scorpioni, have chosen Italy, specifically Florence, as a place to live to blend their proper British sensibilities with their love of Italian art and culture. One of those Scorpioni, Mary Walsh, works as the English secretary for Paolo Innocente, who, in part because of his own wife's adamant refusal, largely neglects his illegitimate adolescent son, Luca, despite Paolo's want for Luca to grow up to be a proper young man, much like the English. Luca has lived in an orphanage since his dressmaker mother's death, death a concept that Luca does not yet understand. As such, he often runs away looking for his mother. On a mutual agreement between Paolo and Mary, Mary becomes Luca's guardian, she who will receive help in raising Luca by her fellow Scorpioni and financial help from Paolo as needed. Associated with the Scorpioni is a brash younger nouveau riche Jewish-American woman named Elsa Morgenthal, who, because of her affection for Luca's mother to who she owed money, sets up a trust for Luca's future. Among the Scorpioni, Lady Hester Random, the widow of the former ambassador to Italy, in particular and Elsa do not get along because of their fundamental outward differences. The life for the Scorpioni changes with the onset of WWII, more specifically when Italy declares war on Britain and France. Despite all of the Scorpioni taken into custody of sorts by the Italians, they are eventually housed in the comforts of a hotel. Lady Hester wrongly believes it is her association with Mussolini that has gotten them into their comfortable surroundings, but which in reality was arranged and paid for by Elsa. Luca, who has just returned to Italy after attending school in Austria, helps Elsa with her efforts to assist those persecuted in Italy. Luca, now a teenager, has fallen in love with Elsa. As such, Luca is jealous of Elsa's professional and personal relationship with Italian lawyer Vittorio Fanfanni. Elsa's own situation becomes more precarious with the United States' entrance into the war, the Nazis' increasing persecution of Jews, and Luca discovering that Fanfanni has ulterior motives in his relationship with Elsa. Through it all, Mary still tries to be the voice of what is right to Luca, who may be tainted by his own immature teenaged thoughts during these difficult times.", "genres": ["Drama", "Comedy", "War"], "imdb": {"id": 120857, "rating": 6.9, "votes": 8869}, "languages": ["English", "Italian"], "lastupdated": "2015-08-20 01:09:04.860000000", "metacritic": 53, "num_mflix_comments": 1, "plot": "1935. A group of elderly British women, who the Italians have named the Scorpioni, have chosen Italy, specifically Florence, as a place to live to blend their proper British sensibilities ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTcyNDQxODUyOF5BMl5BanBnXkFtZTcwNTczMTM3NA@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 926640000000, "runtime": 117, "title": "Tea with Mussolini", "tomatoes": {"critic": {"meter": 65, "numReviews": 34, "rating": 6.3}, "dvd": 942710400000, "fresh": 22, "lastUpdated": 1441996310000, "production": "MGM/UA", "rotten": 12, "viewer": {"meter": 77, "numReviews": 7594, "rating": 3.5}}, "type": "movie", "writers": ["John Mortimer", "Franco Zeffirelli (autobiography)"], "year": 1999}