{"_id": "573a139af29313caabcf0a2a", "awards": {"nominations": 1, "text": "1 win & 1 nomination.", "wins": 1}, "cast": ["Roshan Seth", "Saeed Jaffrey", "Antony Zaki", "Carrie Preston"], "countries": ["USA"], "directors": ["Harish Saluja"], "fullplot": "Kishan Singh, his wife, and an only child, a son, Raj,live in India. Kishan runs his household by working as a school-teacher. They want their son to grow up well educated, and live a better life abroad. Raj studiously pursues his studies in medicine, & re-locates to in Pittsburgh, U.S.A., soon becomes establishes his practice there. He falls in love with a lovely Caucasian woman named Laura, and both get married, and soon give birth to a daughter and name her Jenny. Thereafter tragedy befalls the Singh family as Kishan's wife passes away. Alone, retired, and not having much to do in India, he decides to re-locate to U.S.A. and live with his son. He is received warmly by Laura, Raj, and Jenny. Kishan and Jenny take to each other very well, and often go for long walks in the countryside. On one such walk, Kishan and Jenny separate. Kishan is unable to locate her, and asks Raj and Laura to help him. A frantic search does get them to Jenny - but anger and acrimony have now taken over Laura, and she distrusts Kishan, and would like him to keep away from her family. Kishan does get the message and moves out to live with another East Indian named Ashok. Raj and Jenny regret this, and often miss him. Kishan and Laura do not know that they will meet again soon when Kishan is held at a popular book store for purportedly attempting to steal a book. Will this meeting change their relationship with each other?", "genres": ["Comedy", "Drama"], "imdb": {"id": 119422, "rating": 7.1, "votes": 90}, "languages": ["English"], "lastupdated": "2015-08-27 00:24:30.337000000", "plot": "Kishan Singh, his wife, and an only child, a son, Raj,live in India. Kishan runs his household by working as a school-teacher. They want their son to grow up well educated, and live a ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTg0Mzc2NDcyMF5BMl5BanBnXkFtZTgwNzg4ODk1MDE@._V1_SY1000_SX677_AL_.jpg", "released": 875664000000, "runtime": 97, "title": "The Journey", "tomatoes": {"lastUpdated": 1439663602000, "viewer": {"numReviews": 113, "rating": 4.1}}, "type": "movie", "writers": ["Lisa Kirk Colburn", "Renee De Palma (screenplay)", "Diana Osberg", "Harish Saluja"], "year": 1997}