{"_id": "573a13b6f29313caabd45b6a", "awards": {"nominations": 4, "text": "Nominated for 1 Golden Globe. Another 5 wins & 4 nominations.", "wins": 6}, "cast": ["Renèe Zellweger", "Ewan McGregor", "Emily Watson", "Barbara Flynn"], "countries": ["UK", "USA", "Isle Of Man"], "directors": ["Chris Noonan"], "fullplot": "In 1902, in London, the spinster Beatrix Potter lives with her bourgeois parents. Her snobbish mother, Helen Potter, had introduced several bachelors to Beatrix until she was twenty years old, but she had turned them all down. Beatrix Potter has been drawing animals and making up stories about them since she was a child, but her parents have never recognized her as an artist. One day, Miss Potter offers her stories to a print house, and a rookie publisher, Norman Warne, who is delighted with her tales, publishes her first children's book. This success leads Norman to publish two other books, and Miss Potter meanwhile becomes the best friend of his single sister Millie Warne. Soon Beatrix and Norman fall in love with each other, but Helen does not accept that her daughter would marry a \"trader\". However, Beatrix's father Rupert Potter proposes that his daughter spend the summer with his wife and him in their country house in Lake District, and if she is still interested in Norman after the summertime, he would bless their marriage. When Miss Potter stops receiving letters from Norman, she is disappointed. Then one day she receives a letter from Millie explaining what had happened to Norman.", "genres": ["Biography", "Drama", "Romance"], "imdb": {"id": 482546, "rating": 7, "votes": 22671}, "languages": ["English"], "lastupdated": "2015-09-14 02:15:50.633000000", "metacritic": 57, "num_mflix_comments": 1, "plot": "The story of Beatrix Potter, the author of the beloved and best-selling children's book, \"The Tale of Peter Rabbit\", and her struggle for love, happiness and success.", "poster": "https://m.media-amazon.com/images/M/MV5BMTA0NjgzMDIzNjVeQTJeQWpwZ15BbWU3MDE3ODk0NDE@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 1173398400000, "runtime": 92, "title": "Miss Potter", "tomatoes": {"boxOffice": "$2.9M", "consensus": "A charming biopic that maintains its sweetness even in sadder moments.", "critic": {"meter": 66, "numReviews": 126, "rating": 6.2}, "dvd": 1182211200000, "fresh": 83, "lastUpdated": 1440007407000, "production": "MGM", "rotten": 43, "viewer": {"meter": 68, "numReviews": 332440, "rating": 3.2}, "website": "http://www.mgm.com/"}, "type": "movie", "writers": ["Richard Maltby Jr."], "year": 2006}