{"_id": "573a13b2f29313caabd3a31f", "awards": {"nominations": 2, "text": "1 win & 2 nominations.", "wins": 1}, "cast": ["Hilary Duff", "Haylie Duff", "Maria Conchita Alonso", "Anjelica Huston"], "countries": ["USA"], "directors": ["Martha Coolidge"], "fullplot": "The silver spoon daughters of the late cosmetics empire founder Victor Marchetta, Avan and Tanzie, never even took an interest in the business, happy to let it be run by their and the firm's administrator, Tommy Katzenbach, while they lead socialite lives, aiming at a marriage with soap star Mic Rionn. Suddenly a scandal wrecks the firm's stock and their family reputation. Their credit cards are canceled, one of them torches the mansion, the other hands their sports-car to a thief mistaken for a parking valet. So they end up living with their Latina former cleaning lady. Help to investigate whether the firm is really best sold to competitor Fabiella, as Tommy claims, comes from hunky lab technician Rick, whom the previously mistook for the inexistent firm parking lot attendant, and Henry Baines, whose free law for the poor charity they didn't even consider for sponsoring.", "genres": ["Comedy", "Family", "Romance"], "imdb": {"id": 433412, "rating": 3.8, "votes": 18318}, "languages": ["English"], "lastupdated": "2015-08-31 00:18:02.733000000", "metacritic": 17, "plot": "Two wealthy sisters, both heiresses to their family's cosmetics fortune, are given a wake-up call when a scandal and ensuing investigation strip them of their wealth.", "poster": "https://m.media-amazon.com/images/M/MV5BMTk3MTY2MDAzMF5BMl5BanBnXkFtZTcwNjQ4MjUzMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 1155859200000, "runtime": 97, "title": "Material Girls", "tomatoes": {"boxOffice": "$11.3M", "consensus": "Plagued by paper-thin characterizations and a hackneyed script, Material Girls fails to live up to even the minimum standards of its genre.", "critic": {"meter": 4, "numReviews": 54, "rating": 2.6}, "dvd": 1165881600000, "fresh": 2, "lastUpdated": 1442511169000, "production": "MGM/UA", "rotten": 52, "viewer": {"meter": 44, "numReviews": 228975, "rating": 3}, "website": "http://www.mgm.com/materialgirls"}, "type": "movie", "writers": ["John Quaintance", "Jessica O'Toole", "Amy Rardin"], "year": 2006}