{"_id": "573a1399f29313caabcecb70", "awards": {"nominations": 2, "text": "2 wins & 2 nominations.", "wins": 2}, "cast": ["Sanjay Dutt", "Madhuri Dixit", "Salman Khan", "Ekta Sohini"], "countries": ["India"], "directors": ["Lawrence D'Souza"], "fullplot": "Aman (Sanjay Dutt) is a poor, handicapped orphan who is befriended by wealthy Akash Verma (Salman Khan) during his childhood. Akash's parents adopt him and give him their family name, and Akash and Aman grow up as brothers. While Akash is a womanizer, Aman takes to writing poems under the pen name Sagar. The poems get published, and Aman becomes very popular. One of his fans is a young woman by the name of Pooja Saxena (Madhuri Dixit), who corresponds with Sagar. Akash meets Pooja and falls head over heels in love with her. When Aman comes to know this, he asks Akash to pose as Sagar, which he does, and Pooja and Akash fall in love with each other. A heartbroken Aman looks on, as he knows that although women may like his poetry, they will never come out openly and love him when they see his handicap. At the end, Akash discovers that Aman is actually Sagar and loves Pooja, so he decides to sacrifice his love for Aman.", "genres": ["Drama", "Romance", "Musical"], "imdb": {"id": 102825, "rating": 7.3, "votes": 3407}, "languages": ["Hindi"], "lastupdated": "2015-08-09 01:00:07.283000000", "num_mflix_comments": 1, "plot": "Aman (Sanjay Dutt) is a poor, handicapped orphan who is befriended by wealthy Akash Verma (Salman Khan) during his childhood. Akash's parents adopt him and give him their family name, and ...", "poster": "https://m.media-amazon.com/images/M/MV5BNTMxOTc5NzM0OF5BMl5BanBnXkFtZTgwMDcwNjkwMzE@._V1_SY1000_SX677_AL_.jpg", "released": 683510400000, "runtime": 181, "title": "Saajan", "tomatoes": {"dvd": 916704000000, "lastUpdated": 1438195309000, "viewer": {"meter": 71, "numReviews": 1439, "rating": 3.8}}, "type": "movie", "writers": ["Reema Rakesh Nath (dialogue)", "Reema Rakesh Nath (screenplay)", "Reema Rakesh Nath (story)"], "year": 1991}