{"_id": "573a1397f29313caabce7de2", "awards": {"nominations": 2, "text": "2 nominations.", "wins": 0}, "cast": ["Charles Bronson", "Jill Ireland", "Vincent Gardenia", "J.D. Cannon"], "countries": ["USA"], "directors": ["Michael Winner"], "fullplot": "Paul Kersey, the vigilante, now lives in LA with his daughter, who is still recovering from her attack. He also has a new woman in his life. One day while with them, Kersey is mugged by some punks, Kersey fights back, but they get away. The leader, wanting to get back at Kersey, goes to his house, but Kersey and his daughter Carol are not there. The muggers rape his housekeeper, and when Kersey and his daughter arrive, they knock him out and kidnap her. After they assault her, she leaps out of a window to her death. Kersey then grabs his gun and goes after them. When the LA authorities, deduce they have a vigilante, they decide to consult with New York, who had their vigilante problem. Now the New York officials, knowing that Kersey lives in LA, fears that he's back to his old habit. Fearing that Kersey, when caught will reveal that they let him go instead of prosecuting him send Inspector Ochoa to make sure that doesn't happen.", "genres": ["Action", "Crime", "Drama"], "imdb": {"id": 82250, "rating": 5.9, "votes": 9479}, "languages": ["English"], "lastupdated": "2015-09-11 00:46:10.777000000", "num_mflix_comments": 2, "plot": "Architect Paul Kersey once again becomes a vigilante when he tries to find the five street punks who murdered his daughter and housekeeper, this time on the dark streets of Los Angeles.", "poster": "https://m.media-amazon.com/images/M/MV5BZTU1MzU3ZTktMTEwZC00MGU3LWE1YTktY2RlMTcxYzFiYjFkL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 383011200000, "runtime": 88, "title": "Death Wish II", "tomatoes": {"dvd": 1141689600000, "lastUpdated": 1441047690000, "viewer": {"meter": 100, "numReviews": 54, "rating": 4.4}}, "type": "movie", "writers": ["David Engelbach", "Brian Garfield (characters)"], "year": 1982}