{"_id": "573a13bdf29313caabd582ee", "awards": {"nominations": 13, "text": "2 wins & 13 nominations.", "wins": 2}, "cast": ["Ananda Everingham", "Lalita Panyopas", "Porntip Papanai", "Thaksakorn Pradapphongsa"], "countries": ["Thailand"], "directors": ["Pen-Ek Ratanaruang"], "fullplot": "Every relationship has an expiration date. Every relationship needs its fantasies...some more real than others... A violent death of a relative brings Wit and his wife, Dang, back to Bangkok from America, where they own a Thai restaurant, for the first time in 7 years. As soon as they arrive in Bangkok at 5.30 am. Wit and Dang check into a five-star hotel downtown. Wit finds out that he is out of cigarettes once they are inside the room. He goes down to the lobby bar. After getting his pack of cigarette from the bartender Wit decides to order a cup of coffee and smoke his cigarette there. The girl from the table in the dark corner comes to Wit to ask if she could borrow his lighter. Wit hands her his lighter. Then she asks if she could borrow one cigarette too. The girl sits down and lights up one of his cigarettes and they somehow strike up a conversation. Wit learns that her name is PLOY. This is how our little tale of love and jealousy begins. A highly detailed psychological drama with three strangers locked inside one hotel room. It starts with subtle suspicions and builds up to hilarious jealousy, as the appearance of the young woman triggers the couple to suddenly realize how they had grown apart in their seven-year marriage, before reaching a devastating climax. In the final act, the couple is faced with the choice of going separate ways or turns around and embraces each other for a new beginning.", "genres": ["Drama"], "imdb": {"id": 993778, "rating": 6.9, "votes": 1187}, "languages": ["Thai", "English"], "lastupdated": "2015-07-12 00:41:33.297000000", "plot": "Every relationship has an expiration date. Every relationship needs its fantasies...some more real than others... A violent death of a relative brings Wit and his wife, Dang, back to ...", "released": 1181174400000, "runtime": 105, "title": "Ploy", "tomatoes": {"lastUpdated": 1438718570000, "production": "Wild Side Films", "viewer": {"meter": 63, "numReviews": 740, "rating": 3.5}, "website": "http://www.ploythemovie.com/"}, "type": "movie", "writers": ["Pen-Ek Ratanaruang"], "year": 2007}