{"_id": "573a13d7f29313caabda3153", "awards": {"nominations": 2, "text": "2 nominations.", "wins": 0}, "cast": ["Laura Bailey", "John Burgmeier", "Bruce Carey", "Justin Cook"], "countries": ["USA", "Japan", "Canada", "South Korea"], "directors": ["Atsushi Takeuchi"], "fullplot": "An untold chapter in the Mass Effect saga, following the early career of Alliance Marine, James Vega, as he leads a squad of elite special forces into battle against a mysterious alien threat known as The Collectors. Stationed at a colony in a remote star system, Vega and his troops must protect the inhabitants from an invasion of the deadly insectoid warriors determined to collect the population for unknown purposes. Soon after the attack, Vega's commanding officer falls in battle, forcing the young officer to embrace the responsibility of leadership for the colony's survival. Having idolized Earth's greatest hero and warrior, Commander Shepard (the central character in the Mass Effect video games), the young and idealistic Vega must now make life and the death decisions that will effect not only the lives of his squad, but the lives of every person in the colony - all of whom he has sworn to protect. Fighting valiantly for every life in his hands, Vega soon discovers the path of heroism is not as glamorous as he envisioned, and that victory in war always comes with a heavy price; the end of innocence, the sacrifice of one's ideals and ultimately, the loss of those closest to him.", "genres": ["Animation", "Action", "Sci-Fi"], "imdb": {"id": 2140141, "rating": 5.9, "votes": 1686}, "languages": ["Japanese", "English"], "lastupdated": "2015-08-15 00:44:16.193000000", "plot": "Set before Mass Effect 3, James Vega and a group of soldiers try to protect a human colony from the Collectors, who wish to capture the colonists for unknown purposes.", "poster": "https://m.media-amazon.com/images/M/MV5BY2Q4ODVlNzUtNGM4Ni00OTI1LWJmMjAtZGNhMDhkYjBmMmEzXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_SY1000_SX677_AL_.jpg", "released": 1356652800000, "runtime": 84, "title": "Mass Effect: Paragon Lost", "tomatoes": {"dvd": 1356652800000, "lastUpdated": 1441995660000, "viewer": {"meter": 68, "numReviews": 39, "rating": 3.4}}, "type": "movie", "writers": ["Henry Gilroy (screenplay)"], "year": 2012}