{"_id": "573a13b4f29313caabd40af3", "awards": {"nominations": 23, "text": "6 wins & 23 nominations.", "wins": 6}, "cast": ["Cillian Murphy", "Padraic Delaney", "Liam Cunningham", "Orla Fitzgerald"], "countries": ["Ireland", "UK", "Germany", "Italy", "Spain", "France", "Belgium", "Switzerland"], "directors": ["Ken Loach"], "fullplot": "In 1920, rural Ireland is the vicious battlefield of republican rebels against the British security forces and Irish Unionist population who oppose them, a recipe for mutual cruelty. Medical graduate Damien O'Donovan always gave priority to his socialist ideals and simply helping people in need. Just when he's leaving Ireland to work in a highly reputed London hospital, witnessing gross abuse of commoners changes his mind. he returns and joins the local IRA brigade, commanded by his brother Teddy, and adopts the merciless logic of civil war, while Teddy mellows by experiencing first-hand endless suffering. When IRA leaders negotiate an autonomous Free State under the British crown, Teddy defends the pragmatic best possible deal at this stage. Damien however joins the large seceding faction which holds nothing less than a socialist republic will do. The result is another civil war, bloodily opposing former Irish comrades in arms, even the brothers.", "genres": ["Drama", "History", "War"], "imdb": {"id": 460989, "rating": 7.5, "votes": 34563}, "languages": ["English", "Irish", "Latin"], "lastupdated": "2015-08-31 00:05:00.233000000", "metacritic": 82, "plot": "Against the backdrop of the Irish War of Independence, two brothers fight a guerrilla war against British forces.", "poster": "https://m.media-amazon.com/images/M/MV5BYTE0ZGE4YTItZTE2NC00MzZjLTkyMWUtMTZiODAwNTRlNDk4XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 1174608000000, "runtime": 127, "title": "The Wind That Shakes the Barley", "tomatoes": {"boxOffice": "$1.8M", "consensus": "Bleak and uncompromising, but director Ken Loach brightens his film with gorgeous cinematography and tight pacing, and features a fine performance from Cillian Murphy.", "critic": {"meter": 88, "numReviews": 113, "rating": 7.7}, "dvd": 1188864000000, "fresh": 100, "lastUpdated": 1441305804000, "production": "IFC First Take", "rotten": 13, "viewer": {"meter": 87, "numReviews": 36423, "rating": 4}, "website": "http://www.thewindthatshakesthebarley.co.uk/"}, "type": "movie", "writers": ["Paul Laverty"], "year": 2006}