{"_id": "573a13c3f29313caabd6ae3e", "awards": {"nominations": 0, "text": "2 wins.", "wins": 2}, "cast": ["Kiele Sanchez", "Rhys Coiro", "Diora Baird", "Harold Perrineau"], "countries": ["USA"], "directors": ["Ben Ketai"], "fullplot": "It has been a year since the isolated Alaskan town of Barrow's population was decimated by vampires during its annual month long sunset. Riddled with grief over the death of her husband Eben, bound by nightmares and void of all emotions beyond hate and sorrow, Stella Oleson has spent the past months traveling the world, trying to convince others that vampires exist. Met with skepticism and laughter, she is ready to throw in the towel when a group of lost souls offers an incredible opportunity: the chance to exact revenge upon Lilith, the vampire queen responsible for the assault on her sleepy Alaskan town. With nothing remaining to live for, and nothing left to fear, Stella joins their mission and ventures into the uncharted underbelly of Los Angeles where she pushes herself to the most extreme limits to stop the evil from striking again.", "genres": ["Horror", "Thriller"], "imdb": {"id": 1320304, "rating": 4.4, "votes": 9648}, "languages": ["English"], "lastupdated": "2015-09-11 00:25:34.303000000", "plot": "After surviving the incidents in Barrow, Alaska, Stella Olemaun relocates to Los Angeles, where she intentionally attracts the attention of the local vampire population in order to avenge the death of her husband, Eben.", "poster": "https://m.media-amazon.com/images/M/MV5BMTY3ODMxODIwNl5BMl5BanBnXkFtZTgwMDYyODAwNzE@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1286236800000, "runtime": 92, "title": "30 Days of Night: Dark Days", "tomatoes": {"critic": {"meter": 17, "numReviews": 6, "rating": 5.5}, "dvd": 1286236800000, "fresh": 1, "lastUpdated": 1439921791000, "production": "SPE Acquisitions", "rotten": 5, "viewer": {"meter": 14, "numReviews": 3523, "rating": 2.2}}, "type": "movie", "writers": ["Steve Niles (screenplay)", "Ben Ketai (screenplay)", "Steve Niles (comic)", "Ben Templesmith (comic)"], "year": 2010}