{"_id": "573a13c2f29313caabd679bb", "awards": {"nominations": 2, "text": "2 nominations.", "wins": 0}, "cast": ["Lee Atwater", "Tucker Eskew", "Joe Sligh", "Eric Alterman"], "countries": ["UK", "USA"], "directors": ["Stefan Forbes"], "fullplot": "The Murrow, Polk, and IDA Award-winning documentary Boogie Man is about Lee Atwater, a blues-playing rogue whose rise from the South to Chairman of the GOP made him a political rock star. He mentored George W. Bush and Karl Rove while leading the Republican party to historic victories, helping make liberal a dirty word, and transforming the way America elects our Presidents. In interviews with Republicans and friends of Atwater, Boogie Man examines his role in America's shift to the right. To Democrats offended by the 1988 Willie Horton controversy, Atwater was a remorseless political assassin dubbed by one Congresswoman \"the most evil man in America.\" The film examines his irreverent sense of humor, his understanding of the American heartland, and his unapologetic vision of politics as war. It ends with a portrait of a cynic's deathbed search for meaning.", "genres": ["Documentary", "Biography"], "imdb": {"id": 1262863, "rating": 7.7, "votes": 521}, "languages": ["English"], "lastupdated": "2015-08-13 00:00:25.410000000", "metacritic": 66, "num_mflix_comments": 1, "plot": "The Murrow, Polk, and IDA Award-winning documentary Boogie Man is about Lee Atwater, a blues-playing rogue whose rise from the South to Chairman of the GOP made him a political rock star. ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTY3ODUxNDQ3N15BMl5BanBnXkFtZTcwNzQxMDI3Mw@@._V1_SY1000_SX677_AL_.jpg", "released": 1222387200000, "runtime": 86, "title": "Boogie Man: The Lee Atwater Story", "tomatoes": {"consensus": "Boogie Man is a complex, absorbing study of the contradictory life and times of architect of modern smear politics.", "critic": {"meter": 93, "numReviews": 28, "rating": 7.6}, "dvd": 1272931200000, "fresh": 26, "lastUpdated": 1441134577000, "production": "InterPositive Media", "rotten": 2, "viewer": {"meter": 79, "numReviews": 398, "rating": 3.8}, "website": "http://www.boogiemanfilm.com/"}, "type": "movie", "year": 2008}