{"_id": "573a13b2f29313caabd3a5ef", "awards": {"nominations": 4, "text": "4 nominations.", "wins": 0}, "cast": ["Zach Braff", "Jacinda Barrett", "Casey Affleck", "Rachel Bilson"], "countries": ["USA"], "directors": ["Tony Goldwyn"], "fullplot": "Michael and Jenna, having been a couple for three years, want to get married and start a family. These plans seem to be well on their way when Jenna announces that she's pregnant. But Michael is worried that his life and his youth will be over for good. At a wedding of a friend, he meets a free-spirited college co-ed, Kim, who opens his eyes and leads him on a dangerous path away from Jenna. Meanwhile, none of the relationships of the people surrounding Michael and Jenna are happy and stable. Michael's friend Izzy is unwilling to let go of his childhood sweetheart Arianna; Kenny is a handsome stud who fears commitment to his latest conquest Danielle; and Chris is a co-worker who is dominated by his neurotic and overbearing wife over raising their newborn son. Even Jenna's parents, Stephen and Anna, are experiencing problems in their long-suffering marriage.", "genres": ["Comedy", "Drama", "Romance"], "imdb": {"id": 434139, "rating": 6.5, "votes": 37231}, "languages": ["English"], "lastupdated": "2015-08-22 01:11:05.030000000", "metacritic": 57, "plot": "Michael and Jenna, having been a couple for three years, want to get married and start a family. These plans seem to be well on their way when Jenna announces that she's pregnant. But ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTk3Mjk4Mjg1OV5BMl5BanBnXkFtZTgwMzU0NTgxMDI@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1158278400000, "runtime": 104, "title": "The Last Kiss", "tomatoes": {"boxOffice": "$11.5M", "consensus": "You'll either find the The Last Kiss to be a phony bore or a refreshing take about young 20-somethings at the crossroads between their carefree lifestyle and responsibility. Zach Braff and the rest of the appealing cast make the case for the latter.", "critic": {"meter": 46, "numReviews": 127, "rating": 5.7}, "dvd": 1167091200000, "fresh": 58, "lastUpdated": 1440093856000, "production": "Paramount", "rotten": 69, "viewer": {"meter": 59, "numReviews": 96764, "rating": 3.2}, "website": "http://www.lastkissmovie.com"}, "type": "movie", "writers": ["Paul Haggis (screenplay)", "Gabriele Muccino (motion picture \"L'ultimo bacio\")"], "year": 2006}