{"_id": "573a13b2f29313caabd3835d", "awards": {"nominations": 2, "text": "2 nominations.", "wins": 0}, "cast": ["Dane Cook", "Jessica Simpson", "Dax Shepard", "Andy Dick"], "countries": ["USA"], "directors": ["Greg Coolidge"], "fullplot": "Slacker Zack Bradley works as a box boy at Super Club, a warehouse club store. It is the lowest in the job hierarchy at the store. He doesn't work very hard at his job, and along with some of his fellow employee friends treats the store like his playground. Regardless, he is well liked by most of the other employees. He used to be hard working, when he was developing a dot com, but he lost all his and his grandmother's money in the process. As such, he decided not to take any risks in life while he now lives with her so as to provide her with what he considers at least a more reliable life. On the other extreme is Vince Downey, who lords an air of superiority over his fellow employees as the store's head cashier. He lives to be the store's best employee solely so that he can be named Employee of the Month, which he has been named seventeen months in a row. If he is named Employee of the Month for a record eighteenth time in a row, he will be rewarded with entrance into the corporation's management track program and a new car. Zack decides he wants to break Vince's streak if only because he reads in the employment record of recent transfer, the pretty Amy Renfro, that she had a thing at her previous store for men who have been named Employee of the Month. Zack finds that working toward being Employee of the Month is not as easy as he thought, especially as Vince will not relinquish the title and all its perks without a fight, dirty or not. Zack has to decide how far he is willing to go to get the title and the girl.", "genres": ["Comedy", "Romance"], "imdb": {"id": 424993, "rating": 5.5, "votes": 35645}, "languages": ["English"], "lastupdated": "2015-08-23 00:49:23.813000000", "metacritic": 36, "num_mflix_comments": 1, "plot": "A slacker competes with a repeat winner for the \"Employee of the Month\" title at work, in order to gain the affections of a new female employee.", "poster": "https://m.media-amazon.com/images/M/MV5BMTc4NTc2NDI5OF5BMl5BanBnXkFtZTcwMDQ4NzYzMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1160092800000, "runtime": 103, "title": "Employee of the Month", "tomatoes": {"boxOffice": "$28.4M", "consensus": "Employee of the Month features mediocre performances, few laughs, and a lack of satiric bite.", "critic": {"meter": 20, "numReviews": 90, "rating": 4}, "dvd": 1168905600000, "fresh": 18, "lastUpdated": 1439835376000, "production": "Lionsgate", "rotten": 72, "viewer": {"meter": 53, "numReviews": 421779, "rating": 3.1}, "website": "http://www.employeeofthemonthfilm.com/"}, "type": "movie", "writers": ["Don Calame (screenplay)", "Chris Conroy (screenplay)", "Greg Coolidge (screenplay)", "Don Calame (story)", "Chris Conroy (story)"], "year": 2006}