{"_id": "573a1394f29313caabce04e5", "awards": {"nominations": 5, "text": "Won 7 Oscars. Another 25 wins & 5 nominations.", "wins": 32}, "cast": ["William Holden", "Alec Guinness", "Jack Hawkins", "Sessue Hayakawa"], "countries": ["UK", "USA"], "directors": ["David Lean"], "fullplot": "The film deals with the situation of British prisoners of war during World War II who are ordered to build a bridge to accommodate the Burma-Siam railway. Their instinct is to sabotage the bridge but, under the leadership of Colonel Nicholson, they are persuaded that the bridge should be constructed as a symbol of British morale, spirit and dignity in adverse circumstances. At first, the prisoners admire Nicholson when he bravely endures torture rather than compromise his principles for the benefit of the Japanese commandant Saito. He is an honorable but arrogant man, who is slowly revealed to be a deluded obsessive. He convinces himself that the bridge is a monument to British character, but actually is a monument to himself, and his insistence on its construction becomes a subtle form of collaboration with the enemy. Unknown to him, the Allies have sent a mission into the jungle, led by Warden and an American, Shears, to blow up the bridge.", "genres": ["Adventure", "Drama", "War"], "imdb": {"id": 50212, "rating": 8.2, "votes": 134445}, "languages": ["English", "Japanese", "Thai"], "lastupdated": "2015-09-10 17:57:35.973000000", "plot": "After settling his differences with a Japanese PoW camp commander, a British colonel co-operates to oversee his men's construction of a railway bridge for their captors - while oblivious to a plan by the Allies to destroy it.", "poster": "https://m.media-amazon.com/images/M/MV5BNmMyNzI1MGEtNDkyZS00MmY2LWJlZmUtMjA1MzMwZjM3OWViXkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "APPROVED", "released": -380246400000, "runtime": 161, "title": "The Bridge on the River Kwai", "tomatoes": {"consensus": "This complex war epic asks hard questions, resists easy answers, and boasts career-defining work from star Alec Guinness and director David Lean.", "critic": {"meter": 94, "numReviews": 52, "rating": 9.2}, "dvd": 974764800000, "fresh": 49, "lastUpdated": 1439749020000, "production": "Columbia Pictures", "rotten": 3, "viewer": {"meter": 93, "numReviews": 53528, "rating": 4}}, "type": "movie", "writers": ["Pierre Boulle (novel)", "Carl Foreman (screenplay)", "Michael Wilson (screenplay)"], "year": 1957}