{"_id": "573a13c0f29313caabd616a3", "awards": {"nominations": 4, "text": "1 win & 4 nominations.", "wins": 1}, "cast": ["Anthony Hopkins", "Colin O'Donoghue", "Alice Braga", "Ciarèn Hinds"], "countries": ["USA", "Hungary", "Italy"], "directors": ["Mikael Hèfstrèm"], "fullplot": "Michael, the son of a funeral director grows indifferent to his father and joins a Seminary. On his way to the course completion, he is overwhelmed by a strong lack of faith. His religious beliefs are further jolted when he sees a young girl haplessly dying in a road accident for whom he reluctantly performs the ritual to absolve her sins. His mentor still believes in him and urges him to go to Italy to take an exorcism course hoping that he it would strengthen his faith in Christianity. In Italy he attends a session from Father Xavier who soon becomes aware of his skepticism. As a result he sends him to an eminent Jesuit exorcist, Father Lucas, whose ways though questionable are quite effective. He witnesses the exorcism of a sixteen year old girl but still seems unconvinced. Father Lucas explains to him that it takes multiple sessions over a long stretch of time to completely free a victim from the demon. Despite witnessing some supernatural occurrences during the aforesaid exorcism, Michael is as skeptical as ever. After the second exorcism, the girls condition becomes quite critical as she is moved to a hospital. She soon dies and the demon finds a new victim. As the moment of reckoning draws near, Micheal may be the only hope left but first he must overcome his own doubts and apprehensions in order to fight and destroy the ominous forces.", "genres": ["Drama", "Horror", "Mystery"], "imdb": {"id": 1161864, "rating": 6, "votes": 70389}, "languages": ["English", "Welsh", "Italian", "Latin", "Russian", "Hungarian"], "lastupdated": "2015-08-26 00:05:24.133000000", "metacritic": 38, "plot": "An American seminary student travels to Italy to take an exorcism course.", "poster": "https://m.media-amazon.com/images/M/MV5BMTcxNTAxMTMzNF5BMl5BanBnXkFtZTcwMjQ1MDAxNA@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1296172800000, "runtime": 114, "title": "The Rite", "tomatoes": {"boxOffice": "$33.0M", "consensus": "Anthony Hopkins is as excellent as ever, but he's no match for The Rite's dawdling pace and lack of chills -- or Colin O'Donoghue's tentative performance in the leading role.", "critic": {"meter": 20, "numReviews": 161, "rating": 4.3}, "dvd": 1305590400000, "fresh": 33, "lastUpdated": 1442166210000, "production": "Warner Bros. Pictures/New Line Cinema", "rotten": 128, "viewer": {"meter": 41, "numReviews": 52102, "rating": 3}, "website": "http://www.what-do-you-believe.com/"}, "type": "movie", "writers": ["Michael Petroni", "Matt Baglio (book)"], "year": 2011}