{"_id": "573a13abf29313caabd2472d", "awards": {"nominations": 4, "text": "3 wins & 4 nominations.", "wins": 3}, "cast": ["Felicity Mason", "Mungo McKay", "Rob Jenkins", "Lisa Cunningham"], "countries": ["Australia"], "directors": ["Michael Spierig", "Peter Spierig"], "fullplot": "Peaceful, rustic Berkeley is a charming fishing community where life is sweet and the people friendly. All that is about to change. After losing her childhood farm to the bank, local beauty Rene decides to leave town and head for the big city. Suddenly, an avalanche of meteorites races through the sky, bombarding the town and bringing an otherworldly infection. Departing is going to be much more difficult than she had planned. The living dead are awakened and Rene is now caught in a nightmare of zombies hungry for human flesh. She manages to find salvation in a small isolated farm house owned by the town loony, Marion. There she is met with four other desperate survivors. Together they battle their way through a plague of walking dead and discover that there is more transpiring than just an infection.", "genres": ["Action", "Comedy", "Horror"], "imdb": {"id": 339840, "rating": 5.5, "votes": 11177}, "languages": ["English"], "lastupdated": "2015-09-06 00:49:14.073000000", "metacritic": 34, "plot": "A quaint Australian fishing village is overcome by meteorites that turn its residents into the ravenous undead, leaving a small group of those unharmed to find a way out.", "poster": "https://m.media-amazon.com/images/M/MV5BMTQ0MDM3NDU2MF5BMl5BanBnXkFtZTcwOTQxMTkyMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1062633600000, "runtime": 97, "title": "Undead", "tomatoes": {"consensus": "This low-budget homage to the zombie genre borrows heavily from superior predecessors and revels in a pile of its own campiness -- neither original nor watchable enough to entertain.", "critic": {"meter": 32, "numReviews": 76, "rating": 4.4}, "dvd": 1128988800000, "fresh": 24, "lastUpdated": 1440356844000, "production": "Lions Gate Films", "rotten": 52, "viewer": {"meter": 44, "numReviews": 15700, "rating": 2.9}, "website": "http://www.undeadmovie.com/"}, "type": "movie", "writers": ["Michael Spierig", "Peter Spierig"], "year": 2003}