{"_id": "573a13b4f29313caabd40e14", "awards": {"nominations": 3, "text": "3 wins & 3 nominations.", "wins": 3}, "cast": ["Hurichabilike", "Geliban", "Badema", "Yidexinnaribu"], "countries": ["China"], "directors": ["Hao Ning"], "fullplot": "Bilike has never seen a ping-pong ball before. He and his family live without electricity and running water in a solitary tent home among the vast steppe grasslands. The magnificent landscape here has changed little since the days of Genghis Kahn. But life in the middle of nowhere can be exciting for a young boy. The smallest of details become big events for curious Bilike and his best friends Erguotou and Dawa. The mystery of the small white ball floating in the creek leads to questions about the world around them, as well as innocent mischief. Bilike's grandmother says the ball is a glowing pearl from heaven. But the boys are sceptical after waiting all night outdoors for the ball to light up. Since nobody has an idea about the odd white object, they trek to the faraway monastery to consult the wise lamas. But even the grasslands' most knowledgeable inhabitants are stumped. While watching the new TV-set Dawa's father has won, the boys learn about pingpong. They are excited to hear that their object is the 'national ball of China'. Not realizing how far Beijing actually is, the determined young boys set off to return the ball to the Chinese capital...", "genres": ["Comedy", "Drama"], "imdb": {"id": 461804, "rating": 6.6, "votes": 682}, "languages": ["Mongolian"], "lastupdated": "2015-08-30 00:31:04.383000000", "metacritic": 64, "num_mflix_comments": 1, "plot": "Bilike has never seen a ping-pong ball before. He and his family live without electricity and running water in a solitary tent home among the vast steppe grasslands. The magnificent ...", "poster": "https://m.media-amazon.com/images/M/MV5BMjE5ODk4Nzc5MV5BMl5BanBnXkFtZTcwNzk0MjgzMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 1154563200000, "runtime": 102, "title": "Mongolian Ping Pong", "tomatoes": {"consensus": "Though the story is quite simple and the pace slow, the movie is a charming one, set against beautiful scenery.", "critic": {"meter": 84, "numReviews": 25, "rating": 7}, "dvd": 1161648000000, "fresh": 21, "lastUpdated": 1439926345000, "production": "First Run", "rotten": 4, "viewer": {"meter": 70, "numReviews": 757, "rating": 3.6}, "website": "http://www.firstrunfeatures.com/mongolian_synopsis.html"}, "type": "movie", "writers": ["Hao Ning"], "year": 2005}