{"_id": "573a13a0f29313caabd04f60", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Ajay Devgn", "Saif Ali Khan", "Manisha Koirala", "Namrata Shirodkar"], "countries": ["India"], "directors": ["Milan Luthria"], "fullplot": "Unemployed Aftab is into unlawful activities; one day he attempt to grab a consignment of arms and ammunitions that is being supplied to terrorists on the Indo-Pak border. When he find that he is being followed he decides to destroy the consignment only to be recognized by the terrorists. Meanwhile he goes to arrange his marriage with his beloved, Ruksana where-by questions arise about his biological father; questions that he or his mother, Mariam are unable to provide answer for thus the marriage plans became nulled. A few days later he gets to meet Ramakant Pandit who Mariam introduced to him as his father and who on his death bed is willing to touch his feet. Shortly after Ramakant passes away and Aftab gets to meet his step-brother, Dhananjay alias Jai who is quite resentful towards Aftab and his mother. Meanwhile Aftab and Mariam are apprehend and tortured by the same terrorists whose booty were destroyed by Aftab; without a choice Aftab is forced to call Jai for help. Fortunately Jai do agree after Aftab pleads with him and soon both are on the run from not only the terrorists but the local police who accuses the duo of being hand in gloved with the terrorists.", "genres": ["Action", "Romance"], "imdb": {"id": 206067, "rating": 6, "votes": 703}, "languages": ["Hindi"], "lastupdated": "2015-07-19 00:28:36.917000000", "num_mflix_comments": 1, "plot": "Unemployed Aftab is into unlawful activities; one day he attempt to grab a consignment of arms and ammunitions that is being supplied to terrorists on the Indo-Pak border. When he find that...", "poster": "https://m.media-amazon.com/images/M/MV5BZWFmZDQ5OGEtNzdkYy00ZjM5LTg1NzEtMTA2MWEwOTc1MjI3XkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY1000_SX677_AL_.jpg", "title": "Kachche Dhaage", "tomatoes": {"dvd": 1163462400000, "lastUpdated": 1437328996000, "viewer": {"meter": 20, "numReviews": 158, "rating": 2.8}}, "type": "movie", "writers": ["Sanjay Chhel", "Anjum Rajabali (screenplay)", "Anjum Rajabali (story)"], "year": 1999}