{"_id": "573a13c3f29313caabd6a38e", "awards": {"nominations": 2, "text": "5 wins & 2 nominations.", "wins": 5}, "cast": ["Ilker Aksum", "Fatih Al", "Gunes Sayin", "Taner Birsel"], "countries": ["Turkey", "Germany", "Netherlands"], "directors": ["Seyfi Teoman"], "fullplot": "The peaceful cohabitation of bachelors Ender and Cetin is disrupted when they allow a friend's sister to move in with them. The 30-something longtime friends are overwhelmed by the presence of the uncommunicative Nihal. What possessed them to accept the responsibility of a university student in their home? Especially a girl struggling with the trauma of recently losing her parents in a car accident. But simple daily rituals like sharing meals eventually bring the three roommates together for more pleasant moments. Nihal soon comes out of her depressed shell and the two men discover a vibrant beautiful young woman. Always caring and protective gentlemen, Ender and Cetin are intent on being conscientious guardians. Nihal enjoys discussing literature and poetry with scholarly Ender, and she finds comfort in boisterous Cetin's earthy humor. Nihal is touched by the men's loyal friendship: in a sort of bromance since high school, Ender and Cetin now seem like an old married couple... Before they see what's coming, both men fall in love with the enchanting Nihal. But Ender and Cetin don't want to disrespect their good friend nor confuse his still-fragile sister. Ender and Cetin seesaw between feeling like protective fathers to acting like nervous school boys, wondering if they should confess their true feelings to Nihal...", "genres": ["Drama"], "imdb": {"id": 1309178, "rating": 6.9, "votes": 1902}, "languages": ["Turkish"], "lastupdated": "2015-09-03 00:35:46.600000000", "num_mflix_comments": 2, "plot": "The peaceful cohabitation of two 30-something bachelors is disrupted when they both fall in love with the charming young woman who moves in with them.", "poster": "https://m.media-amazon.com/images/M/MV5BMzcyODg0Mjc1NF5BMl5BanBnXkFtZTcwODcwNTczNA@@._V1_SY1000_SX677_AL_.jpg", "released": 1302825600000, "runtime": 102, "title": "Our Grand Despair", "tomatoes": {"lastUpdated": 1440008384000, "viewer": {"numReviews": 43, "rating": 3.4}}, "type": "movie", "writers": ["Baris Bicakci (novel)", "Baris Bicakci (script)", "Seyfi Teoman (script)"], "year": 2011}