{"_id": "573a13a2f29313caabd0b930", "awards": {"nominations": 3, "text": "Nominated for 1 Oscar. Another 15 wins & 3 nominations.", "wins": 16}, "cast": ["Bolek Polèvka", "Anna Siskovè", "Csongor Kassai", "Jaroslav Dusek"], "countries": ["Czech Republic"], "directors": ["Jan Hrebejk"], "fullplot": "In World War II Nazi occupied Czechoslovakia, a childless couple, Josef and Marie Cizek, can only watch while the Jewish family of their employers, the Wieners, are first removed from their own home to a spare room in their house by the Nazis, then deported to Theresienstadt concentration camp. Years later, young David Wiener, the sole surviving member of that family has managed to escape and make it to the Cizeks. Although fully aware of the extreme danger of harbouring a Jew in the Third Reich, the Cizek's can not permit themselves to leave David to certain death and agree to hide him. However, this decision leads to terrible danger of discovery by the Nazis and especially their friend and Nazi collaborator, Horst Prohazka, who is attracted to Marie. With desperate cleverness and luck, the Cizeks struggle to keep the secret, even when Horst begins to suspect. In doing so, they find themselves making unorthodox choices and learning about the true nature of the people around them.", "genres": ["Comedy", "Drama", "War"], "imdb": {"id": 234288, "rating": 7.8, "votes": 4073}, "languages": ["German", "Czech"], "lastupdated": "2015-08-11 00:21:59.280000000", "metacritic": 69, "plot": "In Nazi occupied Czechoslovakia, a childless couple agree to hide a Jewish friend at great personal risk of discovery and execution.", "poster": "https://m.media-amazon.com/images/M/MV5BOWZiMWJiYzUtYWZhYy00N2JiLTk3NjEtNTY2MDIwNmRmMzgzXkEyXkFqcGdeQXVyMjIxMzMyMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 953164800000, "runtime": 117, "title": "Divided We Fall", "tomatoes": {"consensus": "Divided We Fall takes a complex look at World War II, skillfully balancing humor and gravity.", "critic": {"meter": 90, "numReviews": 61, "rating": 7.3}, "dvd": 1006819200000, "fresh": 55, "lastUpdated": 1441133803000, "production": "Sony Pictures Classics", "rotten": 6, "viewer": {"meter": 91, "numReviews": 2253, "rating": 4}, "website": "http://www.spe.sony.com/classics/dividedwefall"}, "type": "movie", "writers": ["Jan Hrebejk", "Petr Jarchovskè (screenplay)", "Petr Jarchovskè (story)"], "year": 2000}