{"_id": "573a13bbf29313caabd53b9a", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Sophie Monk", "Tad Hilgenbrink", "William Sadler", "Janet Montgomery"], "countries": ["USA"], "directors": ["Dave Parker"], "fullplot": "Tyler is obsessed by the horror movie \"The Hills Run Red\", considered by those that had seen it the scariest movie ever made, with the deranged serial-killer Babyface in the lead role. However, the director Wilson Wyler Concannon and the movie vanished many years ago and there is no available print. His research is affecting his relationship with his girlfriend Serina that is needy and feels neglected. When Tyler discovers that Concannon's daughter Alexa works in a night-club, he decides to meet her and asks about the missing movie. The woman tells that the movie might be in her father's house in the middle of the woods, and Tyler decides to travel to the spot with Alexa, Serina and their friend Lalo. Along their journey, Tyler films and interviews some locals. During the night, they are attacked by the rednecks, but they are saved by Babyface that kills the assaulters and is controlled by Alexa that runs away from him. Tyler, Serina and Lalo get rid off the ropes, but Tyler decides to help Alexa, disclosing fate of the movie.", "genres": ["Horror", "Thriller"], "imdb": {"id": 907676, "rating": 5.5, "votes": 7084}, "languages": ["English"], "lastupdated": "2015-09-06 00:59:06.150000000", "num_mflix_comments": 2, "plot": "A group of young horror fans go searching for a film that mysteriously vanished years ago but instead find that the demented killer from the movie is real, and he's thrilled to meet fans who will die gruesomely for his art.", "poster": "https://m.media-amazon.com/images/M/MV5BMDgzNDdkNTgtYzI0Yi00MThmLWIzYmMtNzFiNjhkYmViM2Q4XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1254182400000, "runtime": 81, "title": "The Hills Run Red", "tomatoes": {"critic": {"meter": 57, "numReviews": 7, "rating": 5.4}, "dvd": 1254182400000, "fresh": 4, "lastUpdated": 1442270078000, "production": "WARNER BROTHERS PICTURES", "rotten": 3, "viewer": {"meter": 33, "numReviews": 2044, "rating": 2.8}}, "type": "movie", "writers": ["David J. Schow (teleplay)", "John Dombrow (screenplay)", "John Carchietta (story)"], "year": 2009}