{"_id": "573a13b5f29313caabd44509", "awards": {"nominations": 3, "text": "3 nominations.", "wins": 0}, "cast": ["Abhishek Bachchan", "Priyanka Chopra", "Riteish Deshmukh", "Nana Patekar"], "countries": ["India"], "directors": ["Rohan Sippy"], "fullplot": "Roy is leading a dual life . His girlfriend Simi believes he is an honest person while the reality is quite different. Roy is actually a professional conman who dupes innocent people as easily as he swats flies. When Simi comes to know of the reality, she is heartbroken and ditches Roy for ever. Roy repents but it seems like it's too late now. One day Roy bumps into Aditya \"Dittu\" Shrivastav who is an amateur conman. Dittu implores Roy to teach him the tricks of his trade, but Roy disagrees. One night, Roy collapses while crossing a road and visits Dr. Bhalerao for a medical checkup. It is revealed that Roy has a brain tumour and has very little time. He bumps into Dittu again and this time he agrees to take Dittu under his wing and teach him the basics of the art of conning. Together they zero in on a big \"fish\" - a shady hotel owner named Chandru and proceed to lure him into their master plan.", "genres": ["Comedy", "Romance", "Thriller"], "imdb": {"id": 476527, "rating": 6.8, "votes": 4068}, "languages": ["Hindi"], "lastupdated": "2015-08-19 00:12:07.297000000", "plot": "A conman Roy, gets dumped by his girl-friend. Then he finds out he has a fatal disease. On the verge of death, he resolves to do some good, by helping his apprentice Dittu hoodwink the mobster who hurt his (Dittu's) family.", "poster": "https://m.media-amazon.com/images/M/MV5BMmFiNDc1NDktYjgzNy00MGNhLTkwYTUtNzk4Y2M0Y2Y2NzZmXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY1000_SX677_AL_.jpg", "released": 1134691200000, "runtime": 137, "title": "Bluffmaster!", "tomatoes": {"boxOffice": "$0.7M", "dvd": 1148428800000, "lastUpdated": 1442086333000, "production": "UTV", "viewer": {"meter": 77, "numReviews": 4410, "rating": 3.7}, "website": "http://www.bluffmasterthefilm.com"}, "type": "movie", "writers": ["Rajat Arora (dialogue)", "Shridhar Raghavan (story)"], "year": 2005}