{"_id": "573a1394f29313caabce09b0", "awards": {"nominations": 8, "text": "Nominated for 6 Oscars. Another 4 wins & 8 nominations.", "wins": 10}, "cast": ["Elizabeth Taylor", "Paul Newman", "Burl Ives", "Jack Carson"], "countries": ["USA"], "directors": ["Richard Brooks"], "fullplot": "The family of who is \"affectionately\" known as \"Big Daddy\" Pollitt convenes at his and Big Momma's vast 28,000 acre East Mississippi plantation for his sixty-fifth birthday, although it may as well be for his funeral on the belief that he is dying. Despite his latest medical report being clean, in reality he truly does have terminal colon cancer, something the doctor only tells Big Daddy's two sons, Gooper Pollitt, a lawyer, and Brick Pollitt, who recently left his job as a sportscaster. Brooding Brick and his wife Maggie Pollitt, who have driven up from New Orleans for the occasion, are going through a long rough patch in their marriage. Brick wanted to split, but Maggie convinced him to stay married on the condition that she not pressure him for sex. In their troubles, Brick has turned to the bottle, a drunken incident which has left Brick currently on crutches. Maggie believes Gooper and his wife Mae Pollitt are trying to orchestrate Brick out of Big Daddy's will, Brick and Maggie's only saving grace being that Big Daddy has greater affinity for them than Gooper and Mae, as Maggie is beautiful and Brick was a star athlete, most specifically in football and track. As Gooper and Mae have a sixth child on the way, Maggie also believes they could combat anything Gooper and Mae would do by having a child of their own. In his current state, Brick has contempt for everyone and everything around him, which includes Big Daddy's money. All Brick and Maggie's problems seem to center on their respective relationships with Brick's high school friend and football partner, Skipper, and events in their lives just prior to Skipper's death. What happens not only with Brick and Maggie but the entire Pollitt family may depend on if Brick can reconcile himself with his life, much of which is currently in Big Daddy's house, including Maggie.", "genres": ["Drama", "Romance"], "imdb": {"id": 51459, "rating": 8.1, "votes": 31205}, "languages": ["English"], "lastupdated": "2015-08-15 00:50:47.723000000", "plot": "Brick, an alcoholic ex-football player, drinks his days away and resists the affections of his wife, Maggie. His reunion with his father, Big Daddy, who is dying of cancer, jogs a host of memories and revelations for both father and son.", "poster": "https://m.media-amazon.com/images/M/MV5BMzFhNTMwNDMtZjY3Yy00NzY3LWI1ZWQtZTQxMWJmODVhZWFkXkEyXkFqcGdeQXVyNjQzNDI3NzY@._V1_SY1000_SX677_AL_.jpg", "rated": "APPROVED", "released": -356054400000, "runtime": 108, "title": "Cat on a Hot Tin Roof", "tomatoes": {"critic": {"meter": 97, "numReviews": 33, "rating": 7.7}, "dvd": 874972800000, "fresh": 32, "lastUpdated": 1440357710000, "production": "MGM Home Entertainment", "rotten": 1, "viewer": {"meter": 93, "numReviews": 31383, "rating": 4}}, "type": "movie", "writers": ["Richard Brooks (screenplay)", "James Poe (screenplay)", "Tennessee Williams (play)"], "year": 1958}