{"_id": "573a13cff29313caabd889e3", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Paddy Considine", "Peter Capaldi", "Tom Georgeson", "William Beck"], "countries": ["UK"], "directors": ["James Hawes"], "fullplot": "In 1860 Scotland Yard's 'Prince of Sleuths' Jack Whicher is sent to rural Wiltshire to investigate the murder of three-year-old Saville Kent,snatched from his bed at night and killed.Saville's nurse Elizabeth Gough is a prime suspect but released for want of evidence though local Superintendant Foley is convinced it is an inside job. Foley gives his help grudgingly,disdainful of 'modern' methods,speculating that Saville woke to see Elizabeth with a lover,possibly Saville's father,an unpopular man. Part of a woman's torn garment is found,stained in blood,and Constance,Kent's sixteen-year-old daughter from his first marriage, claims she lost a night-gown. Dr. Stapleton,the family physician,tells Whicher that Constance,like her mother,is dangerously unstable and jealous of Saville. Both she and younger brother William hate their stepmother Mary,their former nanny,with whom Kent cuckolded their mother. Whicher arrests Constance but fails to get a confession from her and,at her trial,a clever lawyer gets her acquitted,discrediting Whicher,who suffers a breakdown. Saville's killer is never caught.", "genres": ["Crime", "Drama", "Mystery"], "imdb": {"id": 1724572, "rating": 6.5, "votes": 978}, "languages": ["English"], "lastupdated": "2015-09-16 08:12:27.827000000", "num_mflix_comments": 3, "plot": "Based on true events. Scotland Yard Detective Inspector Jack Whicher is sent to rural Wiltshire to investigate the horrific murder of a three-year-old boy.", "poster": "https://m.media-amazon.com/images/M/MV5BOTdjNDdmYjctNTgxNC00OWQxLTk4NjEtZTQ3ODVlZDUyNmRhXkEyXkFqcGdeQXVyMjExMjk0ODk@._V1_SY1000_SX677_AL_.jpg", "released": 1303689600000, "runtime": 95, "title": "The Suspicions of Mr Whicher: The Murder at Road Hill House", "type": "movie", "writers": ["Kate Summerscale (book)", "Neil McKay"], "year": 2011}