{"_id": "573a13cbf29313caabd8135d", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Jamie Bartlett", "John Kani", "Thabo Malema", "A.J. van der Merwe"], "countries": ["South Africa"], "directors": ["Michael Swan"], "fullplot": "According to the legend of the Shangaan, white lions are the messengers of the gods, but it has been years since one has been seen in their remote African valley. When a white lion is miraculously born into that valley, a young Shangaan named Gisani, finds himself destined to protect this rare and magnificent creature at all costs. This young lion, whom will be known as Letsatsi, is cast from his pride and forced to embark upon a perilous journey of survival. Close to starvation, Letsatsi befriends Nkulu, an older lion and together they learn how to survive in the harsh African wilderness Gisani, who is watching over Letsatsi, takes a job as a tracker with a local hunter, who has his sights set on leading the hunt for this rare and magnificent white lion. Gisani, guided by fate, believes that he must find a way to prevent this tragedy from happening. When Nkulu is killed by a farmer, Letsatsi is forced once again to survive on his own. After many trials and tribulations he finally learns to hunt by himself and grows into a magnificent adult. But before he can take over a pride of his own, Letsatsi and Gisani must face their greatest challenge - the trophy hunter- for whom legends are worthless and rare skins priceless.", "genres": ["Drama", "Family"], "imdb": {"id": 1618421, "rating": 6.6, "votes": 647}, "languages": ["English"], "lastupdated": "2015-09-02 00:45:38.833000000", "num_mflix_comments": 3, "plot": "According to the legend of the Shangaan, white lions are the messengers of the gods, but it has been years since one has been seen in their remote African valley. When a white lion is ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTcwMTAyMzg5OV5BMl5BanBnXkFtZTcwMjgxODc1NA@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 1266537600000, "runtime": 88, "title": "White Lion", "type": "movie", "writers": ["Ivan Milborrow", "Michael Swan", "Janet van Eeden"], "year": 2010}