{"_id": "573a139af29313caabcf0bb2", "awards": {"nominations": 7, "text": "Nominated for 1 Oscar. Another 10 wins & 7 nominations.", "wins": 11}, "cast": ["Ralph Fiennes", "Cate Blanchett", "Ciarèn Hinds", "Tom Wilkinson"], "countries": ["USA", "Australia", "UK"], "directors": ["Gillian Armstrong"], "fullplot": "In mid-1800's England, Oscar is a young Anglican priest, a misfit and an outcast, but with the soul of an angel. As a boy, even though from a strict Pentecostal family, he felt God told him through a sign to leave his father and his faith and join the Church of England. Lucinda is a teen-aged Australian heiress who has an almost desperate desire to liberate her sex from the confines of the male-dominated culture of the Australia of that time. She buys a glass factory and has a dream of building a church made almost entirely of glass, and then transporting it to Bellingen, a remote settlement on the north coast. Oscar and Lucinda meet on a ship going to Australia; once there, they are for different reasons ostracized from society, and as a result \"join forces\" together. Oscar and Lucinda are both passionate gamblers, and Lucinda bets Oscar her entire inheritance that he cannot transport the glass church to the Outback safely. Oscar accepts her wager, and this leads to the events that will change both their lives forever.", "genres": ["Drama", "Romance"], "imdb": {"id": 119843, "rating": 6.7, "votes": 5381}, "languages": ["English", "French"], "lastupdated": "2015-08-18 01:06:30.830000000", "metacritic": 66, "plot": "In mid-1800's England, Oscar is a young Anglican priest, a misfit and an outcast, but with the soul of an angel. As a boy, even though from a strict Pentecostal family, he felt God told him...", "poster": "https://m.media-amazon.com/images/M/MV5BZjUwOTIyMjAtZGQ5My00YmUyLWE0ZWMtOWNkZGNkZjU0OWRmXkEyXkFqcGdeQXVyMTAwMzUyOTc@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 883526400000, "runtime": 132, "title": "Oscar and Lucinda", "tomatoes": {"critic": {"meter": 66, "numReviews": 32, "rating": 6.7}, "dvd": 1105401600000, "fresh": 21, "lastUpdated": 1442270766000, "production": "Twentieth Century Fox Home Entertainment", "rotten": 11, "viewer": {"meter": 65, "numReviews": 5338, "rating": 3.4}}, "type": "movie", "writers": ["Peter Carey (novel)", "Laura Jones (screenplay)"], "year": 1997}