{"_id": "573a1395f29313caabce1c6c", "awards": {"nominations": 0, "text": "Nominated for 1 Oscar. Another 4 wins.", "wins": 5}, "cast": ["Leonardo Villar", "Glèria Menezes", "Dionèsio Azevedo", "Geraldo Del Rey"], "countries": ["Brazil"], "directors": ["Anselmo Duarte"], "fullplot": "Zè-do-Burro has only one worldly possession, his donkey, that he named Nicolas and considers to have a sole like himself, a law abiding Christian just a trifle naive. During a tempest, Nicolas is seriously wounded, and Zè-do-Burro, out of despair, makes a promise: to carry a cross as large as Christ's, to the altar of Saint Barbara - the nearest being in the city of Bahia. He vows to do so in a Candomblè session, dedicated to the goddess Yansan - that in the popular belief corresponds to that Christian saint. Nicolas fully recovers from his illness, and Zè-do-Burro produces a large cross with his own hands and tools, and then carries it on foot to Bahia, accompanied by his wife, Rosa. He has to stay by the church's closed door, and the only person who comes to meet them is Bonitèo, the local pimp, who offers to take Rosa to a pension while Zè-do-Burro keeps his promise of staying by the cross. Next morning, the priest is surprised but satisfied with the faith shown by Zè-do-Burro - until the detail that the promise had been done in a Candomblè session comes up in conversation. Then, Olavo the priest berates Zè-do-Burro for his impiety, and forbade him entrance to the church. The local zealots back him up. A crowd is gathering for the procession and feast in honor of Saint Barbara, including Rosa, who is soon attacked by Marly, the local whore, out of jealousy of her having stayed the night in the company of the handsome gigolo. The women's fight causes a disturbance of the peace. The black people perform a Capoeira fight in her honor, in front of the church. A scandals' reporter adds to the confusion with his insinuation that Zè-do-Burro may be a communist agitator, or a blessed man. The police is called by the zealots, because Zè-do-Burro tried to force the door to the church using the cross as a battering-ram. The police officers order Zè-do-Burro to go away from the church, but he faces up to them. There's a brawl, a shot is heard, the people escape this way and that, and Zè-do-Burro lies dead by his cross. It's then that the black people take Zè-do-Burro's body, put it on the cross, and carry him inside the church to the altar of his favorite saint - unopposed.", "genres": ["Drama"], "imdb": {"id": 56322, "rating": 8.2, "votes": 1505}, "languages": ["Portuguese"], "lastupdated": "2015-08-29 01:06:42.827000000", "num_mflix_comments": 1, "plot": "A simple yet devout Christian makes a vow to Saint Barbara after she saves his donkey, but everyone he meets seems determined to misunderstand his intentions. Will he be able to keep his promise in the end?", "released": -239414400000, "runtime": 98, "title": "The Given Word", "tomatoes": {"lastUpdated": 1440530741000, "viewer": {"meter": 93, "numReviews": 566, "rating": 4.4}}, "type": "movie", "writers": ["Anselmo Duarte (screenplay)", "Dias Gomes (based on a play by)", "Dias Gomes (adaptation)"], "year": 1962}