{"_id": "573a139bf29313caabcf3b1e", "awards": {"nominations": 12, "text": "3 wins & 12 nominations.", "wins": 3}, "cast": ["Jake Gyllenhaal", "Chris Cooper", "Laura Dern", "Chris Owen"], "countries": ["USA"], "directors": ["Joe Johnston"], "fullplot": "In a 1950's mining town called Coalwood, Homer Hickam is a kid with only one future in sight, to work in the local coal mine like his father. However in October 1957, everything changes when the first artificial satellite, Sputnik goes into orbit. With that event, Homer becomes inspired to learn how to build rockets. With his friends and the local nerd, Homer sets to do just that by trial and a lot of error. Unfortunately, most of the town and especially Homer's father thinks that they are wasting their time. Only one teacher in the high school understands their efforts and lets them know that they could become contenders in the national science fair with college scholarships being the prize. Now the gang must learn to perfect their craft and overcome the many problems facing them as they shoot for the stars.", "genres": ["Biography", "Drama", "Family"], "imdb": {"id": 132477, "rating": 7.8, "votes": 59401}, "languages": ["English"], "lastupdated": "2015-08-20 00:42:38.517000000", "metacritic": 71, "plot": "The true story of Homer Hickam, a coal miner's son who was inspired by the first Sputnik launch to take up rocketry against his father's wishes.", "poster": "https://m.media-amazon.com/images/M/MV5BZmIzMjE0M2YtNzliZi00YWNmLTgyNDItZDhjNWVhY2Q2ODk0XkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 919382400000, "runtime": 108, "title": "October Sky", "tomatoes": {"consensus": "Rich in sweet sincerity, intelligence, and good old-fashioned inspirational drama, October Sky is a coming-of-age story with a heart to match its Hollywood craftsmanship.", "critic": {"meter": 90, "numReviews": 73, "rating": 7.6}, "dvd": 933206400000, "fresh": 66, "lastUpdated": 1442079728000, "production": "Universal", "rotten": 7, "viewer": {"meter": 88, "numReviews": 65283, "rating": 3.7}, "website": "http://www.octobersky.com"}, "type": "movie", "writers": ["Homer H. Hickam Jr. (book)", "Lewis Colick (screenplay)"], "year": 1999}