{"_id": "573a1398f29313caabcea156", "awards": {"nominations": 2, "text": "2 nominations.", "wins": 0}, "cast": ["Victor Love", "Matt Dillon", "Elizabeth McGovern", "Geraldine Page"], "countries": ["USA"], "directors": ["Jerrold Freedman"], "fullplot": "Bigger Thomas, an African American who lives in an impoverished neighborhood, is employed by a prosperous white family who live in the suburbs of a major city. The money Bigger makes at his new job will be used to supplement his mother's income. As a chauffeur, he is directed by the father of the family to take Mary, the daughter, to the university. Instead, Mary decides to pick up her Socialist boyfriend, Jan, and to spend the time drinking and partying. Jan and Mary portray a young liberal couple who venture into a black neighborhood with Bigger for the sole purpose of being entertained at Ernie's, a black nightclub. On the way home, Mary becomes inebriated and Bigger must get her to her bedroom without being detected. Mary's mother, who is blind, enters the room and Bigger panics at the thought of being caught with a white woman. He accidentally kills Mary by placing a pillow over her head to keep her quiet. Still frightened, Bigger disposes of the body in the furnace, possibly because he feels he would not get a fair trial for the accidental death of a white woman. Meanwhile, Jan is wanted by the police for Mary's murder and Bigger plays a role in the accusations against him.", "genres": ["Drama"], "imdb": {"id": 91613, "rating": 5.8, "votes": 412}, "languages": ["English"], "lastupdated": "2015-08-02 00:58:03.763000000", "plot": "In 1940s Chicago, a young black man takes a job as a chauffeur to a white family, which takes a turn for the worse when he accidentally kills the teenage daughter of the couple and then tries to cover it up.", "poster": "https://m.media-amazon.com/images/M/MV5BMTM2MTAwMjYwNV5BMl5BanBnXkFtZTcwMTAwMTMzMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 534729600000, "runtime": 111, "title": "Native Son", "type": "movie", "writers": ["Richard Wesley", "Richard Wright (novel)"], "year": 1986}