{"_id": "573a13b0f29313caabd342c5", "awards": {"nominations": 88, "text": "Won 4 Oscars. Another 102 wins & 88 nominations.", "wins": 106}, "cast": ["Leonardo DiCaprio", "Matt Damon", "Jack Nicholson", "Mark Wahlberg"], "countries": ["USA", "Hong Kong"], "directors": ["Martin Scorsese"], "fullplot": "In South Boston, the state police force is waging war on Irish American organized crime. Young undercover cop Billy Costigan is assigned to infiltrate the mob syndicate run by gangland chief Frank Costello. While Billy quickly gains Costello's confidence, Colin Sullivan, a hardened young criminal who has infiltrated the state police as an informer for the syndicate is rising to a position of power in the Special Investigation Unit. Each man becomes deeply consumed by his double life, gathering information about the plans and counter-plans of the operations he has penetrated. But when it becomes clear to both the mob and the police that there's a mole in their midst, Billy and Colin are suddenly in danger of being caught and exposed to the enemy-and each must race to uncover the identity of the other man in time to save himself. But is either willing to turn on the friends and comrades they've made during their long stints undercover?", "genres": ["Crime", "Drama", "Thriller"], "imdb": {"id": 407887, "rating": 8.5, "votes": 772226}, "languages": ["English", "Cantonese"], "lastupdated": "2015-08-31 00:16:54.983000000", "metacritic": 86, "num_mflix_comments": 368, "plot": "An undercover cop and a mole in the police attempt to identify each other while infiltrating an Irish gang in South Boston.", "poster": "https://m.media-amazon.com/images/M/MV5BMTI1MTY2OTIxNV5BMl5BanBnXkFtZTYwNjQ4NjY3._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1160092800000, "runtime": 151, "title": "The Departed", "tomatoes": {"boxOffice": "$132.3M", "consensus": "Featuring outstanding work from an excellent cast that includes Jack Nicholson, Leonardo DiCaprio, and Matt Damon, The Departed is a thoroughly engrossing gangster drama with the gritty authenticity and soupy morality that has infused director Martin Scorsese's past triumphs.", "critic": {"meter": 91, "numReviews": 262, "rating": 8.2}, "dvd": 1171324800000, "fresh": 238, "lastUpdated": 1442080177000, "production": "Warner Bros. Pictures", "rotten": 24, "viewer": {"meter": 94, "numReviews": 731288, "rating": 4.1}, "website": "http://www.thedeparted.com/"}, "type": "movie", "writers": ["William Monahan (screenplay)", "Alan Mak", "Felix Chong"], "year": 2006}