{"_id": "573a13a5f29313caabd1398b", "awards": {"nominations": 1, "text": "2 wins & 1 nomination.", "wins": 2}, "cast": ["Michel Bouquet", "Charles Berling", "Natacha Règnier", "Amira Casar"], "countries": ["Spain", "France"], "directors": ["Anne Fontaine"], "fullplot": "Jean-Luc is an established gerontologist who can do no wrong; he runs a private clinic specialising in anti-ageing treatments. Honoured for his work in this field, he throws a garden party at his home. It is during this social event that his father suddenly reappears, back after a long exile. A physician, he had left decades earlier without any apparent reason to practice in Africa. He moves into his son's home for several days, phlegmatically observing everything with an enigmatic smile. He peruses Jean-Luc's life and environment with cruel objectivity. The arrival of this interloper father, who everyone thought had disappeared for good, shatters the family microcosm: Jean-Luc doesn't know how to take him, as if the memory - or the resentment - was nothing but lost time; his wife becomes fond of this highly unconventional man; after first refusing to deal with him, Jean-Luc's younger brother strikes up a modest bond with him.", "genres": ["Drama", "Thriller"], "imdb": {"id": 268219, "rating": 6.8, "votes": 827}, "languages": ["French"], "lastupdated": "2015-06-18 00:01:35.077000000", "metacritic": 78, "num_mflix_comments": 1, "plot": "When his long-time disappeared father is entering his life again, Jean-Luc, a successful doctor, has no option but to face his own life story. Will he ever be able to forget and forgive?", "poster": "https://m.media-amazon.com/images/M/MV5BNjQ1MDg5NDkwM15BMl5BanBnXkFtZTcwOTk5MTYyMQ@@._V1_SY1000_SX677_AL_.jpg", "released": 1000857600000, "runtime": 98, "title": "How I Killed My Father", "tomatoes": {"lastUpdated": 1437072236000, "production": "Pathè Distribution", "viewer": {"meter": 33, "numReviews": 87, "rating": 3.2}}, "type": "movie", "writers": ["Jacques Fieschi", "Anne Fontaine"], "year": 2001}