{"_id": "573a1395f29313caabce1d19", "awards": {"nominations": 1, "text": "3 wins & 1 nomination.", "wins": 3}, "cast": ["Vittorio Gassman", "Catherine Spaak", "Jean-Louis Trintignant", "Claudio Gora"], "countries": ["Italy"], "directors": ["Dino Risi"], "fullplot": "Bruno Cortona and Roberto Mariani meet by chance as Roberto helps Bruno one day while everything is closed in Rome for the holiday weekend. The two men could not be more different. Thirty-six year old Bruno is extroverted, a man who seizes opportunities as they arise, is an excitement seeker, has never really grown up, but is a person to who many are drawn because of his exuberance and masculine good looks. Law student Roberto is introverted, controlled and so unsure of himself that he doesn't really know why he chose law as a career and is afraid not only to let the girl who lives across the way from him, Valeria, know that he likes her, but even to speak to her. He even has a photograph of her in his wallet that he took clandestinely. Roberto reluctantly gets caught up in the whirlwind of Bruno's last minute change in plans for the holidays as the two head off together in Bruno's Lancia Aurelia sports car, their joy ride which will be largely at Bruno's whim. That reluctance is because Roberto would rather stay at home to study for an exam a few weeks away. Roberto tries to ditch Bruno at every stop, he however afraid to tell Bruno the truth that he'd rather not be with him. But as their time together progresses, they each learn a little more about the other, with Roberto in particular beginning to understand how stultified his life has been. The question becomes whether Roberto and Bruno can find that good balance in their lives because of their time with the other.", "genres": ["Drama", "Comedy"], "imdb": {"id": 56512, "rating": 8.2, "votes": 4934}, "languages": ["Italian", "Latin", "German", "English", "Arabic"], "lastupdated": "2015-08-06 00:56:28.820000000", "num_mflix_comments": 1, "plot": "An impulsive braggart takes a shy law student for a two-day ride through the Roman and Tuscany countries.", "poster": "https://m.media-amazon.com/images/M/MV5BYmRmZGIxZWYtZDVkNS00NWI0LTg1ZDMtNzdiNjdiMWIxMTg3XkEyXkFqcGdeQXVyMjA0MzYwMDY@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": -223257600000, "runtime": 105, "title": "Il Sorpasso", "tomatoes": {"critic": {"meter": 83, "numReviews": 6, "rating": 8.8}, "dvd": 1398643200000, "fresh": 5, "lastUpdated": 1440181387000, "rotten": 1, "viewer": {"meter": 94, "numReviews": 835, "rating": 4.4}}, "type": "movie", "writers": ["Dino Risi (story)", "Ettore Scola (story)", "Ruggero Maccari (story)", "Ettore Scola (dialogue)", "Ruggero Maccari (dialogue)"], "year": 1962}