{"_id": "573a13a4f29313caabd0f569", "awards": {"nominations": 4, "text": "1 win & 4 nominations.", "wins": 1}, "cast": ["Gèrard Depardieu", "Christian Clavier", "Jamel Debbouze", "Monica Bellucci"], "countries": ["France", "Germany"], "directors": ["Alain Chabat"], "fullplot": "The Egyptian Queen Cleopatra bets against the Roman Emperor, Julius Caesar, that her people are still great, even if the times of the Pharaohs has long passed. She vows (against all logic) to build a new palace for Caesar within three months. Since all her architects are either busy otherwise or too conservative in style, this ambivalent honor falls to Edifis. He is to build the palace and be covered in gold or, if not, his fate is to be eaten by crocodiles. Edifis calls upon an old friend to help him out: The fabulous Druid Getafix from Gaul, who brews a fantastic potion that gives supernatural strength. In order to help and protect the old Druid, Asterix and Obelix accompany him on his journey to Egypt. When Julius Caesar gets wind of the project succeeding, he has the building site attacked by his troops in order to win the bet and not lose face. But just like the local pirates, he hasn't counted on Asterix and Obelix.", "genres": ["Adventure", "Comedy", "Family"], "imdb": {"id": 250223, "rating": 6.6, "votes": 34491}, "languages": ["French", "Arabic", "Cantonese", "Latin", "German"], "lastupdated": "2015-08-10 00:37:44.237000000", "plot": "Astèrix and Obèlix go to Egypt to help architect Numèrobis who is building a palace for Cleopatra.", "poster": "https://m.media-amazon.com/images/M/MV5BM2Q3NmUzNjAtM2VjMS00MGU3LWE4YjEtZTM1NDM0YTdlOWRkXkEyXkFqcGdeQXVyODIyOTEyMzY@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 1012348800000, "runtime": 107, "title": "Asterix and Obelix Meet Cleopatra", "tomatoes": {"critic": {"meter": 86, "numReviews": 7, "rating": 6.3}, "fresh": 6, "lastUpdated": 1442345955000, "production": "Miramax Films", "rotten": 1, "viewer": {"meter": 80, "numReviews": 20237, "rating": 3.6}}, "type": "movie", "writers": ["Renè Goscinny (comic book \"Astèrix et Clèopatre\")", "Albert Uderzo (comic book \"Astèrix et Clèopatre\")", "Alain Chabat (screenplay)"], "year": 2002}