{"_id": "573a13c3f29313caabd6b3f2", "awards": {"nominations": 2, "text": "5 wins & 2 nominations.", "wins": 5}, "cast": ["Brian Wimmer", "Bart Johnson", "Don Most", "Michael Buster"], "countries": ["USA"], "directors": ["David R. Brooks"], "fullplot": "The Yankles is about Charlie Jones, a professional baseball player who was released from the Los Angeles Spirits because of a drinking problem. Upon being paroled from prison after serving time for his third drunk driving conviction, Charlie endeavors to serve 192 hours mandatory community service by coaching baseball. To Charlie's dismay, however, he is shunned by mainstream society because of the controversy surrounding his early parole and prior convictions. Charlie soon discovers that the only people willing to give him a second chance are a group of Jewish, orthodox, yeshiva students who formed an upstart baseball team called The Yankles. Fortunately for Charlie, The Yankles are as desperate for a coach as he is for community service. After a rough start, Charlie finds a home with The Yankles. With Charlie's help, The Yankles strive for success on the field, while Charlie works to rebuild his reputation in society and his relationship with those whom he wronged in the past.", "genres": ["Sport"], "imdb": {"id": 1326277, "rating": 5, "votes": 162}, "languages": ["English"], "lastupdated": "2015-08-19 00:36:09.500000000", "num_mflix_comments": 2, "plot": "About Charlie Jones, a washed up, ex major league ballplayer, and how he gets a second chance at life and love by managing a Jewish, orthodox yeshiva baseball team.", "poster": "https://m.media-amazon.com/images/M/MV5BMjA0MTc1NzcwOF5BMl5BanBnXkFtZTcwOTA1MDIyNQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1258243200000, "runtime": 115, "title": "The Yankles", "tomatoes": {"dvd": 1338854400000, "lastUpdated": 1441996646000, "production": "DZB Productions", "viewer": {"meter": 65, "numReviews": 42, "rating": 3.8}}, "type": "movie", "writers": ["David R. Brooks", "Zev Brooks"], "year": 2009}