{"_id": "573a1391f29313caabcd8414", "awards": {"nominations": 4, "text": "3 wins & 4 nominations.", "wins": 3}, "cast": ["Alfred Abel", "Gustav Frèhlich", "Rudolf Klein-Rogge", "Fritz Rasp"], "countries": ["Germany"], "directors": ["Fritz Lang"], "fullplot": "Sometime in the future, the city of Metropolis is home to a Utopian society where its wealthy residents live a carefree life. One of those is Freder Fredersen. One day, he spots a beautiful woman with a group of children, she and the children who quickly disappear. Trying to follow her, he, oblivious to such, is horrified to find an underground world of workers, apparently who run the machinery which keeps the above ground Utopian world functioning. One of the few people above ground who knows about the world below is Freder's father, Joh Fredersen, who is the founder and master of Metropolis. Freder learns that the woman is Maria, who espouses the need to join the \"hands\" - the workers - to the \"head\" - those in power above - by a mediator or the \"heart\". Freder wants to help the plight of the workers in the want for a better life. But when Joh learns of what Maria is espousing and that Freder is joining their cause, Joh, with the assistance of an old colleague and now nemesis named Rotwang, an inventor, works toward quashing a supposed uprising, with Maria as the center of their plan. However, Joh is unaware that Rotwang has his own agenda. But if any of these plans includes the shut down of the machines, total anarchy could break loose both above ground and below.", "genres": ["Drama", "Sci-Fi"], "imdb": {"id": 17136, "rating": 8.3, "votes": 99845}, "languages": ["German"], "lastupdated": "2015-09-04 00:09:30.553000000", "metacritic": 98, "num_mflix_comments": 2, "plot": "In a futuristic city sharply divided between the working class and the city planners, the son of the city's mastermind falls in love with a working class prophet who predicts the coming of a savior to mediate their differences.", "poster": "https://m.media-amazon.com/images/M/MV5BMTg5YWIyMWUtZDY5My00Zjc1LTljOTctYmI0MWRmY2M2NmRkXkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": -1350864000000, "runtime": 153, "title": "Metropolis", "tomatoes": {"boxOffice": "$0.5M", "consensus": "A visually awe-inspiring science fiction classic from the silent era.", "critic": {"meter": 99, "numReviews": 115, "rating": 9.1}, "dvd": 1045526400000, "fresh": 114, "lastUpdated": 1442425707000, "production": "Paramount Pictures", "rotten": 1, "viewer": {"meter": 92, "numReviews": 60706, "rating": 4.1}, "website": "http://www.kino.com/metropolis"}, "type": "movie", "writers": ["Thea von Harbou (screenplay)", "Thea von Harbou (novel)"], "year": 1927}