{"_id": "573a13b4f29313caabd3eea4", "awards": {"nominations": 2, "text": "2 nominations.", "wins": 0}, "cast": ["Rowan Atkinson", "Steve Pemberton", "Lily Atkinson", "Preston Nyman"], "countries": ["UK", "France", "Germany"], "directors": ["Steve Bendelack"], "fullplot": "Mr. Bean enters a church raffle and wins a vacation trip to France as well as a camcorder. After boarding a Eurostar train and arriving in Paris, the French language proves a barrier for Bean, as he struggles to get across the city to catch a train to the south of France from the Gare de Lyon. Taking time to order a meal, he finds the consumption of a seafood platter to be a challenge. Just before catching his train, he asks Emil, a Russian film director on his way to be a judge at the Cannes Film festival to use his camcorder to record his boarding, but accidentally causes Emil being left behind at the station. Bean attempts to cheer up the director's son Stepan as the train continues south but matters are made more hectic by the fact that Emil has reported his son to have been kidnapped and Bean losing his wallet and essential travel documents at a pay phone where he and Stepan attempt to contact Emil. Heading in the direction of Cannes, Bean finds himself in the cast and disrupting the flow of a commercial being shot by the egotistical director Carson Clay. He and Stepan finally hitch a ride with the young and vivacious actress Sabine who is heading to Cannes to attend the premiere of Clay's film, in which she appears. After Bean sneaks into the showing, his camcorder images are destined to enliven the proceedings.", "genres": ["Comedy", "Family"], "imdb": {"id": 453451, "rating": 6.3, "votes": 79753}, "languages": ["English", "French", "Spanish", "Russian"], "lastupdated": "2015-08-19 00:07:45.173000000", "metacritic": 56, "num_mflix_comments": 1, "plot": "Mr. Bean wins a trip to Cannes where he unwittingly separates a young boy from his father and must help the two come back together. On the way he discovers France, bicycling, and true love, among other things.", "poster": "https://m.media-amazon.com/images/M/MV5BMTM2NzQ1Mzc4M15BMl5BanBnXkFtZTcwNTk3NjA1MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 1187913600000, "runtime": 90, "title": "Mr. Bean's Holiday", "tomatoes": {"boxOffice": "$32.6M", "consensus": "Mr. Bean's Holiday means well, but good intentions can't withstand the 90 minutes of monotonous slapstick and tired, obvious gags.", "critic": {"meter": 51, "numReviews": 110, "rating": 5.5}, "dvd": 1196121600000, "fresh": 56, "lastUpdated": 1442427237000, "production": "Universal Pictures", "rotten": 54, "viewer": {"meter": 49, "numReviews": 441936, "rating": 2.9}, "website": "http://www.dotcomedy.com/bean/"}, "type": "movie", "writers": ["Rowan Atkinson (character)", "Richard Curtis (character)", "Simon McBurney (story)", "Hamish McColl (screenplay)", "Robin Driscoll (screenplay)"], "year": 2007}