{"_id": "573a1397f29313caabce8c75", "awards": {"nominations": 0, "text": "2 wins.", "wins": 2}, "cast": ["Kristjan Markersen", "Erik Petersèn", "Axel Strèbye", "Birgit Sadolin"], "countries": ["Denmark"], "directors": ["Rumle Hammerich"], "fullplot": "Topper and Viggo are best friends and they live in the same house, where Viggo's father is an proprietor of a pub, called the \"The Blue Sea Cat\". Viggo has both his parents with him, but Topper only has his mother. His father is a sailor and is hardly ever home. Therefore, Topper misses him incredibly much. Topper is also secretly in love with a girl by the name of Sille. One day, Topper finds a pencil with which he writes \"I love Sille\" on a wall. When he discovers that Sille is approaching him, he stands in front of what he has written, so that she will not see it, since he's too shy to show it to her. However, she demands to see what he has written and he is forced to show her. But the writing is gone and he starts to wonder if there is something magic with the pencil. He and viggo decides to really try it out and they draw a rhinoceros on the wall (covered with yellow wallpaper) in Topper's apartment. However, the rhino doesn't vansih, as they think it will, but it comes to life instead. They name him Otto, but keeping him on the third floor in an apartment isn't easy. Otto becomes hungry and getting food for a yellow rhinoceros is easier said than done. This task casts them into many adventures, involving many different people.", "genres": ["Drama"], "imdb": {"id": 86064, "rating": 6.2, "votes": 321}, "languages": ["Danish"], "lastupdated": "2015-08-12 00:07:42.360000000", "num_mflix_comments": 1, "plot": "Topper and Viggo are best friends and they live in the same house, where Viggo's father is an proprietor of a pub, called the \"The Blue Sea Cat\". Viggo has both his parents with him, but ...", "released": 417398400000, "runtime": 90, "title": "Otto Is a Rhino", "tomatoes": {"lastUpdated": 1432931280000, "viewer": {"numReviews": 2, "rating": 3}}, "type": "movie", "writers": ["Rumle Hammerich", "Ole Lund Kirkegaard (book)", "Mogens Klèvedal"], "year": 1983}