{"_id": "573a1399f29313caabcec115", "awards": {"nominations": 2, "text": "4 wins & 2 nominations.", "wins": 4}, "cast": ["Salman Khan", "Bhagyashree", "Alok Nath", "Rajeev Verma"], "countries": ["India"], "directors": ["Sooraj R. Barjatya"], "fullplot": "Kishen Kumar Chaudhary and Karan are family like friends, when Kishen's wife Mrs. Kaushalya gives birth to a baby boy Prem, Karan helps the couple bring up there child with out- most care. Years later the two friends have parted ways, Karan likes in a shanty house, works as a mechanic and is the father to a young girl Suman while Kishen is a wealthy industrialist and lives in a spacious bungalow. In order to accumulate huge sums of fund abroad for good living Karan decides to leave Suman in the care of the Chaudhary's family. All is well there for Suman as she is befriend by Prem which eventually blossom to love, Kaushalya finds out about Prem and Suman's relationship and approve of Suman as her daughter-in-law but Kishen is quite unhappy with the relationship as he have plans to get Prem marry to his business partner's daughter Seema thus he insults Suman and throw her out of his house. Karan returns and is enraged at the treatment his daughter receive and leaves the house immediately with his daughter. Prem too is unhappy with his dad's decision and he also leaves the house opting to marry Suman with the blessings of Karan. But Karan refuses to accept Prem and the only way Prem can win Karan's approval is if he prove that he can earn money by his own sweat.", "genres": ["Family", "Musical", "Romance"], "imdb": {"id": 100095, "rating": 7.6, "votes": 4982}, "languages": ["Hindi"], "lastupdated": "2015-08-31 00:48:14.187000000", "num_mflix_comments": 2, "plot": "Kishen Kumar Chaudhary and Karan are family like friends, when Kishen's wife Mrs. Kaushalya gives birth to a baby boy Prem, Karan helps the couple bring up there child with out- most care. ...", "poster": "https://m.media-amazon.com/images/M/MV5BZDQ5NzAwYWItODVkYS00NzI5LWE3M2ItNTRjNDAyMzdjYjIzXkEyXkFqcGdeQXVyNjQ1MDcxNzM@._V1_SY1000_SX677_AL_.jpg", "runtime": 192, "title": "Maine Pyar Kiya", "tomatoes": {"dvd": 926985600000, "lastUpdated": 1441907627000, "production": "Rajshri Media", "viewer": {"meter": 89, "numReviews": 5189, "rating": 4.2}}, "type": "movie", "writers": ["S.M. Ahale (story)", "Sooraj R. Barjatya (dialogue)", "Sooraj R. Barjatya (screenplay)"], "year": 1989}