{"_id": "573a13aaf29313caabd22a5c", "awards": {"nominations": 7, "text": "11 wins & 7 nominations.", "wins": 11}, "cast": ["Tim Ivey", "Gena Rowlands", "Starletta DuPois", "James Garner"], "countries": ["USA"], "directors": ["Nick Cassavetes"], "fullplot": "In a nursing home, resident Duke reads a romance story for an old woman who has senile dementia with memory loss. In the late 1930s, wealthy seventeen year-old Allie Hamilton is spending summer vacation in Seabrook. Local worker Noah Calhoun meets Allie at a carnival and they soon fall in love with each other. One day, Noah brings Allie to an ancient house that he dreams of buying and restoring and they attempt to make love but get interrupted by their friend. Allie's parents do not approve of their romance since Noah belongs to another social class, and they move to New York with her. Noah writes 365 letters (A Year) to Allie, but her mother Anne Hamilton does not deliver them to her daughter. Three years later, the United States joins the World War II and Noah and his best friend Fin enlist in the army, and Allie works as an army nurse. She meets injured soldier Lon Hammond in the hospital. After the war, they meet each other again going on dates and then, Lon, who is wealthy and handsome, proposes. Meanwhile Noah buys and restores the old house and many people want to buy it. When Allie accidentally sees the photo of Noah and his house in a newspaper, she feels divided between her first love and her commitment with Lon. Meanwhile Duke stops reading to the old lady since his children are visiting him in the nursing home.", "genres": ["Drama", "Romance"], "imdb": {"id": 332280, "rating": 7.9, "votes": 360935}, "languages": ["English"], "lastupdated": "2015-09-04 00:12:33.133000000", "metacritic": 53, "plot": "A poor and passionate young man falls in love with a rich young woman and gives her a sense of freedom. They soon are separated by their social differences.", "poster": "https://m.media-amazon.com/images/M/MV5BMTk3OTM5Njg5M15BMl5BanBnXkFtZTYwMzA0ODI3._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1088121600000, "runtime": 123, "title": "The Notebook", "tomatoes": {"dvd": 1132012800000, "lastUpdated": 1441993446000, "viewer": {"meter": 80, "numReviews": 254, "rating": 3.5}}, "type": "movie", "writers": ["Jeremy Leven (screenplay)", "Jan Sardi (adaptation)", "Nicholas Sparks (novel)"], "year": 2004}