{"_id": "573a13abf29313caabd26384", "awards": {"nominations": 20, "text": "20 nominations.", "wins": 0}, "cast": ["Amitabh Bachchan", "Akshay Kumar", "Ajay Devgn", "Aishwarya Rai Bachchan"], "countries": ["India"], "directors": ["Rajkumar Santoshi"], "fullplot": "DCP Anant Shrivastav (Amitabh Bachchan) has been assigned the mission to escort terrorist Iqbal Ansari (Atul Kulkarni) from Chandangarh to Mumbai. His terrorist organization are determined to obtain him again. The plan for this is led by Yashwant Angre (Ajay Devgan), a ruthless killer and a former police officer. Anant's team consists of Inspector Shekhar Sachdev (Akshay Kumar), rookie cop Ashwin Gupte (Tusshar Kapoor) and two more inspectors. Soon Mahalakshmi (Aishwarya Rai) joins them as she is the only witness to have seen Yashwant. The team are armed and ready to go but danger lurks everywhere as the terrorist organization are determined to make sure the officers do not make it to Mumbai. The trip turns into survival when the team are attacked at various times. Finally the team make it to an abandoned cottage in the forest but there is a shoot out and the team are heavily outnumbered. Shekhar tries to force an exchange but against Anant's and Ashwin's judgement. Finally Ansari, after weeks of frustration, reveals that the terrorists are also out to kill him. He reveals a corrupt world involving the police and politicians. The officers soon realize the enemy they have been fighting is closer to them...In the end, Shekhar is killed by Mahalakshmi and her associate Angre. This killing spites anger into Anant and he hunts down each one of the corrupt officers and in the end, captures Angre after a fight during which, Despite Anant needing his medication often, he wins, and Angre is successfully captured. The movie ends as Angre is tried and sentenced to prison, and is being carried to his sentence; when he decides to flee, as a nut is lose in the bar to which he is handcuffed in the police van. Angre has Ashwin on gun point using a constable's rifle, when Ashwin reveals that Angre's lose nut was a setup to allow the killing of Angre, and that the bullets of the rifle had been emptied. Ashwin then shoots Angre, and reports his death as murder in an encounter.", "genres": ["Action", "Drama"], "imdb": {"id": 347332, "rating": 7.5, "votes": 7249}, "languages": ["Hindi", "Urdu"], "lastupdated": "2015-09-05 00:51:18.527000000", "num_mflix_comments": 1, "plot": "DCP Anant Shrivastav (Amitabh Bachchan) has been assigned the mission to escort terrorist Iqbal Ansari (Atul Kulkarni) from Chandangarh to Mumbai. His terrorist organization are determined ...", "poster": "https://m.media-amazon.com/images/M/MV5BN2NhOGZlNzYtYmYxMS00YTk1LTk2MDItNjI3MDVlZTRkZDYwXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY1000_SX677_AL_.jpg", "released": 1074816000000, "runtime": 174, "title": "Khakee", "tomatoes": {"dvd": 1080604800000, "lastUpdated": 1441222093000, "production": "Eros Entertainment", "viewer": {"meter": 78, "numReviews": 3064, "rating": 3.7}, "website": "http://www.khakeethemovie.com"}, "type": "movie", "writers": ["Shridhar Raghavan", "Rajkumar Santoshi (dialogue)", "Rajkumar Santoshi"], "year": 2004}