{"_id": "573a13d7f29313caabda2574", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["James Murphy", "Chuck Klosterman", "Keith Wood", "Nancy Whang"], "countries": ["UK"], "directors": ["Will Lovelace", "Dylan Southern"], "fullplot": "On April 2nd 2011, LCD Soundsystem played its final show at Madison Square Garden. LCD frontman James Murphy had made the conscious decision to disband one of the most celebrated and influential bands of its generation at the peak of its popularity, ensuring that the band would go out on top with the biggest and most ambitious concert of its career. The instantly sold out, near four-hour extravaganza did just that, moving the thousands in attendance to tears of joy and grief, with New York magazine calling the event \"a marvel of pure craft\" and TIME magazine lamenting \"we may never dance again.\" Documenting this once in a life time performance and an intimate portrait of James Murphy as he navigates the lead-up to the show, the day after, and the personal and professional ramifications of his decision.", "genres": ["Documentary", "Music"], "imdb": {"id": 2124908, "rating": 7.4, "votes": 1995}, "languages": ["English"], "lastupdated": "2015-08-24 00:30:20.697000000", "metacritic": 72, "plot": "On April 2nd 2011, LCD Soundsystem played its final show at Madison Square Garden. Documenting this once in a life time performance and an intimate portrait of James Murphy as he navigates the lead-up to the show, the day after, and the personal and professional ramifications of his decision.", "poster": "https://m.media-amazon.com/images/M/MV5BMTQxNjgwMjIzOF5BMl5BanBnXkFtZTcwMjAyNjUwOA@@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 1342569600000, "runtime": 108, "title": "Shut Up and Play the Hits", "tomatoes": {"boxOffice": "$0.5M", "critic": {"meter": 88, "numReviews": 25, "rating": 6.9}, "dvd": 1349740800000, "fresh": 22, "lastUpdated": 1440269938000, "production": "Oscilloscope Pictures", "rotten": 3, "viewer": {"meter": 85, "numReviews": 933, "rating": 4}, "website": "http://www.shutupandplaythehits.com/"}, "type": "movie", "year": 2012}