{"_id": "573a13b5f29313caabd44e35", "awards": {"nominations": 9, "text": "2 wins & 9 nominations.", "wins": 2}, "cast": ["Smadar Sayar", "Naama Schendar", "Katia Zinbris", "Ami Weinberg"], "countries": ["Israel"], "directors": ["Vardit Bilu", "Dalia Hager"], "fullplot": "Rebellious and outgoing Smadar can't stand types like Mirit. Mirit, introverted and frightened, keeps away from the likes of Smadar. But the two are thrown together as they are assigned to a patrol in Jerusalem as part of their compulsory military service. Their job is to stop Palestinian passersby, to ask for their identity cards, and to write down their details on special forms. You don't move from this place, don't sit down, don't smoke, don't eat, don't talk on your cell phones, says their commander, leaving them alone on the street with their patrol forms. What will they do now? This is the story of two 18-year-old girls who are busy with their own worlds--falling in love, break-ups, and the volatile relationship between the two--in an attempt to ignore the political reality in a city that slowly makes its way into their lives. As women, this film is our own way of soul searching, about our army service and the occupation", "genres": ["Drama"], "imdb": {"id": 478999, "rating": 6.9, "votes": 831}, "languages": ["Hebrew"], "lastupdated": "2015-07-31 00:06:04.143000000", "metacritic": 64, "num_mflix_comments": 2, "plot": "Rebellious and outgoing Smadar can't stand types like Mirit. Mirit, introverted and frightened, keeps away from the likes of Smadar. But the two are thrown together as they are assigned to ...", "poster": "https://m.media-amazon.com/images/M/MV5BMjE1ODA5MTUwOV5BMl5BanBnXkFtZTcwNTcwOTE0MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 1142467200000, "runtime": 98, "title": "Close to Home", "tomatoes": {"consensus": "While Close to Home devotes too much time chastising military service, its female perspective is unique and refreshing.", "critic": {"meter": 69, "numReviews": 35, "rating": 6.4}, "dvd": 1182211200000, "fresh": 24, "lastUpdated": 1440698797000, "production": "IFC First Take", "rotten": 11, "viewer": {"meter": 62, "numReviews": 2388, "rating": 3.3}, "website": "http://www.transfax.co.il/"}, "type": "movie", "writers": ["Vardit Bilu", "Dalia Hager"], "year": 2005}