{"_id": "573a1398f29313caabcea989", "awards": {"nominations": 2, "text": "1 win & 2 nominations.", "wins": 1}, "cast": ["Michele Valley", "Takis Spiridakis", "Liana Hatzi", "Nikos Hatzis"], "countries": ["Greece"], "directors": ["Nikos Nikolaidis"], "fullplot": "A woman is walking alone through an abandoned city. She approaches the forbidden zone and tries to pass through. Everywhere the Morning Patrol and deceptive traps are watching. The city itself is alive but uncontrolled. Computer voices warn non-existing inhabitants to leave the city. The communication system works... cinemas show films... classic faces of a past era flash across TV screens. She is confronted by one of the few survivors guarding the city. They will come close to each other ; they will try to recall the past. Together they unravel their tangled memory - threads of this catastrophe and decide to penetrate the zone together ; They are linked by the bonds of violence and death since no other behaviour is possible in this kind of world. Is there an end? Is there hope and any future since no person that was allowed through ever returned to tell us whether the freedom of the sea exists. The fugitives encounter increasing dangers... A story of love in this unbearable world... what point can it have?", "genres": ["Sci-Fi"], "imdb": {"id": 93791, "rating": 7.1, "votes": 363}, "languages": ["Greek"], "lastupdated": "2015-08-10 00:40:20.267000000", "plot": "A woman is walking alone through an abandoned city. She approaches the forbidden zone and tries to pass through. Everywhere the Morning Patrol and deceptive traps are watching. The city ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTM5OTczODk2NV5BMl5BanBnXkFtZTcwNzQ1MDg5Ng@@._V1_SY1000_SX677_AL_.jpg", "released": 560044800000, "runtime": 108, "title": "Morning Patrol", "tomatoes": {"lastUpdated": 1434305439000, "viewer": {"numReviews": 83, "rating": 3.8}}, "type": "movie", "writers": ["Raymond Chandler (excerpt)", "Philip K. Dick (excerpt)", "Daphne Du Maurier (excerpt)", "Nikos Nikolaidis", "Herman Raucher (excerpt)"], "year": 1987}