{"_id": "573a13a0f29313caabd06434", "awards": {"nominations": 0, "text": "4 wins.", "wins": 4}, "cast": ["Rakhee Gulzar", "Bobby Deol", "Preity Zinta", "Farida Jalal"], "countries": ["India"], "directors": ["Abbas Alibhai Burmawalla", "Mastan Alibhai Burmawalla"], "fullplot": "Major Vijay Malhotra works in the Indian army; on one assignment whereby he is asked to be the security in-charge of a truck-load of arms and ammunitions; he red-handedly caught some traitors attempting to steal these arms. When he attempts to bring them to justice; they attacked him leading to a scuffle which ended up leaving Malhotra dead. They then put the blame on Malhotra; has his dead body stripped of all medals and commendations, and leave him to be cremated by his wife Geeta and young son Raju. The villagers' refuses to let a traitor cremated on their land and leave his body to rot in the hot desert sand. 20 years later Raju has now matured and is on the verge of unravel the secrets of his dad's death and to punish the real perpetrators.", "genres": ["Action", "Drama", "Musical"], "imdb": {"id": 211634, "rating": 6.1, "votes": 1417}, "languages": ["Hindi"], "lastupdated": "2015-08-18 00:27:48.283000000", "plot": "The story follows a young man (Bobby Deol) who flees India and arrives in Australia seeking vengence for something that started in India. In Australia he meets and falls in love with the daughter of a rich and powerful man(Suresh Oberoi). The story keeps the covers on Bobby Deols plan until the end when everything is revealed as to why he is a SOLDIER.", "poster": "https://m.media-amazon.com/images/M/MV5BMTcyMTc1OTczMV5BMl5BanBnXkFtZTcwNzE2ODgzMQ@@._V1_SY1000_SX677_AL_.jpg", "released": 908150400000, "title": "Soldier", "tomatoes": {"dvd": 1056412800000, "lastUpdated": 1431892895000, "production": "Vanguard", "viewer": {"numReviews": 48, "rating": 0}}, "type": "movie", "writers": ["Sachin Bhowmick (screenplay)", "Shyam Goel (screenplay)", "Shyam Goel (story)", "Javed Siddiqui (dialogue)"], "year": 1998}