{"_id": "573a1399f29313caabcec9d1", "awards": {"nominations": 3, "text": "3 nominations.", "wins": 0}, "cast": ["Sam Waterston", "Tess Harper", "Gail Strickland", "Reese Witherspoon"], "countries": ["USA"], "directors": ["Robert Mulligan"], "fullplot": "Rural Louisiana, summer of 1957, Elvis is King. At 14, Dani is coming of age. Her older sister is beautiful, smart, and off to Duke in the fall; her mom's pregnant with number four (Dad wants a son), and Dad's pretty strict. Life gets sweeter when 17-year-old Court Foster, his widowed mom, and two little brothers move into the vacant farm next door. Court likes Dani's high spirits and direct way, and though he has a man's responsibilities on the farm, they go off swimming sometimes. The waters of adolescence are deeper than Dani realizes as hers and Court's feelings get jumbled. Then Mother Nature throws wrenching surprises at Dani, and she must come to terms with new emotions.", "genres": ["Drama", "Romance"], "imdb": {"id": 102388, "rating": 7.5, "votes": 11345}, "languages": ["English"], "lastupdated": "2015-09-01 00:40:42.600000000", "num_mflix_comments": 2, "plot": "Rural Louisiana, summer of 1957, Elvis is King. At 14, Dani is coming of age. Her older sister is beautiful, smart, and off to Duke in the fall; her mom's pregnant with number four (Dad ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTM4MDU0NDY0MF5BMl5BanBnXkFtZTcwMzg1ODE1NA@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 686534400000, "runtime": 99, "title": "The Man in the Moon", "tomatoes": {"consensus": "It's sentimental, and some viewers may feel manipulated by the melodramatic final act, but The Man in the Moon offers a finely drawn coming-of-age story with an excellent cast -- including Reese Witherspoon in her film debut.", "critic": {"meter": 89, "numReviews": 19, "rating": 7.7}, "dvd": 978998400000, "fresh": 17, "lastUpdated": 1440355384000, "production": "MGM", "rotten": 2, "viewer": {"meter": 85, "numReviews": 33137, "rating": 3.7}, "website": "http://www.mgm.com/title_title.php?title_star=MANINTHE"}, "type": "movie", "writers": ["Jenny Wingfield"], "year": 1991}