{"_id": "573a1395f29313caabce1972", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Shirley MacLaine", "Laurence Harvey", "Jack Hawkins", "Nobu McCarthy"], "countries": ["USA"], "directors": ["Charles Walters"], "fullplot": "American Anna Vorontosov teaches in a rural school on New Zealand's North Island. Her class of younger students is comprised largely of Maoris. She feels that western methods are not the most appropriate in teaching her students, for who concepts such as \"see Jane run\" have no cultural context. She wants her students to \"feel\", from love to pain to joy, and as such her classes are outwardly disorganized and chaotic. Her livelihood is potentially threatened with the arrival of a new senior inspector of primary schools, a Brit name William Abercrombie. To make her classes seem more organized to Abercrombie, Anna enlists the help of one of the older students, fifteen year old Maori, Whareparita. Anna's students, including Whareparita, see her as their guardian angel. Anna's burgeoning friendship with Whareparita may show her that although she has her students' best interests at heart, she may also not fully understand the culture within which she now lives. Teaching is her life, which leaves no time for men, sex about which she has repressive views. These views affect her relationship with two very different men who fall in love with her. The first is fellow teacher, Paul Lathrope, a brash Brit. He is a lost soul with self-destructive tendencies. The second is married Abercrombie himself, whose marriage is albeit unsatisfying and long-distance.", "genres": ["Drama"], "imdb": {"id": 55557, "rating": 5.1, "votes": 175}, "languages": ["English"], "lastupdated": "2015-07-02 00:34:58.347000000", "plot": "Out on a Limb, not out on a Leash.", "rated": "APPROVED", "released": -257040000000, "runtime": 96, "title": "Two Loves", "tomatoes": {"lastUpdated": 1441051312000, "production": "Columbia Pictures", "viewer": {"meter": 52, "numReviews": 763, "rating": 3.4}}, "type": "movie", "writers": ["Ben Maddow (screenplay)", "Sylvia Ashton-Warner (novel)"], "year": 1961}