{"_id": "573a13b1f29313caabd3706b", "awards": {"nominations": 1, "text": "Nominated for 1 Primetime Emmy. Another 1 win & 1 nomination.", "wins": 2}, "cast": ["Mary-Louise Parker", "Aidan Quinn", "Zac Efron", "Bubba Lewis"], "countries": ["USA"], "directors": ["Gregg Champion"], "fullplot": "The social stigma and discrimination of autistic children is present in the movie Miracle Run. The life of Corrine Morgan-Thomas, the mother of autistic twins Stephen and Philip, changes drastically when she finally finds out that her sons are autistic. The first few doctors she takes her sons to are unable to diagnose them with any problem, saying that they are just fine; fortunately, Corrine takes her sons to a specialist who diagnoses the boys with Autism. Corrine's initial reaction is that of shock. She does not like the idea that her sons are autistic, and leaves the hospital angrily. She does, however, end up realizing that the specialist was correct. When she tells her husband about their autism, he says he doesn't want to deal with the autism, so she decides to leave him. She is determined to fight the social stigma of autism and to have her sons be treated like any other child, so she does not tell Stephen and Philip's new school about their problem. The school accuses her of abusing her children, but then tells her that she ought to find another school for the boys when Corrine tells them about her twins' autism. In the end her boys set their hearts to succeed and do succeed, proving that autistic children can do anything that any other child could do!", "genres": ["Drama"], "imdb": {"id": 419967, "rating": 7.6, "votes": 1260}, "languages": ["English"], "lastupdated": "2015-07-28 00:16:07.683000000", "plot": "The social stigma and discrimination of autistic children is present in the movie Miracle Run. The life of Corrine Morgan-Thomas, the mother of autistic twins Stephen and Philip, changes ...", "poster": "https://m.media-amazon.com/images/M/MV5BZjBhYmMzZTYtMTIyOC00ZmE0LTljM2QtM2ViNzhjMDNiODAxXkEyXkFqcGdeQXVyNjc4NzE2Mzk@._V1_SY1000_SX677_AL_.jpg", "rated": "TV-PG", "released": 1092009600000, "runtime": 120, "title": "Miracle Run", "tomatoes": {"lastUpdated": 1435175447000, "viewer": {"meter": 89, "numReviews": 3960, "rating": 4.2}}, "type": "movie", "writers": ["Mike Maples"], "year": 2004}