{"_id": "573a1391f29313caabcd9637", "awards": {"nominations": 1, "text": "2 wins & 1 nomination.", "wins": 2}, "cast": ["Bela Lugosi", "Helen Chandler", "David Manners", "Dwight Frye"], "countries": ["USA"], "directors": ["Tod Browning"], "fullplot": "After a harrowing ride through the Carpathian mountains in eastern Europe, Renfield enters castle Dracula to finalize the transferral of Carfax Abbey in London to Count Dracula, who is in actuality a vampire. Renfield is drugged by the eerily hypnotic count, and turned into one of his thralls, protecting him during his sea voyage to London. After sucking the blood and turning the young Lucy Weston into a vampire, Dracula turns his attention to her friend Mina Seward, daughter of Dr. Seward who then calls in a specialist, Dr. Van Helsing, to diagnose the sudden deterioration of Mina's health. Van Helsing, realizing that Dracula is indeed a vampire, tries to prepare Mina's fiance, John Harker, and Dr. Seward for what is to come and the measures that will have to be taken to prevent Mina from becoming one of the undead.", "genres": ["Horror"], "imdb": {"id": 21814, "rating": 7.6, "votes": 30184}, "languages": ["English", "Hungarian", "Latin"], "lastupdated": "2015-08-28 00:30:04.660000000", "num_mflix_comments": 1, "plot": "The ancient vampire Count Dracula arrives in England and begins to prey upon the virtuous young Mina.", "poster": "https://m.media-amazon.com/images/M/MV5BZDY2ODZhZWQtNDk0ZS00OGE4LWE4NjAtZjE5MTJhMjExMTRjXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_SY1000_SX677_AL_.jpg", "rated": "APPROVED", "released": -1226966400000, "runtime": 85, "title": "Dracula", "tomatoes": {"consensus": "Bela Lugosi's timeless portrayal of Dracula in this creepy and atmospheric 1931 film has set the standard for major vampiric roles since.", "critic": {"meter": 91, "numReviews": 45, "rating": 7.9}, "dvd": 998956800000, "fresh": 41, "lastUpdated": 1442516384000, "production": "Universal Pictures", "rotten": 4, "viewer": {"meter": 82, "numReviews": 44035, "rating": 3.7}}, "type": "movie", "writers": ["Bram Stoker (by)", "Hamilton Deane (from the play adapted by)", "John L. Balderston (from the play adapted by)", "Garrett Fort (play)"], "year": 1931}