{"_id": "573a13dcf29313caabdb2d8e", "awards": {"nominations": 2, "text": "2 nominations.", "wins": 0}, "cast": ["David Garrett", "Jared Harris", "Joely Richardson", "Christian McKay"], "countries": ["Germany", "Italy"], "directors": ["Bernard Rose"], "fullplot": "1830. Violin virtuoso and notorious womanizer Niccolè Paganini (David Garrett) is at the peak of his career, acclaimed throughout Europe. His name alone suggests countless affairs and scandals - which is exactly what his manager Urbani (Jared Harris) is doing his utmost to cultivate, for it is in his interest to market his famous client the best way possible. Only the London public has yet to be conquered. In a plan to lure Paganini to London for his British debut, English impresario John Watson (Christian McKay) and his mistress Elisabeth Wells (Veronica Ferres) risk all they own. Business-savvy Urbani ultimately manages to bring Paganini to the British capital, albeit against his will. And thanks to the rave reviews by journalist Ethel Langham (Joely Richardson), Urbani's strategy seems to be working better than he imagined. Fans throng his hotel, causing pandemonium. Musician and manager are forced to take refuge at Watson's home, where Paganini quickly takes a liking to his host's lovely daughter Charlotte (Andrea Deck), a talented singer. She and the violinist find the way to each other's hearts through music - and Paganini falls undyingly in love with the young beauty. This displeases Urbani, however, who fears he will lose his influence on his protegè. He begins to craft a diabolical plan...", "genres": ["Biography", "Drama", "Musical"], "imdb": {"id": 2401715, "rating": 6.1, "votes": 1746}, "languages": ["English", "French"], "lastupdated": "2015-08-20 00:01:03.033000000", "metacritic": 38, "num_mflix_comments": 1, "plot": "The life story of Italian violinist and composer, Niccolè Paganini, who rose to fame as a virtuoso in the early 19th Century.", "poster": "https://m.media-amazon.com/images/M/MV5BNTQ1MjUzMTY0Nl5BMl5BanBnXkFtZTgwNjAwNDM1MDE@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1422576000000, "runtime": 122, "title": "The Devil's Violinist", "tomatoes": {"boxOffice": "$8.0k", "critic": {"meter": 25, "numReviews": 12, "rating": 5.1}, "dvd": 1430092800000, "fresh": 3, "lastUpdated": 1441136156000, "production": "Freestyle Releasing", "rotten": 9, "viewer": {"meter": 47, "numReviews": 222, "rating": 3.2}, "website": "http://www.teufelsgeiger-film.de"}, "type": "movie", "writers": ["Bernard Rose"], "year": 2013}