{"_id": "573a13b4f29313caabd3f467", "awards": {"nominations": 1, "text": "1 win & 1 nomination.", "wins": 1}, "cast": ["Josh Duhamel", "Melissa George", "Olivia Wilde", "Desmond Askew"], "countries": ["USA"], "directors": ["John Stockwell"], "fullplot": "While traveling on vacation through the country of Northeastern of Brazil by bus, the American Alex Trubituan, his sister Bea Tribituan and their friend Amy Harrington meet the also foreigners Pru Stagler, Finn Davies and Liam Kuller after an accident with their bus. They follow a track through the woods and find a hidden paradisiacal beach. They decide to stay in the place drinking beer and dancing funk and parting with the locals and they meet the amicable Brazilian teenager Kiko. They are drugged with \"Boa Noite, Cinderela\" (Ruffies, literal translation: \"Good Night, Cinderella\" - a trick used by smalltime crooks to steal naive people) and when they wake up, they are practically naked, with all their belongings, clothes, money, jewels, passports, backpacks etc. stolen. They walk to a small village trying to find a police station, they get into trouble with the dwellers and they are helped by their acquaintance Kiko, who leads them to his uncle's isolated well-equipped cabin in the woods to wait for the next bus two days later. Along the night, Kiko's \"uncle\" arrives with his friends and the group discloses the sinister intentions of the newcomers.", "genres": ["Horror", "Mystery", "Thriller"], "imdb": {"id": 454970, "rating": 5.3, "votes": 29726}, "languages": ["English", "Portuguese"], "lastupdated": "2015-09-14 17:29:09.557000000", "metacritic": 36, "num_mflix_comments": 2, "plot": "A group of young backpackers' vacation turns sour when a bus accident leaves them marooned in a remote Brazilian rural area that holds an ominous secret.", "poster": "https://m.media-amazon.com/images/M/MV5BMTAwNjAwOTAyMDdeQTJeQWpwZ15BbWU2MDIyMTU1Nw@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1164931200000, "runtime": 93, "title": "Turistas", "tomatoes": {"boxOffice": "$6.9M", "consensus": "Beautiful scenery and cinematography can't save Turistas from its wooden acting and stale and predictable plot.", "critic": {"meter": 16, "numReviews": 104, "rating": 3.8}, "dvd": 1174953600000, "fresh": 17, "lastUpdated": 1440353025000, "production": "Fox Atomic", "rotten": 87, "viewer": {"meter": 28, "numReviews": 83384, "rating": 2.7}, "website": "http://www.myspace.com/turistasmovie"}, "type": "movie", "writers": ["Michael Ross"], "year": 2006}