{"_id": "573a13b4f29313caabd40aab", "awards": {"nominations": 18, "text": "Nominated for 1 BAFTA Film Award. Another 17 wins & 18 nominations.", "wins": 18}, "cast": ["Aamir Khan", "Siddharth", "Sharman Joshi", "Kunal Kapoor"], "countries": ["India"], "directors": ["Rakeysh Omprakash Mehra"], "fullplot": "A young idealistic English filmmaker, Sue, arrives in India to make a film on Indian revolutionaries Bhagat Singh, Chandrashekhar Azad and their contemporaries and their fight for freedom from the British Raj. Owing to a lack of funds, she recruits students from Delhi University to act in her docu-drama. She finds DJ, who graduated five years ago but still wants to be a part of the University because he doesn't think there's too much out there in the real world to look forward to. Karan, the son of Industrialist Rajnath Singhania, who shares an uncomfortable relationship with his father, but continues to live off him, albeit very grudgingly. Aslam, is a middle class Muslim boy, who lives in the by-lanes near Jama Masjid, poet, philosopher and guide to his friends. Sukhi, the group's baby, innocent, vulnerable and with a weakness for only one thing - girls. Laxman Pandey, the fundamentalist in the group, the only one who still believes that politics can make the world a better place and finally Sonia - the sole girl in the group, tomboy and vivacious spirit, engaged to Ajay - the dashing air pilot. Through her film, Sue wishes to showcase to the world the efforts of these young revolutionaries and the enormity of their contribution to the freedom movement in India. What unfolds is the inspiration behind Sue's passion for bringing their story to the world. The twist in the tale is of course the fact that more than just telling the world, Sue's film makes DJ and his friends stop and stare at themselves for being the actual descendants of these great men and never recognizing and celebrating their courage and spirit.", "genres": ["Comedy", "Drama", "History"], "imdb": {"id": 405508, "rating": 8.4, "votes": 61068}, "languages": ["Hindi", "Panjabi", "English"], "lastupdated": "2015-09-02 13:20:59.617000000", "num_mflix_comments": 2, "plot": "The story of six young Indians who assist an English Woman to film a documentary on the extremist freedom fighters from their past, and the events that lead them to relive the long forgotten saga of freedom.", "poster": "https://m.media-amazon.com/images/M/MV5BM2I3OGU1YmQtNjIyOC00OGYzLWFkOTgtOGIyMDVlNmE2M2VmXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 1138233600000, "runtime": 157, "title": "Rang De Basanti", "tomatoes": {"dvd": 883612800000, "lastUpdated": 1442081794000, "viewer": {"numReviews": 67, "rating": 4.5}}, "type": "movie", "writers": ["Renzil D'Silva (screenplay)", "Rakeysh Omprakash Mehra (screenplay)", "Kamlesh Pandey (story)"], "year": 2006}