{"_id": "573a13b8f29313caabd4d8e1", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Thomas Michael", "Paolo Mancini", "Chris Klein", "Shae Norris"], "countries": ["Canada", "USA"], "directors": ["Matthiew Klinck"], "fullplot": "Thomas Michael, Paolo Mancini, Chris Klein and Joe Mantegna star in director Matthiew Klinck's holiday-themed comedy concerning two downsized Easter bunnies whose friendship starts to suffer when the multi-national corporation that owns all holidays decides to make some serious cutbacks. Hank and Mike are the Felix Unger and Oscar Madison of holiday mascots: They may seem like a mismatched pair yet their differences are precisely what's kept them together all these years. While Hank is a hard drinking ladies man, Mike can't seem to look past his own insecurities long enough to realize how truly miserable he is. Once a year, Hank and Mike dutifully venture out to deliver Easter baskets to families everywhere. This year, however, Easter Enterprises has taken a hit, and all \"Tier 2\" holidays (Christmas and Hanukkah being prime examples of \"Tier 1\") are fair game for downsizing. Since Hank and Mike work only once a year, their jobs are the first to go. Subsequently relegated to the unemployment office and unable to break free of their furry-tailed past, these two longtime pals are about to discover just how valuable their friendship can be in times of need.", "genres": ["Comedy", "Fantasy"], "imdb": {"id": 814131, "rating": 6, "votes": 1367}, "languages": ["English"], "lastupdated": "2015-08-16 00:56:28.680000000", "plot": "Thomas Michael, Paolo Mancini, Chris Klein and Joe Mantegna star in director Matthiew Klinck's holiday-themed comedy concerning two downsized Easter bunnies whose friendship starts to ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTMxNjQyNzAzMl5BMl5BanBnXkFtZTcwMTczNjY5MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1199145600000, "runtime": 86, "title": "Hank and Mike", "tomatoes": {"dvd": 1225152000000, "lastUpdated": 1437504354000, "production": "Magnolia Pictures", "viewer": {"meter": 53, "numReviews": 636, "rating": 3.3}, "website": "http://www.hankandmike.com/"}, "type": "movie", "writers": ["Paolo Mancini", "Thomas Michael"], "year": 2008}