{"_id": "573a13d6f29313caabd9f0d5", "awards": {"nominations": 3, "text": "3 nominations.", "wins": 0}, "cast": ["Kimmo Pohjonen", "Samuli Kosminen", "Timo Kèmèrèinen", "Sami Kuoppamèki"], "countries": ["Finland", "Tanzania", "UK", "Belgium", "Portugal"], "directors": ["Kimmo Koskela"], "fullplot": "Finland's most daring musician, the accordionist, composer, performer Kimmo Pohjonen, revolutionizes the accordion and shatters traditional musical standards. Extraordinary sounds explode from his custom built accordion and its bellows including electronic effects, accordion samples, voice, farm machines, animals and string quartet. Pohjonen bridges the gap between experimental, rock, folk and classic genres in fact creating an entirely new accordion music world. His performances are reminiscent of the violence of Roman gladiators and the castigation of medieval monks. The film is a journey of an exceptional artist grounded in basic human truths. The Cinematography and drama reveal a distinctive Scandinavian viewpoint. From the startling opening - the hero walks across an expanse of ice and drops through a hole into frigid water - right to the very end; a dramatic pace draws the viewer in, revealing the inner struggle of this iconoclast.", "genres": ["Documentary", "Biography", "Music"], "imdb": {"id": 2072236, "rating": 7.3, "votes": 69}, "languages": ["Finnish", "English"], "lastupdated": "2015-08-15 00:56:04.817000000", "num_mflix_comments": 2, "plot": "Finland's most daring musician, the accordionist, composer, performer Kimmo Pohjonen, revolutionizes the accordion and shatters traditional musical standards. Extraordinary sounds explode ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTQyNDU5NzE3OV5BMl5BanBnXkFtZTgwMjYzOTI0MzE@._V1_SY1000_SX677_AL_.jpg", "released": 1363910400000, "runtime": 86, "title": "Soundbreaker", "tomatoes": {"lastUpdated": 1438888210000, "viewer": {"numReviews": 10, "rating": 3.5}}, "type": "movie", "writers": ["Kimmo Koskela"], "year": 2012}