{"_id": "573a13b4f29313caabd40f61", "awards": {"nominations": 5, "text": "3 wins & 5 nominations.", "wins": 3}, "cast": ["Samuel L. Jackson", "Christina Ricci", "Justin Timberlake", "S. Epatha Merkerson"], "countries": ["USA"], "directors": ["Craig Brewer"], "fullplot": "In rural Mississippi, Lazarus, a former blues musician who survives by truck farming, finds a young girl nearly beaten to death near his home. She's the white-trash town tramp, molded by a life of sexual abuse at the hands of her father and verbal abuse from her mother, who seems to delight in reminding Rae of her mistake in not aborting her. Lazarus, who is also facing personal crisis at the dissolution of his marriage, nurses Rae back to health, providing her with gentle, fatherly advice as well as an education in blues music. Rae's boyfriend, Ronnie, goaded by the man who nearly beat Rae to death, misunderstands the relationship between Lazarus and Rae, and vows to kill him. Lazarus, exhibiting a street-smart understanding of violence and its motives, calls Ronnie's bluff, senses that he is as troubled as Rae, and becomes a guiding force in the young couple's resurrection.", "genres": ["Drama", "Music"], "imdb": {"id": 462200, "rating": 7, "votes": 49859}, "languages": ["English"], "lastupdated": "2015-09-14 12:56:11.790000000", "metacritic": 52, "num_mflix_comments": 1, "plot": "A God-fearing bluesman takes to a wild young woman who, as a victim of childhood sexual abuse, looks everywhere for love, never quite finding it.", "poster": "https://m.media-amazon.com/images/M/MV5BNzE4NzY0NzM2MF5BMl5BanBnXkFtZTcwMTc4MTY0MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1172793600000, "runtime": 116, "title": "Black Snake Moan", "tomatoes": {"boxOffice": "$9.3M", "consensus": "Uninhibited performances, skillful direction, and a killer blues soundtrack elevate Black Snake Moan beyond its outlandish premise.", "critic": {"meter": 66, "numReviews": 157, "rating": 6.4}, "dvd": 1182816000000, "fresh": 104, "lastUpdated": 1442424705000, "production": "Paramount Vantage", "rotten": 53, "viewer": {"meter": 69, "numReviews": 412998, "rating": 3.3}, "website": "http://www.moanmovie.com/"}, "type": "movie", "writers": ["Craig Brewer"], "year": 2006}