{"_id": "573a13adf29313caabd2aabd", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Johnny Messner", "KaDee Strickland", "Matthew Marsden", "Nicholas Gonzalez"], "countries": ["USA"], "directors": ["Dwight H. Little"], "fullplot": "In New York, the ambitious Dr. Jack Byron and his associate Gordon Mitchell present the research of his assistant Sam Rogers to the CEO and board of directors of a corporation to sponsor a scientific expedition to Borneo. The objective is to find a flower, Blood Orchid, that flourishes for a couple of weeks every seven years and could be a fountain of youth, prolonging the expectation of life of human beings. They are succeeded and once in Borneo, they realize that it is the raining season and there is no boat available to navigate on the river. They pay US$ 50,000.00 to convince Captain Bill Johnson and his partner Tran to sail to the location. After an accident in a waterfall, the survivors realize that a pack of anacondas have gathered for mating and their nest is nearby the plantation of Blood Orchid, which made them bigger and bigger.", "genres": ["Adventure", "Horror", "Thriller"], "imdb": {"id": 366174, "rating": 4.5, "votes": 20664}, "languages": ["English", "Indonesian"], "lastupdated": "2015-09-15 03:58:17.480000000", "metacritic": 40, "num_mflix_comments": 2, "plot": "A scientific expedition sets out for Borneo to seek a flower called the Blood Orchid, which could grant longer life. Meanwhile, they run afoul of snakes and each other.", "poster": "https://m.media-amazon.com/images/M/MV5BNzc5MDg1NTkxNl5BMl5BanBnXkFtZTYwNTcyNjA3._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1093564800000, "runtime": 97, "title": "Anacondas: The Hunt for the Blood Orchid", "type": "movie", "writers": ["Hans Bauer", "Jim Cash", "Jack Epps Jr.", "Hans Bauer (story)", "Jim Cash (story)", "Jack Epps Jr. (story)", "John Claflin (screenplay)", "Daniel Zelman (screenplay)", "Michael Miner (screenplay)", "Edward Neumeier (screenplay)"], "year": 2004}