{"_id": "573a13b5f29313caabd426d4", "awards": {"nominations": 33, "text": "Nominated for 1 Oscar. Another 35 wins & 33 nominations.", "wins": 36}, "cast": ["Ryan Gosling", "Jeff Lima", "Shareeka Epps", "Nathan Corbett"], "countries": ["USA"], "directors": ["Ryan Fleck"], "fullplot": "Young Caucasian Dan Dunne teaches history and coaches the girls basketball team at a Brooklyn high school populated primarily by black and Hispanic students. To the chagrin of his superiors, Dan bucks the outlined curriculum of historical facts in favor of the philosophy of historical events, generally discussing the concept of dialectics. As such, he captures the imagination of his students, at least in the classroom. Outside of the classroom, Dan's life is in shambles. He has a distant but cordial relationship with his family. He uses illicit drugs rampantly. Although his former girlfriend Rachel was able to clean up her drug habit, Dan believes that rehab will not work for him. Due to a combination of these issues, he treats women poorly. Thirteen year old Drey is a student in his class and a player on his basketball team. Drey has her own problems. Her parents are divorced, with her father a virtually non-existent figure in her life and her EMT mother generally absent as she is always working to provide for Drey. Her older brother Mike is incarcerated for selling drugs for a local dealer named Frank. Mike took the fall for Frank, who in turn protects Drey whether she wants to be associated with him or not. Dan and Drey's relationship changes when Drey catches Dan, believing he is alone, smoking crack in the girl's locker room bathroom. He is totally stoned. Their resulting friendship, which is seen as inappropriate by the few who know, is based on each being unable to deal with their own life, but feeling like they can be at least a minor salvation in the other's life.", "genres": ["Drama"], "imdb": {"id": 468489, "rating": 7.3, "votes": 67259}, "languages": ["English"], "lastupdated": "2015-09-02 00:40:17.523000000", "metacritic": 85, "plot": "An inner-city junior high school teacher with a drug habit forms an unlikely friendship with one of his students after she discovers his secret.", "poster": "https://m.media-amazon.com/images/M/MV5BMTg4ODg1OTIwNl5BMl5BanBnXkFtZTcwOTA3ODQzMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1158883200000, "runtime": 106, "title": "Half Nelson", "tomatoes": {"boxOffice": "$2.6M", "consensus": "Half Nelson features powerful performances from Ryan Gosling and Shareeka Epps. It's a wise, unsentimental portrait of lonely people at the crossroads.", "critic": {"meter": 90, "numReviews": 153, "rating": 7.6}, "dvd": 1177372800000, "fresh": 138, "lastUpdated": 1440355016000, "production": "ThinkFilm", "rotten": 15, "viewer": {"meter": 83, "numReviews": 55562, "rating": 3.8}, "website": "http://www.halfnelsonthefilm.com"}, "type": "movie", "writers": ["Ryan Fleck", "Anna Boden"], "year": 2006}