{"_id": "573a13c1f29313caabd643b2", "awards": {"nominations": 2, "text": "2 nominations.", "wins": 0}, "cast": ["Chris Pine", "Keira Knightley", "Kevin Costner", "Kenneth Branagh"], "countries": ["USA", "Russia"], "directors": ["Kenneth Branagh"], "fullplot": "This new version of the saga of CIA analyst Jack Ryan begins as Jack attends the London School of Economics. 9/11 happens. He subsequently enlists in the Marines, sustaining severe injuries when the chopper deploying him to Afghanistan is shot down. While in intense rehab, he grabs the attention of Harper, a man who works for the CIA and who would like Jack to finish his studies, get a job on Wall Street, and seek out terrorist plots through their financial transactions. Ten years pass. Jack finds anomalies in the accounts of a Russian named Cherevin and thinks he should go to Russia to check out what's going on. He's told not to tell anyone who he is, including his girlfriend Cathy, which makes her doubt him when she catches him in some lies. In Russia, Cherevin assigns someone to assist Jack, but when the two are alone, the man tries to kill Jack instead, so Jack kills him. Obviously, Cherevin is hiding something. Jack goes to meet him and says he'll bring his fiancèe along, but when Cathy shows up, Jack has to tell her the truth. Harper says Cathy has to go with Jack when she meets Cherevin. Jack doesn't want her to but Cathy says she's going, so the action begins that leads to the climax.", "genres": ["Action", "Thriller"], "imdb": {"id": 1205537, "rating": 6.2, "votes": 89990}, "languages": ["English", "Russian"], "lastupdated": "2015-09-10 18:00:36.947000000", "metacritic": 57, "num_mflix_comments": 1, "plot": "Jack Ryan, as a young covert CIA analyst, uncovers a Russian plot to crash the U.S. economy with a terrorist attack.", "poster": "https://m.media-amazon.com/images/M/MV5BMTY2MDkxNzYwNl5BMl5BanBnXkFtZTgwOTM2MjE5MDE@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1389916800000, "runtime": 105, "title": "Jack Ryan: Shadow Recruit", "tomatoes": {"boxOffice": "$50.5M", "consensus": "It doesn't reinvent the action-thriller wheel, but Jack Ryan: Shadow Recruit offers a sleek, reasonably diverting reboot for a long-dormant franchise.", "critic": {"meter": 56, "numReviews": 160, "rating": 5.7}, "dvd": 1402358400000, "fresh": 90, "lastUpdated": 1440959502000, "production": "Paramount Pictures", "rotten": 70, "viewer": {"meter": 53, "numReviews": 64113, "rating": 3.4}, "website": "http://www.ShadowRecruitMovie.com"}, "type": "movie", "writers": ["Adam Cozad", "David Koepp", "Tom Clancy (based on characters created by)"], "year": 2014}