{"_id": "573a13acf29313caabd26aa9", "awards": {"nominations": 2, "text": "2 nominations.", "wins": 0}, "cast": ["Bernard Campan", "Gèrard Darmon", "Jean-Pierre Darroussin", "Marc Lavoine"], "countries": ["France"], "directors": ["Marc Esposito"], "fullplot": "The life of four best friends in Paris: Antoine (a gym school teacher), Jeff (director of a monthly journal), Alex (Jeff's associate in the monthly journal and a Don Juan) and Manu (owner of fine food store). Their time is shared between their respective jobs, their relationship with women (their own and others...) and the times they meet together to discuss about life and play sport lottery. Several events happen that immediately change their routine : the death of Manu's father, the break up of Antoine's couple when he learns that his wife once cheating on him, and the wedding of Jeff's daughter. Soon, Manu meets a charming and magical young lady (Juliette). Jeff thinks he is at a turning point in his life and decides to retire, to be friends with his ex-wife (whom he hardly spoke to) and to go to the South of France to live in the sun with his girlfriend. Despite all the hard times they have in their lives, the four friends managed to support each other and keep their friendship running.", "genres": ["Comedy", "Drama", "Romance"], "imdb": {"id": 349225, "rating": 6.5, "votes": 1365}, "languages": ["French"], "lastupdated": "2015-09-14 09:24:14.490000000", "num_mflix_comments": 3, "plot": "The life of four best friends in Paris: Antoine (a gym school teacher), Jeff (director of a monthly journal), Alex (Jeff's associate in the monthly journal and a Don Juan) and Manu (owner ...", "poster": "https://m.media-amazon.com/images/M/MV5BMjA0NTQ2MzM4M15BMl5BanBnXkFtZTgwNjU4OTk1MDE@._V1_SY1000_SX677_AL_.jpg", "released": 1049241600000, "runtime": 100, "title": "Le coeur des hommes", "tomatoes": {"dvd": 1209600000000, "lastUpdated": 1440439236000, "viewer": {"meter": 82, "numReviews": 3563, "rating": 3.9}}, "type": "movie", "writers": ["Marc Esposito"], "year": 2003}