{"_id": "573a13cef29313caabd870a2", "awards": {"nominations": 6, "text": "3 wins & 6 nominations.", "wins": 3}, "cast": ["Julianne Hough", "Irene Ziegler", "Jon Kohler", "Tim Parati"], "countries": ["USA"], "directors": ["Lasse Hallstrèm"], "fullplot": "When a mysterious young woman named Katie appears in the small North Carolina town of Southport, her sudden arrival raises questions about her past. Beautiful yet self-effacing, Katie seems determined to avoid forming personal ties until a series of events draws her into two reluctant relationships: one with Alex, a widowed store owner with a kind heart and two young children; and another with her plainspoken single neighbor, Jo. Despite her reservations, Katie slowly begins to let down her guard, putting down roots in the close-knit community and becoming increasingly attached to Alex and his family. But even as Katie begins to fall in love, she struggles with the dark secret that still haunts and terrifies her . . . a past that set her on a fearful, shattering journey across the country, to the sheltered oasis of Southport. With Jo's empathic and stubborn support, Katie eventually realizes that she must choose between a life of transient safety and one of riskier rewards . . . and that in the darkest hour, love is the only true safe haven.", "genres": ["Drama", "Romance", "Thriller"], "imdb": {"id": 1702439, "rating": 6.7, "votes": 66740}, "languages": ["English", "Portuguese"], "lastupdated": "2015-08-24 00:09:12.307000000", "metacritic": 34, "num_mflix_comments": 1, "plot": "A young woman with a mysterious past lands in Southport, North Carolina where her bond with a widower forces her to confront the dark secret that haunts her.", "poster": "https://m.media-amazon.com/images/M/MV5BMTg4MzcxODA3OV5BMl5BanBnXkFtZTcwMTYzNDkwOQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1360800000000, "runtime": 115, "title": "Safe Haven", "tomatoes": {"boxOffice": "$71.3M", "consensus": "Schmaltzy, predictable, and melodramatic, Safe Haven also suffers from a ludicrous plot twist, making for a particularly ignominious Nicholas Sparks adaptation.", "critic": {"meter": 12, "numReviews": 139, "rating": 4}, "dvd": 1367884800000, "fresh": 17, "lastUpdated": 1441907894000, "production": "Relativity Media", "rotten": 122, "viewer": {"meter": 67, "numReviews": 75492, "rating": 3.7}, "website": "http://Facebook.com/SafeHavenMovie"}, "type": "movie", "writers": ["Dana Stevens (screenplay)", "Gage Lansky (screenplay)", "Nicholas Sparks (based upon the novel by)"], "year": 2013}