{"_id": "573a13e0f29313caabdb9f80", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Tony Benn"], "countries": ["UK"], "directors": ["Skip Kite"], "fullplot": "Tony Benn (87), the longest serving Labour MP in history, is also, arguably, the most popular UK politician of all time. Across the globe and in particular over the last five years his brand of socialism has struck a cord with people of all ages and social backgrounds. For the first time ever through intimate, quasi confessional interviews and his personal, photographic and film archive 'Will And Testament' reveals a very human face behind the political mask. In this feature length film, Tony Benn also criss-crosses the UK bearing witness to major social and political upheavals and events. He hopes 'Will And Testament' will prove to be the defining documentary of the most globally and politically aware generation in a lifetime. This documentary is an exclusive and deeply personal look at the life of a national treasure, a frank, candid and sometimes painful exploration of the great themes of life that have affected him and affect us all, love, loss, hopes, dreams, fears and death. Never before has a person of his calibre and reputation spoken to camera in such a direct way.", "genres": ["Documentary"], "imdb": {"id": 2636424, "rating": 8.3, "votes": 54}, "languages": ["English"], "lastupdated": "2015-06-05 00:13:47.023000000", "num_mflix_comments": 3, "plot": "Tony Benn (87), the longest serving Labour MP in history, is also, arguably, the most popular UK politician of all time. Across the globe and in particular over the last five years his ...", "poster": "https://m.media-amazon.com/images/M/MV5BNzc1NjkwNzg2OF5BMl5BanBnXkFtZTgwMTcwOTAxMzE@._V1_SY1000_SX677_AL_.jpg", "released": 1403827200000, "runtime": 95, "title": "Tony Benn: Will and Testament", "tomatoes": {"critic": {"meter": 85, "numReviews": 13, "rating": 7.1}, "fresh": 11, "lastUpdated": 1437069916000, "rotten": 2, "viewer": {"numReviews": 29, "rating": 4.1}}, "type": "movie", "writers": ["Skip Kite"], "year": 2014}