{"_id": "573a1395f29313caabce1c0a", "awards": {"nominations": 4, "text": "Nominated for 2 Oscars. Another 7 wins & 4 nominations.", "wins": 9}, "cast": ["Frank Sinatra", "Laurence Harvey", "Janet Leigh", "Angela Lansbury"], "countries": ["USA"], "directors": ["John Frankenheimer"], "fullplot": "Major Ben Marco is an intelligence officer in the U.S. Army. He served valiantly as a captain in the Korean war and his Sergeant, Raymond Shaw, even won the Medal of Honor. Marco has a major problem however: he has a recurring nightmare, one where two members of his squad are killed by Shaw. He's put on indefinite sick leave and visits Shaw in New York. Shaw for his part has established himself well, despite the misgivings of his domineering mother, Mrs. Eleanor Shaw Iselin. She is a red-baiter, accusing anyone who disagrees with her right-wing reactionary views of being a Communist. Raymond hates her, not only for how she's treated him but equally because of his step-father, the ineffectual U.S. Senator John Iselin, who is intent on seeking higher office. When Marco learns that others in his Korean War unit have nightmares similar to his own, he realizes that something happened to all of them in Korea and that Raymond Shaw is the focal point.", "genres": ["Thriller"], "imdb": {"id": 56218, "rating": 8, "votes": 59152}, "languages": ["English"], "lastupdated": "2015-09-15 03:34:07.567000000", "metacritic": 94, "num_mflix_comments": 1, "plot": "A former Korean War POW is brainwashed by Communists into becoming a political assassin. But another former prisoner may know how to save him.", "poster": "https://m.media-amazon.com/images/M/MV5BOTY0ZTA1ZjUtN2MyNi00ZGRmLWExYmMtOTkyNzI1NGQ2Y2RlXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_SY1000_SX677_AL_.jpg", "rated": "APPROVED", "released": -226886400000, "runtime": 126, "title": "The Manchurian Candidate", "tomatoes": {"consensus": "A classic blend of satire and political thriller that was uncomfortably prescient in its own time, The Manchurian Candidate remains distressingly relevant today.", "critic": {"meter": 98, "numReviews": 51, "rating": 8.6}, "dvd": 989884800000, "fresh": 50, "lastUpdated": 1441046901000, "production": "MGM/UA Classics", "rotten": 1, "viewer": {"meter": 90, "numReviews": 30563, "rating": 3.9}, "website": "http://www.mgm.com/title_title.php?title_star=MANCHURI"}, "type": "movie", "writers": ["Richard Condon (based upon a novel by)", "George Axelrod (screenplay)"], "year": 1962}