{"_id": "573a13c3f29313caabd6ab08", "awards": {"nominations": 3, "text": "1 win & 3 nominations.", "wins": 1}, "cast": ["Jamey Sheridan", "Steve Buscemi", "Mariann Mayberry", "Aidan Quinn"], "countries": ["USA"], "directors": ["Bette Gordon"], "fullplot": "They call him \"Handsome\" Harry Sweeney. At 52, the Vietnam veteran has kept his rugged good looks. Everyone likes Harry, an electrician by trade who loves to sing but for some reason he never lets anyone get too close. He's been divorced for a long time, has a son whom he rarely sees, and, although he's engaged in a long-term flirtation with the waitress at the diner, seems destined to remain alone. One day, Harry gets a call from a former Navy buddy, Tom Kelly, whom he hasn't seen in some thirty years. On his deathbed and terrified of going to Hell, Kelly convinces Harry to seek forgiveness on his behalf from a comrade they betrayed long ago, David Kagan. At first, Harry wants nothing to do with Kelly, Kagan or the remnants of his murky past. But guilt and memories have a mysterious grasp on Harry, and he finally relents, driving down the East Coast to call on his old comrades. As he confronts the three other men involved in a long-ago crime, he observes how each man has dealt with his own guilt. The rugged Rheems hides behind righteous moral posturing and economic success. The intellectual Porter has divorced himself from the violent implications of his past in the military. Soft-spoken Gephardt has turned to Jesus. Though they've all grown older, it is unclear whether any of them have really found salvation. As the road stretches out before Harry, two mysteries gradually unfold: what really happened on that night thirty years ago, and the mystery of what it has meant to Harry and how it has shaped his life ever since. It is only through confronting the events of the distant past, and finally confronting David himself, that Harry can begin to truly live again.", "genres": ["Drama"], "imdb": {"id": 1318001, "rating": 6.5, "votes": 1802}, "languages": ["English"], "lastupdated": "2015-09-17 04:38:49.610000000", "metacritic": 59, "num_mflix_comments": 1, "plot": "An ex-Navy man carrying out the last wish of a dying shipmate renews contact with old friends to break the code of silence around a mysterious, long-buried crime.", "poster": "https://m.media-amazon.com/images/M/MV5BMjA2MDgzNjY5M15BMl5BanBnXkFtZTcwODI5NDQzMw@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1291593600000, "runtime": 94, "title": "Handsome Harry", "tomatoes": {"critic": {"meter": 78, "numReviews": 23, "rating": 6.7}, "dvd": 1293494400000, "fresh": 18, "lastUpdated": 1441134718000, "production": "Screen Media Ventures", "rotten": 5, "viewer": {"meter": 54, "numReviews": 379, "rating": 3.3}, "website": "http://www.handsomeharrythemovie.com/"}, "type": "movie", "writers": ["Nicholas T. Proferes"], "year": 2009}