{"_id": "573a13d8f29313caabda739d", "awards": {"nominations": 3, "text": "3 wins & 3 nominations.", "wins": 3}, "cast": ["Hiroaki Iwanaga", "Takahiro Sakurai", "Toa Yukinari", "Yuki Kaji"], "countries": ["Japan"], "directors": ["Toshiyuki Kubooka"], "fullplot": "This arc is a flashback showing Guts' youth and what led him to become the \"Black Swordsman\". Guts grows up as a young mercenary until his enrollment in the Band of the Hawk. He develops complex relationships with Casca and Griffith, the Band's charismatic leader and holder of the Crimson Behelit, who leads the Band to its rise to prominence within the Midland army. Griffith is elevated from his commoner status to the nobility, causing some resentment, and after sleeping with the King's daughter, Griffith is imprisoned, and the Hawks are declared outlaws. The Hawks manage to rescue Griffith, only to find him broken mentally and physically. From a conventional medieval European background, the story shifts to fantasy and horror, with the apparition of the Eclipse ceremony that ends with the destruction of the Band, as per Griffith's sacrifice in order to become Femto, the fifth member of the God Hand, and reclaim his path towards his dream. Only with help from the enigmatic Skull Knight, were Guts and Casca able to survive. Unbelievably distraught over what transpired, Guts vows vengeance against Griffith and commits to his own personal war against the entities known as Apostles that slaughtered the Band of the Hawk.", "genres": ["Animation", "Action", "Adventure"], "imdb": {"id": 2210479, "rating": 7.7, "votes": 4173}, "languages": ["Japanese", "English"], "lastupdated": "2015-09-12 00:01:43.527000000", "num_mflix_comments": 1, "plot": "He trusts no one, only his sword.", "poster": "https://m.media-amazon.com/images/M/MV5BYzA0ZGYxYzAtMmJlOC00OTFkLThhNmItYTdlMTdkNDY2NzQ4L2ltYWdlXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_SY1000_SX677_AL_.jpg", "released": 1335398400000, "runtime": 76, "title": "Berserk: The Golden Age Arc I - The Egg of the King", "tomatoes": {"dvd": 1353974400000, "lastUpdated": 1440267224000, "viewer": {"meter": 75, "numReviews": 201, "rating": 3.8}}, "type": "movie", "writers": ["Kentaro Miura (manga)", "Ichirè èkèchi (screenplay)"], "year": 2012}