{"_id": "573a13a1f29313caabd066cb", "awards": {"nominations": 5, "text": "Nominated for 2 Golden Globes. Another 7 wins & 5 nominations.", "wins": 9}, "cast": ["Sandra Bullock", "Michael Caine", "Benjamin Bratt", "Candice Bergen"], "countries": ["USA", "Australia"], "directors": ["Donald Petrie"], "fullplot": "Undercover FBI agent Gracie Hart shows no signs of having any femininity in her demeanor or appearance. Generally a bright and capable agent, she is in trouble at work when she makes an error in judgment in a case which results in a near disaster. As such, one of her by-the-books colleagues, Eric Matthews, who has never shown any inclination of thinking outside the box, is assigned to lead the high profile case of a terrorist coined The Citizen instead of her, while she is facing possible disciplinary action. Gracie pieces together the evidence to determine that The Citizen's next target will be the Miss United States beauty pageant. The pageant represents everything that Gracie abhors. Despite Gracie's mannish demeanor, Eric, with no other undercover female agent remotely fitting the demographic, assigns her to go undercover as a pageant contestant to see if she can flush out The Citizen, who is perhaps one of the other contestants. Although the pageant administration, led by former winner Cathy Morningside and long time host Stan Fields, provide the FBI with access to the pageant, Cathy in particular is less than thrilled to have a non-credible Gracie posing as a contestant which she feels will ruin the pageant. The FBI enlist the assistance of former pageant contestant coach Victor Melling, who is facing his own disgrace associated with the pageant, to do the near impossible task of transforming Gracie, not only into a woman, but a credible beauty pageant contestant. As Gracie proceeds in the transformation, she gets to know the other contestants, not only as potential criminals, but also as real people. She also discovers that another sinister element is present at the pageant. She will do whatever it takes to quash that element and protect her new friends, namely the other innocent contestants. But now displaying some femininity, Gracie begins to have more womanly feelings herself and in turn attracts the attention of men, one in particular about who she is happy.", "genres": ["Action", "Comedy", "Crime"], "imdb": {"id": 212346, "rating": 6.1, "votes": 124015}, "languages": ["English", "Russian", "French", "Hawaiian", "Spanish"], "lastupdated": "2015-08-26 00:50:59.400000000", "metacritic": 43, "num_mflix_comments": 393, "plot": "An FBI agent must go undercover in the Miss United States beauty pageant to prevent a group from bombing the event.", "poster": "https://m.media-amazon.com/images/M/MV5BZDhjNzc4N2MtNWE5ZC00N2M4LWFiYjEtMTE5YmYyMTg3OGY5XkEyXkFqcGdeQXVyMTkzODUwNzk@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 977443200000, "runtime": 109, "title": "Miss Congeniality", "tomatoes": {"boxOffice": "$105.5M", "consensus": "Though critics say Bullock is funny and charming, she can't overcome a bad script that makes the movie feel too much like a fluffy, unoriginal sitcom.", "critic": {"meter": 42, "numReviews": 115, "rating": 5.1}, "dvd": 988675200000, "fresh": 48, "lastUpdated": 1442511386000, "production": "Warner Bros. Pictures", "rotten": 67, "viewer": {"meter": 69, "numReviews": 974617, "rating": 3.2}, "website": "http://www.misscongeniality.net"}, "type": "movie", "writers": ["Marc Lawrence", "Katie Ford", "Caryn Lucas"], "year": 2000}