{"_id": "573a13d6f29313caabd9f9bc", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Molly C. Quinn", "Michael Welch", "Lara Flynn Boyle", "Cary Elwes"], "countries": ["USA"], "directors": ["Duane Journey"], "fullplot": "The pothead Ashton Crawford and his girlfriend Gretel are smoking in her room special marijuana called Black Forest supplied by the drug dealer Manny and produced by an old lady named Agnes that lives in Pasadena. Gretel's brother Hansel arrives home and Gretel tells that she will bake gingerbread cookie while Ashton will go directly to Agnes to buy more Black Forest. However Agnes is a witch and captures Ash to eat his flesh and drain his youth to maintain youth. Gretel seeks her boyfriend out and suspects of Agnes, but the police officers Ritter and Hart do not give credit to her words since Ritter knows that Ash is a pothead. Meanwhile the gang that supplies weed to Manny learns that he is selling Black Forest to his costumers and they threaten him and their leader Jorge sends a message to Agnes through Manny. However, the drug dealer is turned into a zombie by Agnes and Jorge and his gang pay a visit to her and are also turned into zombies. Soon Gretel and Manny's girlfriend Bianca decide to break into Agnes' house and they learn that she is a powerful witch. Meanwhile Hansel goes to Agnes's house to look for his sister.", "genres": ["Comedy", "Horror"], "imdb": {"id": 2081194, "rating": 4.3, "votes": 2519}, "languages": ["English"], "lastupdated": "2015-08-15 00:08:06.817000000", "num_mflix_comments": 1, "plot": "A brother and sister battle a witch who lures teenagers into her suburban home with her special blend of marijuana where she then proceeds to kill and eat them to maintain her youth and beauty.", "poster": "https://m.media-amazon.com/images/M/MV5BMTYxNjU0OTkyOV5BMl5BanBnXkFtZTcwODYwMTEwOQ@@._V1_SY1000_SX677_AL_.jpg", "released": 1361232000000, "runtime": 86, "title": "Hansel & Gretel Get Baked", "tomatoes": {"dvd": 1374624000000, "lastUpdated": 1440442600000, "production": "Tribeca Films", "viewer": {"meter": 33, "numReviews": 302, "rating": 2.6}, "website": "http://www.hg420movie.com/"}, "type": "movie", "writers": ["David Tillman"], "year": 2013}