{"_id": "573a13b3f29313caabd3c729", "awards": {"nominations": 2, "text": "Nominated for 1 Oscar. Another 2 wins & 2 nominations.", "wins": 3}, "countries": ["Poland"], "directors": ["Andrzej Celinski", "Hanna Polak"], "fullplot": "Since the fall of the Iron Curtain an estimated four million children have found themselves living on the streets in the former countries of the Soviet Union. In the streets of Moscow alone there are over 30,000 surviving in this manner at the present time. The makers of the documentary film concentrated on a community of homeless children living hand to mouth in the Moscow train station Leningradsky. Eight-year-old Sasha, eleven-year-old Kristina, thirteen-year-old Misha and ten-year-old Andrej all dream of living in a communal home. They spend winter nights trying to stay warm by huddling together on hot water pipes and most of their days are spent begging. Andrej has found himself here because of disagreements with his family. Kristina was driven into this way of life by the hatred of her stepmother and twelve-year-old Roma by the regular beatings he received from his constantly drunk father. \"When it is worst, we try to make money for food by prostitution,\" admits thirteen-year-old Artur. The pair of Polish filmmakers in this raw and very effective documentary even succeeded in filming an incident where the police patrol beat one of the street children and smear an entire tube of glue into his hair and onto his face. It is precisely this sniffing of the glue fumes that gives these children the possibility to at least for a little while escape the unforgiving world around them. It is a life of fleeting possibilities and danger.", "genres": ["Short", "Documentary"], "imdb": {"id": 442947, "rating": 8, "votes": 423}, "languages": ["Russian"], "lastupdated": "2015-05-15 06:20:56.830000000", "num_mflix_comments": 2, "plot": "AIDS, drug abuse, police brutality, and other social ills in post-Soviet Russia.", "released": 1106265600000, "runtime": 35, "title": "The Children of Leningradsky", "tomatoes": {"lastUpdated": 1436898998000, "viewer": {"meter": 89, "numReviews": 135, "rating": 4}}, "type": "movie", "year": 2005}