{"_id": "573a13cef29313caabd87099", "awards": {"nominations": 2, "text": "2 nominations.", "wins": 0}, "countries": ["Netherlands", "Germany", "Ireland", "Belgium"], "directors": ["Tommy Pallotta", "Femke Wolting"], "fullplot": "LAST HIJACK is a true tale of survival in Somalia told from the pirate's perspective. Combining animation with documentary storytelling, the film takes an innovative hybrid approach to explore how one Somali pirate - Mohamed - came to live such a brutal and dangerous existence. Animated re-enactments exploring Mohamed's memories, dreams and fears from his point of view are juxtaposed with raw footage from his everyday life in an original non-fiction narrative. Somalia is the worldwide capital of piracy, and Mohamed is one of Somalia's most experienced pirates. But in his homeland, a failed state, Mohamed is just another middle-aged man trying to make ends meet. Far removed from the glamour and adventure of the pirates of books and movies, Somali pirates face increasing scrutiny and stigmatization both at home and abroad. Now Mohamed is engaged and both his parents and his in-laws pressure him to change his ways before the big wedding day. Mohamed senses that the golden age of piracy may be coming to an end, and with pressure mounting to provide for his loved ones, he must decide whether to risk everything for one last hijack.", "genres": ["Documentary", "Animation"], "imdb": {"id": 1702437, "rating": 6.2, "votes": 96}, "languages": ["Somali"], "lastupdated": "2015-09-12 00:39:24.273000000", "metacritic": 61, "plot": "LAST HIJACK is a true tale of survival in Somalia told from the pirate's perspective. Combining animation with documentary storytelling, the film takes an innovative hybrid approach to ...", "poster": "https://m.media-amazon.com/images/M/MV5BOTcwODgyNzc1OV5BMl5BanBnXkFtZTgwMTkyOTcxMTE@._V1_SY1000_SX677_AL_.jpg", "released": 1398297600000, "runtime": 83, "title": "Last Hijack", "tomatoes": {"critic": {"meter": 92, "numReviews": 13, "rating": 7.1}, "dvd": 1431907200000, "fresh": 12, "lastUpdated": 1438197927000, "production": "FilmBuff", "rotten": 1, "viewer": {"meter": 58, "numReviews": 156, "rating": 2.8}, "website": "http://www.lasthijack.com"}, "type": "movie", "writers": ["Tommy Pallotta", "Femke Wolting"], "year": 2014}