{"_id": "573a1394f29313caabce0ca9", "awards": {"nominations": 1, "text": "Nominated for 5 Oscars. Another 7 wins & 1 nomination.", "wins": 12}, "cast": ["Frank Sinatra", "Dean Martin", "Shirley MacLaine", "Martha Hyer"], "countries": ["USA"], "directors": ["Vincente Minnelli"], "fullplot": "In the post-war, the alcoholic and bitter veteran military and former writer Dave Hirsch returns from Chicago to his hometown Parkman, Indiana. He is followed by Ginnie Moorehead, a vulgar and easy woman with whom he spent his last night in Chicago that has fallen in love with him. The resentful Dave meets his older brother Frank Hirsh, who owns a jewelry store and is a prominent citizen of Parkman that invites him to have dinner with his family. Dave meets his sister-in-law Agnes that hates him since one character of his novel had been visibly inspired on her, and his teenage niece Dawn. Frank introduces the school teacher Gwen French to him and Dave feels attracted by the beautiful woman that is daughter of his former Professor Robert Haven French and idolizes his work as writer. However, his unrequited love with Gwen drives Dave back to the local bar where he befriends the professional gambler Bama Dillert and meets Ginnie again with the Chicago's mobster Raymond Lanchak that was her former lover and has followed her from Chicago. The unconditional love of Ginnie for Dave leads to a tragedy in the calm Parkman.", "genres": ["Drama", "Romance"], "imdb": {"id": 52218, "rating": 7.5, "votes": 3742}, "languages": ["English"], "lastupdated": "2015-08-19 00:33:02.313000000", "num_mflix_comments": 1, "plot": "In the post-war, the alcoholic and bitter veteran military and former writer Dave Hirsch returns from Chicago to his hometown Parkman, Indiana. He is followed by Ginnie Moorehead, a vulgar ...", "poster": "https://m.media-amazon.com/images/M/MV5BNjc4ZTNhY2EtZWFmNi00MzBjLThiNGYtOGFmNmQyMjYxMDJmXkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "APPROVED", "released": -348364800000, "runtime": 137, "title": "Some Came Running", "tomatoes": {"critic": {"meter": 80, "numReviews": 10, "rating": 7.4}, "dvd": 1210636800000, "fresh": 8, "lastUpdated": 1441910890000, "production": "MGM Home Entertainment", "rotten": 2, "viewer": {"meter": 78, "numReviews": 806, "rating": 3.9}}, "type": "movie", "writers": ["James Jones (novel)", "John Patrick", "Arthur Sheekman"], "year": 1958}