{"_id": "573a13b3f29313caabd3e55d", "awards": {"nominations": 0, "text": "Nominated for 1 Golden Globe. Another 1 win.", "wins": 2}, "cast": ["Takuya Shimada", "Brian Blessed", "Richard Clifford", "Bryce Dallas Howard"], "countries": ["USA", "UK"], "directors": ["Kenneth Branagh"], "fullplot": "Rosalind, the daughter of Duke Senior (the banished duke), is raised at the court of Duke Frederick (who is younger brother to Duke Senior and took over his dukedom), with her cousin Celia (daughter to Duke Frederick). She falls in love with a young man named Orlando, but before she can even think twice about it, she is banished by Duke Frederick, who threatens death if she comes near the court again. Celia, being Rosalind's best friend, goes with Rosalind (who is disguised as a boy, Ganymede) and Touchstone, the court's fool, to the forest of Arden. Upon their arrival in the forest, they happen upon Orlando and his manservant, who are fleeing the wrath of Orlando's eldest brother. What follows is an elaborate scheme devised by the cross-dressing Rosalind to find out the verity of Orlando's supposed passion for her, and to further capture his heart, through the witty and mischievous faèade of Ganymede.", "genres": ["Drama", "Comedy", "Romance"], "imdb": {"id": 450972, "rating": 6.3, "votes": 2325}, "languages": ["English"], "lastupdated": "2015-08-15 00:34:57.223000000", "plot": "Rosalind, the daughter of Duke Senior (the banished duke), is raised at the court of Duke Frederick (who is younger brother to Duke Senior and took over his dukedom), with her cousin Celia ...", "poster": "https://m.media-amazon.com/images/M/MV5BMjA1MDk4MDIxNV5BMl5BanBnXkFtZTcwMzgzNzE1MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 1190332800000, "runtime": 127, "title": "As You Like It", "tomatoes": {"critic": {"meter": 36, "numReviews": 14, "rating": 4.7}, "dvd": 1190678400000, "fresh": 5, "lastUpdated": 1441221751000, "production": "Picturehouse", "rotten": 9, "viewer": {"meter": 49, "numReviews": 5232, "rating": 3.1}}, "type": "movie", "writers": ["Kenneth Branagh (adaptation)", "William Shakespeare (play)"], "year": 2006}