{"_id": "573a13d9f29313caabdaa145", "awards": {"nominations": 27, "text": "Nominated for 1 BAFTA Film Award. Another 26 wins & 27 nominations.", "wins": 27}, "cast": ["Reem Abdullah", "Waad Mohammed", "Abdullrahman Al Gohani", "Ahd"], "countries": ["Saudi Arabia", "Germany", "USA", "United Arab Emirates", "Jordan", "Netherlands"], "directors": ["Haifaa Al-Mansour"], "fullplot": "WADJDA is a 10-year-old girl living in a suburb of Riyadh, the capital of Saudi Arabia. Although she lives in a conservative world, Wadjda is fun loving, entrepreneurial and always pushing the boundaries of what she can get away with. After a fight with her friend Abdullah, a neighborhood boy she shouldn't be playing with, Wadjda sees a beautiful green bicycle for sale. She wants the bicycle desperately so that she can beat Abdullah in a race. But Wadjda's mother won't allow it, fearing repercussions from a society that sees bicycles as dangerous to a girl's virtue. So Wadjda decides to try and raise the money herself. At first, Wadjda's mother is too preoccupied with convincing her husband not to take a second wife to realize what's going on. And soon enough Wadjda's plans are thwarted when she is caught running various schemes at school. Just as she is losing hope of raising enough money, she hears of a cash prize for a Koran recitation competition at her school. She devotes herself to the memorization and recitation of Koranic verses, and her teachers begin to see Wadjda as a model pious girl. The competition isn't going to be easy, especially for a troublemaker like Wadjda, but she refuses to give in. She is determined to continue fighting for her dreams...", "genres": ["Comedy", "Drama"], "imdb": {"id": 2258858, "rating": 7.6, "votes": 11668}, "languages": ["Arabic"], "lastupdated": "2015-09-06 00:10:51.697000000", "metacritic": 81, "plot": "An enterprising Saudi girl signs on for her school's Koran recitation competition as a way to raise the remaining funds she needs in order to buy the green bicycle that has captured her interest.", "poster": "https://m.media-amazon.com/images/M/MV5BMjI4MzMyNzM2Ml5BMl5BanBnXkFtZTgwNDQ5MDgwMDE@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 1368662400000, "runtime": 98, "title": "Wadjda", "tomatoes": {"consensus": "Transgressive in the best possible way, Wadjda presents a startlingly assured new voice from a corner of the globe where cinema has been all but silenced.", "critic": {"meter": 99, "numReviews": 102, "rating": 8}, "dvd": 1392076800000, "fresh": 101, "lastUpdated": 1441992614000, "production": "Sony Pictures Classics", "rotten": 1, "viewer": {"meter": 89, "numReviews": 13044, "rating": 4.1}, "website": "http://www.sonyclassics.com/wadjda/"}, "type": "movie", "writers": ["Haifaa Al-Mansour"], "year": 2012}