{"_id": "573a13aaf29313caabd23635", "awards": {"nominations": 18, "text": "Nominated for 3 Oscars. Another 23 wins & 18 nominations.", "wins": 26}, "cast": ["Jim Caviezel", "Maia Morgenstern", "Christo Jivkov", "Francesco De Vito"], "countries": ["USA"], "directors": ["Mel Gibson"], "fullplot": "A depiction of the last twelve hours in the life of Jesus of Nazareth, on the day of his crucifixion in Jerusalem. The story opens in the Garden of Olives where Jesus has gone to pray after the Last Supper. Betrayed by Judas Iscariot, the controversial Jesus--who has performed 'miracles' and has publicly announced that he is 'the Son of God'--is arrested and taken back within the city walls of Jerusalem. There, the leaders of the Pharisees confront him with accusations of blasphemy; subsequently, his trial results with the leaders condemning him to his death. Jesus is brought before Pontius Pilate, the Roman Governor of Palestine, for his sentencing. Pilate listens to the accusations leveled at Jesus by the Pharisees. Realizing that his own decision will cause him to become embroiled in a political conflict, Pilate defers to King Herod in deciding the matter of how to persecute Jesus. However, Herod returns Jesus to Pilate who, in turn, gives the crowd a choice between which prisoner they would rather to see set free--Jesus, or Barrabas. The crowd chooses to have Barrabas set free. Thus, Jesus is handed over to the Roman soldiers and is brutally flagellated. Bloody and unrecognizable, he is brought back before Pilate who, once again, presents him to the thirsty crowd--assuming they will see that Jesus has been punished enough. The crowd, however, is not satisfied. Thus, Pilate washes his hands of the entire dilemma, ordering his men to do as the crowd wishes. Whipped and weakened, Jesus is presented with the cross and is ordered to carry it through the streets of Jerusalem, all the way up to Golgotha. There, more corporal cruelty takes place as Jesus is nailed to the cross--suffering, he hangs there, left to die. Initially, in his dazed suffering, Jesus is alarmed that he has been abandoned by God his father. He then beseeches God. At the moment of his death, nature itself over-turns.", "genres": ["Drama"], "imdb": {"id": 335345, "rating": 7.1, "votes": 169735}, "languages": ["Aramaic", "Latin", "Hebrew"], "lastupdated": "2015-09-06 00:20:06.603000000", "metacritic": 47, "num_mflix_comments": 2, "plot": "Depicts the final twelve hours in the life of Jesus of Nazareth, on the day of his crucifixion in Jerusalem.", "poster": "https://m.media-amazon.com/images/M/MV5BNDY1N2IyYWMtZTY4OS00OGM1LTkxNmUtOTQzYmM5MmI2YmVmXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1077667200000, "runtime": 127, "title": "The Passion of the Christ", "tomatoes": {"boxOffice": "$370.2M", "consensus": "The graphic details of Jesus' torture make the movie tough to sit through and obscure whatever message it is trying to convey.", "critic": {"meter": 49, "numReviews": 267, "rating": 5.9}, "dvd": 1093910400000, "fresh": 131, "lastUpdated": 1442264881000, "production": "Newmarket Film Group", "rotten": 136, "viewer": {"meter": 80, "numReviews": 368076, "rating": 3.7}, "website": "http://www.thepassionofthechrist.com/skip.html"}, "type": "movie", "writers": ["Benedict Fitzgerald (screenplay)", "Mel Gibson (screenplay)"], "year": 2004}