{"_id": "573a139df29313caabcfb913", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Philip Williams", "Wayne Robson", "Ellen-Ray Hennessy", "Kristin Fairlie"], "countries": ["Canada", "France", "Germany"], "directors": ["Raymond Jafelice"], "fullplot": "Babar is a young elephant in the great forest. Whilst out with his mother a hunter kills his mother and he flees to escape the same fate. He eventually finds himself in a human city and experiences the many differences between city and forest life. Generally treated as an outsider he is taken in by an elderly woman, dressed in fancy suits, taught to write and count and is brought up in human culture. Later in life his friends Celeste and Arthur stumble into the city and find him - previously assuming he was also killed by the hunter. Babar dresses them and treats them to the comforts of his world until more elephants arrive to bring them back. The three elephants return by car to the great forest. Soon after Arthur sparks a war with the neighbouring Rhino tribe but peace is formed due to quick thinking by Babar. After this Babar is crowned king with Celeste his Queen. Due to his human upbringing Babar decides to alter the elephant society and builds a city and kits every elephant out in human clothing, every elephant is assigned tasks and everyone has his place. But with human culture comes problems associated with modern living. How will Babar cope with the onset of misfortune?", "genres": ["Family", "Animation"], "imdb": {"id": 166090, "rating": 5.9, "votes": 315}, "languages": ["English", "French"], "lastupdated": "2015-09-12 00:33:14.433000000", "num_mflix_comments": 1, "plot": "Babar is a young elephant in the great forest. Whilst out with his mother a hunter kills his mother and he flees to escape the same fate. He eventually finds himself in a human city and ...", "poster": "https://m.media-amazon.com/images/M/MV5BNzI5Njc2NDUxNV5BMl5BanBnXkFtZTcwNzI5NDEzMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "G", "released": 919987200000, "runtime": 80, "title": "Babar: King of the Elephants", "tomatoes": {"dvd": 945734400000, "lastUpdated": 1441303486000, "production": "HBO Video", "viewer": {"meter": 53, "numReviews": 11101, "rating": 3}}, "type": "movie", "writers": ["Jean de Brunhoff (based on the books by)", "Laurent de Brunhoff (based on the books by)", "Raymond Jafelice (screenplay)", "Peter Sauder (screenplay)"], "year": 1999}