{"_id": "573a13cbf29313caabd80f61", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Luke de Lacey", "Holly Lucas", "Siubhan Harrison", "James Oliver Wheatley"], "countries": ["UK"], "directors": ["Sean Hogan", "Andrew Parkinson", "Simon Rumley"], "fullplot": "\"Little Deaths\" is composed by three segments with short stories of sex, violence, death and revenge in England. 1st segment: \"House & Home\" Richard Gull and his wife Victoria Gull claim that are good Samaritans and invite the starving homeless Sorrow to have a bath and dinner with them at home. However they spike the wine and when Sorrow wakes up, she is tied naked on a bed in the basement. Richard abuses of her and Victoria stays with Sorrow humiliating her while he has a shower. He hears a scream and when he arrives in the basement, he has a gruesome surprise. 2nd segment: \"Mutant Tool\" The former addicted prostitute Jen lives with her former pimp and drug dealer Frank, who also abducts persons to steal their kidneys to deliver to Dr. Reese. Jen gives her best efforts to stay clean and refuses to meet clients from the former \"agency\" where she worked. When Frank asks her to go to Dr. Reese, he gives some tablets for her. Jen has headaches and nightmares and she returns to Dr. Reese, but soon she discovers the truth about the tablets that Dr. Reese gave to her. 3rd segment: \"Bitch\" The receptionist Claire is addicted in kinky sex with her mate Pete. She has a phobia with dogs and can only satisfy herself with twisted sex. Pete asks her to have normal sex but she invites him to have a threesome with their friend Al. Pete does not accept and she has sex with Al anyway. Pete plots revenge against his beloved woman.", "genres": ["Horror"], "imdb": {"id": 1614456, "rating": 4.7, "votes": 2303}, "languages": ["English"], "lastupdated": "2015-08-16 00:23:18.120000000", "num_mflix_comments": 1, "plot": "Composed of three disturbingly sensual and terrifying short narratives, unified by the twin themes of sex and death.", "poster": "https://m.media-amazon.com/images/M/MV5BMTY1OTcxMzc1MF5BMl5BanBnXkFtZTcwMzAyMDMzNA@@._V1_SY1000_SX677_AL_.jpg", "released": 1299801600000, "runtime": 94, "title": "Little Deaths", "type": "movie", "writers": ["Sean Hogan", "Andrew Parkinson", "Simon Rumley"], "year": 2011}