{"_id": "573a139af29313caabcef069", "awards": {"nominations": 12, "text": "Nominated for 1 Oscar. Another 8 wins & 12 nominations.", "wins": 9}, "cast": ["Clint Eastwood", "Meryl Streep", "Annie Corley", "Victor Slezak"], "countries": ["USA"], "directors": ["Clint Eastwood"], "fullplot": "The path of Francesca Johnson's future seems destined when an unexpected fork in the road causes her to question everything she had come to expect from life. While her husband and children are away at the Illinois state fair in the summer of 1965, Robert Kincaid happens turn into the Johnson farm and asks Francesca for directions to Roseman Bridge. Francesca later learns that he was in Iowa on assignment from National Geographic magazine. She is reluctant seeing that he's a complete stranger and then she agrees to show him to the bridges and gradually she talks about her life from being a war-bride from Italy which sets the pace for this bittersweet and all-too-brief romance of her life. Through the pain of separation from her secret love and the stark isolation she feels as the details of her life consume her, she writes her thoughts of the four-day love affair which took up three journals. The journals are found by her children after the lawyer was going over Francesca's will and all the contents which produces a key to her hope chest in the bedroom which contained some of hers and Robert's things. The message they take from the diaries is to what you what you have to do to be happy in life. After learning that Robert Kincaid's cremated remains were scattered off Roseman Bridge and that their mother requested that she too be cremated and her ashes to be scattered off Roseman Bridge, the children must decide whether to honor their mother's final wishes or bury her alongside their father as the family had planned. Adapted from the novel by Robert James Waller, this is the story of a special love that happens just once in a lifetime -- if you're lucky.", "genres": ["Drama", "Romance"], "imdb": {"id": 112579, "rating": 7.5, "votes": 50897}, "languages": ["English"], "lastupdated": "2015-09-12 00:32:44.390000000", "metacritic": 66, "plot": "Photographer Robert Kincaid wanders into the life of housewife Francesca Johnson, for four days in the 1960s.", "poster": "https://m.media-amazon.com/images/M/MV5BOTczNjIwMDM0MF5BMl5BanBnXkFtZTgwNzEzNTU1NTM@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 802051200000, "runtime": 135, "title": "The Bridges of Madison County", "tomatoes": {"consensus": "Sentimental, slow, schmaltzy, and very satisfying, The Bridges of Madison County finds Clint Eastwood adapting a bestseller with heft, wit, and grace.", "critic": {"meter": 89, "numReviews": 57, "rating": 7.4}, "dvd": 875145600000, "fresh": 51, "lastUpdated": 1442338519000, "production": "Warner Bros.", "rotten": 6, "viewer": {"meter": 87, "numReviews": 47626, "rating": 3.6}}, "type": "movie", "writers": ["Richard LaGravenese (screenplay)", "Robert James Waller (novel)"], "year": 1995}