{"_id": "573a13a0f29313caabd04c9c", "awards": {"nominations": 2, "text": "2 nominations.", "wins": 0}, "cast": ["Richard Gere", "Helen Hunt", "Farrah Fawcett", "Laura Dern"], "countries": ["USA", "Germany"], "directors": ["Robert Altman"], "fullplot": "Dr. Sullivan Travis \"Dr. T.\" is a wealthy Dallas gynecologist for some of the wealthiest women in Texas who finds his idealist life beginning to fall apart starting when his wife, Kate, suffers a nervous breakdown and is committed to the state mental hospital. Dr. T's eldest daughter, Dee Dee, is planning to go through with her approaching wedding despite the secret that she's a lesbian and is romantically involved with Marilyn, the maid of honor. Dr T's youngest daughter, Connie, is a conspiracy theorist freak who has her own agenda to everything, while Dr. T's loyal secretary, Carolyn, has romantic feelings for him, which are not mutual. Dr. T's sister-in-law, Peggy, meddles in every situation she stumbles into, while one woman, Bree, a golf instructor, is the only one who offers him any comfort and salvation.", "genres": ["Comedy", "Drama", "Romance"], "imdb": {"id": 205271, "rating": 4.6, "votes": 15100}, "languages": ["English", "German", "Spanish"], "lastupdated": "2015-09-11 00:26:48.447000000", "metacritic": 64, "num_mflix_comments": 1, "plot": "Dr. Sullivan Travis \"Dr. T.\" is a wealthy Dallas gynecologist for some of the wealthiest women in Texas who finds his idealist life beginning to fall apart starting when his wife, Kate, ...", "poster": "https://m.media-amazon.com/images/M/MV5BYTllODYwZjktZDEzYi00ZDZkLWFjZWMtMGVkYzc4NTczNzI0XkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 971395200000, "runtime": 122, "title": "Dr. T and the Women", "tomatoes": {"boxOffice": "$12.1M", "consensus": "In terms of quality, Dr. T and the Women is one of Altman's good-but-not-great films. In typical Altman style, it features some great ensemble acting, including a wonderful performance by Richard Gere.", "critic": {"meter": 57, "numReviews": 107, "rating": 5.7}, "dvd": 1003795200000, "fresh": 61, "lastUpdated": 1439921870000, "production": "Artisan Entertainment", "rotten": 46, "viewer": {"meter": 20, "numReviews": 15111, "rating": 2.3}, "website": "http://www.drtandthewomen.com"}, "type": "movie", "writers": ["Anne Rapp"], "year": 2000}