{"_id": "573a13b7f29313caabd4a6d1", "awards": {"nominations": 6, "text": "6 nominations.", "wins": 0}, "cast": ["Chris O'Neil", "Rhiannon Leigh Wryn", "Joely Richardson", "Timothy Hutton"], "countries": ["USA"], "directors": ["Robert Shaye"], "fullplot": "The siblings Noah and Emma travel with their mother Jo from Seattle to the family cottage in Whidbey Island to spend a couple of days while their workaholic father David Wilder is working. They find a box of toys from the future in the water and bring it home, and Emma finds a stuffed rabbit called Mimzy, and stones and a weird object, but they hide their findings from their parents. Mimzy talks telepathically to Emma and the siblings develop special abilities, increasing their intelligences to the level of genius. Their father becomes very proud when Noah presents a magnificent design in the fair of science and technology, and his teacher Larry White and his mystic wife Naomi Schwartz become interested in the boy when he draws a mandala. When Noah accidentally assembles the objects and activates a powerful generator creating a blackout in the state, the FBI arrests the family trying to disclose the mystery. But Emma unravels the importance to send Mimzy back to the future.", "genres": ["Family", "Sci-Fi"], "imdb": {"id": 768212, "rating": 6.3, "votes": 18038}, "languages": ["English", "Spanish"], "lastupdated": "2015-09-02 00:47:03.083000000", "metacritic": 59, "plot": "Two siblings begin to develop special talents after they find a mysterious box of toys. Soon the kids, their parents, and even their teacher are drawn into a strange new world and find a task ahead of them that is far more important than any of them could imagine!", "poster": "https://m.media-amazon.com/images/M/MV5BMTIwMTkzMDI1N15BMl5BanBnXkFtZTcwMzc1NzI0MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 1174608000000, "runtime": 90, "title": "The Last Mimzy", "tomatoes": {"boxOffice": "$21.4M", "consensus": "The Last Mimzy makes efforts to be a fun children's movie, but unsuccessfully juggles too many genres and subplots -- eventually settling as an unfocused, slightly dull affair.", "critic": {"meter": 53, "numReviews": 122, "rating": 5.8}, "dvd": 1184025600000, "fresh": 65, "lastUpdated": 1441135724000, "production": "New Line Cinema", "rotten": 57, "viewer": {"meter": 54, "numReviews": 258555, "rating": 3.1}, "website": "http://www.mimzy.com/"}, "type": "movie", "writers": ["Bruce Joel Rubin (screenplay)", "Toby Emmerich (screenplay)", "James V. Hart (screen story)", "Carol Skilken (screen story)", "Henry Kuttner (short story \"Mimsy Were the Borogoves\")", "C.L. Moore (short story \"Mimsy Were the Borogoves\")"], "year": 2007}