{"_id": "573a139af29313caabcefc21", "awards": {"nominations": 3, "text": "1 win & 3 nominations.", "wins": 1}, "cast": ["Matt Dillon", "Noah Emmerich", "Annabeth Gish", "Lauren Holly"], "countries": ["USA"], "directors": ["Ted Demme"], "fullplot": "New York based jazz pianist Willie Conway heads back to his small hometown of Knights Ridge, Massachusetts for a high school reunion. The trip is as much to go to the reunion and see his old friends - none of whom left Knights Ridge after graduation - as it is to get away from his current life, at which he is at a crossroads both personally and professionally. He is just eking out a living with his piano playing gigs, and as such he is thinking about taking a sales job. He's also not sure if he's ready to marry his long time girlfriend, lawyer Tracy Stover. Most of Willie's Knights Ridge blue collar friends' best days were in high school, they still having that \"trophy\" mentality of girlfriends and wives. Only Michael \"Mo\" Morris is happily married with a family. Paul Kirkwood, whose room is plastered with magazine pictures of models, wants his waitress ex-girlfriend Jan back only because he knows now that he can't have her. And Tommy \"Birdman\" Rowland, who was the big man in high school, is trying to end his affair with his now married high school girlfriend, Darian Smalls. Despite knowing about Darian, Tommy's current girlfriend, Sharon Cassidy, stands by her man through bad and worse. A cousin of their bar owning friend Stanley \"Stinky\" Womack, the beautiful Andera who is visiting from Chicago, may provide the voice of reason for this group of friends in dealing with their women problems. Some reason is what Willie may need in trying to figure out why he is attracted to Marty, his father's thirteen year old neighbor, especially as Willie learns that Tracy has decided to join him for the reunion.", "genres": ["Comedy", "Drama", "Romance"], "imdb": {"id": 115639, "rating": 7.2, "votes": 25263}, "languages": ["English"], "lastupdated": "2015-09-04 00:07:26.303000000", "metacritic": 64, "num_mflix_comments": 2, "plot": "A piano player at a crossroads in his life returns home to his friends and their own problems with life and love.", "poster": "https://m.media-amazon.com/images/M/MV5BOTQ4OTU0ODktY2E5YS00MGFhLTgwZTEtZWFkOGMxMmFmOTg0XkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 823824000000, "runtime": 112, "title": "Beautiful Girls", "tomatoes": {"consensus": "A warm, thoughtful dramedy about male insecurity, Beautiful Girls is buoyed by an excellent cast - particularly Natalie Portman in a stunning early role.", "critic": {"meter": 78, "numReviews": 46, "rating": 6.9}, "dvd": 986256000000, "fresh": 36, "lastUpdated": 1442431102000, "production": "Miramax Films", "rotten": 10, "viewer": {"meter": 81, "numReviews": 21769, "rating": 3.6}, "website": "http://www.miramax.com/movie/beautiful-girls"}, "type": "movie", "writers": ["Scott Rosenberg"], "year": 1996}