{"_id": "573a139ff29313caabd0192a", "awards": {"nominations": 8, "text": "Nominated for 1 Golden Globe. Another 2 wins & 8 nominations.", "wins": 3}, "cast": ["Juliette Binoche", "Daniel Auteuil", "Emir Kusturica", "Michel Duchaussoy"], "countries": ["France", "Canada"], "directors": ["Patrice Leconte"], "fullplot": "In 1849, in the Archipelago of Saint-Pierre et Miquelon, the drunken Ariel Neel Auguste and his partner Louis Ollivier kill for a futile motive (to see if he is fat or just big) the fishing boat captain Coupard. Nell, who stabbed the victim, is sentenced to die with his head severed in the guillotine while Louis is sentenced to hard labor. During the transportation to the prison under the custody of Captain Jean, there is an accident and Louis dies. While spending his days in the cell waiting for the guillotine and the executioner, Neel is invited by the captain's wife Mrs. Pauline to help her in her garden and becomes her protègè. Later he has a process of rehabilitation helping the locals in minor works and becomes very popular in the island. When he saves the building Cafè du Nord and her owner from sinking in the sea, his popularity increases and nobody but the governor and politicians of the council wants his death. Neel marries Eleontine Jeanne-Marie, but sooner he is informed that the ship Marie Galante has just left Martinique bringing a guillotine. Now the Governor and politicians need to find an executioner in the population to execute the sentence.", "genres": ["Drama", "Romance"], "imdb": {"id": 191636, "rating": 7.3, "votes": 4683}, "languages": ["French"], "lastupdated": "2015-08-21 00:08:55.187000000", "metacritic": 72, "num_mflix_comments": 2, "plot": "In a small French colony, a drunken man kills someone. While a guillotine is being shipped in, he changes, becoming a good and popular man.", "poster": "https://m.media-amazon.com/images/M/MV5BYzlhNjMzNDUtZWVmOS00NzE5LTkyOTYtZTdlNmRjOWU5Y2MyXkEyXkFqcGdeQXVyMTA0MjU0Ng@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 987120000000, "runtime": 112, "title": "The Widow of Saint-Pierre", "tomatoes": {"consensus": "Critics are impressed with The Widow of St. Pierre's intriguing story and beautiful cinematography.", "critic": {"meter": 88, "numReviews": 76, "rating": 7.2}, "dvd": 1000771200000, "fresh": 67, "lastUpdated": 1439925805000, "production": "Lions Gate Releasing", "rotten": 9, "viewer": {"meter": 76, "numReviews": 3292, "rating": 3.6}, "website": "http://www.laveuvedestpierre.com"}, "type": "movie", "writers": ["Claude Faraldo", "Patrice Leconte (adaptation)"], "year": 2000}