{"_id": "573a13ddf29313caabdb320f", "awards": {"nominations": 15, "text": "7 wins & 15 nominations.", "wins": 7}, "cast": ["Sandra Bullock", "Melissa McCarthy", "Demian Bichir", "Marlon Wayans"], "countries": ["USA"], "directors": ["Paul Feig"], "fullplot": "Sarah Ashburn, an FBI agent, is extremely ambitious and has her eye on a promotion, but she doesn't get along with her co-workers. She is sent to Boston to uncover the identity of an elusive drug lord, Mr. Larkin, by tracking down his proxy, Rojas, and is told that she'll have a good shot at the promotion if she finds Larkin. When she arrives in Boston, she learns that Larkin has been eliminating his competition and taking over their operations. She learns that Rojas is in Boston PD custody and goes to see him to ask him what he knows about Larkin, but is warned that the cop who arrested Rojas, Shannon Mullins, is very territorial, and she is not exactly sociable. When the two meet they don't get along. When Mullins learns why Ashburn is in Boston, she decides to find Larkin herself. Ashburn is told by her boss to work with Mullins, but it won't be easy because Ashburn does things by the book while Mullins does things her way.", "genres": ["Action", "Comedy", "Crime"], "imdb": {"id": 2404463, "rating": 6.6, "votes": 120383}, "languages": ["English", "Spanish", "Bulgarian"], "lastupdated": "2015-09-11 00:03:24.780000000", "metacritic": 60, "plot": "An uptight FBI Special Agent is paired with a foul-mouthed Boston cop to take down a ruthless drug lord.", "poster": "https://m.media-amazon.com/images/M/MV5BMjA2MDQ2ODM3MV5BMl5BanBnXkFtZTcwNDUzMTQ3OQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1372377600000, "runtime": 117, "title": "The Heat", "tomatoes": {"boxOffice": "$159.6M", "consensus": "The Heat is predictable, but Melissa McCarthy is reliably funny and Sandra Bullock proves a capable foil.", "critic": {"meter": 65, "numReviews": 165, "rating": 6.2}, "dvd": 1381795200000, "fresh": 108, "lastUpdated": 1442080044000, "production": "20th Century Fox", "rotten": 57, "viewer": {"meter": 71, "numReviews": 165664, "rating": 3.8}, "website": "http://www.theheatmovie.com/#/trailer"}, "type": "movie", "writers": ["Katie Dippold"], "year": 2013}