{"_id": "573a13d5f29313caabd9b582", "awards": {"nominations": 2, "text": "1 win & 2 nominations.", "wins": 1}, "cast": ["Danny Trejo", "Mel Gibson", "Demian Bichir", "Amber Heard"], "countries": ["Russia", "USA"], "directors": ["Robert Rodriguez"], "fullplot": "During an operation of a Mexican Cartel, Machete Cortez and Sartana Rivera intercept the criminals alone, but another group arrives and a masked man kills Sartana. Machete is arrested, accused of killing his beloved Sartana and Sheriff Doakes hangs Machete. But the President of the USA Rathcock pardons and recruits Machete to kill the revolutionary Marcos Mendez that has threatened the USA with a missile with a bomb. Machete goes to San Antonio to meet the Miss San Antonio Blanca Vasquez that will be the liaison between Machete and President Rathcock. Then Machete goes to the brothel of Madame Desdemona to seek out the prostitute Cereza that is Mendez's mistress. Machete meets Mendez and learns that his heart is connected to the missile and only the arm dealer Luther Voz is capable to disarm the bomb. Now Machete needs to bring Mendez to the USA in less than twenty-four hours and save his new country in a dangerous journey with betrayals.", "genres": ["Action", "Crime", "Thriller"], "imdb": {"id": 2002718, "rating": 5.6, "votes": 52429}, "languages": ["English", "Spanish"], "lastupdated": "2015-08-24 00:21:58.477000000", "metacritic": 41, "num_mflix_comments": 1, "plot": "The U.S. government recruits Machete to battle his way through Mexico in order to take down an arms dealer who looks to launch a weapon into space.", "poster": "https://m.media-amazon.com/images/M/MV5BMjA2MzUxMTM3M15BMl5BanBnXkFtZTgwMzA2NzkxMDE@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1381449600000, "runtime": 107, "title": "Machete Kills", "tomatoes": {"boxOffice": "$7.9M", "consensus": "While possessed with the same schlocky lunacy as its far superior predecessor, Machete Kills loses the first installment's spark in a less deftly assembled sequel.", "critic": {"meter": 29, "numReviews": 113, "rating": 4.5}, "dvd": 1390262400000, "fresh": 33, "lastUpdated": 1442077529000, "production": "Open Road", "rotten": 80, "viewer": {"meter": 35, "numReviews": 36132, "rating": 2.9}, "website": "http://www.facebook.com/MacheteKills"}, "type": "movie", "writers": ["Kyle Ward (screenplay)", "Robert Rodriguez (story)", "Marcel Rodriguez (story)"], "year": 2013}