{"_id": "573a13adf29313caabd2999d", "awards": {"nominations": 12, "text": "29 wins & 12 nominations.", "wins": 29}, "cast": ["Ben Affleck", "Stevie Wonder", "George W. Bush", "James Baker III"], "countries": ["USA"], "directors": ["Michael Moore"], "fullplot": "Following up on 'Bowling for Columbine', film-maker Michael Moore provides deep and though-provoking insights on the American security system, the level of paranoia, fear, uncertainty, false values and patriotism, which all combined together to set a stage for George W. Bush to launch a war on Iraq instead of focusing on getting the real culprit(s) behind the terrorist attacks of September 11, 2001. This documentary also focuses on how some Saudis were safely and secretly flown out of America while planes were ostensibly grounded after the attacks. Archived film footage, candid interviews with politicians, and an overall waste of public funds for a war that was initiated on false pretension to wit: a weapon of mass distraction - to take the focus away from the real enemy and get Americans glued to their TV sets to watch innocent Iraqis and Afghans getting killed. And a war that would eventually alienate the U.S.A. and it's citizens from almost every country on Earth.", "genres": ["Documentary"], "imdb": {"id": 361596, "rating": 7.5, "votes": 107763}, "languages": ["English", "Arabic"], "lastupdated": "2015-08-20 01:03:57.640000000", "metacritic": 67, "num_mflix_comments": 1, "plot": "Michael Moore's view on what happened to the United States after September 11; and how the Bush Administration allegedly used the tragic event to push forward its agenda for unjust wars in Afghanistan and Iraq.", "poster": "https://m.media-amazon.com/images/M/MV5BMjAyODU1NzM0NF5BMl5BanBnXkFtZTcwNjI1MjYyMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1088121600000, "runtime": 122, "title": "Fahrenheit 9/11", "tomatoes": {"boxOffice": "$119.1M", "consensus": "Extremely one-sided in its indictment of the Bush administration, but worth watching for the humor and the debates it'll stir.", "critic": {"meter": 83, "numReviews": 229, "rating": 7.3}, "dvd": 1096934400000, "fresh": 191, "lastUpdated": 1439836717000, "production": "Lions Gate", "rotten": 38, "viewer": {"meter": 69, "numReviews": 207346, "rating": 3.3}, "website": "http://www.fahrenheit911.com/"}, "type": "movie", "writers": ["Michael Moore"], "year": 2004}