{"_id": "573a1397f29313caabce661e", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Linda Blair", "Richard Burton", "Louise Fletcher", "Max von Sydow"], "countries": ["USA"], "directors": ["John Boorman"], "fullplot": "Dr. Gene Tuskin works with troubled children, perhaps none more troubled than Regan MacNeil, who suffers from bad dreams and repressed memories. The memories she represses are of the time she was possessed by a demon. Dr. Tuskin's invention, a device that hypnotizes two persons and links their minds together, reveals that the demon, named Pazuzu, still lurks within her. It is desperate to emerge again and wreak havoc. Meanwhile, Father Philip Lamont is ordered by his cardinal to investigate the death of Father Merrin, the priest who died while performing an exorcism on Regan. Father Lamont undertakes his task reluctantly. He feels unworthy of his assignment. He also feels that Evil is literally an entity and that this entity is winning the battle over Good. His investigation takes him to Africa where he locates another recipient of Merrin's exorcising and learns something fascinating and terrible about locusts.", "genres": ["Drama", "Horror", "Mystery"], "imdb": {"id": 76009, "rating": 3.7, "votes": 15297}, "languages": ["English", "French", "Spanish"], "lastupdated": "2015-09-14 10:39:05.660000000", "num_mflix_comments": 1, "plot": "A girl once possessed by a demon finds that it still lurks within her. Meanwhile, a priest investigates the death of the girl's exorcist.", "poster": "https://m.media-amazon.com/images/M/MV5BZTQ2NmY5NmUtNWJiNS00ZjZmLTllMjQtNzU3YWZlM2E2MmJjXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 235353600000, "runtime": 118, "title": "Exorcist II: The Heretic", "tomatoes": {"critic": {"meter": 22, "numReviews": 18, "rating": 3.5}, "dvd": 1029801600000, "fresh": 4, "lastUpdated": 1442256763000, "production": "WARNER BROTHERS PICTURES", "rotten": 14, "viewer": {"meter": 13, "numReviews": 36252, "rating": 2.3}}, "type": "movie", "writers": ["William Goodhart"], "year": 1977}