{"_id": "573a13bcf29313caabd5668a", "awards": {"nominations": 1, "text": "2 wins & 1 nomination.", "wins": 2}, "cast": ["Adam Sandler", "John Turturro", "Emmanuelle Chriqui", "Nick Swardson"], "countries": ["USA"], "directors": ["Dennis Dugan"], "fullplot": "Zohan Dvir works as a Special Agent and lives with his orthodox parents in Israel. He wants to give up this life full of dangerous encounters with Palestinians. While in the process of apprehending a Palestinian activist known simply as the Phantom, he fakes his death, hides in a dog-kennel on a plane bound for New York, and decides to try his hand as a hair-stylist. He is refused employment initially, but when he offers to work for free, Dahlia hires him as a cleaner. When a hair-stylist named Debbie quits, Zohan replaces her, winning over elderly female clientèle, and falling in love with Dahlia herself. Before Zohan could propose to her, Dahlia's landlord, Walbridge, who has been raising rents regularly, hires skinhead goons to terrorize the neighborhood, creates misunderstandings between Jews, Muslims, Arabs, and Palestinians, and drives them out, so as to enable him to construct a new building which is topped by a roller coaster. When Zohan decides to confront these skinheads, he does not realize that he is in for quite a few surprises himself.", "genres": ["Action", "Comedy"], "imdb": {"id": 960144, "rating": 5.5, "votes": 144960}, "languages": ["English", "Hebrew"], "lastupdated": "2015-09-05 00:35:55.143000000", "metacritic": 54, "num_mflix_comments": 2, "plot": "An Israeli Special Forces Soldier fakes his death so he can re-emerge in New York City as a hair stylist.", "poster": "https://m.media-amazon.com/images/M/MV5BMzE2MzEzNDc5M15BMl5BanBnXkFtZTcwMzYxOTA3MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1212710400000, "runtime": 113, "title": "You Don't Mess with the Zohan", "tomatoes": {"boxOffice": "$100.0M", "consensus": "You Don't Mess With the Zohan features intermittent laughs, and will please Sandler diehards, but after awhile the leaky premise wears thin.", "critic": {"meter": 38, "numReviews": 184, "rating": 4.7}, "dvd": 1223337600000, "fresh": 69, "lastUpdated": 1442137894000, "production": "Sony Pictures", "rotten": 115, "viewer": {"meter": 45, "numReviews": 409839, "rating": 3.1}, "website": "http://www.youdontmesswiththezohan.com/"}, "type": "movie", "writers": ["Adam Sandler", "Robert Smigel", "Judd Apatow"], "year": 2008}