{"_id": "573a1396f29313caabce40be", "awards": {"nominations": 1, "text": "1 win & 1 nomination.", "wins": 1}, "cast": ["Marcello Mastroianni", "Billie Whitelaw", "Calvin Lockhart", "Glenna Forster-Jones"], "countries": ["UK"], "directors": ["John Boorman"], "fullplot": "Prince Leo, last in the line of rulers of a long-deposed monarchy on continental Europe and jaded with the frenetic search for kicks with the European jet-set, returns to his father's London town house for rest. With him are social-climber Margaret, to whom he is engaged, and Laszlo, who is planning a counter revolution which will restore Leo to the kingship of the monarchy. Leo is shocked to discover the one exclusive neighborhood has degenerated into a ghetto inhabited mainly by poor blacks on the brink of desperation. His nearest neighbors are the Mardi family and their beautiful daughter, Salambo, who catches his eye as does her boy friend the procurer Roscoe. Using the excuse of watching birds he watches them closely through field glasses with the coolness and detachment of a scientist watching insects under a magnifying glass. When Salambo is forced to become a whore in order to keep her family together, Leo, despite the pleadings of Margaret and Laszlo who has just about finished the steps toward the restoration, does something of which he always though himself incapable.", "genres": ["Drama", "Comedy"], "imdb": {"id": 65974, "rating": 6.2, "votes": 382}, "languages": ["English"], "lastupdated": "2015-07-26 00:42:21.740000000", "plot": "Prince Leo, last in the line of rulers of a long-deposed monarchy on continental Europe and jaded with the frenetic search for kicks with the European jet-set, returns to his father's ...", "poster": "https://m.media-amazon.com/images/M/MV5BOTMzOWE2MGQtNTE2MC00ZjMwLTk0ZDItNmRkYmRmZDdhOTkyXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 21254400000, "runtime": 104, "title": "Leo the Last", "tomatoes": {"lastUpdated": 1441306249000, "viewer": {"meter": 50, "numReviews": 76, "rating": 3.2}}, "type": "movie", "writers": ["John Boorman", "William Stair", "George Tabori (play)"], "year": 1970}