{"_id": "573a1394f29313caabcde87e", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["John Wayne", "Maureen O'Hara", "Ben Johnson", "Claude Jarman Jr."], "countries": ["USA"], "directors": ["John Ford"], "fullplot": "Rio Grande takes place after the Civil War when the Union turned their attention towards the Apaches. Union officer Kirby Yorke is in charge of an outpost on the Rio Grande in which he is in charge of training of new recruits one of which is his son whom he hasn't seen in 15 years. He whips him into shape to take on the Apaches but not before his mother shows up to take him out of there.The decision to leave is left up to Trooper Yorke who decides to stay and fight. Through it all Kirby and Kathleen though separated for years fall back into love and decide that it's time to give it another try. But Yorke faces his toughest battle when his unorthodox plan to outwit the elusive Apaches leads to possible court- martial. Locked in a bloody Indian war, he must fight to redeem his honor and save the love and lives of his broken family", "genres": ["Romance", "Western"], "imdb": {"id": 42895, "rating": 7.3, "votes": 9491}, "languages": ["English"], "lastupdated": "2015-08-21 00:07:30.330000000", "num_mflix_comments": 3, "plot": "Rio Grande takes place after the Civil War when the Union turned their attention towards the Apaches. Union officer Kirby Yorke is in charge of an outpost on the Rio Grande in which he is ...", "poster": "https://m.media-amazon.com/images/M/MV5BOTI2ZjM2MTUtYTNjYS00ZTM3LTg0NjEtNDNlM2JhMzk1ZjIyXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_SY1000_SX677_AL_.jpg", "rated": "APPROVED", "released": -603676800000, "runtime": 105, "title": "Rio Grande", "tomatoes": {"critic": {"meter": 75, "numReviews": 12, "rating": 6.7}, "dvd": 990489600000, "fresh": 9, "lastUpdated": 1441131029000, "production": "Artisan Entertainment", "rotten": 3, "viewer": {"meter": 71, "numReviews": 8668, "rating": 3.6}}, "type": "movie", "writers": ["James Kevin McGuinness (screenplay)", "James Warner Bellah (Saturday Evening Post story)"], "year": 1950}