{"_id": "573a13a5f29313caabd142f2", "awards": {"nominations": 2, "text": "1 win & 2 nominations.", "wins": 1}, "cast": ["Tilda Swinton", "Jeremy Davies", "James Urbaniak", "John O'Keefe"], "countries": ["USA", "Germany", "UK"], "directors": ["Lynn Hershman-Leeson"], "fullplot": "Anxious to use artificial life to improve the world, Rosetta Stone, a bio-geneticist creates a Recipe for Cyborgs and uses her own DNA in order to breed three Self Replicating Automatons, part human, part computer named Ruby, Olive and Marine. The SRA's act as 'portals' on the Internet, helping users to fulfill their dreams. The SRA's are nourished through touch. Because they were bred only with Rosetta's DNA, they need the balance of an Y chromo or male sperm to survive. Rosetta projects seduction scenes from movie clips onto Ruby, which absorbs as she sleeps. The SRA'S can not distinguish dreams from reality. Ruby acts out these scenes in real life with the men and shares her spoils with her sisters. However, Ruby's encounters suffer from impotence and unexplained rashes. Fearing a bio-gender war, the FBI sends in Agent Edward Hopper to solve the mystery. Puzzled, he turns for help from a private cyber detective. The men recover. Ruby falls in love and becomes impregnated by Sandy, a xerox shop worker. The characters struggle to find love in a world that no longer needs sex to reproduce, a world that is changing and is populated with people who use provisional identities and are seen through virtual selves and a world where love is the only thing that makes things real.", "genres": ["Comedy", "Drama", "Romance"], "imdb": {"id": 270688, "rating": 5.3, "votes": 1047}, "languages": ["English"], "lastupdated": "2015-07-27 00:06:19.560000000", "metacritic": 43, "num_mflix_comments": 1, "plot": "Anxious to use artificial life to improve the world, Rosetta Stone, a bio-geneticist creates a Recipe for Cyborgs and uses her own DNA in order to breed three Self Replicating Automatons, ...", "poster": "https://m.media-amazon.com/images/M/MV5BMjE1ODEyNzY0Ml5BMl5BanBnXkFtZTcwNjExNDAwMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1288051200000, "runtime": 85, "title": "Teknolust", "tomatoes": {"critic": {"meter": 30, "numReviews": 33, "rating": 4.4}, "dvd": 1072137600000, "fresh": 10, "lastUpdated": 1437764469000, "production": "ThinkFilm", "rotten": 23, "viewer": {"meter": 38, "numReviews": 798, "rating": 2.9}, "website": "http://www.teknolustthemovie.com"}, "type": "movie", "writers": ["Lynn Hershman-Leeson"], "year": 2002}