{"_id": "573a13daf29313caabdacb11", "awards": {"nominations": 28, "text": "Nominated for 1 Oscar. Another 9 wins & 28 nominations.", "wins": 10}, "cast": ["Idris Elba", "Naomie Harris", "Tony Kgoroge", "Riaad Moosa"], "countries": ["UK", "South Africa"], "directors": ["Justin Chadwick"], "fullplot": "Nelson Mandela is a South African lawyer who joins the African National Congress in the 1940s when the law under the Apartheid system's brutal tyranny proves useless for his people. Forced to abandon peaceful protest for armed resistance after the Sharpeville Massacre, Mandela pays the price when he and his comrades are sentenced to life imprisonment for treason while his wife, Winnie, is abused by the authorities herself. Over the decades in chains, Mandela's spirit is unbowed as his struggle goes on in and beyond his captivity to become an international cause. However, as Winnie's determination hardens over the years into a violent ruthlessness, Nelson's own stature rises until he becomes the renowned leader of his movement. That status would be put to the test as his release nears and a way must be found to win a peaceful victory that will leave his country, and all its peoples, unstained.", "genres": ["Biography", "Drama", "History"], "imdb": {"id": 2304771, "rating": 7.1, "votes": 18775}, "languages": ["English", "Afrikaans", "Xhosa"], "lastupdated": "2015-09-03 00:31:00.257000000", "metacritic": 60, "num_mflix_comments": 1, "plot": "A chronicle of Nelson Mandela's life journey from his childhood in a rural village through to his inauguration as the first democratically elected president of South Africa.", "poster": "https://m.media-amazon.com/images/M/MV5BMTg1NTQ1NDczNV5BMl5BanBnXkFtZTcwNDQyMDU1OQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1387929600000, "runtime": 141, "title": "Mandela: Long Walk to Freedom", "tomatoes": {"boxOffice": "$1.4M", "consensus": "It might be too respectful to truly soar, but there's no denying Idris Elba's impressive work in Mandela: Long Walk to Freedom -- or the inspirational power of the life it depicts.", "critic": {"meter": 58, "numReviews": 122, "rating": 6.2}, "dvd": 1395100800000, "fresh": 71, "lastUpdated": 1440440060000, "production": "The Weinstein Co.", "rotten": 51, "viewer": {"meter": 68, "numReviews": 22166, "rating": 3.7}, "website": "http://mandelafilm.com/"}, "type": "movie", "writers": ["William Nicholson (screenplay)", "Nelson Mandela (autobiography)"], "year": 2013}