{"_id": "573a139af29313caabcf14fd", "awards": {"nominations": 2, "text": "1 win & 2 nominations.", "wins": 1}, "cast": ["David Duchovny", "Minnie Driver", "Carroll O'Connor", "Robert Loggia"], "countries": ["USA"], "directors": ["Bonnie Hunt"], "fullplot": "The film opens with a loving husband and wife preparing for a very important fund raising dinner. The evening ends with the loss of the wife. In a hospital a weak young woman who may die soon if she can not get a new heart. Jump ahead one year the young woman received a heart and is trying to adjust to a life no longer counted by hours or days, she can actually make plans. The grieving husband and his dog are still trying to adjust to life without his wife. His friends keep trying to pry him from his \"work is my life\" existence by setting him up on blinds dates. Finally he actually shows up for one at an Irish-Italian restaurant where he finds himself more attracted to the waitress than his blind date. He finds an excuse to return to the restaurant in hopes of seeing the waitress again, there's just something attractive about her. Unknown to both the attraction they both feel for one another is Grace has the heart of Bob's dead wife. What can you say after that! Carroll O'Connor says exactly the right thing to Bob after he finds out this ironic coincidence.", "genres": ["Comedy", "Drama", "Romance"], "imdb": {"id": 122459, "rating": 6.9, "votes": 15817}, "languages": ["English", "Italian"], "lastupdated": "2015-08-29 00:02:28.327000000", "metacritic": 54, "plot": "A man who falls in love with the woman who received his wife's heart must decide which woman it is who holds his heart.", "poster": "https://m.media-amazon.com/images/M/MV5BMjIwNDEzODU3Nl5BMl5BanBnXkFtZTcwMjI0NzU2NA@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 955065600000, "runtime": 115, "title": "Return to Me", "tomatoes": {"consensus": "David Duchovny and Minnie Driver provide heart-warming romance and comedy in this solid debut by Director Bonnie Hunt.", "critic": {"meter": 61, "numReviews": 98, "rating": 6.1}, "dvd": 972950400000, "fresh": 60, "lastUpdated": 1440439550000, "production": "MGM Distribution", "rotten": 38, "viewer": {"meter": 79, "numReviews": 46746, "rating": 3.3}, "website": "http://www.mgm.com/rtm"}, "type": "movie", "writers": ["Bonnie Hunt (story)", "Don Lake (story)", "Andrew Stern (story)", "Samantha Goodman (story)", "Bonnie Hunt (screenplay)", "Don Lake (screenplay)"], "year": 2000}