{"_id": "573a13b2f29313caabd3a047", "awards": {"nominations": 12, "text": "9 wins & 12 nominations.", "wins": 9}, "cast": ["Rekha", "Hrithik Roshan", "Priyanka Chopra", "Sharat Saxena"], "countries": ["India"], "directors": ["Rakesh Roshan"], "fullplot": "Singapore-based Dr. Siddhant Arya recruits a superhumanly powerful Indian-born man named Rohit Mehra, who was given special powers by a blue-skinned alien named Jadoo, to build a computer that can forecast the future, which results in an accident that kills Rohit. When this news reaches Rohit's mother, Sonia, in India, she passes this on to Rohit's wife, Nisha, who has just given birth to a son named Krishna. However, Nisha, unable to handle this devastating news, passes away, leaving Krishna to be brought up by Sonia. When Krishna is enrolled in school, she notices that he has the same intellectual and physical powers that his father possessed, so in order to shield him from any harm, she moves to a secluded and remote area in a mountainous region of the country, where he grows up. Years later, Krishna has matured, has acquired the same special powers that his father had, and is also able to communicate with animals. He meets with a camper named Priya and is attracted to her. When she returns home to Singapore, she phones him to visit her so that she can introduce him to her mother so that they can get married. A thrilled Krishna travels to Singapore, despite Sonia's pleas; meets with Priya; and is all set to meet her mother, get married, and return home. What Krishna does not know is that Priya has lured him there so that she can exploit his superhuman powers on her TV network, Star Plus--and not only maintain her job but also get a promotion. It looks like the naève and overly trusting Krishna may now be propelled straight into the hands of Dr. Arya, who is still alive and on the verge of creating a supercomputer that can forecast the future--and is quite capable of doing anything in his power to achieve this nefarious goal and project himself as the one and only God of the universe.", "genres": ["Action", "Adventure", "Romance"], "imdb": {"id": 432637, "rating": 6.3, "votes": 10778}, "languages": ["Hindi", "English", "Cantonese"], "lastupdated": "2015-09-07 00:06:26.587000000", "metacritic": 68, "plot": "The origins of the Indian superhero Krrish.", "poster": "https://m.media-amazon.com/images/M/MV5BNzRlNDJmOWUtMTM5Ni00ZjNlLWEwZjYtNTY1ZGEzNjE3OWMzXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 1151020800000, "runtime": 154, "title": "Krrish", "tomatoes": {"critic": {"meter": 100, "numReviews": 7, "rating": 7}, "dvd": 1158019200000, "fresh": 7, "lastUpdated": 1439664311000, "production": "Adlabs Films", "rotten": 0, "viewer": {"meter": 72, "numReviews": 9240, "rating": 3.8}, "website": "http://www.krrishthemovie.com/"}, "type": "movie", "writers": ["Robin Bhatt (screenplay)", "Sachin Bhowmick (screenplay)", "Honey Irani (screenplay)", "Akarsh Khurana (screenplay)", "Sanjay Masoom (dialogue)", "Rakesh Roshan (screenplay)"], "year": 2006}