{"_id": "573a1394f29313caabcdfd90", "awards": {"nominations": 6, "text": "Won 1 Oscar. Another 1 win & 6 nominations.", "wins": 2}, "cast": ["Doris Day", "James Cagney", "Cameron Mitchell", "Robert Keith"], "countries": ["USA"], "directors": ["Charles Vidor"], "fullplot": "In 1920's Chicago, Ruth Etting wants to be a renowned singer, which is a far step away from her current work as a taxi dancer. Upon walking into the dance hall and seeing her, Chicago gangster Marty Snyder immediately falls for Ruth, and works toward being her lover, which he believes he can achieve by opening up singing opportunities for her. Ruth is initially wary of Marty, but makes it clear that she is not interested in him in a romantic sense. Regardless, he does help her professionally, and through his opportunities, which are achieved through intimidation and fear, Ruth does quickly start to gain a name as a singer, which she is able to do because of her talent and despite Marty's intimidation tactics. However, the greater her success, the more reliant she becomes on him. This becomes an issue in their relationship as she believes he can take her only so far before he becomes a liability, however he will never let her go that easily. The one person who tried and tries to get Ruth away from her unhappy life with Marty is Johnny Alderman, the musical advisor Marty hired for Ruth at the first gig he got for her, and who also loves Ruth himself.", "genres": ["Biography", "Drama", "Music"], "imdb": {"id": 48317, "rating": 7.3, "votes": 2558}, "languages": ["English"], "lastupdated": "2015-09-05 00:35:17.287000000", "num_mflix_comments": 2, "plot": "A fictionalized account of the career of jazz singer Ruth Etting and her tempestuous marriage to gangster Marty Snyder, who helped propel her to stardom.", "poster": "https://m.media-amazon.com/images/M/MV5BNzQwZDczMTUtODI3My00ZDkwLWI4ODctMTBkMmRhYjI4Njg3XkEyXkFqcGdeQXVyMjIyNjE2NA@@._V1_SY1000_SX677_AL_.jpg", "rated": "PASSED", "released": -459561600000, "runtime": 122, "title": "Love Me or Leave Me", "tomatoes": {"critic": {"meter": 67, "numReviews": 6, "rating": 7.4}, "dvd": 1114473600000, "fresh": 4, "lastUpdated": 1441912319000, "production": "MGM Home Entertainment", "rotten": 2, "viewer": {"meter": 76, "numReviews": 3939, "rating": 3.5}}, "type": "movie", "writers": ["Daniel Fuchs (screenplay)", "Isobel Lennart (screenplay)", "Daniel Fuchs (story)"], "year": 1955}