{"_id": "573a13d5f29313caabd9cb11", "awards": {"nominations": 11, "text": "7 wins & 11 nominations.", "wins": 7}, "cast": ["Hae-il Park", "Seung-ryong Ryu", "Mu-Yeol Kim", "Chae-won Moon"], "countries": ["South Korea"], "directors": ["Han-min Kim"], "fullplot": "Two children Nam-yi and Ja-in are being chased by King Injo's guards and saved by their father Choi Pyeong-ryung, an officer of King Gwanghae and a skilled archer. He sends his own children to find a place of refuge with his best friend Kim Mu-seon. As they escape crying, Ja-in begs her brother to go back to their father but their father is killed in front of Nam-yi. Nam-yi, though bitten by the guard dogs, kills them and escapes with Ja-in. Nam-yi becomes the only family Ja-in has. 13 years later Nam-yi is now a skilled archer and hunter. He learns from Mu-seon's son Seo-goon that he and Ja-in plan to get married, with the approval of Mu-seon who is also Ja-in's godfather. During the wedding, Nam-yi is up in the mountains hunting deer. He hears the rumble of the invading forces. When Nam-yi makes it back to the village, he finds his step-father slaughtered and his sister taken away. Nam-yi then sets out to find the Qing army and take out their army with his bow.", "genres": ["Action", "History"], "imdb": {"id": 2025526, "rating": 7.2, "votes": 7815}, "languages": ["Korean"], "lastupdated": "2015-09-12 00:28:09.123000000", "num_mflix_comments": 4, "plot": "Set during the second Manchu invasion of Korea, Nam Yi, the best archer in Korea, goes up against the Qing Dynasty to save his younger sister Ja In - who was dragged away by Manchurian.", "poster": "https://m.media-amazon.com/images/M/MV5BMTgwMjAyNzA0N15BMl5BanBnXkFtZTcwMTcxOTIwNw@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1312934400000, "runtime": 122, "title": "War of the Arrows", "tomatoes": {"boxOffice": "$40.7k", "dvd": 1329782400000, "lastUpdated": 1442340589000, "production": "CJ Entertainment", "viewer": {"meter": 79, "numReviews": 906, "rating": 3.9}, "website": "http://www.arrow2011.com"}, "type": "movie", "writers": ["Han-min Kim (screenplay)"], "year": 2011}