{"_id": "573a1397f29313caabce7952", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Tatum O'Neal", "Kristy McNichol", "Armand Assante", "Matt Dillon"], "countries": ["USA"], "directors": ["Ron Maxwell"], "fullplot": "Fifteen year olds Ferris Whitney and Angel Bright meet when they attend the same summer camp and are assigned the bunks next to each other in the same cabin. It's hate at first sight as they are seemingly polar opposites: romantic and literate Ferris comes from a wealthy and thus privileged background, while streetwise and chain-smoking Angel is from the proverbial wrong side of the tracks. But they share one similarity: they are both virgins, the only ones of their age in their cabin. Due to pressure from their cabin mates, most specifically the aggressive Cinder Carlson, the two enter into a bet on who will lose their virginity first and by the end of the summer. Ferris, who initially seems more interested in the pursuit of the opposite sex, quickly sets her sights on Gary Callahan, the much older coach at the camp. But Angel finds her own target, namely Randy Adams, an equally streetwise boy attending the camp across the lake. The process becomes a bonding exercise for the two girls, who take divergent paths to their end goal and in dealing with the aftermath of the alleged big events.", "genres": ["Comedy", "Drama"], "imdb": {"id": 81060, "rating": 6.4, "votes": 3485}, "languages": ["English"], "lastupdated": "2015-08-11 00:32:28.360000000", "plot": "Two 15-year old girls from different sides of the tracks compete to see who will be first to lose their virginity while at camp.", "poster": "https://m.media-amazon.com/images/M/MV5BZWVmMmQ0ODQtMmVkNC00OGQ1LWI1Y2EtNzlmZTAxZjU2N2ZmXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 322444800000, "runtime": 96, "title": "Little Darlings", "tomatoes": {"lastUpdated": 1441222988000, "production": "Paramount Pictures", "viewer": {"meter": 75, "numReviews": 7472, "rating": 3.4}}, "type": "movie", "writers": ["Kimi Peck (screenplay)", "Dalene Young (screenplay)", "Kimi Peck (story)"], "year": 1980}