{"_id": "573a13dcf29313caabdb0a0f", "awards": {"nominations": 31, "text": "29 wins & 31 nominations.", "wins": 29}, "cast": ["Michael Polley", "Harry Gulkin", "Susy Buchan", "John Buchan"], "countries": ["Canada"], "directors": ["Sarah Polley"], "fullplot": "In this inspired, genre-twisting new film, Oscarè-nominated writer/director Sarah Polley discovers that the truth depends on who's telling it. Polley is both filmmaker and detective as she investigates the secrets kept by a family of storytellers. She playfully interviews and interrogates a cast of characters of varying reliability, eliciting refreshingly candid, yet mostly contradictory, answers to the same questions. As each relates their version of the family mythology, present-day recollections shift into nostalgia-tinged glimpses of their mother, who departed too soon, leaving a trail of unanswered questions. Polley unravels the paradoxes to reveal the essence of family: always complicated, warmly messy and fiercely loving. Stories We Tell explores the elusive nature of truth and memory, but at its core is a deeply personal film about how our narratives shape and define us as individuals and families, all interconnecting to paint a profound, funny and poignant picture of the larger human story.", "genres": ["Documentary"], "imdb": {"id": 2366450, "rating": 7.6, "votes": 8279}, "languages": ["English"], "lastupdated": "2015-08-17 00:02:22.233000000", "metacritic": 91, "num_mflix_comments": 1, "plot": "A film that excavates layers of myth and memory to find the elusive truth at the core of a family of storytellers.", "poster": "https://m.media-amazon.com/images/M/MV5BMTg3MDU2NjI3N15BMl5BanBnXkFtZTcwMjYwMzYyOQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1358380800000, "runtime": 108, "title": "Stories We Tell", "tomatoes": {"boxOffice": "$1.6M", "consensus": "In Stories We Tell, Sarah Polley plays with the documentary format to explore the nature of memory and storytelling, crafting a thoughtful, compelling narrative that unfolds like a mystery.", "critic": {"meter": 94, "numReviews": 127, "rating": 8.6}, "dvd": 1378166400000, "fresh": 120, "lastUpdated": 1440353406000, "production": "Roadside Attractions", "rotten": 7, "viewer": {"meter": 79, "numReviews": 14403, "rating": 3.9}, "website": "http://storieswetellmovie.com/"}, "type": "movie", "writers": ["Sarah Polley", "Michael Polley (narration)"], "year": 2012}