{"_id": "573a13cdf29313caabd83ea5", "awards": {"nominations": 0, "text": "2 wins.", "wins": 2}, "cast": ["Rosario Dawson", "Vanessa Hudgens", "Dascha Polanco", "Brendan Fraser"], "countries": ["USA"], "directors": ["Ron Krauss"], "fullplot": "16 year old street-wise Apple (Vanessa Hudgens) has never had an easy life. Her mother, June Bailey (Rosario Dawson), is an addict and prostitute, is verbally and physically abusive, and is grooming her daughter to follow in her footsteps. Apple knows the streets, alleys and motels like the back of her hand but wants more from her life. She possesses a tenacious, tough, indomitable spirit, and will not surrender to fate. Apple runs away from her mother and tracks down her father whom she has never known, as he was only 19 when he got Apple's mother pregnant. Apple begs her now Wall Street Broker father, Tom Fitzpatrick (Brendan Fraser), to take her in. In the few days under her father's care, she learns she's become pregnant by a kid from the streets she met on the train, who now wants nothing to do with her. She is forced to leave her father's home because of her choice to give birth to the baby she is carrying. Apple runs away again, and is eventually taken under the wing of Father McCarthy (James Earl Jones), the chaplain of the local hospital after almost getting herself killed. He offers to let Apple live at a shelter for pregnant young women run by a spiritual woman named Kathy (Ann Dowd). It is here that Apple begins to tentatively interact with the other girls who are in the same predicament as she and gradually begins to make a family for herself.", "genres": ["Drama"], "imdb": {"id": 1657510, "rating": 6.5, "votes": 5609}, "languages": ["English"], "lastupdated": "2015-09-12 00:24:20.577000000", "metacritic": 37, "plot": "A pregnant teenager flees her abusive mother in search of her father, only to be rejected by her stepmother and forced to survive on the streets until a compassionate stranger offers a hopeful alternative.", "poster": "https://m.media-amazon.com/images/M/MV5BMTg0MzMyMjYxMV5BMl5BanBnXkFtZTgwNDYzMTc2MDE@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1414540800000, "runtime": 101, "title": "Gimme Shelter", "type": "movie", "writers": ["Ron Krauss"], "year": 2013}