{"_id": "573a1394f29313caabcdf4b7", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Fredric March", "Terry Moore", "Gloria Grahame", "Cameron Mitchell"], "countries": ["USA"], "directors": ["Elia Kazan"], "fullplot": "In 1950s Czechoslovakia circus manager Karel Cernik is planning an escape from Communism to freedom.His idea is to force his way across the guarded border using his entire circus.Three years in the making his idea is ready to be tested when he's suddenly summoned to a Secret Police routine questioning about his circus' program.To Cernik it's clear that he has an informer among his staff who reports his activities and private talks to the Secret Police. The Americans are just across the river in a nearby border village but Cernik needs a special permit from the Secret Police allowing his circus freedom of movement in the border areas to perform his shows.This hard to get permit is vital to his escape plan.To make matters worse his wife is being unfaithful, his daughter has fallen in love with the new stables boy,his circus is falling apart and his longtime rival, Barovik, wants to take over Cernik's circus.", "genres": ["Drama", "Film-Noir", "Thriller"], "imdb": {"id": 46040, "rating": 7.1, "votes": 599}, "languages": ["English", "German"], "lastupdated": "2015-08-06 00:21:51.163000000", "plot": "Czech circus owner-Clown and his entire troupe employ a daring stratagem in order to escape en masse from behind the iron curtain.", "poster": "https://m.media-amazon.com/images/M/MV5BNzM4YWIwNWYtYjdmNC00ZDFlLWE4N2EtOThkY2Q5YzAxMzYxXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_SY1000_SX677_AL_.jpg", "rated": "APPROVED", "released": -520992000000, "runtime": 105, "title": "Man on a Tightrope", "tomatoes": {"dvd": 1029801600000, "lastUpdated": 1442514214000, "production": "VCI Entertainment", "viewer": {"meter": 65, "numReviews": 805, "rating": 3.6}, "website": "http://www.vcientertainment.com/Film-Categories?product_id=400"}, "type": "movie", "writers": ["Neil Paterson (story)", "Robert E. Sherwood"], "year": 1953}