{"_id": "573a1398f29313caabcea772", "awards": {"nominations": 5, "text": "Won 1 Oscar. Another 4 nominations.", "wins": 0}, "cast": ["Dennis Quaid", "Martin Short", "Meg Ryan", "Kevin McCarthy"], "countries": ["USA"], "directors": ["Joe Dante"], "fullplot": "Tuck Pendleton is a cocky pilot, who is taking part in a miniaturization experiment. When some bad guys break into the lab to steal the technology, one of the scientists takes a syringe which contains the miniaturized Tuck and vessel. Now in the vessel is part of the material needed to restore him. But the other part which is the lab is stolen. The scientist's shot but before dying he injects Tuck into Jack Putter, a hypochondriac, who feels that something is wrong with him all the time. When Tuck links himself to Jack's systems, he discovers that something happened. So they go back to the lab, and discover what happened. Now they are told that unless they retrieve the material that was stolen they won't be able to restore Tuck before his oxygen is depleted. Now the government rep decides that the only thing that matters that as long as they have the other half of the material, it is useless to the thieves. So Tuck eggs Jack to go out and find the thieves. They enlist the aid of Tuck's old girlfriend, Lydia, who is a reporter. And it's fortunate for them that she has a lead that pans out.", "genres": ["Action", "Adventure", "Comedy"], "imdb": {"id": 93260, "rating": 6.7, "votes": 38517}, "languages": ["English"], "lastupdated": "2015-08-19 00:19:07.937000000", "num_mflix_comments": 1, "plot": "A hapless store clerk must foil criminals to save the life of the man who, miniaturized in a secret experiment, was accidentally injected into him.", "poster": "https://m.media-amazon.com/images/M/MV5BNDk1NzNiMGQtNGQ4Yy00NmMzLTkyNWQtZjM4MDU2Y2Q2NDVlL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 552096000000, "runtime": 120, "title": "Innerspace", "tomatoes": {"consensus": "A manic, overstuffed blend of sci-fi, comedy, and romance, Innerspace nonetheless charms, thanks to Martin Short's fine performance and the insistent zaniness of the plot.", "critic": {"meter": 81, "numReviews": 37, "rating": 6.7}, "dvd": 1026172800000, "fresh": 30, "lastUpdated": 1442516696000, "production": "Warner Bros. Pictures", "rotten": 7, "viewer": {"meter": 65, "numReviews": 35070, "rating": 3.2}}, "type": "movie", "writers": ["Chip Proser (story)", "Jeffrey Boam (screenplay)", "Chip Proser (screenplay)"], "year": 1987}