{"_id": "573a1399f29313caabcecb0f", "awards": {"nominations": 3, "text": "3 nominations.", "wins": 0}, "cast": ["John Ritter", "Michael Oliver", "Jack Warden", "Laraine Newman"], "countries": ["USA"], "directors": ["Brian Levant"], "fullplot": "Junior's back in his first adventure since his last! Junior and Ben move to Mortville which seems like the perfect town to live in. The Healys have a nice new house--and Junior get's a cool new room! And young women have formed a line at Ben's door in order to get a piece of him (romantically). Ben does feel he should get remarried so Junior can have a mom, so while Junior adjusts to his new school which includes a little girl who's as bratty as Junior and a teenage brain-dead ignoramous bully in Junior's sixth grade class, Ben finds some dates, which Junior sends running for the hills, in the meantime Junior pulls his infamous tricks on people: blowing up barbecues, taping the bully to the chalkboard, videotaping his babysitter and her boyfriend having sex and broadcasting it for the whole neighborhood to see, same old same old. Meanwhile, Ben meets the gorgeous school nurse (after the school's satellite dish get's pushed on his head) and they, well he, believes it's love at first site, until he meets LaWanda Dumore, a greedy business women who wants to marry Ben and send Junior to boarding school--in Baghdad! So Junior and his new friend, Trixie, must get rid of LaWanda (any way possible!) to bring their parents together!", "genres": ["Comedy", "Family"], "imdb": {"id": 102719, "rating": 4.4, "votes": 15723}, "languages": ["English"], "lastupdated": "2015-08-12 00:08:37.393000000", "plot": "Junior's back in his first adventure since his last! Junior and Ben move to Mortville which seems like the perfect town to live in. The Healys have a nice new house--and Junior get's a cool...", "poster": "https://m.media-amazon.com/images/M/MV5BZTQzNjRhMTctZjJmNi00NjFkLTgzMzgtNzUyOTUyODQ1NDA3XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 678499200000, "runtime": 90, "title": "Problem Child 2", "tomatoes": {"consensus": "Crude, rude, puerile, and pointless, Problem Child 2 represents a cynical nadir in family-marketed entertainment.", "critic": {"meter": 7, "numReviews": 27, "rating": 2.4}, "dvd": 1078185600000, "fresh": 2, "lastUpdated": 1441131948000, "production": "MCA Universal Home Video", "rotten": 25, "viewer": {"meter": 41, "numReviews": 25932, "rating": 2.5}}, "type": "movie", "writers": ["Scott Alexander (characters)", "Larry Karaszewski (characters)", "Scott Alexander", "Larry Karaszewski"], "year": 1991}