{"_id": "573a13c1f29313caabd6510e", "awards": {"nominations": 7, "text": "2 wins & 7 nominations.", "wins": 2}, "cast": ["Bradley Cooper", "Robert De Niro", "Abbie Cornish", "Andrew Howard"], "countries": ["USA"], "directors": ["Neil Burger"], "fullplot": "An action-thriller about a writer who takes an experimental drug that allows him to use 100 percent of his mind. As one man evolves into the perfect version of himself, forces more corrupt than he can imagine mark him for assassination. Out-of-work writer Eddie Morra's (Cooper) rejection by girlfriend Lindy (Abbie Cornish) confirms his belief that he has zero future. That all vanishes the day an old friend introduces Eddie to NZT, a designer pharmaceutical that makes him laser focused and more confident than any man alive. Now on an NZT-fueled odyssey, everything Eddie's read, heard or seen is instantly organized and available to him. As the former nobody rises to the top of the financial world, he draws the attention of business mogul Carl Van Loon (De Niro), who sees this enhanced version of Eddie as the tool to make billions. But brutal side effects jeopardize his meteoric ascent. With a dwindling stash and hit men who will eliminate him to get the NZT, Eddie must stay wired long enough to elude capture and fulfill his destiny. If he can't, he will become just another victim who thought he'd found invincibility in a bottle.", "genres": ["Mystery", "Sci-Fi", "Thriller"], "imdb": {"id": 1219289, "rating": 7.4, "votes": 376583}, "languages": ["English", "Russian", "Italian", "Mandarin", "French"], "lastupdated": "2015-09-05 00:29:49.003000000", "metacritic": 59, "num_mflix_comments": 4, "plot": "With the help of a mysterious pill that enables the user to access 100 percent of his brain abilities, a struggling writer becomes a financial wizard, but it also puts him in a new world with lots of dangers.", "poster": "https://m.media-amazon.com/images/M/MV5BYmViZGM0MGItZTdiYi00ZDU4LWIxNDYtNTc1NWQ5Njc2N2YwXkEyXkFqcGdeQXVyNDk3NzU2MTQ@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1300406400000, "runtime": 105, "title": "Limitless", "tomatoes": {"boxOffice": "$79.2M", "consensus": "Although its script is uneven, Neil Burger directs Limitless with plenty of visual panache, and Bradley Cooper makes for a charismatic star.", "critic": {"meter": 70, "numReviews": 188, "rating": 6.4}, "dvd": 1311033600000, "fresh": 132, "lastUpdated": 1442082413000, "production": "Relativity Media", "rotten": 56, "viewer": {"meter": 74, "numReviews": 106249, "rating": 3.7}, "website": "http://www.iamrogue.com/limitless"}, "type": "movie", "writers": ["Leslie Dixon (screenplay)", "Alan Glynn (novel)"], "year": 2011}