{"_id": "573a13b0f29313caabd332ac", "awards": {"nominations": 2, "text": "1 win & 2 nominations.", "wins": 1}, "cast": ["Nikita Mikhalkov", "Oleg Menshikov", "Nadezhda Mikhalkova", "Sergey Makovetskiy"], "countries": ["Russia"], "directors": ["Nikita Mikhalkov"], "fullplot": "Epic film about WWII, a sequel to Burnt by the Sun (1994). Evil Stalin is terrorizing people of Russia while the Nazis are advancing. Russian officer Kotov, who miraculously survived the death sentence in Stalin's Purge, is now fighting in the front lines. His daughter, Nadia, who survived a rape attempt by Nazi soldiers, is now a nurse risking her own life to save others. In the war-torn nation even former enemies are fighting together to defend their land. People stand up united for the sake of victory. The deadly war comes at very high cost: the Nazis are killing people, burning villages, raping women, bombing churches, destroying bridges. Hoping to survive, Kotov and his daughter are having visions of each other, but their dreams fade amidst massive bombardment. Fire and smoke eclipses the sun. The land around becomes lifeless, defenseless and littered with the dead. Then the dead are covered by snow. Life is over. Only a butterfly is flying above the weapons and corpses, alluding to eternity.", "genres": ["Drama", "War"], "imdb": {"id": 403645, "rating": 4.1, "votes": 3215}, "languages": ["Russian"], "lastupdated": "2015-08-14 00:57:12.803000000", "num_mflix_comments": 3, "plot": "Epic film about WWII, a sequel to Burnt by the Sun (1994). Evil Stalin is terrorizing people of Russia while the Nazis are advancing. Russian officer Kotov, who miraculously survived the ...", "poster": "https://m.media-amazon.com/images/M/MV5BYmJhNWMwMWUtZWJiNS00ZjJmLThiMDktMzYxYzJkNmY2YzE5XkEyXkFqcGdeQXVyNjMwOTA1MDM@._V1_SY1000_SX677_AL_.jpg", "released": 1271894400000, "runtime": 181, "title": "Utomlyonnye solntsem 2: Predstoyanie", "tomatoes": {"lastUpdated": 1441137011000, "viewer": {"meter": 38, "numReviews": 109, "rating": 2.7}}, "type": "movie", "writers": ["Nikita Mikhalkov", "Vladimir Moiseenko", "Aleksandr Novototskiy-Vlasov", "Gleb Panfilov"], "year": 2010}