{"_id": "573a139af29313caabceff51", "awards": {"nominations": 18, "text": "Nominated for 4 Oscars. Another 9 wins & 18 nominations.", "wins": 13}, "cast": ["Riz Abbasi", "Richard Attenborough", "David Blair", "Brian Blessed"], "countries": ["UK", "USA"], "directors": ["Kenneth Branagh"], "fullplot": "Hamlet, son of the king of Denmark, is summoned home for his father's funeral and his mother's wedding to his uncle. In a supernatural episode, he discovers that his uncle, whom he hates anyway, murdered his father. In an incredibly convoluted plot--the most complicated and most interesting in all literature--he manages to (impossible to put this in exact order) feign (or perhaps not to feign) madness, murder the \"prime minister,\" love and then unlove an innocent whom he drives to madness, plot and then unplot against the uncle, direct a play within a play, successfully conspire against the lives of two well-meaning friends, and finally take his revenge on the uncle, but only at the cost of almost every life on stage, including his own and his mother's.", "genres": ["Drama"], "imdb": {"id": 116477, "rating": 7.8, "votes": 29078}, "languages": ["English"], "lastupdated": "2015-08-26 00:04:20.760000000", "num_mflix_comments": 1, "plot": "Hamlet, Prince of Denmark, returns home to find his father murdered and his mother remarrying the murderer, his uncle. Meanwhile, war is brewing.", "poster": "https://m.media-amazon.com/images/M/MV5BMjA4OTM4NzMxOF5BMl5BanBnXkFtZTcwMDY1OTM2MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 851472000000, "runtime": 242, "title": "Hamlet", "tomatoes": {"consensus": "Kenneth Branagh's sprawling, finely textured adaptation of Shakespeare's masterpiece lives up to its source material, using strong performances and a sharp cinematic focus to create a powerfully resonant film that wastes none of its 246 minutes.", "critic": {"meter": 95, "numReviews": 55, "rating": 8.1}, "dvd": 1187049600000, "fresh": 52, "lastUpdated": 1442511420000, "production": "Sony Pictures Classics", "rotten": 3, "viewer": {"meter": 90, "numReviews": 32056, "rating": 3.8}}, "type": "movie", "writers": ["William Shakespeare (play)", "Kenneth Branagh (screenplay)"], "year": 1996}