{"_id": "573a13caf29313caabd7d8ea", "awards": {"nominations": 24, "text": "6 wins & 24 nominations.", "wins": 6}, "cast": ["Matthew Goode", "Bojana Novakovic", "Essie Davis", "Kerry Fox"], "countries": ["UK", "Australia"], "directors": ["Jonathan Teplitzky"], "fullplot": "Sarah Keaton has just passed away following a difficult bout of cancer. She is survived by among others her loving executive chef/restaurateur husband, Tom Keaton, and their eight year old son, Oscar Keaton. The end of the Keatons' marriage was difficult not only because of the cancer itself, but also because they had divergently different views on treatment, and because her early prognosis was positive leading to both not treating the news of her imminent death well. Tom copes recklessly, irresponsibly and angrily in his grief, manifested by among other things indiscriminate casual sex with a multitude of partners. Also negatively affected by Tom's actions is Sarah's sister, Karen, who feels she needs to be the responsible one, especially as Oscar is often a casualty of Tom's irresponsibility. Many of the Keatons' friends and colleagues try to be there for Tom in any way they can, including Miriam, a therapist who is more a friend of a friend. Tom may have to go through much pain before he and by association Oscar can emerge from their grief intact, if Tom emerges from it at all before disaster strikes in his recklessness.", "genres": ["Drama", "Romance"], "imdb": {"id": 1570559, "rating": 6.5, "votes": 2839}, "languages": ["English"], "lastupdated": "2015-09-13 00:05:31.840000000", "metacritic": 53, "num_mflix_comments": 2, "plot": "An English chef with a chic restaurant on Bondi Beach trying to put his life and his relationship with his son back on track while surrounded by women.", "poster": "https://m.media-amazon.com/images/M/MV5BOTM5MzMzODY3OF5BMl5BanBnXkFtZTcwMDI4MDk4Ng@@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 1321488000000, "runtime": 110, "title": "Burning Man", "tomatoes": {"critic": {"meter": 74, "numReviews": 23, "rating": 7.6}, "dvd": 1353974400000, "fresh": 17, "lastUpdated": 1441910051000, "production": "IFC Films", "rotten": 6, "viewer": {"meter": 64, "numReviews": 2611, "rating": 3.5}}, "type": "movie", "writers": ["Jonathan Teplitzky"], "year": 2011}