{"_id": "573a13b1f29313caabd35db2", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Salman Khan", "Shilpa Shetty", "Arbaaz Khan", "Farida Jalal"], "countries": ["India"], "directors": ["Puneet Issar"], "fullplot": "Crime has taken its toll heavily on Mumbai city; with the police force restricted by the norms of the law. Unable to witness this the police commissioner, Samar Singh decides to appeal to his superiors and seniors for permission to conduct a shoot at sight mission for all criminals. Thus Assistant Commissioner of Police Arjun Ranawat and his college Haider Ali Khan is assigned to head the crew as they go about bringing all criminals to justice. When the gangs are speculated this trigger international terrorist, Zafar Supari who takes help from a corrupt Minister Khashi Trevadi to put extreme pressure on Samar Singh. Soon Khashi Trevadi takes up the Chief Minister post forcing Samar Singh to tender his resignation with immediate effect. Then there is a show-down when inspector Haider Ali is murdered and is accused of having connection with the terrorists and ISI agents forcing Arjun to take a stand - but situations only frustrates him to the extent of revolting by murdering all corrupt high-ranking public personalities. Then Arjun is arrested by the police; his case is called up in a court of law where-by there are many charges lay on him - one of them involves having an illicit relationship with his very own sister, Rakhi Dixit. With Trevadi still in the port-folio it certainly looks like Arjun will get a life sentence.", "genres": ["Action", "Drama"], "imdb": {"id": 415003, "rating": 5.3, "votes": 1749}, "languages": ["Hindi"], "lastupdated": "2015-08-18 00:07:35.983000000", "num_mflix_comments": 1, "plot": "Crime has taken its toll heavily on Mumbai city; with the police force restricted by the norms of the law. Unable to witness this the police commissioner, Samar Singh decides to appeal to ...", "released": 1089331200000, "runtime": 162, "title": "Garv: Pride and Honour", "tomatoes": {"dvd": 1099094400000, "lastUpdated": 1441306477000, "production": "Eros Entertainment", "viewer": {"meter": 20, "numReviews": 343, "rating": 3.3}}, "type": "movie", "writers": ["Anirudh Dhodapkar (dialogue)"], "year": 2004}