{"_id": "573a13d8f29313caabda6399", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Olivia Thirlby", "Vincent Kartheiser", "Billy Campbell", "Lisa Harrow"], "countries": ["USA", "Argentina"], "directors": ["Scott Cohen"], "fullplot": "Peter and Chloe, a young married couple from New York, decide on impulse to take a belated honeymoon on-board a research vessel en route to the icy wastes of Antarctica. Not long into the journey, Chloe begins to feel neglected and betrayed by Peter, who is focused on gathering information for an article he plans to publish on their return about the work of one of their fellow passengers, the whale biologist Roger Payne. After an unforgivable betrayal of trust by Peter, Chloe turns their fledgling marriage upside down by moving into her own room and staking out her independence onboard the ship. Drawing attention to the poles within each of us, the impressionistic story oscillates between the super-confined interiors of the ship and the vast open spaces of Antarctica. In the end, it's not until Chloe and Peter are lost - perhaps literally, perhaps metaphorically - in the Antarctic ice that they discover how essential one is to the other.", "genres": ["Drama"], "imdb": {"id": 2191880, "rating": 5.1, "votes": 168}, "languages": ["English"], "lastupdated": "2015-09-06 00:05:15.777000000", "metacritic": 61, "num_mflix_comments": 2, "plot": "Peter and Chloe, a young married couple from New York, decide on impulse to take a belated honeymoon on-board a research vessel en route to the icy wastes of Antarctica. Not long into the ...", "poster": "https://m.media-amazon.com/images/M/MV5BOTcyNzY1ODczNF5BMl5BanBnXkFtZTgwMzQ3MjEyNjE@._V1_SY1000_SX677_AL_.jpg", "released": 1394841600000, "runtime": 80, "title": "Red Knot", "tomatoes": {"critic": {"meter": 86, "numReviews": 7, "rating": 6.8}, "fresh": 6, "lastUpdated": 1441907465000, "production": "Thunder Perfect Mind", "rotten": 1, "viewer": {"meter": 52, "numReviews": 106, "rating": 3}, "website": "http://redknotjourney.com/"}, "type": "movie", "writers": ["Scott Cohen (story)"], "year": 2014}