{"_id": "573a1393f29313caabcde178", "awards": {"nominations": 7, "text": "Won 3 Oscars. Another 12 wins & 7 nominations.", "wins": 15}, "cast": ["Broderick Crawford", "John Ireland", "Joanne Dru", "John Derek"], "countries": ["USA"], "directors": ["Robert Rossen"], "fullplot": "Jack Burden is a newspaper reporter who first hears of Willie Stark when his editor sends him to Kanoma County to cover the man. What's special about this nobody running for county treasurer? He's supposedly an honest man. Burden discovers this to be true when he sees Stark delivering a speech and having his son pass out handbills, while the local politicians do their best to intimidate him. Willie Stark is honest and brave. He's also a know-nothing hick whose schoolteacher wife has given him what little education he has. Stark loses the race for treasurer, but later makes his way through law school, becoming an idealistic attorney who fights for what is good. Someone in the governor's employ remembers Stark when the governor needs a patsy to run against him and split the vote of his rival. The fat cats underestimate Stark; but Jack Burden, Stark's biggest supporter, overestimates the man's idealism. To get where he wants to go, Willie Stark is willing to crack a few eggs - which include his tough-talking assistant, Sadie Burke; Jack's poised and elegant fiancèe, Anne Stanton; and even Jack Burden himself.", "genres": ["Drama"], "imdb": {"id": 41113, "rating": 7.6, "votes": 9100}, "languages": ["English"], "lastupdated": "2015-09-02 00:24:13.583000000", "num_mflix_comments": 1, "plot": "The rise and fall of a corrupt politician, who makes his friends richer and retains power by dint of a populist appeal.", "poster": "https://m.media-amazon.com/images/M/MV5BYTU2MDk0YTMtODIwYy00MmJkLThlNTUtMjZlNWNlOWQxY2IwXkEyXkFqcGdeQXVyNTY5MzgzNDU@._V1_SY1000_SX677_AL_.jpg", "rated": "APPROVED", "released": -631152000000, "runtime": 110, "title": "All the King's Men", "tomatoes": {"consensus": "Broderick Crawford is spellbinding as politician Willie Stark in director Robert Rossen's adaptation of the Robert Penn Warren novel about the corrosive effects of power on the human soul.", "critic": {"meter": 97, "numReviews": 33, "rating": 7.9}, "dvd": 991699200000, "fresh": 32, "lastUpdated": 1440613637000, "production": "Sony Pictures Home Entertainment", "rotten": 1, "viewer": {"meter": 78, "numReviews": 4724, "rating": 3.7}}, "type": "movie", "writers": ["Robert Penn Warren (based upon: the Pulitzer Prize novel \"All the King's Men\")", "Robert Rossen (written for the screen by)"], "year": 1949}