{"_id": "573a13b7f29313caabd49297", "awards": {"nominations": 1, "text": "3 wins & 1 nomination.", "wins": 3}, "cast": ["Victor Rasuk", "Richard Petrocelli", "Nicolle Rochelle", "Karen Olivo"], "countries": ["USA"], "directors": ["Alfredo Rodriguez de Villa"], "fullplot": "A meditation on isolation and intersection in the big city - the layered story of three characters who find courage to move to the next stage of life through profound encounters with strangers they meet on their daily routes. Rose, an optometrist paralyzed by crushing grief after the death of her infant, has built a wall around herself, unable to relate to her estranged husband or anyone else. When an elderly patient, a painter losing his eyesight, begins to visit her office unannounced, Rose registers how alone he is, urging him to reach out and ask for help--something neither does easily. Meanwhile Simon, a late-blooming teenager with an overbearing mother, photographs people at a distance with a borrowed long lens. One day, Rose, beautiful and melancholy in a vibrant scarf, comes into focus in his camera sight. The pictures he shoots become a conduit for each of them to touch something deep within and expand their confining existence. - Caroline Libresco", "genres": ["Drama"], "imdb": {"id": 497316, "rating": 5.5, "votes": 1410}, "languages": ["English", "Spanish"], "lastupdated": "2015-08-23 00:45:01.767000000", "plot": "The lives of three lonely strangers intersect while commuting on New York's 1 and 9 subway lines.", "poster": "https://m.media-amazon.com/images/M/MV5BMTUwMzM1OTgyOV5BMl5BanBnXkFtZTcwNDQ3OTI1MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1212710400000, "runtime": 91, "title": "Adrift in Manhattan", "tomatoes": {"critic": {"meter": 44, "numReviews": 9, "rating": 5.2}, "dvd": 1200960000000, "fresh": 4, "lastUpdated": 1440011278000, "production": "Screen Media Films", "rotten": 5, "viewer": {"meter": 34, "numReviews": 792, "rating": 3}, "website": "http://www.adriftinmanhattan.net"}, "type": "movie", "writers": ["Nat Moss (screenplay)", "Alfredo Rodriguez de Villa (based on an original story by)"], "year": 2007}