{"_id": "573a13bcf29313caabd56fc0", "awards": {"nominations": 0, "text": "2 wins.", "wins": 2}, "cast": ["Toufeeq Adonis", "Wilson Bethel", "Adrian Collins", "Scot Cooper"], "countries": ["Canada", "Germany"], "directors": ["Uwe Boll"], "fullplot": "During the Vietnam War the U.S. Army brass decides to create a special unit called the Tunnel Rats. Their main mission is to clean-up the Viet-Cong network of tunnels found in the Cu-Chi district outside the South Vietnamese capital of Saigon.The tunnels have become a major nuisance for the U.S. Forces stationed around and inside Saigon. From these tunnels the Viet-Cong can launch devastating and unexpected attacks on any nearby American base as well as on Saigon itself. After the attacks the Viet-Cong forces disappear into the extensive network of tunnels as fast as they appeared, leaving the pursuing Americans empty-handed. The first Tunnel Rats units arrive in the Cu-Chi district in 1968 and they are special-trained to fight hand-to-hand combats underground. They can only rely on a flashlight, a knife and a pistol to try to flush the enemy out. The tunnels, varying in size and length, are booby-trapped with mines and grenades, punji sticks, tripwires, poisonous snakes and enemy snipers. Arriving with his unit of Tunnel Rats Lieutenant Vic Hollowborn is trying to make some sense of this complex and nightmarish task.", "genres": ["Action", "Drama", "War"], "imdb": {"id": 970462, "rating": 4.7, "votes": 4018}, "languages": ["English", "Vietnamese"], "lastupdated": "2015-09-01 00:26:01.927000000", "num_mflix_comments": 1, "plot": "During the Vietnam War [1959-1975] a special US combat unit is sent out to hunt and kill the Viet Cong soldiers in a man-to-man combat in the endless tunnels underneath the jungle of Vietnam. Suicide squads of a special kind.", "poster": "https://m.media-amazon.com/images/M/MV5BYzIzOTcxMTAtODQ4Ni00N2M5LThjNWYtZmFiMTk3NDg0ZDU4XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1236902400000, "runtime": 96, "title": "1968 Tunnel Rats", "tomatoes": {"dvd": 1246320000000, "lastUpdated": 1442251981000, "production": "Vivendi Entertainment", "viewer": {"meter": 29, "numReviews": 2811, "rating": 2.7}}, "type": "movie", "writers": ["Dan Clarke (story)", "Uwe Boll"], "year": 2008}