{"_id": "573a13bdf29313caabd58998", "awards": {"nominations": 11, "text": "1 win & 11 nominations.", "wins": 1}, "cast": ["Sarah Jessica Parker", "Kim Cattrall", "Kristin Davis", "Cynthia Nixon"], "countries": ["USA"], "directors": ["Michael Patrick King"], "fullplot": "After moving in together in an impossibly beautiful New York apartment, Carrie Bradshaw and Mr. Big make a rather arbitrary decision to get married. The wedding itself proves to be anything but a hasty affair--the guest list quickly blooms from 75 to 200 guests, and Carrie's simple, label-less wedding gown gives way to an enormous creation that makes her look like a gigantic cream puff. An upcoming photo spread in Vogue puts the event--which will take place at the New York Public Library--squarely in the public eye. Meanwhile, Carrie's girlfriends--Samantha, the sexpot; Charlotte, the sweet naèf; and Miranda, the rigid perfectionist--could not be happier. At least, they couldn't be happier for Carrie. Charlotte still has the unrealized hope of getting pregnant. Samantha is finding a loving, committed relationship more grueling than she could have imagined. Miranda unwittingly lets her own unhappiness--created when Steve admits to cheating on her just once--spoil Carrie's. After a heated encounter with Steve, she happens to spot Mr. Big and tells him he's crazy to get married. She's really only thinking of her own marriage. But her angry remark gets Mr. Big to thinking.", "genres": ["Comedy", "Drama", "Romance"], "imdb": {"id": 1000774, "rating": 5.5, "votes": 93925}, "languages": ["English"], "lastupdated": "2015-09-03 00:30:32.443000000", "metacritic": 53, "num_mflix_comments": 3, "plot": "A New York writer on sex and love is finally getting married to her Mr. Big. But her three best girlfriends must console her after one of them inadvertently leads Mr. Big to jilt her.", "poster": "https://m.media-amazon.com/images/M/MV5BMTYyMzYxMjM3OF5BMl5BanBnXkFtZTcwNjg2OTA3MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1212105600000, "runtime": 145, "title": "Sex and the City", "tomatoes": {"boxOffice": "$152.6M", "consensus": "Sex and the City loses steam in the transition to the big screen, but will still thrill fans of the show.", "critic": {"meter": 49, "numReviews": 174, "rating": 5.5}, "dvd": 1222128000000, "fresh": 86, "lastUpdated": 1442250035000, "production": "Warner Bros. Pictures", "rotten": 88, "viewer": {"meter": 77, "numReviews": 463515, "rating": 3.8}, "website": "http://www.sexandthecitymovie.com/"}, "type": "movie", "writers": ["Michael Patrick King", "Candace Bushnell (book)", "Darren Star (television series creator)"], "year": 2008}