{"_id": "573a13a1f29313caabd0795b", "awards": {"nominations": 6, "text": "Won 1 Golden Globe. Another 3 wins & 6 nominations.", "wins": 4}, "cast": ["James Woods", "Craig T. Nelson", "Diana Scarwid", "Leon Pownall"], "countries": ["USA"], "directors": ["Frank Pierson"], "fullplot": "Fact-based story about the court proceedings that followed Cincinnati art museum director Dennis Barrie after his decision to display a controversial art exhibit by photographer Robert Mapplethorpe. The proceedings start with an inflamed County Sheriff who is determined to put Barrie in jail. A grand jury established to determine whether the sexually explicit photographs were obscene found seven of the pictures to possibly be obscene. The seven pictures depicted nude children, a man ramming his fist up another man's anus, and man with his finger in his penis. Other pictures in the exhibit did depict explicit nudity and sexual connotation. An obviously biased judge made derisive decisions throughout the trial. The strain of the trial also placed Barrie's marriage under duress, which ultimately led to his wife divorcing him, and led to Barrie's children being derided and physically attacked by their classmates.", "genres": ["Drama"], "imdb": {"id": 217363, "rating": 6.7, "votes": 699}, "languages": ["English"], "lastupdated": "2015-08-13 00:04:39.677000000", "num_mflix_comments": 2, "plot": "A Cincinnati museum director goes on trial in 1990 for exhibiting sadomasochistic photographs taken by Robert Mapplethorpe.", "poster": "https://m.media-amazon.com/images/M/MV5BMTI2MzEwNDc4OF5BMl5BanBnXkFtZTcwMjg1ODcxMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 959385600000, "runtime": 104, "title": "Dirty Pictures", "tomatoes": {"critic": {"meter": 40, "numReviews": 5, "rating": 5.3}, "dvd": 975369600000, "fresh": 2, "lastUpdated": 1435169145000, "production": "MGM Home Entertainment", "rotten": 3, "viewer": {"meter": 62, "numReviews": 169, "rating": 3.5}}, "type": "movie", "writers": ["Ilene Chaiken"], "year": 2000}