{"_id": "573a139ff29313caabd01f9e", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Giobbe Covatta", "Paolo Maria Veronica", "Emanuela Grimalda", "Felice Andreasi"], "countries": ["Italy"], "directors": ["Massimo Martelli"], "fullplot": "Eduardo, detto Dodè, e Freddi sono animatori di villaggi turistici in Africa. Durante un quantomeno avventuroso viaggio di trasferimento in aereo verso un nuovo villaggio, in compagnia di una prorompente turista, hanno un incidente e sono raccolti da padre Luca, responsabile di una missione cattolica in uno sperduto villaggio nel cuore del Kenia. La forzata convivenza con i medici e i volontari che compongono la missione e il contatto con le popolazioni locali, fanno prendere coscienza a Dodè che, da quarantenne stanco e disilluso, inizia a scoprire e capire la solidarietè e l'umanitè. La scoperta di un nuovo mondo, anche interiore, lo costringe, suo malgrado a fare delle scelte che mai avrebbe pensato di fare: quando arriva in visita il vescovo del circondario è costretto a prendere il posto di padre Luca, malato, ed affronta il potente prelato con una passione a lui sconosciuta, per esaltare le doti dei componenti la missione ed il lavoro da loro svolto. Dimostrando cosè a sè stesso ed agli altri come chiunque, a volte solo per coincidenza, puè essere migliore di quello che credeva di essere. Alla fine, Dodè decide di restare alla missione, lasciando i due amici che ritornano in patria.", "genres": ["Comedy"], "imdb": {"id": 193345, "rating": 6.1, "votes": 100}, "languages": ["Italian"], "lastupdated": "2015-05-05 23:01:52.353000000", "num_mflix_comments": 2, "plot": "Eduardo, detto Dodè, e Freddi sono animatori di villaggi turistici in Africa. Durante un quantomeno avventuroso viaggio di trasferimento in aereo verso un nuovo villaggio, in compagnia di ...", "released": 922406400000, "runtime": 100, "title": "Muzungu", "tomatoes": {"lastUpdated": 1440614934000, "viewer": {"meter": 93, "numReviews": 693, "rating": 4.3}}, "type": "movie", "writers": ["Paola Catella (story)", "Giobbe Covatta (story)", "Paola Catella", "Giobbe Covatta", "Carlo Mazzotta", "Vincenzo Salemme"], "year": 1999}