{"_id": "573a139af29313caabcef41c", "awards": {"nominations": 1, "text": "1 win & 1 nomination.", "wins": 1}, "cast": ["Johnny Morina", "Maggie Castle", "Christopher Olscamp", "Justin Borntraeger"], "countries": ["USA", "Canada"], "directors": ["Robert Tinnell"], "fullplot": "Eleven-year-old Alex and his fellow homemade heroes are having a backyard blast. Battles rage, knights fight and damsels distress in a cardboard Camelot of dirt-bike steeds, aluminum foil sabres and plastic armor. The summer fun and fantasy soon become a marvelous, mystical reality with the touch of a sword. Malcolm McDowell, Michael Ironside and bright newcomer Johnny Morina star in a modern-day adventure filled with medieval magic. One fateful afternoon, Alex comes across a sword sunk in stone - King Arthur's legendary Excalibur! The sword holds untold powers of strength, magic and wisdom. With one motion, Alex frees the sword, Merlin the Magician appears, and Alex discovers the awesome power he'd always dreamed about. But to misuse Excalibur is to lose Excalibur... as Alex soon discovers. Now with Merlin vanished, Alex must prove himself worthy of the sword to bring back the magic. He'd better act fast - his friends need his power now more than ever!", "genres": ["Adventure", "Comedy", "Family"], "imdb": {"id": 113541, "rating": 5, "votes": 257}, "languages": ["English"], "lastupdated": "2015-05-11 00:14:12.697000000", "num_mflix_comments": 2, "plot": "Eleven-year-old Alex and his fellow homemade heroes are having a backyard blast. Battles rage, knights fight and damsels distress in a cardboard Camelot of dirt-bike steeds, aluminum foil ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTEwMTM0MzI3OTheQTJeQWpwZ15BbWU3MDQzNTQ2MTE@._V1_SY1000_SX677_AL_.jpg", "rated": "UNRATED", "released": 818985600000, "runtime": 89, "title": "Kids of the Round Table", "tomatoes": {"dvd": 1159228800000, "lastUpdated": 1429122867000, "viewer": {"meter": 63, "numReviews": 76, "rating": 3.3}}, "type": "movie", "writers": ["David Sherman (screenplay)", "Robert Tinnell (based on an original story by)"], "year": 1995}