{"_id": "573a13a0f29313caabd06264", "awards": {"nominations": 1, "text": "4 wins & 1 nomination.", "wins": 4}, "cast": ["Ajay Devgn", "Pooja Bhatt", "Sonali Bendre", "Kunal Khemu"], "countries": ["India"], "directors": ["Mahesh Bhatt"], "fullplot": "Mrs. Desai is a Bombay-based widow and lives with her singer son, Ajay, his pregnant wife Sonia, and a second son, Anand, who is currently involved in a right-wing organization run by Subodh Malgaonkar. Things take a turn for the worst when militants storm the Babri Masjid in Uttar Pradesh and demolish it. Anger runs high amongst the Muslim community which lead to riots, even in far-off Bombay. The Bombay police move quickly and a curfew is imposed in the more sensitive parts such as Mohammed Ali Road, Jogeshwari, and Dharavi. It is on this day that Mrs. Desai goes to offer prayers at her usual place of worship, and it is here that she will be attacked by militants, set ablaze, admitted to the Holy Family Hospital with more than 80% burns, and virtually no chance of surviving. Ajay must now deal with conflicts with Sonia, who wants to leave India, and re-locate to England, where she wants to give birth to her child without any constraints as to religion and caste, on one hand, and on another attempt to cool a vengeful Anand into attacking other innocent Muslims. But the main thing Ajay has to do is carry out his mother's last request - to bury her - which is consistent with the Christian and Muslim religions. Ajay is the only one who knows the answer to this and must ensure that her last request is fulfilled despite of Subodh Malgaonkar's increasing pressure that his mother be cremated according to Hindu Rites.", "genres": ["Drama"], "imdb": {"id": 211126, "rating": 7.9, "votes": 1684}, "languages": ["Hindi"], "lastupdated": "2015-09-01 01:04:22.850000000", "num_mflix_comments": 2, "plot": "Amidst religious riots, a son deals with his mother's life-threatening injuries, and her last request.", "released": 913680000000, "runtime": 125, "title": "Zakhm", "tomatoes": {"dvd": 926985600000, "lastUpdated": 1442081063000, "viewer": {"meter": 83, "numReviews": 737, "rating": 3.9}}, "type": "movie", "writers": ["Mahesh Bhatt (screenplay)", "Mahesh Bhatt (story)", "Tanuja Chandra (screenplay)", "Girish Dhamija (dialogue)"], "year": 1998}