{"_id": "573a13b9f29313caabd4e88a", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Sophie Marceau", "Julie Depardieu", "Marie Gillain", "Dèborah Franèois"], "countries": ["France"], "directors": ["Jean-Paul Salomè"], "fullplot": "In 1944, in London, Lieutenant Pierre Desfontaines assigns his sister Louise Desfontaines to convince three other women to form a five-woman task force under his command to rescue a British geologist from a German hospital in the countryside. The geologist was assigned by Colonel Maurice Buckmaster in a reconnaissance mission of the soil of the beaches at Normandy for the D-Day and had been captured by the Germans. Louise and Pierre force the prostitute Jeanne Faussier that is imprisoned for murdering her pimp; the explosives expert Gaèlle Lemenech that misses action; and the former dancer and fiancè of Colonel Karl Heindrich, Suzy Desprez, using blackmail and unethical methods to fly to France and join the Italian agent Maria Luzzato in the assignment. They are well-succeeded but when they deliver the geologist to the British aeroplane, Pierre betrays the group. He forces the women to travel to Paris to kill Colonel Heindrich who suspects that the landing of the allied forces will be through Normandy, in a dangerous mission.", "genres": ["Drama", "War"], "imdb": {"id": 824330, "rating": 6.8, "votes": 5442}, "languages": ["French", "German", "English"], "lastupdated": "2015-09-10 17:37:26.187000000", "num_mflix_comments": 2, "plot": "In 1944, in London, Lieutenant Pierre Desfontaines assigns his sister Louise Desfontaines to convince three other women to form a five-woman task force under his command to rescue a British...", "poster": "https://m.media-amazon.com/images/M/MV5BMTQ1ODg3ODIzN15BMl5BanBnXkFtZTcwNDEwMzc1MQ@@._V1_SY1000_SX677_AL_.jpg", "released": 1204675200000, "runtime": 117, "title": "Female Agents", "tomatoes": {"critic": {"meter": 71, "numReviews": 7, "rating": 6}, "dvd": 1239062400000, "fresh": 5, "lastUpdated": 1439925902000, "production": "TFM Distribution", "rotten": 2, "viewer": {"meter": 70, "numReviews": 2622, "rating": 3.5}, "website": "http://www.tfmdistribution.com/lesfemmesdelombre/"}, "type": "movie", "writers": ["Jean-Paul Salomè", "Laurent Vachaud"], "year": 2008}