{"_id": "573a13abf29313caabd23f11", "awards": {"nominations": 0, "text": "2 wins.", "wins": 2}, "cast": ["Gil Bellows", "Jennifer Westfeldt", "Christian Kane", "Kim Raver"], "countries": ["USA"], "directors": ["Stu Pollard"], "fullplot": "In the perfectly normal town of Louisville, KY, there is a perfectly normal man living the perfect life. David Dailey is a man who has it all: A great career, a community that adores him, and an enduring marriage. But beneath the surface, David's idyllic world is crumbling. He's haunted by a series of mysterious notes that warn of an imminent fall from grace. His sultry wife Susan is hell-bent on expanding the horizons of their sex life - with or without him. His longtime assistant Whit is gunning for his job. And he finds himself increasingly attracted to Melody Carpenter, a curious stranger he instinctively trusts because she doesn't know him well enough to betray him. Complicating matters, Melody's jilted boyfriend Sean, a charming and talented trust fund baby, regards David and Melody's fledgling friendship with contempt. As his jealousy seethes deeper, he concocts a devious plan to win her back, unaware his overly protective father has ordered his number one ally to keep an eye on everyone involved. As David and Melody grow closer, they discover they have much in common - including the maddening suspicion they're each being stalked - and are plunged into a harrowing web of desire, deceit, and paranoia. Suddenly, the man everyone loves fears everyone has a reason to bring him down. As his perfect life veers further and further off course, David is about to learn that the biggest danger of having it all is having everything to lose.", "genres": ["Drama", "Mystery", "Romance"], "imdb": {"id": 337656, "rating": 5.4, "votes": 1063}, "languages": ["English"], "lastupdated": "2015-09-17 02:12:17.100000000", "num_mflix_comments": 2, "plot": "In the perfectly normal town of Louisville, KY, there is a perfectly normal man living the perfect life. David Dailey is a man who has it all: A great career, a community that adores him, ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTQ4MDAyMTExMV5BMl5BanBnXkFtZTcwNTg0MTEzMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1123804800000, "runtime": 94, "title": "Keep Your Distance", "tomatoes": {"dvd": 1141084800000, "lastUpdated": 1440529143000, "viewer": {"meter": 22, "numReviews": 383, "rating": 2.9}, "website": "http://www.monarchhomeent.com/"}, "type": "movie", "writers": ["Stu Pollard"], "year": 2005}