{"_id": "573a1395f29313caabce23b5", "awards": {"nominations": 0, "text": "Nominated for 7 Oscars. Another 5 wins.", "wins": 12}, "cast": ["Bette Davis", "Olivia de Havilland", "Joseph Cotten", "Agnes Moorehead"], "countries": ["USA"], "directors": ["Robert Aldrich"], "fullplot": "Aged and wealthy Charlotte Hollis has lived alone and as a recluse in the crumbling family plantation mansion in Hollisport, Louisiana since her father Sam Hollis' death thirty-six years ago. The only people who regularly see her are her hard-as-nails but seemingly loyal housekeeper Velma Crowther, and her longtime friend and physician, Dr. Drew Bayliss. She has lived there the better part of her life except for a short stint in London thirty-seven years ago following the vicious murder of her married lover, John Mayhew, at the plantation's summer house while Sam was hosting one of his legendary grand balls in the mansion. That evening, she and John were going to run off together, that is before he was bludgeoned to death, his right hand and head which were never found. No one was ever convicted for his murder, but most people believe Charlotte did it after John changed his mind about running off with her. Not having seen her in years, they also now believe Charlotte is a crazy old woman, her mental state which turned at or before the murder. Conversely, Charlotte has hidden away as she fears people would always be glaring at her. She also believes any bad thing that has happened to her following John's murder has been initiated by John's widow, Jewel Mayhew, who Charlotte blames for orchestrating the expropriation of her property to build a bridge across the lake. Charlotte is surprised that her younger cousin, Miriam Deering, who left the area years ago never to have returned and who was once Drew's romantic interest, has accepted her invitation to stay at the mansion. While Charlotte wanted Miriam to help her overturn the expropriation with the state government in Baton Rouge, Miriam has instead come to help Charlotte pack her belongings. Miriam's visit coincides with the arrival to Hollisport of insurance investigator Harry Willis, who has always had an interest in this case in why the insurance was never claimed. Not expecting to find anything earth shattering while not wanting to upset the apple cart, he doesn't let anyone know except Sheriff Luke Standish the true nature of his visit. These visits also coincide with Charlotte's mental state seemingly going into decline, perhaps concerning having to leave her family home, but the issues which are always around John's murder. Or is someone or some people trying to drive her crazy if she is not so already? If the latter, the truth behind who killed John and why may finally come to light to those who matter.", "genres": ["Mystery", "Thriller"], "imdb": {"id": 58213, "rating": 7.7, "votes": 7899}, "languages": ["English"], "lastupdated": "2015-08-25 00:09:15.713000000", "num_mflix_comments": 2, "plot": "An aging, reclusive southern belle, plagued by a horrifying family secret, descends into madness after the arrival of a lost relative.", "poster": "https://m.media-amazon.com/images/M/MV5BMzU4YjNlNGUtN2ZkNy00OTkwLTkyMWUtZmZiNDMzNDA4N2ZkXkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_SY1000_SX677_AL_.jpg", "rated": "UNRATED", "released": -158457600000, "runtime": 133, "title": "Hush...Hush, Sweet Charlotte", "tomatoes": {"critic": {"meter": 85, "numReviews": 20, "rating": 7.4}, "dvd": 1123545600000, "fresh": 17, "lastUpdated": 1440346920000, "production": "Fox", "rotten": 3, "viewer": {"meter": 85, "numReviews": 7944, "rating": 3.8}}, "type": "movie", "writers": ["Henry Farrell (screenplay)", "Lukas Heller (screenplay)", "Henry Farrell (story)"], "year": 1964}