{"_id": "573a13c1f29313caabd64e11", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Emraan Hashmi", "Sonal Chauhan", "Shakeel Khan", "Sameer Kochhar"], "countries": ["India"], "directors": ["Kunal Deshmukh"], "fullplot": "Arjun is a reckless young man with an obsession for making money at card games. A chance meeting with a girl in a mall, Zoya, gives him the reasons he was looking for the move out of his ordinary life. He steps up from playing small-time card games to becoming a bookie. Stuck in a triangle of sorts between the woman he loves and his addiction to make a quick buck, Arjun moves on from being a bookie to a runner for the mafia. He steps into the world of match fixing. Arjun switches on the limelight to bigger, better, faster, more, until his dizzying rise attracts the attention of the police. Arjun has to now choose between the love of his life, Zoya, and this new found success and power. As Arjun struggles to choose between the two, the Don offers the forbidden apple of limitless wealth in exchange for his soul and draws him into his core entourage of money spinners. How far will the horizon of reality stretch as Arjun and Zoya tread a fine, fast-blurring line between right and wrong to find the heaven they have been looking for?", "genres": ["Crime", "Drama", "Romance"], "imdb": {"id": 1216300, "rating": 6.7, "votes": 3169}, "languages": ["Hindi"], "lastupdated": "2015-09-07 00:19:30.023000000", "num_mflix_comments": 1, "plot": "Arjun is a reckless young man with an obsession for making money at card games. A chance meeting with a girl in a mall, Zoya, gives him the reasons he was looking for the move out of his ...", "released": 1210896000000, "title": "Jannat: In Search of Heaven...", "tomatoes": {"dvd": 1225152000000, "lastUpdated": 1442082917000, "viewer": {"meter": 62, "numReviews": 3168, "rating": 3.7}}, "type": "movie", "writers": ["Vishesh Bhatt (screenplay)", "Kunal Deshmukh (story)", "Sanjay Masoom (dialogue)"], "year": 2008}