{"_id": "573a1392f29313caabcdaf58", "awards": {"nominations": 1, "text": "1 win & 1 nomination.", "wins": 1}, "cast": ["Irene Dunne", "Allan Jones", "Charles Winninger", "Paul Robeson"], "countries": ["USA"], "directors": ["James Whale"], "fullplot": "Adaptation of the Broadway musical. Magnolia Hawks is the lovely but protected, and thus very naive, daughter of Cap'n Andy Hawks, the genial proprietor of a show boat that cruises the Missisippi, and his nagging wife, Parthy. She is best friends with the show boat's star, Julie LaVerne, but Julie and her husband Steve are forced to leave when it is revealed that Julie has \"Negro\" blood in her, thereby breaking the state law by being married to the white Steve. Magnolia replaces Julie as the show boat's female star, and the show's new male star is the suave gambler Gaylord Ravenal. \"Nola\" and Gaylord fall in love and marry against Parthy's wishes. They and their young daughter lead the high life when Gaylord is lucky in gambling, but live like dirt when he's unlucky. During one such unlucky streak, a broken Gaylord leaves Nola, and she is forced to start over by returning to the stage. Like Old Man River, as the famous song from this show goes, she just keeps rollin' along.", "genres": ["Comedy", "Drama", "Musical"], "imdb": {"id": 28249, "rating": 7.7, "votes": 2027}, "languages": ["English"], "lastupdated": "2015-08-19 00:41:33.093000000", "plot": "Despite her mother's objections, the naive young daughter of a show boat captain is thrust into the limelight as the company's new leading lady.", "poster": "https://m.media-amazon.com/images/M/MV5BODkwOTg5MTg1M15BMl5BanBnXkFtZTgwNjAwMzQwMjE@._V1_SY1000_SX677_AL_.jpg", "rated": "APPROVED", "released": -1061164800000, "runtime": 113, "title": "Show Boat", "tomatoes": {"critic": {"meter": 100, "numReviews": 9, "rating": 9.2}, "fresh": 9, "lastUpdated": 1437503868000, "rotten": 0, "viewer": {"meter": 74, "numReviews": 971, "rating": 3.7}}, "type": "movie", "writers": ["Edna Ferber", "Oscar Hammerstein II (stage play)", "Oscar Hammerstein II (screen play)"], "year": 1936}