{"_id": "573a1395f29313caabce127e", "awards": {"nominations": 2, "text": "Nominated for 1 BAFTA Film Award. Another 1 win & 2 nominations.", "wins": 2}, "cast": ["Iya Savvina", "Aleksey Batalov", "Nina Alisova", "Panteleymon Krymov"], "countries": ["Soviet Union"], "directors": ["Iosif Kheifits"], "fullplot": "In the Nineteenth Century, at the seaside resort of Yalta, the upper class Dimitri Gurov from Moscow meets Anna Sergeyovna walking with her little dog. Both have unhappy marriages: Dimitri has a marriage of convenience arranged by the family when he was a college boy and Anna married a lackey for love that has gone, and they have a love affair. When Anna returns to Saratov and Dimitri to Moscow, he has a boring life at home, spending his time working and going to the club after hours alone to drink and play cards with his friends. On Christmas, Dimitri misses Anna and lies to his wife, telling that he has a business trip to Saint Petersburg. However, he heads to Saratov and he meets Anna in the Opera House with her husband. Their love kindles and Anna promises to meet him in Moscow. In a period when divorce would be unthinkable, Anna and Dimitri are doomed to meet each other in hotel rooms.", "genres": ["Drama", "Romance"], "imdb": {"id": 53746, "rating": 7.4, "votes": 622}, "languages": ["Russian"], "lastupdated": "2015-09-05 00:48:18.993000000", "plot": "In the Nineteenth Century, at the seaside resort of Yalta, the upper class Dimitri Gurov from Moscow meets Anna Sergeyovna walking with her little dog. Both have unhappy marriages: Dimitri ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTYyNjMyNzUwOV5BMl5BanBnXkFtZTcwMDA5NzMwMg@@._V1_SY1000_SX677_AL_.jpg", "released": -313286400000, "runtime": 89, "title": "The Lady with the Dog", "tomatoes": {"dvd": 1227571200000, "lastUpdated": 1437419467000, "production": "Artkino Pictures", "viewer": {"meter": 82, "numReviews": 90, "rating": 3.7}}, "type": "movie", "writers": ["Anton Chekhov (short story \"Dama s sobachkoy\")", "Iosif Kheifits"], "year": 1960}