{"_id": "573a13a4f29313caabd1083a", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Misato Tanaka", "Shèsuke Tanihara", "Masatè Ibu", "Yuriko Hoshi"], "countries": ["Japan"], "directors": ["Masaaki Tezuka"], "fullplot": "Godzilla returns to terrorize Japan! This time, however, Japan has two new weapons to defend themselves. The Gryphon, a high-tech ship, and the Dimension Tide, a device that creates artificial black holes! During a test of the Dimension Tide, eggs appear in the city of Shibuya and hatch into terrifying Meganurons! These creatures need water to grow and flood the city of Shibuya by breaking underground water veins. As they multiply and grow, they start to feed on the energy of humans. After gathering enough energy, they transform in to giant dragonfly monsters called Meganuras! And now they target Godzilla for energy to feed to the larva of their queen, which eventually hatches into the terrifying 60-meter Megaguirus who also begins to attack Godzilla for his energy. Now a 3-way battle between Godzilla, the Megaguirus, and humans begins! Will Godzilla win? Will humanity survive?", "genres": ["Action", "Horror", "Sci-Fi"], "imdb": {"id": 255198, "rating": 6.3, "votes": 1820}, "languages": ["Japanese"], "lastupdated": "2015-08-22 01:02:01.343000000", "num_mflix_comments": 2, "plot": "Japan creates an artificial black hole device to trap Godzilla forever, but a test of the device creates new foes for Godzilla, car-sized dragonflies called meganula and their queen, Megaguirus.", "poster": "https://m.media-amazon.com/images/M/MV5BMTFiMTkyMGUtOTI1Ny00ZDZjLTlkYTItOTdmNDlmNjA3YzRmXkEyXkFqcGdeQXVyNjQ2MzU1NzQ@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 976924800000, "runtime": 105, "title": "Godzilla vs. Megaguirus", "tomatoes": {"dvd": 1075161600000, "lastUpdated": 1439751778000, "production": "Sony Pictures Home Entertainment", "viewer": {"meter": 50, "numReviews": 6795, "rating": 3.2}}, "type": "movie", "writers": ["Hiroshi Kashiwabara", "Wataru Mimura"], "year": 2000}