{"_id": "573a13b0f29313caabd32cc9", "awards": {"nominations": 6, "text": "1 win & 6 nominations.", "wins": 1}, "cast": ["Hringur Ingvarsson", "Spencer Wilding", "Stellan Skarsgèrd", "Ingvar Eggert Sigurèsson"], "countries": ["Canada", "UK", "Iceland", "USA", "Australia"], "directors": ["Sturla Gunnarsson"], "fullplot": "The blood-soaked tale of a Norse warrior's battle against the great and murderous troll, Grendel. Out of allegiance to the King Hrothgar, the much respected Lord of the Danes, Beowulf leads a troop of warriors across the sea to rid a village of the marauding monster. The monster, Grendel, is not a creature of mythic powers, but one of flesh and blood - immense flesh and raging blood, driven by a vengeance from being wronged, while Beowulf, a victorious soldier in his own right, has become increasingly troubled by the hero-myth rising up around his exploits. Beowulf's willingness to kill on behalf of Hrothgar wavers when it becomes clear that the King is more responsible for the troll's rampages than was first apparent. As a soldier, Beowulf is unaccustomed to hesitating. His relationship with the mesmerizing witch, Selma, creates deeper confusion. Swinging his sword at a great, stinking beast is no longer such a simple act. The story is set in barbarous Northern Europe where the reign of the many-gods is giving way to one - the southern invader, Christ. Beowulf is a man caught between sides in this great shift, his simple code transforming and falling apart before his eyes. Vengeance, loyalty and mercy powerfully entwine. A story of blood and beer and sweat, which strips away the mask of the hero-myth, leaving a raw and tangled tale.", "genres": ["Action", "Adventure", "Drama"], "imdb": {"id": 402057, "rating": 5.9, "votes": 15496}, "languages": ["English", "Latin", "Icelandic"], "lastupdated": "2015-08-28 00:48:49.660000000", "metacritic": 53, "num_mflix_comments": 3, "plot": "In Denmark, during the 6th century, Danish king Hrothgar and his warriors kill a troll whose son, Grendel, vows revenge.", "poster": "https://m.media-amazon.com/images/M/MV5BMTM4MjM0NTA3Ml5BMl5BanBnXkFtZTcwMjI3NjIzMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1141862400000, "runtime": 103, "title": "Beowulf & Grendel", "tomatoes": {"consensus": "Despite the impressive Icelandic scenery, Beowulf And Grendel fails to find its footing in the transition from epic tale to the big screen.", "critic": {"meter": 48, "numReviews": 33, "rating": 5.4}, "dvd": 1159228800000, "fresh": 16, "lastUpdated": 1440356961000, "production": "Union Station Media", "rotten": 17, "viewer": {"meter": 40, "numReviews": 26531, "rating": 2.9}, "website": "http://www.beowulf-movie.com"}, "type": "movie", "writers": ["Anonymous (epic poem \"Beowulf\")", "Andrew Rai Berzins"], "year": 2005}