{"_id": "573a1399f29313caabcedfb0", "awards": {"nominations": 9, "text": "3 wins & 9 nominations.", "wins": 3}, "cast": ["Sharon Stone", "William Baldwin", "Tom Berenger", "Polly Walker"], "countries": ["USA"], "directors": ["Phillip Noyce"], "fullplot": "Carly Norris is a book editor living in New York City who moves into the Sliver apartment building. In the apartment building, Carly meets two of her new neighbors, author Jack Lansford who writes thriller novels and Zeke Hawkins, the handsome owner of the apartment building. Carly finds that some of the women living in the apartment building have been murdered and the police suspect that there is a serial killer in the apartment building. Carly has a passionate and seductive love affair with Zeke, unaware Zeke has secretly wired the apartment building with hidden cameras and he has been watching the lives of each tenant living in the apartment building including Carly. Carly begins to suspect Zeke or Jack may be the serial killer responsible for the murders in the apartment building and she may be the killer's next victim.", "genres": ["Thriller"], "imdb": {"id": 108162, "rating": 4.9, "votes": 21381}, "languages": ["English"], "lastupdated": "2015-08-28 00:15:56.440000000", "plot": "Carly Norris is a book editor living in New York City who moves into the Sliver apartment building. In the apartment building, Carly meets two of her new neighbors, author Jack Lansford who...", "poster": "https://m.media-amazon.com/images/M/MV5BYWM4NTI2N2MtMWY2Mi00YzUwLTg4MDEtOWRjMTY4Njg0MDU4XkEyXkFqcGdeQXVyNjQ2MjQ5NzM@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 737942400000, "runtime": 108, "title": "Sliver", "tomatoes": {"critic": {"meter": 12, "numReviews": 26, "rating": 3.6}, "dvd": 1143504000000, "fresh": 3, "lastUpdated": 1440439939000, "production": "Paramount Home Video", "rotten": 23, "viewer": {"meter": 29, "numReviews": 17348, "rating": 2.5}}, "type": "movie", "writers": ["Ira Levin (novel)", "Joe Eszterhas (screenplay)"], "year": 1993}