{"_id": "573a13e4f29313caabdc1c12", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Alex Ivanovici", "Howard Donahue", "Colin McLaren", "Colleen Lorenzen"], "countries": ["Canada"], "directors": ["Malcolm Mcdonald"], "fullplot": "Seventy-five percent of the American people still refuse to believe the official story of President John F. Kennedy's death. They do not think he was killed by a lone gunman but by a mysterious cabal that somehow conspired to have him killed. How can this be? How can a crime this famous, witnessed and investigated by so many, remain a mystery? This is what veteran Australian police detective Colin McLaren is determined to find out. JFK: The Smoking Gun follows the forensic cold-case investigation McLaren conducted over four painstaking years, taking us back to that tragic day in Dallas at Dealey Plaza where the shooting took place, to Parkland Hospital where the president was pronounced dead, to the Bethesda Naval Hospital where the autopsy was conducted and to the conclusions of the Warren Commission that have remained controversial to this day. Driven by a seasoned police detective who, thanks to modern technology, finally had access to all the facts and to witness testimony, the documentary uses logic, reason and time-tested investigative techniques to solve a crime that is every bit as shocking and incredible today as it was when it first happened 50 years ago. Colin McLaren believes he has found \"the smoking gun\" that killed JFK. Once you've seen this film, he's confident you will believe it, too.", "genres": ["Documentary"], "imdb": {"id": 2945784, "rating": 7.3, "votes": 382}, "languages": ["English"], "lastupdated": "2015-08-18 00:27:00.970000000", "num_mflix_comments": 1, "plot": "Australian detective Colin McLaren investigates the JFK assassination using ballistics expert Howard Donahue's evidence of a second shooter in Dealey Plaza.", "poster": "https://m.media-amazon.com/images/M/MV5BOTA1MzAwMjExMF5BMl5BanBnXkFtZTgwMzExMjIzMDE@._V1_SY1000_SX677_AL_.jpg", "released": 1384560000000, "runtime": 120, "title": "JFK: The Smoking Gun", "tomatoes": {"dvd": 1394409600000, "lastUpdated": 1441219786000, "production": "Cinedigm", "viewer": {"meter": 73, "numReviews": 39, "rating": 3.9}}, "type": "movie", "writers": ["Steve Lucas"], "year": 2013}