{"_id": "573a1395f29313caabce2147", "awards": {"nominations": 18, "text": "Won 4 Oscars. Another 18 wins & 18 nominations.", "wins": 22}, "cast": ["George Devine", "Rachel Kempson", "Angela Baddeley", "Joyce Redman"], "countries": ["UK"], "directors": ["Tony Richardson"], "fullplot": "In eighteenth century England, \"first cousins\" Tom Jones and Master Blifil grew up together in privilege in the western countryside, but could not be more different in nature. Tom, the bastard son of one of Squire Allworthy's servants Jenny Jones and the local barber Partridge, was raised by virtuous Allworthy as his own after he sent Jenny away. Tom is randy, chasing anything in a skirt, he's having a sexual relationship on the sly with Molly Seagrim, the peasant daughter of Allworthy's gamekeeper. Tom is nonetheless kind-hearted and good-natured, he who is willing to defend that and those in which he believes. Blifil, on the other hand, is dour, and although outwardly pious, is cold-hearted and vengeful. Despite his randiness, Tom eventually falls in love with Sophie Western, who has just returned to the area after a few years abroad. Despite Sophie's love for Tom, Squire Western and his spinster sister would rather see Sophie marry Blifil rather than a bastard, who Western nonetheless liked before he knew that Tom liked Sophie. Based on half truths, Tom, out of circumstance, is forced to leave his home and strike out on his own in London. While Sophie sneaks away in search of Tom, and Squire Western and Miss Western go off in search of Sophie, Tom gets into one misadventure after another on his way to London, some involving his randiness, and some which will reveal certain aspects of his life previously unknown to him. Through it all, Sophie, deep down, is never far from his mind, even when his life is in danger.", "genres": ["Adventure", "Comedy", "History"], "imdb": {"id": 57590, "rating": 6.8, "votes": 7853}, "languages": ["English"], "lastupdated": "2015-09-10 17:54:26.120000000", "num_mflix_comments": 4, "plot": "In eighteenth century England, \"first cousins\" Tom Jones and Master Blifil grew up together in privilege in the western countryside, but could not be more different in nature. Tom, the ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTUxMzgwODM5N15BMl5BanBnXkFtZTcwNTExNDY3NA@@._V1_SY1000_SX677_AL_.jpg", "rated": "UNRATED", "released": -191203200000, "runtime": 128, "title": "Tom Jones", "tomatoes": {"consensus": "A frantic, irreverent adaptation of the novel, bolstered by Albert Finney's courageous performance and arresting visuals.", "critic": {"meter": 83, "numReviews": 30, "rating": 7.9}, "dvd": 878169600000, "fresh": 25, "lastUpdated": 1440612175000, "production": "Woodfall Film Productions", "rotten": 5, "viewer": {"meter": 60, "numReviews": 5362, "rating": 3.3}}, "type": "movie", "writers": ["John Osborne (screenplay)", "Henry Fielding (novel)"], "year": 1963}