{"_id": "573a13aef29313caabd2cfd7", "awards": {"nominations": 2, "text": "2 nominations.", "wins": 0}, "cast": ["Bruce Greenwood", "Hayden Panettiere", "Caspar Poyck", "Gary Bullock"], "countries": ["USA"], "directors": ["Frederik Du Chau"], "fullplot": "In the middle of a raging thunderstorm, a traveling circus accidentally leaves behind some very precious cargo--a baby zebra. The gangly little foal is rescued by horse farmer Nolan Walsh, who takes him home to his young daughter Channing. Once a champion thoroughbred trainer, Walsh has given up horse training for a quiet life with Channing on their modest Kentucky farm. The little zebra, or \"Stripes,\" as Channing calls him, is soon introduced to the farm's misfit troupe of barnyard residents, led by a cranky Shetland Pony named Tucker and Franny, a wise old goat who keeps the family in line. The group is joined by Goose, a deranged big-city pelican who's hiding out in the sticks until the heat dies down in Jersey. The un-aptly named bloodhound Lightening keeps a lazy eye on goings-on at the farm - in between naps. The Walsh farm borders the Turfway Racetrack, where highly skilled thoroughbreds compete for horse racing's top honor, the ultra-prestigious Kentucky Crown. From the first moment Stripes lays eyes on the track, he's hooked--he knows that if he could just get the chance, he could leave all those other horses in the dust. What he doesn't know is--he's not exactly a horse. But with characteristic zeal, he devotes himself to training for the big time, with a little help from Tucker, who has coached a host of champion racehorses in the past.", "genres": ["Adventure", "Comedy", "Drama"], "imdb": {"id": 376105, "rating": 5.2, "votes": 11594}, "languages": ["English"], "lastupdated": "2015-09-01 00:32:03.537000000", "metacritic": 43, "num_mflix_comments": 3, "plot": "An abandoned zebra (voice of Frankie Muniz) grows up believing he is a racehorse, and, with the help of his barnyard friends and a teenage girl (Hayden Panettiere), sets out to achieve his dream of racing with thoroughbreds.", "poster": "https://m.media-amazon.com/images/M/MV5BMjE0NDA2MTQwM15BMl5BanBnXkFtZTcwMzYxNDcyMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 1105660800000, "runtime": 102, "title": "Racing Stripes", "type": "movie", "writers": ["David Schmidt (story)", "Steven P. Wegner (story)", "Kirk De Micco (story)", "Frederik Du Chau (story)", "David Schmidt (screenplay)"], "year": 2005}