{"_id": "573a1398f29313caabcebd69", "awards": {"nominations": 9, "text": "1 win & 9 nominations.", "wins": 1}, "cast": ["Donald Sutherland", "Helen Mirren", "Helen Shaver", "Colm Feore"], "countries": ["Canada", "China", "France"], "directors": ["Phillip Borsos"], "fullplot": "Bethune has long been a hero in China. Perhaps for reasons of politics and personality, however, his fame in North America lagged far behind. The film explores the complexity of a character who could be narcissistic, petty, and cruel with those who loved him, yet capable of heroic generosity and creativity for those whom he scarcely knew. It was a Canada-China-France co-production, which by the time of its release had become the most expensive movie ever made in Canada. The production had been dogged by controversy over funding, politics, location, revenue, and a dispute over the script between the author, who had been with Bethune in Spain, and the leading actor who had already played Bethune in other venues. Some scenes are tinged with humor and Bethune's speeches about universal access to humane medicine have an uncanny appeal more than half a century later. With its beautiful backdrop of Chinese landscapes, Montreal snow, and 1930s nostalgia, the film is an evocative memorial to a fascinating figure in surgery's past. Medical students love it. Director Philip Borsos Leading Actors Anouk Aimee, Helen Mirren, Donald Sutherland Studio Telefilm Canada, Canadian Broadcasting Corporation, FR3 TV France, China Film Co-production Year 1990 Color/BW Color Running Time 116 minutes", "genres": ["Biography", "Drama", "Romance"], "imdb": {"id": 99127, "rating": 6.8, "votes": 268}, "languages": ["English"], "lastupdated": "2015-09-17 02:59:57.810000000", "num_mflix_comments": 2, "plot": "Bethune has long been a hero in China. Perhaps for reasons of politics and personality, however, his fame in North America lagged far behind. The film explores the complexity of a character...", "poster": "https://m.media-amazon.com/images/M/MV5BMTM3NjQzMTcwMl5BMl5BanBnXkFtZTcwMjY3MzgxMQ@@._V1_SY1000_SX677_AL_.jpg", "released": 748224000000, "runtime": 115, "title": "Bethune: The Making of a Hero", "tomatoes": {"lastUpdated": 1431022098000, "production": "Wellspring Media Inc.", "viewer": {"meter": 0, "numReviews": 97, "rating": 2.5}}, "type": "movie", "writers": ["Ted Allan (novel)", "Ted Allan (screenplay)"], "year": 1990}