{"_id": "573a13b2f29313caabd3a2e6", "awards": {"nominations": 5, "text": "4 wins & 5 nominations.", "wins": 4}, "cast": ["Harriet Minto-Day", "Jay Laga'aia", "Damien Garvey", "Sahaj Dumpleton"], "countries": ["Australia", "USA"], "directors": ["Michael Spierig", "Peter Spierig"], "fullplot": "In a world 10 years into the future, vampires make up the vast majority of the population with only 5% of the human race remaining. This presents particular challenges as the vampires' food supply - human blood - is dwindling and rationing is now the norm. There is growing evidence that vampires deprived of an adequate blood supply are themselves evolving into wild, vile creatures that attack anyone and anything in order to survive. Dr. Edward Dalton, a vampire and hematologist who works for a pharmaceutical firm, has been working on finding an artificial blood supply that will meet the vampire society's needs. He is sympathetic to humans and sees his work as a way of alleviating their suffering but his views on finding a solution change considerably when he meets someone who found a way to transform himself from being a vampire to again take human form.", "genres": ["Action", "Fantasy", "Horror"], "imdb": {"id": 433362, "rating": 6.5, "votes": 99772}, "languages": ["English"], "lastupdated": "2015-09-04 00:18:19.803000000", "metacritic": 57, "num_mflix_comments": 4, "plot": "In the year 2019, a plague has transformed almost every human into vampires. Faced with a dwindling blood supply, the fractured dominant race plots their survival; meanwhile, a researcher works with a covert band of vamps on a way to save humankind.", "poster": "https://m.media-amazon.com/images/M/MV5BNzg3NDYyMDU4Nl5BMl5BanBnXkFtZTcwODA5NzA5Mg@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1262908800000, "runtime": 98, "title": "Daybreakers", "tomatoes": {"boxOffice": "$30.0M", "consensus": "Though it arrives during an unfortunate glut of vampire movies, Daybreakers offers enough dark sci-fi thrills -- and enough of a unique twist on the genre -- to satisfy filmgoers.", "critic": {"meter": 67, "numReviews": 141, "rating": 6.1}, "dvd": 1273536000000, "fresh": 94, "lastUpdated": 1442165528000, "production": "Lionsgate", "rotten": 47, "viewer": {"meter": 49, "numReviews": 208759, "rating": 3.2}, "website": "http://www.daybreakersmovie.com/"}, "type": "movie", "writers": ["Michael Spierig", "Peter Spierig"], "year": 2009}