{"_id": "573a1396f29313caabce4b17", "awards": {"nominations": 1, "text": "1 win & 1 nomination.", "wins": 1}, "cast": ["Robert Redford", "Will Geer", "Delle Bolton", "Josh Albee"], "countries": ["USA"], "directors": ["Sydney Pollack"], "fullplot": "During the mid-nineteenth century, Jeremiah Johnson, after a stint in the US Army, decides that he would prefer a life of solitude and more importantly peace by living with nature in the mountains of the frontier of the American west. This plan entails finding a piece of land upon which to build a house. This quest ends up being not quite what he envisioned as he does require the assistance of others to find his footing, and in turn he amasses friends and acquaintances along the way, some who become more a part of his life than he would have imagined. Perhaps most importantly, some of those people provide him with the knowledge of how to co-exist with some of the many Indian tribes, most importantly the Crow, on whose land in Colorado Jeremiah ultimately decides to build his home. But an act by Jeremiah upon a request by the US Cavalry leads to a chain of events that may forever change the peaceful relationship he worked so hard to achieve with his neighbors and their land.", "genres": ["Adventure", "Drama", "Western"], "imdb": {"id": 68762, "rating": 7.6, "votes": 19816}, "languages": ["English", "Crow", "French"], "lastupdated": "2015-08-18 00:48:34.907000000", "num_mflix_comments": 2, "plot": "A mountain man who wishes to live the life of a hermit becomes the unwilling object of a long vendetta by Indians, and proves to be a match for their warriors in one-on-one combat on the early frontier.", "poster": "https://m.media-amazon.com/images/M/MV5BYzE0NWI0ZDctYjkwNi00YTM3LWI4MjYtZGRlN2JiMjZmYzY3XkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 84931200000, "runtime": 108, "title": "Jeremiah Johnson", "tomatoes": {"critic": {"meter": 93, "numReviews": 14, "rating": 7.1}, "dvd": 878169600000, "fresh": 13, "lastUpdated": 1440180947000, "production": "Warner Home Video", "rotten": 1, "viewer": {"meter": 89, "numReviews": 12581, "rating": 3.9}}, "type": "movie", "writers": ["Vardis Fisher (novel)", "Raymond W. Thorp (story)", "Robert Bunker (story)", "John Milius (screenplay)", "Edward Anhalt (screenplay)"], "year": 1972}