{"_id": "573a13b4f29313caabd41efb", "awards": {"nominations": 7, "text": "6 wins & 7 nominations.", "wins": 6}, "cast": ["Tantoo Cardinal", "Na'Ku'Set Shepherd", "Tinsel Korey", "Michelle Thrush"], "countries": ["Canada"], "directors": ["Carl Bessai"], "fullplot": "Returning to her hometown of Vancouver on the news that her Caucasian father is on his deathbed, Rebecca learns from him before he dies that her aboriginal mother, Rita, did not abandon them twenty-five years ago because Rita did not love Rebecca as he had always told her, but rather he forced Rita to leave. As such, Rebecca goes on a search for Rita through Vancouver's notorious downtown eastside, where over the years many aboriginal women, marginalized in society, have been found dead, most under the mysterious but suspicious circumstance of being alone in their single room occupancy (SRO) hotel with excessively high blood alcohol levels. Many of these women were officially classified as missing before their dead bodies discovered. Although she comes across a few leads, Rebecca believes the strongest lead in finding her mother is through a man named Norman, who claims to have seen the woman in the photograph, who he refers to as Shadie, sometime recently. Rebecca will learn how much Norman truly knows about her mother, as well as about the dead and missing women.", "genres": ["Crime", "Drama", "Mystery"], "imdb": {"id": 466403, "rating": 5, "votes": 213}, "languages": ["English"], "lastupdated": "2015-07-26 00:39:38.163000000", "num_mflix_comments": 2, "plot": "Returning to her hometown of Vancouver on the news that her Caucasian father is on his deathbed, Rebecca learns from him before he dies that her aboriginal mother, Rita, did not abandon ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTg1NTM2Mjc0Ml5BMl5BanBnXkFtZTcwNDk3NDI0MQ@@._V1_SY1000_SX677_AL_.jpg", "released": 1158192000000, "runtime": 90, "title": "Unnatural & Accidental", "tomatoes": {"dvd": 1174348800000, "lastUpdated": 1439922090000, "viewer": {"meter": 57, "numReviews": 1065, "rating": 3.4}}, "type": "movie", "writers": ["Marie Clements (play)", "Marie Clements (screenplay)"], "year": 2006}