{"_id": "573a1395f29313caabce2046", "awards": {"nominations": 1, "text": "Nominated for 1 Golden Globe. Another 2 wins & 1 nomination.", "wins": 3}, "cast": ["Doris Day", "James Garner", "Polly Bergen", "Thelma Ritter"], "countries": ["USA"], "directors": ["Michael Gordon"], "fullplot": "Three years into their loving marriage with two infant daughters at home in Los Angeles, Nicholas Arden and Ellen Wagstaff Arden are on a plane that goes down in the South Pacific. Although most passengers manage to survive the incident, Ellen presumably perishes when she is swept off the lifeboat she is on. Her body is not recovered. Fast forward five years. Nicky, wanting now to move on with his life, has Ellen declared legally dead. Part of that moving on includes getting remarried, this time to a young woman named Bianca Steele, who, for their honeymoon, he plans to take to the same Monterrey resort where he and Ellen spent their honeymoon. On that very same day, Ellen is dropped off in Los Angeles by the Navy, who rescued her from the South Pacific island where she was stranded for the past five years. She asked the Navy not to publicize her rescue or notify Nicky as she wanted to do so herself. Upon arrival back home, a shocked Grace Arden, Nicky's mother, informs Ellen that Nicky just got married that morning and that she, as his true wife as opposed to Bianca being his bride, should go to Monterrey to tell Nicky she's alive. She does so. Although Nicky is equally as shocked as his mother was when he sees Ellen for the first time, it places him in a difficult position. Although he loves Ellen and wants more than anything to be with her, he has Bianca's feelings to take into consideration. As such, he finds it difficult to tell Bianca, who is in a honeymoon amorous mood. Nicky's inability to tell Bianca irks Ellen, who believes it is a manifestation of his love for Bianca over her. Nicky, however, ends up with questions of his own about Ellen's faithfulness and love for him when he learns that Ellen was not all alone on that island but with a handsome man named Stephen Burkett, the two who pet nicknamed each other Adam and Eve. Nicky's questions about her faithfulness increase when she purposefully withholds information about Stephen from him.", "genres": ["Comedy", "Romance"], "imdb": {"id": 57329, "rating": 7, "votes": 3282}, "languages": ["English"], "lastupdated": "2015-07-31 00:23:39.707000000", "plot": "Three years into their loving marriage with two infant daughters at home in Los Angeles, Nicholas Arden and Ellen Wagstaff Arden are on a plane that goes down in the South Pacific. Although...", "poster": "https://m.media-amazon.com/images/M/MV5BMTQ5MTUyODAwMF5BMl5BanBnXkFtZTgwMzc2NjQzMTE@._V1_SY1000_SX677_AL_.jpg", "rated": "APPROVED", "released": -189993600000, "runtime": 103, "title": "Move Over, Darling", "tomatoes": {"dvd": 1172534400000, "lastUpdated": 1440615852000, "production": "20th Century Fox", "viewer": {"meter": 78, "numReviews": 3923, "rating": 3.8}}, "type": "movie", "writers": ["Hal Kanter (screenplay)", "Jack Sher (screenplay)", "Bella Spewack (based on a screenplay by)", "Sam Spewack (based on a screenplay by)", "Bella Spewack (story)", "Sam Spewack (story)", "Leo McCarey (story)"], "year": 1963}