{"_id": "573a13d0f29313caabd8b305", "awards": {"nominations": 4, "text": "2 wins & 4 nominations.", "wins": 2}, "countries": ["USA"], "directors": ["Alma Har'el"], "fullplot": "Bombay Beach is one of the poorest communities in southern California located on the shores of the Salton Sea, a man-made sea stranded in the middle of the Colorado desert that was once a beautiful vacation destination for the privileged and is now a pool of dead fish. Film director Alma Har'el tells the story of three protagonists. The trials of Benny Parrish, a young boy diagnosed with bipolar disorder whose troubled soul and vivid imagination create both suffering and joy for him and his complex and loving family. The story of CeeJay Thompson, a black teenager and aspiring football player who has taken refuge in Bombay Beach hoping to avoid the same fate of his cousin who was murdered by a gang of youths in Los Angeles; and that of Red, an ancient survivor, once an oil field worker, living on the fumes of whiskey, cigarettes and an irrepressible love of life. Together these portraits form a triptych of manhood in its various ages and guises, in a gently hypnotic style that questions whether they are a product of their world or if their world is a construct of their own imaginations.", "genres": ["Documentary", "Drama", "Musical"], "imdb": {"id": 1758576, "rating": 7, "votes": 989}, "languages": ["English"], "lastupdated": "2015-08-14 01:15:59.020000000", "metacritic": 74, "num_mflix_comments": 1, "plot": "Bombay Beach is one of the poorest communities in southern California located on the shores of the Salton Sea, a man-made sea stranded in the middle of the Colorado desert that was once a ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTk0NTM4Mjc5OF5BMl5BanBnXkFtZTcwMjIwODc4Ng@@._V1_SY1000_SX677_AL_.jpg", "released": 1318550400000, "runtime": 80, "title": "Bombay Beach", "tomatoes": {"critic": {"meter": 76, "numReviews": 34, "rating": 7.4}, "dvd": 1326672000000, "fresh": 26, "lastUpdated": 1442084675000, "production": "Focus World", "rotten": 8, "viewer": {"meter": 79, "numReviews": 351, "rating": 3.9}, "website": "http://bombaybeachfilm.com/"}, "type": "movie", "year": 2011}