{"_id": "573a13a7f29313caabd1bd58", "awards": {"nominations": 1, "text": "Nominated for 1 Oscar. Another 3 wins & 1 nomination.", "wins": 4}, "cast": ["Mai Thi Kim", "Heidi Neville-Bub", "Gerald Ford", "Tom Miller"], "countries": ["USA"], "directors": ["Gail Dolgin", "Vicente Franco"], "fullplot": "In 1975, as the Vietnam War was ending, thousands of orphans and Amerasian children were brought to the United States as part of \"Operation Babylift.\" Daughter from Danang tells the dramatic story of one of these children, Heidi Bub (a.k.a. Mai Thi Hiep), and her Vietnamese mother, Mai Thi Kim, separated at the war's end and reunited 22 years later. Heidi, now living in Tennessee - a married woman with kids - had always dreamt of a joyful reunion. When she ventures to Vietnam to meet her mother, she unknowingly embarks on an emotional pilgrimage that spans decades and distance. Unlike most reunion stories that climax with a clichè happy ending, Daughter from Danang is a real-life drama. Journeying from the Vietnam War to Pulaski, Tennessee and back to Vietnam, Daughter from Danang tensely unfolds as cultural differences and the years of separation take their toll in a riveting film about longing and the personal legacy of war.", "genres": ["Documentary", "War"], "imdb": {"id": 303281, "rating": 7.5, "votes": 484}, "languages": ["English", "Vietnamese"], "lastupdated": "2015-02-23 00:42:00.823000000", "metacritic": 77, "plot": "Separated at the end of the Vietnam war, an \"Americanized\" woman and her Vietnamese mother are reunited after 22 years.", "poster": "https://m.media-amazon.com/images/M/MV5BMjA1MTg4MzYwMl5BMl5BanBnXkFtZTcwODY0MTQyMQ@@._V1_SY1000_SX677_AL_.jpg", "released": 1010707200000, "runtime": 83, "title": "Daughter from Danang", "tomatoes": {"boxOffice": "$0.7M", "consensus": "An emotionally wrenching portrayal of a family reunion that doesn't turn out as expected.", "critic": {"meter": 79, "numReviews": 76, "rating": 6.9}, "dvd": 1068508800000, "fresh": 60, "lastUpdated": 1436896904000, "production": "Paramount Classics", "rotten": 16, "viewer": {"meter": 59, "numReviews": 210, "rating": 3.5}, "website": "http://www.jayzmovie.com/index2.html"}, "type": "movie", "year": 2002}