{"_id": "573a1394f29313caabcdf03f", "awards": {"nominations": 0, "text": "Nominated for 1 Oscar. Another 1 win.", "wins": 2}, "cast": ["Ethel Waters", "Julie Harris", "Brandon De Wilde", "Arthur Franz"], "countries": ["USA"], "directors": ["Fred Zinnemann"], "fullplot": "In a small Georgia town, twelve year old tomboy Frankie Addams feels unconnected to the world, a fact troubling to her. Her unconventional views for a twelve year old girl make her an outcast among her peers, which she in turn blames for her situation rather than anything of her own doing. Her only real friend is John Henry, her younger next door neighbor, although she doesn't see him as a friend since she doesn't consider him a peer. As her widowed father is all consumed with running his small business, Frankie is largely left to the care of their housekeeper, Berenice. Berenice tries to provide as much true guidance to Frankie and what Frankie considers her problems, although Berenice has her own troubles looking after her wild foster brother, Honey Camden, her only surviving family. In addition, Frankie largely sees Berenice's advice as the rantings of a large, crazy black woman. Frankie believes that she has finally found her place in life upon the return to town and announcement by her older enlisted brother Jarvis that he is getting married to a woman named Janice. Immediately upon seeing Jarvis and Janice together, she falls in love with \"them\", believing she can be a \"member\" of \"them\" by leaving town with them immediately following the wedding. Frankie even wants to change her name to Jasmine to feel more connected to them as they will all then have a name \"Ja__\". Two negative situations following the wedding - one in reaction to her finding out that she can't go with Jarvis and Janice - may however put Frankie in the right direction to truly finding her place in life.", "genres": ["Drama"], "imdb": {"id": 44896, "rating": 7.1, "votes": 922}, "languages": ["English"], "lastupdated": "2015-08-21 00:56:07.673000000", "plot": "A young tomboy named Frankie is forced to face her own immaturity as a result her older brother's wedding.", "poster": "https://m.media-amazon.com/images/M/MV5BMzc5NmZjYmYtM2NmZi00ZWRjLWE2YzYtNWFkNTM3M2JlZWVmL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "TV-G", "runtime": 93, "title": "The Member of the Wedding", "tomatoes": {"critic": {"meter": 86, "numReviews": 7, "rating": 7.7}, "dvd": 957225600000, "fresh": 6, "lastUpdated": 1441994572000, "production": "Columbia Pictures", "rotten": 1, "viewer": {"meter": 55, "numReviews": 287, "rating": 3.5}}, "type": "movie", "writers": ["Edna Anhalt (screenplay)", "Edward Anhalt (screenplay)", "Carson McCullers (novel)", "Carson McCullers (play)"], "year": 1952}