{"_id": "573a13b4f29313caabd4091d", "awards": {"nominations": 20, "text": "12 wins & 20 nominations.", "wins": 12}, "cast": ["Roy Dupuis", "Stephen McHattie", "Julie LeBreton", "Philip Craig"], "countries": ["Canada"], "directors": ["Charles Binamè"], "fullplot": "In the late 1930s, a young machinist named Maurice Richard distinguished himself as an ice hockey player of preternatural talent. Although that was enough to get him into the Montreal Canadiens, his frequent injuries cost him the confidence of his team and the fans. In the face of these doubts, Richard eventually shows the kind of aggressive and skillful play that would make him one of the greatest players of all time as \"The Rocket.\" However for all his success, Richard and his fellow French Canadians face constant discrimination in a league dominated by the English speaking. Although a man of few words, Richard begins to speak his own mind about the injustice which creates a organizational conflict that would culminate in his infamous 1955 season suspension that sparks an ethnic riot in protest. In the face of these challenges, Richard must decide who exactly is he playing for.", "genres": ["Biography", "Drama", "Sport"], "imdb": {"id": 460505, "rating": 7.7, "votes": 4296}, "languages": ["French", "English"], "lastupdated": "2015-09-07 00:50:08.447000000", "num_mflix_comments": 1, "plot": "A story about Quebec's most famous hockey player, Maurice \"The Rocket\" Richard, focusing on the struggles of a French Canadian in the National Hockey League dominated by Anglophones.", "poster": "https://m.media-amazon.com/images/M/MV5BYzA5YTM0ZTUtYTc4NS00MTk0LTg3MTUtYmYzNmNiMDUyMDkxL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 1177027200000, "runtime": 124, "title": "The Rocket: The Legend of Rocket Richard", "tomatoes": {"dvd": 1110240000000, "lastUpdated": 1442167143000, "production": "VCI Entertainment", "viewer": {"meter": 86, "numReviews": 1453, "rating": 3.8}, "website": "http://www.vcientertainment.com/Film-Categories?product_id=804"}, "type": "movie", "writers": ["Ken Scott"], "year": 2005}