{"_id": "573a139bf29313caabcf39cd", "awards": {"nominations": 2, "text": "2 nominations.", "wins": 0}, "cast": ["Robert Morse", "Michele Lee", "Rudy Vallee", "Anthony 'Scooter' Teague"], "countries": ["USA"], "directors": ["David Swift"], "fullplot": "Twenty-seven year old New York window washer, J. Pierpont Finch, believes he can be a success in the corporate world after he impulsively picks up the book \"How to Succeed in Business Without Really Trying\". The book promises its reader that he can climb the corporate ladder simply and quickly. The Worldwide Wicket Corporation, the business in the office building whose windows he washes is, according to the book, the perfect type of business. There he meets secretary Rosemary Pilkington, who sees in Ponty (as she calls him) an unassuming man who she believes the corporate world will eat alive. But Ponty, memorizing what the book tells him, does quickly climb the corporate ladder but not by doing any real work. Ponty has a few obstacles along the way such as: Bud Frump who sees Ponty as a rival and is the nephew by marriage of the company president J.B. Biggley; Hedy La Rue, a curvaceous but simple woman who has a secret or not-so-secret tie to someone important in the company; Mr. Ovington, an executive who Ponty can't figure out; and Ponty possibly making a fatal error by not reading far enough ahead in the book. Ponty ultimately has to decide if climbing to the top of the ladder is worth stepping on all those along the way and risk losing the love of Rosemary. In the end telling the truth may set him free.", "genres": ["Comedy", "Musical"], "imdb": {"id": 61791, "rating": 7.3, "votes": 3262}, "languages": ["English"], "lastupdated": "2015-08-29 23:22:03.743000000", "num_mflix_comments": 1, "plot": "Armed with a \"How to...\" manual, an ambitious window washer seeks to climb the corporate ladder.", "poster": "https://m.media-amazon.com/images/M/MV5BMTc3MDI1ODIwNV5BMl5BanBnXkFtZTcwNjk0ODE0NA@@._V1_SY1000_SX677_AL_.jpg", "rated": "APPROVED", "released": -88905600000, "runtime": 121, "title": "How to Succeed in Business Without Really Trying", "tomatoes": {"critic": {"meter": 89, "numReviews": 9, "rating": 7}, "dvd": 989884800000, "fresh": 8, "lastUpdated": 1439923359000, "rotten": 1, "viewer": {"meter": 82, "numReviews": 4332, "rating": 3.6}}, "type": "movie", "writers": ["Abe Burrows (book)", "Jack Weinstock (book)", "Willie Gilbert (book)", "Shepherd Mead (novel)", "David Swift"], "year": 1967}