{"_id": "573a1393f29313caabcdc536", "awards": {"nominations": 0, "text": "Nominated for 3 Oscars. Another 2 wins.", "wins": 5}, "cast": ["Humphrey Bogart", "Mary Astor", "Gladys George", "Peter Lorre"], "countries": ["USA"], "directors": ["John Huston"], "fullplot": "Spade and Archer is the name of a San Francisco detective agency. That's for Sam Spade and Miles Archer. The two men are partners, but Sam doesn't like Miles much. A knockout, who goes by the name of Miss Wonderly, walks into their office; and by that night everything's changed. Miles is dead. And so is a man named Floyd Thursby. It seems Miss Wonderly is surrounded by dangerous men. There's Joel Cairo, who uses gardenia-scented calling cards. There's Kasper Gutman, with his enormous girth and feigned civility. Her only hope of protection comes from Sam, who is suspected by the police of one or the other murder. More murders are yet to come, and it will all be because of these dangerous men -- and their lust for a statuette of a bird: the Maltese Falcon.", "genres": ["Crime", "Drama", "Film-Noir"], "imdb": {"id": 33870, "rating": 8.2, "votes": 103084}, "languages": ["English"], "lastupdated": "2015-09-15 04:50:25.603000000", "num_mflix_comments": 2, "plot": "A private detective takes on a case that involves him with three eccentric criminals, a gorgeous liar, and their quest for a priceless statuette.", "poster": "https://m.media-amazon.com/images/M/MV5BZjIwNGM1ZTUtOThjYS00NDdiLTk2ZDYtNGY5YjJkNzliM2JjL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": -890092800000, "runtime": 100, "title": "The Maltese Falcon", "tomatoes": {"consensus": "Suspenseful, labyrinthine, and brilliantly cast, The Maltese Falcon is one of the most influential noirs -- as well as a showcase for Humphrey Bogart at his finest.", "critic": {"meter": 100, "numReviews": 47, "rating": 9}, "dvd": 950572800000, "fresh": 47, "lastUpdated": 1442252921000, "production": "Warner Bros.", "rotten": 0, "viewer": {"meter": 92, "numReviews": 56532, "rating": 4}}, "type": "movie", "writers": ["John Huston (screenplay)", "Dashiell Hammett (based upon the novel by)"], "year": 1941}