{"_id": "573a13bdf29313caabd59b4a", "awards": {"nominations": 2, "text": "2 nominations.", "wins": 0}, "cast": ["Anna Mouglalis", "Mads Mikkelsen", "Elena Morozova", "Natacha Lindinger"], "countries": ["France", "Japan", "Switzerland"], "directors": ["Jan Kounen"], "fullplot": "Paris 1913. Coco Chanel is infatuated with the rich and handsome Boy Capel, but she is also compelled by her work. Igor Stravinsky's The Rite of Spring is about to be performed. The revolutionary dissonances of Igor's work parallel Coco's radical ideas. She wants to democratize women's fashion; he wants to redefine musical taste. Coco attends the scandalous first performance of The Rite in a chic white dress. The music and ballet are criticized as too modern, too foreign. Coco is moved but Igor is inconsolable. Paris 1920, Coco is newly wealthy and successful but grief-stricken after Boy's death in a car crash. Igor, following the Russian Revolution is now a penniless refugee living in exile in Paris. Coco is introduced to Igor by Diaghilev, impresario of the Ballets Russes. The attraction between them is instant and electric. Coco invites Igor along with his wife - now sick with consumption - together with his four children and a menagerie of birds to stay at her new villa, Bel Respiro, in Garches.", "genres": ["Drama", "Music"], "imdb": {"id": 1023441, "rating": 6.4, "votes": 4545}, "languages": ["French", "Russian", "English"], "lastupdated": "2015-08-26 00:39:08.557000000", "metacritic": 56, "num_mflix_comments": 1, "plot": "Paris 1913. Coco Chanel is infatuated with the rich and handsome Boy Capel, but she is also compelled by her work. Igor Stravinsky's The Rite of Spring is about to be performed. The ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTMxMDg1OTgyM15BMl5BanBnXkFtZTcwNTgyNzUzMw@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1279843200000, "runtime": 119, "title": "Coco Chanel & Igor Stravinsky", "tomatoes": {"boxOffice": "$1.7M", "consensus": "It's well-acted and beautifully filmed, but Jan Kounen's dramatization of the affair between his famous subjects is curiously short on passion.", "critic": {"meter": 52, "numReviews": 90, "rating": 5.7}, "dvd": 1285632000000, "fresh": 47, "lastUpdated": 1439750261000, "production": "Sony Pictures Classics", "rotten": 43, "viewer": {"meter": 42, "numReviews": 19491, "rating": 3}, "website": "http://www.sonyclassics.com/cocochanelandigorstravinsky/"}, "type": "movie", "writers": ["Chris Greenhalgh (screenplay)", "Chris Greenhalgh (novel)", "Carlo De Boutiny (adaptation)", "Jan Kounen (adaptation)"], "year": 2009}