{"_id": "573a13b8f29313caabd4b692", "awards": {"nominations": 9, "text": "9 nominations.", "wins": 0}, "cast": ["Fanny Ardant", "Ania Bukstein", "Michal Shtamler", "Adir Miller"], "countries": ["France", "Israel"], "directors": ["Avi Nesher"], "fullplot": "In The Secrets, two brilliant young women discover their own voices in a repressive orthodox culture where females are forbidden to sing, let alone speak out. Naomi, the studious, devoutly religious daughter of a prominent rabbi, convinces her father to postpone her marriage for a year so that she might study at a Jewish seminary for women in the ancient Kabalistic seat of Safed. Naomi's quest for individuality takes a defiant turn when she befriends Michelle, a free-spirited and equally headstrong fellow student. When the pair encounters a mysterious, ailing foreigner with a disturbing past named Anouk (the iconic French actress Fanny Ardant) they begin a risky journey into forbidden realms. In the hopes of easing her suffering, Naomi and Michelle secretly lead Anouk through a series of Kabalistic cleansing rituals. The process opens up overwhelming new horizons for the girls who find themselves caught between the rigid male establishment they grew up in, and the desire to be true to themselves, no matter the cost.", "genres": ["Drama"], "imdb": {"id": 782867, "rating": 7.1, "votes": 1359}, "languages": ["Hebrew", "French", "English"], "lastupdated": "2015-08-17 00:06:16.703000000", "plot": "In The Secrets, two brilliant young women discover their own voices in a repressive orthodox culture where females are forbidden to sing, let alone speak out. Naomi, the studious, devoutly ...", "poster": "https://m.media-amazon.com/images/M/MV5BOTA5MDM5MzgxNF5BMl5BanBnXkFtZTcwMTU0NDQwMg@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1227657600000, "runtime": 127, "title": "The Secrets", "tomatoes": {"dvd": 1239062400000, "lastUpdated": 1435518869000, "production": "Monterey Media", "viewer": {"meter": 84, "numReviews": 544, "rating": 3.9}, "website": "http://www.thesecretsmovie.com/"}, "type": "movie", "writers": ["Hadar Galron", "Avi Nesher"], "year": 2007}