{"_id": "573a13a7f29313caabd1a590", "awards": {"nominations": 8, "text": "14 wins & 8 nominations.", "wins": 14}, "cast": ["Rodrigo Noya", "Carmen Maura", "Julieta Cardinali", "Jean Pierre Noher"], "countries": ["Argentina", "Netherlands", "France", "Spain", "Italy"], "directors": ["Alejandro Agresti"], "fullplot": "In 1967 Buenos Aires, eight year old Valentèn lives alone with his poor widowed paternal grandmother. He has not seen his mother since he was three. His grandmother tells him that his mother was unfaithful to his father. Regardless, Valentèn still misses her. His womanizing father, Vincente, is on the most part absent as a traveling salesman, he who seems more concerned about his own fortunes than sending money home to take care of his mother and son. Valentèn has dreams like most young boys, his primary one being to become an astronaut. He believes the work that he does building rocket models and space suits will assist the NASA space program, and he does whatever he can, such as walk around in heavy shoes to simulate zero gravity and hold his breath underwater, in his pursuit of becoming an astronaut, despite being slightly cross-eyed and near-sighted, which he believes will not hinder his chances. But without really realizing it, he wants more than anything to be part of a nuclear family, with his father at home and for his father to marry a pretty young woman he can call his mother. He believes Vincente's latest girlfriend, Leticia, is that woman. In the absence of a constant male influence at home, Valentèn searches those out, whether it being his Uncle Chiche who is visiting from Ushuaia, or Rufo, the bohemian pianist who lives next door. Valentèn tries to solve what he sees as the problems in his life to varying degrees of success, and comes to some new understandings which reconciles what he has been inadvertently told in the past and what he now sees in life.", "genres": ["Comedy", "Drama", "Romance"], "imdb": {"id": 296915, "rating": 7.7, "votes": 3535}, "languages": ["Spanish"], "lastupdated": "2015-08-07 00:30:57.130000000", "metacritic": 52, "plot": "An 8-year-old boy, raised by his grandmother, is surrounded by problems in his family he finds only himself capable of solving.", "poster": "https://m.media-amazon.com/images/M/MV5BMTQ3Njk0NTc0OF5BMl5BanBnXkFtZTcwODgwMjcyMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1044489600000, "runtime": 86, "title": "Valentin", "tomatoes": {"boxOffice": "$0.3M", "consensus": "A coming-of-age tale that's more cloying than affecting.", "critic": {"meter": 61, "numReviews": 66, "rating": 6.1}, "dvd": 1097539200000, "fresh": 40, "lastUpdated": 1442337398000, "production": "Miramax Films", "rotten": 26, "viewer": {"meter": 93, "numReviews": 4846, "rating": 4.1}, "website": "http://www.miramax.com/valentin/index.html"}, "type": "movie", "writers": ["Alejandro Agresti"], "year": 2002}