{"_id": "573a13a0f29313caabd03dab", "awards": {"nominations": 5, "text": "2 wins & 5 nominations.", "wins": 2}, "cast": ["Shirley Henderson", "Gina McKee", "Molly Parker", "Ian Hart"], "countries": ["UK"], "directors": ["Michael Winterbottom"], "fullplot": "There's little wonder in the working-class lives of Bill, Eileen, and their three grown daughters. They're lonely Londoners. Nadia, a cafe waitress, places personal ads, looking for love; Debbie, a single mom, entertains men at the hair salon after hours; her son spends part of the weekend with her ex, a man with a hair-trigger temper. Molly is expecting her first baby and its father acts as if the responsibility is too much for him. Eileen is bitter, complaining about her husband and the dog next door; Bill's a doormat. His West Indian neighbor offers him a drink; her own grown son locks himself in his room most of the time. Will anyone connect during this Guy Fawkes weekend?", "genres": ["Drama"], "imdb": {"id": 171865, "rating": 7.2, "votes": 3524}, "languages": ["English"], "lastupdated": "2015-08-30 04:33:37.050000000", "metacritic": 71, "plot": "There's little wonder in the working-class lives of Bill, Eileen, and their three grown daughters. They're lonely Londoners. Nadia, a cafe waitress, places personal ads, looking for love; ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTUwMDgxOTM3N15BMl5BanBnXkFtZTcwMzc4MTIyMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 947808000000, "runtime": 108, "title": "Wonderland", "tomatoes": {"consensus": "A film that tackles something as simple as everyday life and succeeds beatifully. The witty script and clever direction keep the film flowing, while the superb acting keeps it alive. It doesn't aim for the sky and for that reason it hits its mark.", "critic": {"meter": 63, "numReviews": 70, "rating": 6.1}, "dvd": 983836800000, "fresh": 44, "lastUpdated": 1441995503000, "production": "USA Films", "rotten": 26, "viewer": {"meter": 85, "numReviews": 3120, "rating": 3.7}}, "type": "movie", "writers": ["Laurence Coriat"], "year": 1999}