{"_id": "573a1391f29313caabcd796e", "awards": {"nominations": 1, "text": "1 win & 1 nomination.", "wins": 1}, "cast": ["Harold Lloyd", "Mildred Davis", "Bill Strother", "Noah Young"], "countries": ["USA"], "directors": ["Fred C. Newmeyer", "Sam Taylor"], "fullplot": "In 1922, the country boy Harold says goodbye to his mother and his girlfriend Mildred in the train station and leaves Great Bend expecting to be successful in the big city. Harold promises to Mildred to get married with her as soon as he \"make good\". Harold shares a room with his friend \"Limpy\" Bill and he finally gets a job as salesman in the De Vore Department Store. However, he pawns Bill's phonograph, buys a lavaliere and writes to Mildred telling that he is a manager of De Vore. One day, Harold sees an old friend from Great Bend that is a policeman and when he meets his friend Bill, he asks Bill to push the policeman over him and make him fall down. However Bill pushes the wrong policeman that chases him, but he escapes climbing up a building. Out of the blue, Mildred is convinced by her mother to visit Harold without previous notice and he pretends to be the manager of De Vore. When Harold overhears the general manager telling that he would give one thousand dollars to to anyone that could promote De Vore attracting people to the department store, he offers five hundred dollars to Bill to climb up the Bolton Building. However things go wrong when the angry policeman decides to check whether the mystery man that will climb up the building is the one who pushed him over on the floor.", "genres": ["Comedy", "Romance", "Thriller"], "imdb": {"id": 14429, "rating": 8.3, "votes": 11803}, "languages": ["English"], "lastupdated": "2015-08-21 00:59:44.877000000", "num_mflix_comments": 1, "plot": "When a store clerk organizes a publicity stunt, in which a friend climbs the outside of a tall building, circumstances force him to make the perilous climb himself.", "poster": "https://m.media-amazon.com/images/M/MV5BMjkyOTg2MzE1MV5BMl5BanBnXkFtZTgwMDUzODYwMjE@._V1._CR32.883331298828125,11.533340454101562,508,1024_SX89_AL_.jpg", "rated": "NOT RATED", "released": -1475452800000, "runtime": 70, "title": "Safety Last!", "tomatoes": {"critic": {"meter": 96, "numReviews": 25, "rating": 8.6}, "dvd": 1371513600000, "fresh": 24, "lastUpdated": 1441131299000, "production": "Criterion Collection", "rotten": 1, "viewer": {"meter": 93, "numReviews": 3536, "rating": 4.2}}, "type": "movie", "writers": ["Hal Roach (story)", "Sam Taylor (story)", "Tim Whelan (story)", "H.M. Walker (titles)"], "year": 1923}