{"_id": "573a13d6f29313caabd9e955", "awards": {"nominations": 4, "text": "4 nominations.", "wins": 0}, "countries": ["Israel", "USA"], "directors": ["Hilla Medalia", "Shosh Shlam"], "fullplot": "The Chinese government is the first to classify internet addiction as a clinical disorder. 'Web Junkie' identifies internet addiction and focuses on the treatment used in Chinese rehabilitation centres. The film delves into a Beijing treatment centre and explores the cases of three adolescents from the day they arrive at the treatment centre through the three-month period of being held at the centre, and then their return to their homes. The film follows both the underlying issues related to the disorders, as well as the manner and treatment the patients receive. Professor Tao Ran established the world's first internet addiction clinic, and he promises to cure children of so-called internet addiction, which has grown into one of China's most feared public health hazards. The program admits children between the ages of 13 and 18 years; they are forced to undergo military-inspired physical training and comply with monitored sleep and food standards. Throughout their stay at the clinic, they are patrolled by the military guards who protect the children's quarters, which, like prisons, are surrounded by gates and fences. Despite such conditions, parents voluntarily send their children to the treatment centre and relinquish personal involvement. There is no one-on-one therapy, and the children's psychological needs are 'met' with group therapy sessions twice a week. The treatment is very expensive, and parents often borrow money in order to afford to send their child to the clinic. For them it is worth it - steering their child away from this addiction and redeveloping direct communication skills takes priority. 'Web Junkie' provides a microcosm of modern Chinese life, examines intergenerational pressures, and takes a hard look at one of the symptoms of the internet age.", "genres": ["Documentary", "Drama"], "imdb": {"id": 2064745, "rating": 6.3, "votes": 365}, "languages": ["English", "Mandarin"], "lastupdated": "2015-08-17 00:56:58.750000000", "metacritic": 67, "num_mflix_comments": 1, "plot": "The Chinese government is the first to classify internet addiction as a clinical disorder. 'Web Junkie' identifies internet addiction and focuses on the treatment used in Chinese ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTc3MTIxNzU4OF5BMl5BanBnXkFtZTgwMzA4MjI4MDE@._V1_SY1000_SX677_AL_.jpg", "released": 1420070400000, "runtime": 74, "title": "Web Junkie", "tomatoes": {"consensus": "While neither as deep nor as skillfully constructed as its subject might deserve, Web Junkie remains a chillingly serious look at a nightmarish problem.", "critic": {"meter": 71, "numReviews": 24, "rating": 6.5}, "dvd": 1425254400000, "fresh": 17, "lastUpdated": 1441994428000, "production": "Kino Lorber", "rotten": 7, "viewer": {"meter": 56, "numReviews": 136, "rating": 3.4}, "website": "http://webjunkiemovie.com/"}, "type": "movie", "writers": ["Hilla Medalia (story)", "Hilla Medalia", "Shosh Shlam (story)", "Shosh Shlam"], "year": 2013}