{"_id": "573a139af29313caabceffc1", "awards": {"nominations": 4, "text": "Nominated for 2 Primetime Emmys. Another 1 win & 4 nominations.", "wins": 3}, "cast": ["Anthony Edwards", "Eric Roberts", "Sam Neill", "Kevin Tighe"], "countries": ["USA", "Canada"], "directors": ["Jonathan Kaplan"], "fullplot": "At the end of the 1950s, in a more innocent America, the brutal, meaningless slaying of a Midwestern family horrified the nation. This film is based on Truman Capote's hauntingly detailed, psychologically penetrating nonfiction novel. While in prison, Dick Hickock, 28, hears a cell-mate's story about $10,000 in cash kept in a home safe by a prosperous rancher. When he's paroled, Dick persuades ex-con Perry Smith, 31, to join him in going after the stash. On a November night in 1959, Dick and Perry break into the Holcomb, Kansas, house of Herb Clutter. Enraged at finding no safe, they wake the sleeping family and brutally kill them all. The bodies are found by two friends who come by before Sunday church. The murders shock the small Great Plains town, where doors are routinely left unlocked. Detective Alvin Dewey of the Kansas Bureau of Investigation heads the case, but there are no clues, no apparent motive and no suspects...", "genres": ["Crime", "Drama", "History"], "imdb": {"id": 116619, "rating": 6.3, "votes": 668}, "languages": ["English"], "lastupdated": "2015-07-08 09:31:49.487000000", "num_mflix_comments": 3, "plot": "At the end of the 1950s, in a more innocent America, the brutal, meaningless slaying of a Midwestern family horrified the nation. This film is based on Truman Capote's hauntingly detailed, ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTU5MDc4ODg5Nl5BMl5BanBnXkFtZTcwMzc4NTYxMQ@@._V1_SY1000_SX677_AL_.jpg", "released": 848793600000, "runtime": 240, "title": "In Cold Blood", "tomatoes": {"dvd": 1120521600000, "lastUpdated": 1429556994000, "production": "Hallmark Entertainment", "viewer": {"meter": 18, "numReviews": 145, "rating": 2.9}}, "type": "movie", "writers": ["Truman Capote (book)", "Benedict Fitzgerald (teleplay)"], "year": 1996}