{"_id": "573a13c1f29313caabd65d21", "awards": {"nominations": 6, "text": "6 nominations.", "wins": 0}, "cast": ["Robert Downey Jr.", "Zach Galifianakis", "Michelle Monaghan", "Jamie Foxx"], "countries": ["USA"], "directors": ["Todd Phillips"], "fullplot": "In Atlanta on business, straight-laced and overly analytical architect Peter Highman is flying home to Los Angeles and his wife Sarah for the imminent birth of their first child. However, traveling by plane no longer becomes an option when he and a fellow passenger, aspiring actor Ethan Tremblay, are kicked off the plane, which was caused by Ethan's social inappropriateness, due to being generally unaware, exacerbated by Peter's temper at a situation against his sensibilities. Peter, who ends up without money or his suitcase, is forced to accept Ethan's offer of a shared car ride to Los Angeles, Ethan who is looking for his big acting break. For Peter, this partnership is one made in hell, but he feels he has no other choice. Peter obviously wants to take as direct and as quick a route as possible, while he is at Ethan's mercy as the person with the driver's license, car rental and money. They get into one misadventure after another on this trip, with the same issue at each misadventure being Ethan's ineptness as an adult combined with Peter's resulting temper. The questions become whether they will survive the trip together, and if so if Peter will make it home in time to witness the birth of his and Sarah's first child.", "genres": ["Comedy"], "imdb": {"id": 1231583, "rating": 6.6, "votes": 258017}, "languages": ["English", "Spanish"], "lastupdated": "2015-09-02 00:11:30.023000000", "metacritic": 51, "num_mflix_comments": 2, "plot": "High-strung father-to-be Peter Highman is forced to hitch a ride with aspiring actor Ethan Tremblay on a road trip in order to make it to his child's birth on time.", "poster": "https://m.media-amazon.com/images/M/MV5BMTU5MTgxODM3Nl5BMl5BanBnXkFtZTcwMjMxNDEwNA@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1288915200000, "runtime": 95, "title": "Due Date", "tomatoes": {"boxOffice": "$100.4M", "consensus": "Shamelessly derivative and only sporadically funny, Due Date doesn't live up to the possibilities suggested by its talented director and marvelously mismatched stars.", "critic": {"meter": 40, "numReviews": 185, "rating": 5.2}, "dvd": 1298332800000, "fresh": 74, "lastUpdated": 1442078755000, "production": "Warner Bros. Pictures", "rotten": 111, "viewer": {"meter": 52, "numReviews": 124693, "rating": 3.3}, "website": "http://duedatemovie.warnerbros.com/"}, "type": "movie", "writers": ["Alan R. Cohen (screenplay)", "Alan Freedland (screenplay)", "Adam Sztykiel (screenplay)", "Todd Phillips (screenplay)", "Alan R. Cohen (story)", "Alan Freedland (story)"], "year": 2010}