{"_id": "573a13a6f29313caabd168a3", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Jimi Mistry", "Heather Graham", "Marisa Tomei", "Michael McKean"], "countries": ["UK", "France", "USA"], "directors": ["Daisy von Scherler Mayer"], "fullplot": "Bored with Bollywood movies but fascinated with their Hollywood counterparts from his youth, Ram dreams to become a singer and actor in America, the country where dreams are made. He is encouraged when his American-based close friend, Vijay Rao, comes for visit, and brags about driving a Mercedes and living in a penthouse. The Guptas do their best to talk Ramu out of going to America, but in vain. Ram does travel to America and upon arrival in New York is received by Vijay. This is where Ram will get a shock when he finds out that Vijay works as a waiter in an Indian Restaurant, drives a taxi-cab for a living, has never owned any car, and lives in a small apartment based in a Cinema Theater that hosts Bollywood movies, and his two room-mates are Sanjeev and Amit, one of them an illegal immigrant. Ram gets a job as a waiter in the same restaurant as Vijay, but is fired when he gets into a physical argument with a customer. Thereafter Ram applies for an acting job, only to find out that he is to to star in a porno movie opposite sexy Sharonna. Shortly thereafter the Guptas in India will get the shock of their lives when they get to watch a live television telecast of Ramu, who is now known as the \"Sex Guru\". What they do not know is that Ramu has been inspired by his porno co-star, Sharonna, who leads a double life.", "genres": ["Comedy", "Fantasy", "Music"], "imdb": {"id": 280720, "rating": 5.4, "votes": 13307}, "languages": ["English", "Hindi"], "lastupdated": "2015-09-05 00:24:20.173000000", "metacritic": 47, "plot": "Bored with Bollywood movies but fascinated with their Hollywood counterparts from his youth, Ram dreams to become a singer and actor in America, the country where dreams are made. He is ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTg4NzY2MDk0Nl5BMl5BanBnXkFtZTYwNTUxMTg5._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1045180800000, "runtime": 94, "title": "The Guru", "tomatoes": {"boxOffice": "$2.9M", "consensus": "A sweetly silly but wafer-thin romantic comedy.", "critic": {"meter": 57, "numReviews": 87, "rating": 5.7}, "dvd": 1054598400000, "fresh": 50, "lastUpdated": 1441906874000, "production": "Universal Pictures", "rotten": 37, "viewer": {"meter": 40, "numReviews": 19095, "rating": 2.6}, "website": "http://www.thegurumovie.com"}, "type": "movie", "writers": ["Tracey Jackson"], "year": 2002}