{"_id": "573a1392f29313caabcdb571", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Zarah Leander", "Willy Birgel", "Edwin Jèrgensen", "Carola Hèhn"], "countries": ["Germany"], "directors": ["Douglas Sirk"], "fullplot": "In 1846 the actress Gloria Vane is the leading star at the Adelphi Theatre in London. She is in love with the destitute nobleman Albert Finsbury. He is leaving for Australia to become an officer in the Queen's Regiment of New South Wales, but promises her to be back after one year. His creditors urge him to pay his debt on 615 pounds before leaving. He gets a check of 15 pounds from his friend Bobby, but changes it surreptitiously to 615. After Finsbury is gone, the forgery is discovered. To protect him Gloria says in court that she committed the crime, and is sentenced to 7 years in the terrible Paramatta prison in Sidney. From prison she sends a note to Finsbury, asking for help, but he doesn't answer. The settler Henry Hoyer falls in love with Gloria. As this is a chance for her to leave prison, she agrees, but run away from him immediately. When she finds out that Finsbury is going to marry the Governor's daughter, she is heartbroken. Finsbury finds her and wants to run away with her, but she cannot love him anymore.", "genres": ["Drama"], "imdb": {"id": 29819, "rating": 6.9, "votes": 230}, "languages": ["German"], "lastupdated": "2015-09-02 00:23:56.867000000", "num_mflix_comments": 3, "plot": "In 1846 the actress Gloria Vane is the leading star at the Adelphi Theatre in London. She is in love with the destitute nobleman Albert Finsbury. He is leaving for Australia to become an ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTQ2NTQ4MjY1MV5BMl5BanBnXkFtZTcwMjE5NTcxMQ@@._V1._CR19,57,275,399_SY264_CR2,0,178,264_AL_.jpg", "released": -1007510400000, "runtime": 106, "title": "To New Shores", "tomatoes": {"lastUpdated": 1442167836000, "viewer": {"meter": 100, "numReviews": 8, "rating": 4}}, "type": "movie", "writers": ["Lovis Hans Lorenz (novel)", "Kurt Heuser", "Douglas Sirk"], "year": 1937}