{"_id": "573a13d6f29313caabd9fadb", "awards": {"nominations": 21, "text": "34 wins & 21 nominations.", "wins": 34}, "cast": ["Ranbir Kapoor", "Priyanka Chopra", "Ileana", "Saurabh Shukla"], "countries": ["India"], "directors": ["Anurag Basu"], "fullplot": "Set in the 1970s in a pretty corner of India, Barfi! is the story of three young people who learn that love can neither be defined nor contained by society's norms of normal and abnormal. Barfi, a hearing and speech impaired boy falls in love with Shruti. In spite of her deep affection for Barfii, Shruti gives into societal and parental pressure to marry a 'normal' man and lead a 'normal' life. Many years later their paths cross once again when Barfi, now in love with Jhilmil, is on the run from the police. Barfi is desperately seeking Jhilmil, who has gone missing. Shruti's realization that Jhilmil is autistic makes her recognize that true love is really blind. Caught in a cat and mouse game, in the search for the girl Barfi loves, Shruti realizes that she is still in love with him. She must now choose between her happiness and Barfi! stars three of India's most loved young stars, all essaying roles of a lifetime. The uber cool Ranbir Kapoor plays the lead role of Barfi!, the very talented Priyanka Chopra takes on the challenge of playing Jhilmil and South star Ileana makes her Hindi debut as Shruti. This season, don't worry, be Barfi!", "genres": ["Adventure", "Comedy", "Drama"], "imdb": {"id": 2082197, "rating": 8.2, "votes": 45971}, "languages": ["Hindi"], "lastupdated": "2015-08-26 00:48:12.400000000", "num_mflix_comments": 2, "plot": "Three young people learn that love can neither be defined nor contained by society's norms of normal and abnormal.", "poster": "https://m.media-amazon.com/images/M/MV5BMTQzMTEyODY2Ml5BMl5BanBnXkFtZTgwMjA0MDUyMjE@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 1347580800000, "runtime": 151, "title": "Barfi!", "tomatoes": {"boxOffice": "$2.8M", "critic": {"meter": 86, "numReviews": 7, "rating": 7.2}, "dvd": 1353369600000, "fresh": 6, "lastUpdated": 1440614380000, "production": "UTV Communications", "rotten": 1, "viewer": {"meter": 86, "numReviews": 4787, "rating": 4.1}, "website": "http://https://www.facebook.com/UTVMotionPictures"}, "type": "movie", "writers": ["Anurag Basu (story)", "Tani Basu (story)", "Sanjeev Dutta (dialogue)"], "year": 2012}