{"_id": "573a13bef29313caabd5c06a", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Paul Cram", "Chars Bonin", "Carson Lee", "Cody Lyman"], "countries": ["USA"], "directors": ["Dav Kaufman"], "fullplot": "As five underworld heavies settle in for an all night stay at an abandoned warehouse and former film studio, a series of bizarre and unsettling occurrences quickly lead them to believe they are not alone. It was supposed to be a simple night of babysitting a single hostage, but when a series of numbers began to appear on the walls things soon took a dark turn. Later, after the hostage escapes, the perplexed thugs not only learn that there is a rat in the ranks, but also discover the unsettling nature of the films that were shot in the warehouse. Now, as terror takes hold, the thieves are about to discover that they are being stalked from the shadows and that their odds of living to see daybreak are shrinking with each passing minute.", "genres": ["Horror", "Thriller"], "imdb": {"id": 1065060, "rating": 4, "votes": 734}, "languages": ["English"], "lastupdated": "2015-07-29 00:00:45.287000000", "plot": "As five underworld heavies settle in for an all night stay at an abandoned warehouse and former film studio, a series of bizarre and unsettling occurrences quickly lead them to believe they...", "poster": "https://m.media-amazon.com/images/M/MV5BMTkwNjEyMDg5M15BMl5BanBnXkFtZTcwOTEwNTA4MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1225152000000, "runtime": 92, "title": "13 Hours in a Warehouse", "tomatoes": {"boxOffice": "$25.4M", "consensus": "Epic in technical scale but breathlessly intimate in narrative scope, Boyhood is a sprawling investigation of the human condition.", "critic": {"meter": 98, "numReviews": 267, "rating": 9.2}, "dvd": 1420502400000, "fresh": 261, "lastUpdated": 1442081566000, "production": "IFC Films", "rotten": 6, "viewer": {"meter": 81, "numReviews": 83955, "rating": 4.1}, "website": "http://www.ifcfilms.com/films/boyhood"}, "type": "movie", "writers": ["Dav Kaufman"], "year": 2008}