{"_id": "573a13b7f29313caabd4b15f", "awards": {"nominations": 1, "text": "1 win & 1 nomination.", "wins": 1}, "cast": ["Daniel Auteuil", "Dany Boon", "Julie Gayet", "Julie Durand"], "countries": ["France"], "directors": ["Patrice Leconte"], "fullplot": "Franèois is a middle-aged antique dealer. He has a stylish apartment and a fabulous life, but at a dinner with a group he considers his dearest acquaintances, he is blindsided by the revelation that none of them actually likes him. He's arrogant, self-centered and harsh, and they don't believe he knows the meaning of friendship. His business partner Catherine makes him a bet: if he can produce his best friend, she will let him keep the massive Greek vase he acquired that afternoon on the company tab. If not, it's hers. Having accepted the wager, Franèois naively tears through his address book, trying to shoehorn an increasingly unlikely series of contacts into the all-important role. Moving through Paris, he keeps encountering a trivia-spouting, big-hearted cabbie named Bruno. Bruno's chatty, lowbrow ways grate against Franèois's designer temperament, but he covets the other man's easy way with people. He convinces Bruno to teach him how to make friends and sets about learning the \"three S's\" - being sociable, smiling and sincere - though they don't come easy. Ultimately, Franèois victory will depend on Bruno's naivetè in playing along, but what's the cost of cheating at friendship?", "genres": ["Comedy"], "imdb": {"id": 778784, "rating": 6.7, "votes": 4945}, "languages": ["French"], "lastupdated": "2015-09-10 17:37:53.303000000", "metacritic": 65, "num_mflix_comments": 1, "plot": "Catherine, refuses to believe that her business partner, the unlikeable Franèois, has a best friend, so she challenges him to set up an introduction. Scrambling to find someone willing to pose as his best pal, Franèois enlists the services of a charming taxi driver to play the part.", "poster": "https://m.media-amazon.com/images/M/MV5BMTc4MzQ4Mzk4Ml5BMl5BanBnXkFtZTcwNDYzODA1MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1186099200000, "runtime": 94, "title": "My Best Friend", "tomatoes": {"boxOffice": "$1.1M", "consensus": "Although the plot may sound contrived, the performances of Daniel Auteuil and Dany Boon manage to turn My Best Friend into an earnest and witty romp.", "critic": {"meter": 75, "numReviews": 88, "rating": 6.6}, "dvd": 1192492800000, "fresh": 66, "lastUpdated": 1439663128000, "production": "IFC Films", "rotten": 22, "viewer": {"meter": 69, "numReviews": 9647, "rating": 3.5}, "website": "http://www.monmeilleurami-lefilm.com/"}, "type": "movie", "writers": ["Olivier Dazat (idea)", "Patrice Leconte", "Jèrème Tonnerre"], "year": 2006}