{"_id": "573a13a5f29313caabd16159", "awards": {"nominations": 2, "text": "2 wins & 2 nominations.", "wins": 2}, "cast": ["Tom Cruise", "Ken Adam", "Margaret Adams", "Brian Aldiss"], "countries": ["USA"], "directors": ["Jan Harlan"], "fullplot": "Narrated by Tom Cruise, \"Stanley Kubrick: A Life in Pictures\" goes through each one of his movies and talks to various participants about their memories of working with Kubrick. For those who know very little about Kubrick, the documentary is an excellent career overview. Kubrick film clips include \"Fear and Desire,\" \"Killer's Kiss,\" \"The Killing,\" \"Paths of Glory,\" \"Spartacus,\" \"Lolita,\" \"Dr. Strangelove or: How I Learned to Stop Worrying and Love the Bomb,\" \"2001: A Space Odyssey,\" \"A Clockwork Orange,\" \"Barry Lyndon,\" \"The Shining,\" \"Full Metal Jacket\" and \"Eyes Wide Shut.\" Those appearing include: Arthur C. Clarke, Keir Dullea, Shelley Duvall, James B. Harris, Richard Schickel, Michael Herr, Nicole Kidman, Anya Kubrick, Christiane Kubrick, Gert Kubrick, Katharina Kubrick, Paul Mazursky, Jack Nicholson, Malcolm McDowell, Steven Spielberg, Martin Scorsese, Woody Allen, Douglas Trumbull, Marie Windsor, Matthew Modine, Sydney Pollack and Peter Ustinov.", "genres": ["Documentary", "Biography"], "imdb": {"id": 278736, "rating": 8, "votes": 7869}, "languages": ["English"], "lastupdated": "2015-09-02 00:45:55.100000000", "plot": "The career and life of Stanley Kubrick is explored through pictures, clips from his films, his old home movies, comments from his colleagues and a narration by Tom Cruise.", "poster": "https://m.media-amazon.com/images/M/MV5BY2IxNTU4ODYtZDNiMC00MWVmLWFlMDYtNGQ2YzAyN2M2MTBjXkEyXkFqcGdeQXVyNDQzMDg4Nzk@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 988761600000, "runtime": 142, "title": "Stanley Kubrick: A Life in Pictures", "tomatoes": {"critic": {"meter": 85, "numReviews": 13, "rating": 7.4}, "dvd": 1193097600000, "fresh": 11, "lastUpdated": 1439836541000, "production": "DocComTV", "rotten": 2, "viewer": {"meter": 89, "numReviews": 7898, "rating": 4}}, "type": "movie", "year": 2001}