{"_id": "573a1394f29313caabce0df8", "awards": {"nominations": 11, "text": "Nominated for 7 Oscars. Another 9 wins & 11 nominations.", "wins": 16}, "cast": ["James Stewart", "Lee Remick", "Ben Gazzara", "Arthur O'Connell"], "countries": ["USA"], "directors": ["Otto Preminger"], "fullplot": "Frederick Manion (Ben Gazzara), a lieutenant in the army, is arrested for the murder of a bartender, Barney Quill. He claims, in his defense, that the victim had raped and beaten up his wife Laura (Lee Remick). Although Laura supports her husband's story, the police surgeon can find no evidence that she has been raped. Manion is defended by Paul Biegler (James Stewart), a rather humble small-town lawyer. During the course of interviews, Biegler discovers that Manion is violently possessive and jealous, and also that his wife has a reputation for giving her favors to other men. Biegler realizes that the prosecution will try to make the court believe that Laura was the lover of the bartender and than Manion killed him and beat her up when he discovered them together. Manion pleads \"not guilty\" and Biegler, who knows that his case is weak, sets his assistants to try to find a witness who will save Manion.", "genres": ["Crime", "Drama", "Mystery"], "imdb": {"id": 52561, "rating": 8.1, "votes": 41594}, "languages": ["English"], "lastupdated": "2015-09-14 02:55:29.567000000", "num_mflix_comments": 1, "plot": "In a murder trial, the defendant says he suffered temporary insanity after the victim raped his wife. What is the truth, and will he win his case?", "poster": "https://m.media-amazon.com/images/M/MV5BMzM0MzE2ZTAtZTBjZS00MTk5LTg5OTEtNjNmYmQ5NzU2OTUyXkEyXkFqcGdeQXVyNDY2MTk1ODk@._V1_SY1000_SX677_AL_.jpg", "rated": "UNRATED", "released": -326160000000, "runtime": 160, "title": "Anatomy of a Murder", "tomatoes": {"consensus": "One of cinema's greatest courtroom dramas, Anatomy of a Murder is tense, thought-provoking, and brilliantly acted, with great performances from James Stewart and George C. Scott.", "critic": {"meter": 100, "numReviews": 42, "rating": 8.6}, "dvd": 963273600000, "fresh": 42, "lastUpdated": 1440526932000, "production": "Sony Pictures Home Entertainment", "rotten": 0, "viewer": {"meter": 91, "numReviews": 11609, "rating": 4.1}}, "type": "movie", "writers": ["Wendell Mayes (screenplay)", "John D. Voelker (based on the novel by)"], "year": 1959}