{"_id": "573a13b8f29313caabd4d625", "awards": {"nominations": 1, "text": "3 wins & 1 nomination.", "wins": 3}, "cast": ["Amitabh Bachchan", "Sanjay Dutt", "Sunil Shetty", "Arbaaz Khan"], "countries": ["India"], "directors": ["Apoorva Lakhia"], "fullplot": "On a calm summer day in 1991, in the bustling Lokhandwala Complex, five criminals including Maya and Dilip were counting 70 lakhs in flat no. 32 B, when 286 policemen, headed by ACP Khan, took strategic positions around their building. A gunfire ensued and the entire nation witnessed the most talked about daylight encounter lasting 6 hours that transformed suburban Mumbai into a virtual war zone. Shootout At Lokhandwala is the story of a seasoned cop, Khan, who chased Khalistani extremists, handpicked cops like Inspector Kaviraj Patil and Constable Javed Shaikh, and dared to engage trigger-happy gangsters in a residential locality of Mumbai. Khan's fight went beyond the encounter as he faced inquisition from his own department and legal charges of human rights violations. Shootout At Lokhandwala is the story of an upcoming underworld gangster, Maya, and his highly skilled partner, Dilip. The two made extortion the buzzword in the early 90s and dared to disobey the big bhai of the underworld, drawing the attention of Khan and his newly formed ATS squad. Both Khan and Maya were men obsessed, so devoted to their professions that their personal lives were a disaster.", "genres": ["Action", "Crime", "Drama"], "imdb": {"id": 811066, "rating": 7, "votes": 4588}, "languages": ["Hindi"], "lastupdated": "2015-08-22 01:02:06.280000000", "num_mflix_comments": 1, "plot": "On a calm summer day in 1991, in the bustling Lokhandwala Complex, five criminals including Maya and Dilip were counting 70 lakhs in flat no. 32 B, when 286 policemen, headed by ACP Khan, ...", "poster": "https://m.media-amazon.com/images/M/MV5BNDNhNTI0NmItMzE0NS00ZDljLWI1YjktOGM0OTU5NjljZjFmXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY1000_SX677_AL_.jpg", "released": 1180051200000, "runtime": 122, "title": "Shootout at Lokhandwala", "tomatoes": {"boxOffice": "$0.3M", "dvd": 1184198400000, "lastUpdated": 1442270783000, "viewer": {"meter": 66, "numReviews": 4994, "rating": 3.6}}, "type": "movie", "writers": ["Apoorva Lakhia", "Suresh Nair", "Raj Vasant (Dialogue)"], "year": 2007}