{"_id": "573a13cdf29313caabd8609b", "awards": {"nominations": 2, "text": "2 nominations.", "wins": 0}, "cast": ["Zoey Deutch", "Lucy Fry", "Danila Kozlovsky", "Gabriel Byrne"], "countries": ["USA", "India"], "directors": ["Mark Waters"], "fullplot": "Rose Hathaway is a dhampir, half-vampire and half-human, who is training to be a guardian at St Vladimir's Academy along with many others like her. There are good and bad vampires in their world: Moroi, who co-exist peacefully among the humans and only take blood from donors, and also possess the ability to control one of the four elements - water, earth, fire or air; and Strigoi, blood-sucking, evil vampires who drink to kill. Rose and other dhampir guardians are trained to protect Moroi and kill Strigoi throughout their education. Along with her best friend, Princess Vasilisa Dragomir, a Moroi and the last of her line, with whom she has a nigh unbreakable bond, Rose must run away from St Vladimir's, in order to protect Lissa from those who wish to harm the princess and use her for their own means.", "genres": ["Action", "Comedy", "Fantasy"], "imdb": {"id": 1686821, "rating": 5.6, "votes": 35964}, "languages": ["English"], "lastupdated": "2015-09-10 17:41:26.310000000", "metacritic": 30, "plot": "Rose Hathaway is a Dhampir, half human-half vampire, a guardian of the Moroi, peaceful, mortal vampires living discreetly within our world. Her calling is to protect the Moroi from bloodthirsty, immortal Vampires, the Strigoi.", "poster": "https://m.media-amazon.com/images/M/MV5BMTUyOTI0MzUyM15BMl5BanBnXkFtZTgwMzI2MzU0MDE@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1391731200000, "runtime": 104, "title": "Vampire Academy", "tomatoes": {"boxOffice": "$7.8M", "consensus": "Though it may appeal to its built-in fanbase, Vampire Academy's Twilight-meets-Mean Girls conceit borrows lazily from its predecessors and offers few laughs or thrills to complement its overstuffed backstory.", "critic": {"meter": 11, "numReviews": 46, "rating": 3.3}, "dvd": 1400544000000, "fresh": 5, "lastUpdated": 1440094491000, "production": "The Weinstein Company", "rotten": 41, "viewer": {"meter": 57, "numReviews": 29694, "rating": 3.4}, "website": "http://va-movie.com/#"}, "type": "movie", "writers": ["Richelle Mead (novel)", "Daniel Waters (screenplay)"], "year": 2014}