{"_id": "573a13c5f29313caabd6ee61", "awards": {"nominations": 172, "text": "Won 4 Oscars. Another 158 wins & 172 nominations.", "wins": 162}, "cast": ["Leonardo DiCaprio", "Joseph Gordon-Levitt", "Ellen Page", "Tom Hardy"], "countries": ["USA", "UK"], "directors": ["Christopher Nolan"], "fullplot": "Dom Cobb is a skilled thief, the absolute best in the dangerous art of extraction, stealing valuable secrets from deep within the subconscious during the dream state, when the mind is at its most vulnerable. Cobb's rare ability has made him a coveted player in this treacherous new world of corporate espionage, but it has also made him an international fugitive and cost him everything he has ever loved. Now Cobb is being offered a chance at redemption. One last job could give him his life back but only if he can accomplish the impossible-inception. Instead of the perfect heist, Cobb and his team of specialists have to pull off the reverse: their task is not to steal an idea but to plant one. If they succeed, it could be the perfect crime. But no amount of careful planning or expertise can prepare the team for the dangerous enemy that seems to predict their every move. An enemy that only Cobb could have seen coming.", "genres": ["Action", "Mystery", "Sci-Fi"], "imdb": {"id": 1375666, "rating": 8.8, "votes": 1294646}, "languages": ["English", "Japanese", "French"], "lastupdated": "2015-09-12 00:29:01.430000000", "metacritic": 74, "num_mflix_comments": 1, "plot": "A thief who steals corporate secrets through use of dream-sharing technology is given the inverse task of planting an idea into the mind of a CEO.", "poster": "https://m.media-amazon.com/images/M/MV5BMjAxMzY3NjcxNF5BMl5BanBnXkFtZTcwNTI5OTM0Mw@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1279238400000, "runtime": 148, "title": "Inception", "tomatoes": {"boxOffice": "$292.6M", "consensus": "Smart, innovative, and thrilling, Inception is that rare summer blockbuster that succeeds viscerally as well as intellectually.", "critic": {"meter": 86, "numReviews": 326, "rating": 8.1}, "dvd": 1291680000000, "fresh": 281, "lastUpdated": 1442078012000, "production": "Warner Bros. Pictures", "rotten": 45, "viewer": {"meter": 91, "numReviews": 561365, "rating": 4.2}, "website": "http://inceptionmovie.warnerbros.com/"}, "type": "movie", "writers": ["Christopher Nolan"], "year": 2010}