{"_id": "573a1399f29313caabcecffd", "awards": {"nominations": 3, "text": "21 wins & 3 nominations.", "wins": 21}, "cast": ["Federico Luppi", "Ron Perlman", "Claudio Brook", "Margarita Isabel"], "countries": ["Mexico"], "directors": ["Guillermo del Toro"], "fullplot": "In 1536, in Veracruz, Mexico, during the Inquisition, an alchemist builds a mysterious and sophisticated device named Cronos to provide eternal life to the owner. In the present days, the antiques dealer Jesus Gris finds Cronos hidden inside an ancient statue while cleaning it with his granddaughter Aurora. He accidentally triggers the device and soon his wife Mercedes and he note that he has a younger appearance. Out of the blue, the stranger Angel de la Guardia visits Gris's shop and buys the old statue. On the next day, Gris finds his shop trashed and Angel's card on the floor. He pays a visit to Angel that introduces him to the eccentric millionaire De la Guardia that explains the healing power and the eternal life given by Cronos. Angel is sent by De la Guardia to hunt down Gris to get Cronos no matter the costs.", "genres": ["Horror"], "imdb": {"id": 104029, "rating": 6.8, "votes": 17984}, "languages": ["Spanish", "English"], "lastupdated": "2015-09-16 00:00:16.500000000", "metacritic": 70, "num_mflix_comments": 2, "plot": "A mysterious device designed to provide its owner with eternal life resurfaces after four hundred years, leaving a trail of destruction in its path.", "poster": "https://m.media-amazon.com/images/M/MV5BOTc1ZmFiMWItZThkMS00Mjc1LTg2NTYtMjZjNWNkMjUzMTM2XkEyXkFqcGdeQXVyNjQ2MjQ5NzM@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 767750400000, "runtime": 94, "title": "Cronos", "tomatoes": {"consensus": "Guillermo del Toro's unique feature debut is not only gory and stylish, but also charming and intelligent.", "critic": {"meter": 89, "numReviews": 47, "rating": 7.3}, "dvd": 783129600000, "fresh": 42, "lastUpdated": 1441136026000, "production": "Trimark", "rotten": 5, "viewer": {"meter": 70, "numReviews": 12292, "rating": 3.5}}, "type": "movie", "writers": ["Guillermo del Toro (screenplay)"], "year": 1993}