{"_id": "573a1393f29313caabcdd7d8", "awards": {"nominations": 0, "text": "Nominated for 5 Oscars. Another 7 wins.", "wins": 12}, "cast": ["James Stewart", "Donna Reed", "Lionel Barrymore", "Thomas Mitchell"], "countries": ["USA"], "directors": ["Frank Capra"], "fullplot": "George Bailey has spent his entire life giving of himself to the people of Bedford Falls. He has always longed to travel but never had the opportunity in order to prevent rich skinflint Mr. Potter from taking over the entire town. All that prevents him from doing so is George's modest building and loan company, which was founded by his generous father. But on Christmas Eve, George's Uncle Billy loses the business's $8,000 while intending to deposit it in the bank. Potter finds the misplaced money and hides it from Billy. When the bank examiner discovers the shortage later that night, George realizes that he will be held responsible and sent to jail and the company will collapse, finally allowing Potter to take over the town. Thinking of his wife, their young children, and others he loves will be better off with him dead, he contemplates suicide. But the prayers of his loved ones result in a gentle angel named Clarence coming to earth to help George, with the promise of earning his wings. He shows George what things would have been like if he had never been born. In a nightmarish vision in which the Potter-controlled town is sunk in sex and sin, those George loves are either dead, ruined, or miserable. He realizes that he has touched many people in a positive way and that his life has truly been a wonderful one.", "genres": ["Drama", "Family", "Fantasy"], "imdb": {"id": 38650, "rating": 8.6, "votes": 245046}, "languages": ["English"], "lastupdated": "2015-09-05 00:01:34.393000000", "num_mflix_comments": 1, "plot": "An angel helps a compassionate but despairingly frustrated businessman by showing what life would have been like if he never existed.", "poster": "https://m.media-amazon.com/images/M/MV5BZjc4NDZhZWMtNGEzYS00ZWU2LThlM2ItNTA0YzQ0OTExMTE2XkEyXkFqcGdeQXVyNjUwMzI2NzU@._V1_SY1000_SX677_AL_.jpg", "rated": "APPROVED", "released": -725328000000, "runtime": 130, "title": "It's a Wonderful Life", "tomatoes": {"consensus": "The holiday classic to define all holiday classics, It's a Wonderful Life is one of a handful of films worth an annual viewing.", "critic": {"meter": 94, "numReviews": 68, "rating": 8.9}, "dvd": 811468800000, "fresh": 64, "lastUpdated": 1442081455000, "production": "Liberty Films", "rotten": 4, "viewer": {"meter": 95, "numReviews": 215785, "rating": 4}}, "type": "movie", "writers": ["Frances Goodrich (screenplay)", "Albert Hackett (screenplay)", "Frank Capra (screenplay)", "Jo Swerling (additional scenes)", "Philip Van Doren Stern (story)"], "year": 1946}