{"_id": "573a13c6f29313caabd736c7", "awards": {"nominations": 25, "text": "16 wins & 25 nominations.", "wins": 16}, "cast": ["Kèji Yakusho", "Takayuki Yamada", "Yèsuke Iseya", "Ikki Sawamura"], "countries": ["Japan", "UK"], "directors": ["Takashi Miike"], "fullplot": "In 1844, the peace of Feudal Japan is threatened by cruel Lord Naritsugu Matsudaira, who is politically rising and getting closer to his half-brother, the shogun. After the harakiri of the Namiya clan leader, samurai Shinzaemon Shimada is summoned by the shogun's advisor Sir Doi of the Akashi Clan to listen to the tragedy of Makino Uneme, whose son and daughter-in-law have been murdered by Naritsugu. Then Sir Doi shows a woman with arms, legs and tongue severed by Naritsugu and she writes with her forearm a request to Shinza to slaughter Naritsugu and his samurai. Shinza promises to kill Naritsugu and he gathers eleven other samurais and plots a plan to attack Naritsugu in his trip back to the Akashi land. But the cunning samurai Hanbei Kitou that is responsible for the security of his master foresees Shinza's intent. Shinza decides to go with his samurai through the mountain, where they find the hunter Koyata that guides them off the mountain and joins the group. Now the thirteen men prepare an ambush to Naritsugu and his army of two hundred samurai in a suicide mission to stop evil.", "genres": ["Action", "Adventure", "Drama"], "imdb": {"id": 1436045, "rating": 7.6, "votes": 47152}, "languages": ["Japanese"], "lastupdated": "2015-09-07 00:17:07.803000000", "metacritic": 87, "plot": "A group of assassins come together for a suicide mission to kill an evil lord.", "poster": "https://m.media-amazon.com/images/M/MV5BYWE3NzAyNDEtNTU5ZC00MzFlLTkyYzAtZmY4ODk0ZmY0NDU4XkEyXkFqcGdeQXVyNzI1NzMxNzM@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1285372800000, "runtime": 141, "title": "13 Assassins", "tomatoes": {"boxOffice": "$0.8M", "consensus": "Takashi Miike's electric remake of Eiichi Kudo's 1963 period action film is a wild spectacle executed with killer, dizzying panache.", "critic": {"meter": 96, "numReviews": 118, "rating": 8}, "dvd": 1309824000000, "fresh": 113, "lastUpdated": 1442084684000, "production": "Magnet Releasing", "rotten": 5, "viewer": {"meter": 89, "numReviews": 22574, "rating": 4.1}, "website": "http://www.13assassins.com/"}, "type": "movie", "writers": ["Kaneo Ikegami (based on a screenplay by)", "Daisuke Tengan (screenplay)"], "year": 2010}