{"_id": "573a139ef29313caabcfd35c", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Salman Khan", "Kajol", "Arbaaz Khan", "Anjala Zaveri"], "countries": ["India"], "directors": ["Sohail Khan"], "fullplot": "Muskaan (Kajol) is an orphan girl living on a farm run by her overly-protective older brother, Vishal (Arbaaz Khan) and their 'Chachu' (Dharmendra). Muskaan's childhood friend, Ujaala (Anjala Zhaveri), has been carrying a torch for the brooding Vishal since childhood, but he won't give her the time of day. Later on Muskaan decides she wants to go to university in the big city and has to persuade her brother to let her go. Once in the big city Muskaan falls for Suraj (Salman Khan). Vishal does not support this, because his terms and conditions of his future brother-in-law are very strenuous physically. And he decides to bring Muskaan back on the farm. Suraj obviously pursues her and starts working on the farm as a stable boy after a chance meeting with 'Chachu'. And then Vishaul decides to put him to the test, and he is rejected. Vishaal wants Muskaan to marry the brother of Thakur Vijay Singh (Nirmal Pandey), not knowing that Thakur Vijay Singh is doing this to merely extract vengeance against the Thakur family for a previous humiliation his own family received. So Suraj must now prevent this from happening and he must also be able to win Vishal's heart if he is really interested in marrying Muskaan (Vishal's sister).", "genres": ["Comedy", "Romance"], "imdb": {"id": 173080, "rating": 6.7, "votes": 1942}, "languages": ["Hindi"], "lastupdated": "2015-09-15 05:15:37.897000000", "num_mflix_comments": 2, "plot": "Muskaan (Kajol) is an orphan girl living on a farm run by her overly-protective older brother, Vishal (Arbaaz Khan) and their 'Chachu' (Dharmendra). Muskaan's childhood friend, Ujaala (...", "released": 890956800000, "runtime": 162, "title": "Pyaar Kiya To Darna Kya", "tomatoes": {"dvd": 1173139200000, "lastUpdated": 1438631502000, "viewer": {"meter": 73, "numReviews": 1307, "rating": 3.7}}, "type": "movie", "writers": ["Sanjeev Duggal (dialogue)", "Sohail Khan (story)"], "year": 1998}