{"_id": "573a13baf29313caabd5246f", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["John Leguizamo", "Harvey Keitel", "Florencia Lozano", "Diane Venora"], "countries": ["USA"], "directors": ["Franc. Reyes"], "fullplot": "In New York, Detective Alberto Santana comes with his partner Joseph Bruno to meet his wife Gina and his daughter Celeste to celebrate her eighteenth birthday. Out of the blue, Alberto is shot in his head on the sidewalk by a man wearing a hood that delivers a religious message from the Lord. Many years later, Celeste is a detective of the New York Police Department and partner of Joe Bruno. When the crooks Alden and Jeff Kane, who had torched their buildings to receive the insurance, are released from prison, they are executed by two criminals in the same modus operandi of detective Santana, and the police department concludes that they are the same killers. Lieutenant Diaz assigns Detective Manso and Detective Demarco from narcotics to investigate the case, for the deception of Celeste. Then the drug dealer Chino and his gang are executed in Manhattan's Lower East Side by the killers Dante and his deformed and deranged twin brother Perfecto, and Lieutenant Diaz teams up Joe and Celeste with Manso and Demarco. Meanwhile, Dante meets Celeste in the church and they date first and have a love affair. When Perfecto decides to kill Joe, Dante argues with him but the dysfunctional brother does not listen to him.", "genres": ["Crime"], "imdb": {"id": 880570, "rating": 4.5, "votes": 1151}, "languages": ["English"], "lastupdated": "2015-09-07 00:29:44.127000000", "plot": "A NYPD detective attempts to avenge the death of her father, but unwittingly becomes involved with one of his killers.", "poster": "https://m.media-amazon.com/images/M/MV5BODg0NjM3NTE1Nl5BMl5BanBnXkFtZTcwMTAxNDE4Mg@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1255651200000, "runtime": 89, "title": "The Ministers", "tomatoes": {"dvd": 1263254400000, "lastUpdated": 1440271310000, "production": "Maya Releasing", "viewer": {"meter": 13, "numReviews": 577, "rating": 2.3}, "website": "http://www.theministersmovie.com"}, "type": "movie", "writers": ["Franc. Reyes"], "year": 2009}