{"_id": "573a13cdf29313caabd83c44", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Paul Rudd", "Jennifer Aniston", "Justin Theroux", "Alan Alda"], "countries": ["USA"], "directors": ["David Wain"], "fullplot": "In New York, the aspirant filmmaker Linda convinces her husband George Gergenblatt to buy an expensive Micro Loft apartment in Manhattan. Linda expects to sell a documentary about penguins to HBO to help the payment of the installments and George expects a promotion. However, HBO rejects the documentary and George's company has folded and he is fired. With the American financial crisis, they lose a large amount selling the apartment and George does not find a new job. George's brother Rick offers a job position in his company in Atlanta. They drive from New York to Atlanta and they decide to stop for the night in the hotel Elysium. However they see a naked man running toward their car and George tries to return to the highway but accidentally he turns his car over. Soon they learn the Elysium is a hippie and vegan community and the dwellers invite George and Linda to stay with them. However, they decide to go to Atlanta but soon George has an argument with his arrogant brother. George returns to Elysium with Linda and they decide to stay for a two-week trial. A couple of days later, Linda feels well with her new friends but George has difficulties to adapt himself to the rules of Elysium.", "genres": ["Comedy"], "imdb": {"id": 1655460, "rating": 5.6, "votes": 58892}, "languages": ["English"], "lastupdated": "2015-09-17 01:39:21.093000000", "metacritic": 53, "num_mflix_comments": 1, "plot": "Rattled by sudden unemployment, a Manhattan couple surveys alternative living options, ultimately deciding to experiment with living on a rural commune where free love rules.", "poster": "https://m.media-amazon.com/images/M/MV5BMjA5NjIyOTY1Nl5BMl5BanBnXkFtZTcwMDY3NjQ0Nw@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1330041600000, "runtime": 98, "title": "Wanderlust", "type": "movie", "writers": ["David Wain", "Ken Marino"], "year": 2012}