{"_id": "573a13bdf29313caabd58b9c", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Neel Rènholt", "Mikkel Arendt", "Julie R. èlgaard", "Mira Wanting"], "countries": ["Denmark"], "directors": ["Martin Barnewitz"], "fullplot": "Wanting to start a fresh, Katrine moves from the province into a dormitory in Copenhagen and enrolls at the University. But when she crosses conniving Sanne by getting together with Sanne's ex, all hell breaks loose. Sanne and her friends try to bully Katrine out of the dormitory. They frighten her with an old myth surrounding the ghost of a former resident. Yet the myth very soon becomes a reality. By accident, Katrine sets the ghost free, who then starts a terrifyingly gruesome attack on the dormitory's residents. Only Katrine knows the fate of the remaining residents if she doesn't stop the actions of the ghost. However, no one believes Katrine's story and they accuse her of the series of mysterious murders. She seeks help in the former resident Rolf. While the residents continue to die around them, Katrine and Rolf embark on a desperate struggle to stop the ghost before it kills those that are left...", "genres": ["Horror"], "imdb": {"id": 1003005, "rating": 4.5, "votes": 1173}, "languages": ["Danish"], "lastupdated": "2015-09-02 00:45:31.367000000", "num_mflix_comments": 1, "plot": "Wanting to start a fresh, Katrine moves from the province into a dormitory in Copenhagen and enrolls at the University. But when she crosses conniving Sanne by getting together with Sanne's...", "poster": "https://m.media-amazon.com/images/M/MV5BMzM0YzliOGYtYzczNi00N2FjLTkxMWEtYjlkNWRjM2ViZTJlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1186704000000, "runtime": 91, "title": "Room 205", "tomatoes": {"dvd": 1223942400000, "lastUpdated": 1441995104000, "production": "LionsGate Entertainment", "viewer": {"meter": 21, "numReviews": 428, "rating": 2.4}}, "type": "movie", "writers": ["Jannik Tai Mosholt"], "year": 2007}