{"_id": "573a13b9f29313caabd4f255", "awards": {"nominations": 2, "text": "1 win & 2 nominations.", "wins": 1}, "cast": ["Joaquin Phoenix", "Elle Fanning", "Jennifer Connelly", "Sean Curley"], "countries": ["USA", "Germany"], "directors": ["Terry George"], "fullplot": "On a warm September evening, college professor Ethan Learner, his wife Grace, and their daughter Emma are attending a recital. Their 10-year-old son Josh is playing cello - beautifully, as usual. His younger sister looks up to him, and his parents are proud of their son. On the way home, they all stop at a gas station on Reservation Road. There, in one terrible instant, he is taken from them forever. On a warm September evening, law associate Dwight Arno and his 11-year-old son Lucas are attending a baseball game. Their favorite team, the Red Sox, is playing - and, hopefully, heading for the World Series. Dwight cherishes his time spent with Lucas. Driving his son back to his ex-wife, Lucas' mother Ruth Wheldon, Dwight heads towards his fateful encounter at Reservation Road. The accident happens so fast that Lucas is all but unaware, while Ethan - the only witness - is all too aware, as a panicked Dwight speeds away. The police are called, and an investigation begins. Haunted by the tragedy, both fathers react in unexpected ways, as do Grace and Emma. As a reckoning looms, the two fathers are forced to make the hardest choices of their lives.", "genres": ["Crime", "Drama", "Thriller"], "imdb": {"id": 831884, "rating": 6.7, "votes": 17687}, "languages": ["English"], "lastupdated": "2015-09-10 17:07:38.793000000", "metacritic": 46, "num_mflix_comments": 1, "plot": "The lives of two families change forever after a fatal tragedy takes place on Reservation Road.", "poster": "https://m.media-amazon.com/images/M/MV5BNWU0M2EzYWQtNGNiZC00Mzg5LTkxZDgtNGMyZGMwNDk3MTE2XkEyXkFqcGdeQXVyNDkzNTM2ODg@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1213833600000, "runtime": 102, "title": "Reservation Road", "tomatoes": {"consensus": "While the performances are fine, Reservation Road quickly adopts an excessively maudlin tone along with highly improbable plot turns.", "critic": {"meter": 36, "numReviews": 111, "rating": 5.2}, "dvd": 1207612800000, "fresh": 40, "lastUpdated": 1440182791000, "production": "Focus Features", "rotten": 71, "viewer": {"meter": 52, "numReviews": 14399, "rating": 3.3}, "website": "http://www.focusfeatures.com/"}, "type": "movie", "writers": ["John Burnham Schwartz (screenplay)", "Terry George (screenplay)", "John Burnham Schwartz (novel)"], "year": 2007}