{"_id": "573a13e5f29313caabdc28b0", "awards": {"nominations": 1, "text": "1 win & 1 nomination.", "wins": 1}, "cast": ["Tricia Helfer", "J.T. Hodges", "Mark Lutz", "Cristina Rosato"], "directors": ["Harvey Crossland"], "fullplot": "Sean, who runs a New York City advertising agency, and Owen, a small-town handyman and musician, swap residences for the holidays. Mia, who works for Sean, helps Owen get settled into his new apartment while Ryan, sent by Owen to fix a broken heater, helps Sean find the charm of living in a small town. Owen is a fish-out-of-water in the big city and tries to flirt with Halo, an aspiring model/actress/singer who lives in the apartment building. One night, after Mia has shown Owen around the town, Halo sees him entering the elevator while he's dressed in a wardrobe borrowed from Sean's closet. Thinking he's rich, Halo flirts back and sets up a date. Mia, however, warns him that she just thinks he has money because he's living in Sean's apartment and is wearing Sean's clothes. On the day of the big date, Owen realizes who he really is and what he really wants in life. Meanwhile, Sean is falling in love with the local veterinarian, who happens to be harboring a big secret - two, actually. He's surprised when his ex-fiancè' appears on his doorstep, ready to accept his marriage proposal and move back to New York with him. This complicates Sean's blossoming relationship with the small town girl, who has told him that her career as a veterinarian relies on her staying where she is, and to simply enjoy their love while it lasts. On Christmas Eve, Sean invites Owen to come back for a special dinner, where a surprise awaits all of them.", "imdb": {"id": 2964654, "rating": 6.5, "votes": 546}, "languages": ["English"], "lastupdated": "2015-09-15 05:39:15.563000000", "plot": "Sean, who runs a New York City advertising agency, and Owen, a small-town handyman and musician, swap residences for the holidays. Mia, who works for Sean, helps Owen get settled into his ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTEwNTIzMTM3MDNeQTJeQWpwZ15BbWU4MDQ3NDA5NjAx._V1_SY1000_SX677_AL_.jpg", "released": 1387065600000, "title": "Finding Christmas", "tomatoes": {"lastUpdated": 1441905045000, "viewer": {"numReviews": 1, "rating": 0}, "website": "http://www.farfromhomemovie.com/"}, "type": "movie", "writers": ["Lee Ventura"], "year": 2013}