{"_id": "573a1399f29313caabcecb8d", "awards": {"nominations": 2, "text": "3 wins & 2 nominations.", "wins": 3}, "cast": ["Vittorio Mezzogiorno", "Mathilda May", "Stefan Glowacz", "Al Waxman"], "countries": ["Germany", "France", "Canada", "Italy", "Argentina"], "directors": ["Werner Herzog"], "fullplot": "A meeting of two world famous climbers, one an experienced mountaineer the other a sport climber, and a journalist (Ivan) results in a bet on which of the two is the best climber. Roger (the mountaineering expert) states that Martin (the sport climber) wouldn't survive a day on a 'real' climbing expedition, although he is considered to be the world's best sport climber (having just won an indoor 'world championship,' an event depicted in the opening scene). They plan to climb 'Cerro Torre,' in the Patagonia region of South America, near the Argentinian/Chilean border, one of the world's most difficult mountains, especially considering the extreme weather conditions common to the area. The rivalry among the two men results eventually in the death of their common friend and the stealing of Roger's girlfriend (Katrina) by Martin. In the end the rivalry results in a 'climb against time' in which Martin and Roger each attempt different routes up the mountain in a race to the summit. But they're in for a surprise.", "genres": ["Drama"], "imdb": {"id": 102855, "rating": 6.3, "votes": 887}, "languages": ["English"], "lastupdated": "2015-07-14 00:24:22.710000000", "num_mflix_comments": 1, "plot": "Two famous competitive climbers make a bet on who can climb Cerro Torre, one of the most dangerous mountains in Argentina and the world, first. As the day of the climb approaches, their increasing competitiveness becomes destructive.", "poster": "https://m.media-amazon.com/images/M/MV5BMjkwNDEyODY4OF5BMl5BanBnXkFtZTcwODQyNjUyMQ@@._V1_SY1000_SX677_AL_.jpg", "released": 686448000000, "runtime": 105, "title": "Scream of Stone", "tomatoes": {"lastUpdated": 1441134787000, "production": "Alliance", "viewer": {"meter": 61, "numReviews": 407, "rating": 3.6}}, "type": "movie", "writers": ["Hans-Ulrich Klenner", "Walter Saxer", "Robert Geoffrion", "Reinhold Messner (original idea)"], "year": 1991}