{"_id": "573a13b7f29313caabd496bb", "awards": {"nominations": 1, "text": "1 win & 1 nomination.", "wins": 1}, "cast": ["Eiji Bandè", "Kaba Chan", "Shidè Nakamura", "Hiroki Narimiya"], "countries": ["Japan"], "directors": ["Gisaburo Sugii"], "fullplot": "Fleeing a violent thunderstorm, a young goat named Mei becomes separated from his tribe and takes shelter in a cabin. He soon is not alone, as another creature limps inside. In the dark they cannot see each other, both have colds and cannot smell each other, but in conversation assume they are of the same kind for they have much in common even apart from a shared fear of thunder, having been taught by elders to run fast to survive and to value loyalty and friendship. They agree to meet the next day for a picnic, with the words \"stormy night\" used to identify each other. Getting past their initial shock at seeing each other in the daylight, their friendship grows even though they were born enemies, as a goat and a wolf. They continue to meet secretly with Gav fighting off his natural predator tendencies. One day Gav helps Mei escape a wolf hunt, and they are observed together. The other goats demand that Mei use his friend to get details of the wolves plans or be exiled. Gav is threatened with death unless he uses Mei to get details of the goat's habits. With all of the forest watching, they opt to jump into a raging river in an attempt to escape since neither will betray the other. Surviving the waters, they start a journey over a tall snow-capped peak to find a forest beyond where they can live in peace. The bitter cold of a blizzard overcomes Mei, and the pack still pursues them. Respectively facing death from starvation or the pack, Mei and Gav both attempt to sacrifice themselves for the other.", "genres": ["Animation"], "imdb": {"id": 498465, "rating": 7.2, "votes": 757}, "languages": ["Japanese"], "lastupdated": "2015-09-07 01:10:16.627000000", "num_mflix_comments": 1, "plot": "Fleeing a violent thunderstorm, a young goat named Mei becomes separated from his tribe and takes shelter in a cabin. He soon is not alone, as another creature limps inside. In the dark ...", "released": 1134172800000, "runtime": 110, "title": "Stormy Night", "tomatoes": {"lastUpdated": 1420663604000, "viewer": {"meter": 86, "numReviews": 351, "rating": 4.3}}, "type": "movie", "writers": ["Yèichi Kimura (book)", "Gisaburo Sugii"], "year": 2005}