{"_id": "573a1395f29313caabce28d4", "awards": {"nominations": 1, "text": "Nominated for 1 BAFTA Film Award. Another 1 win & 1 nomination.", "wins": 2}, "cast": ["Jean-Paul Belmondo", "Anna Karina", "Graziella Galvani"], "countries": ["France", "Italy"], "directors": ["Jean-Luc Godard"], "fullplot": "Ferdinand Griffon is married with his wealthy Italian wife and has been recently fired from the television where he worked. His wife forces him to go to a party in the house of her influent father that wants to introduce Ferdinand to a potential employer. Her brother brings the babysitter Marianne Renoir to take care of their children. Ferdinand feels bored in the bourgeois party and borrows his brother-in-law's car to return home. He meets Marianne, who was his lover five years ago and insists to call him Pierrot, and offers to take her home; however, he spends the night with her and finds that she is involved in smuggling weapons. When Marianne is chased by terrorists, they decide to travel to the beach without any money, leaving Paris and his family behind in a crazy journey to nowhere.", "genres": ["Crime", "Drama", "Romance"], "imdb": {"id": 59592, "rating": 7.7, "votes": 17085}, "languages": ["French", "English", "Italian"], "lastupdated": "2015-08-30 00:53:15.337000000", "plot": "Pierrot escapes his boring society and travels from Paris to the Mediterranean Sea with Marianne, a girl chased by hit-men from Algeria. They lead an unorthodox life, always on the run.", "poster": "https://m.media-amazon.com/images/M/MV5BMTQ0OTc4MDcxMl5BMl5BanBnXkFtZTgwNjIzMjA0NzE@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": -30931200000, "runtime": 110, "title": "Pierrot le Fou", "tomatoes": {"consensus": "Colorful, subversive, and overall beguiling, Pierrot le Fou is arguably Jean-Luc Godard's quintessential work.", "critic": {"meter": 85, "numReviews": 39, "rating": 7.8}, "dvd": 1203379200000, "fresh": 33, "lastUpdated": 1442078422000, "production": "Janus Films", "rotten": 6, "viewer": {"meter": 87, "numReviews": 9432, "rating": 4.1}}, "type": "movie", "writers": ["Jean-Luc Godard"], "year": 1965}