{"_id": "573a1396f29313caabce4a30", "awards": {"nominations": 1, "text": "Nominated for 1 Golden Globe. Another 3 wins & 1 nomination.", "wins": 4}, "cast": ["Joanne Woodward", "Nell Potts", "Roberta Wallach", "Judith Lowry"], "countries": ["USA"], "directors": ["Paul Newman"], "fullplot": "From the Pullizer Prize winning play by Paul Zindel, this is the story of Beatrice Hunsdorfer and her daughters, Ruth and Matilda. A middle-aged widowed eccentric, Beatrice is looking for her life in the classified ads while all about her is the rubble of an unkempt house. All she needs is the right opportunity, she says puffing on a cigarette. Poorly equipped to survive the vagaries of modern life, she has nonetheless always managed to muddle through. Ruth, epileptic and making her way through the rebellious phase of adolescence, seems doomed to make the same mistakes as her mother. Quiet Matilda, on the other hand, seeks refuge in her animals and her schoolwork. \"Jesus, don't you hate the world, Matilda?\" Beatrice asks her youngest daughter. The title of the film is also the subject of Matilda's science project at school and serves as a metaphor for the way life affects each of us differently -- how some are able to find opportunity in adversity and thrive and how some succumb when the burden becomes too heavy. This is the story of slowly drowning and grasping desperately for a lifeline only to find that there's none there and you must save yourself. \"No, Mama,\" Matilda says, \"I don't hate the world.\" (Nell Potts, who stars as Matilda, is the stage name of Eleanor Newman -- Joanne Woodward's real-life daughter. She also appeared as the young Rachel in *Rachel, Rachel*.)", "genres": ["Drama"], "imdb": {"id": 68528, "rating": 7.6, "votes": 1371}, "languages": ["English"], "lastupdated": "2015-08-25 00:17:16.320000000", "plot": "From the Pullizer Prize winning play by Paul Zindel, this is the story of Beatrice Hunsdorfer and her daughters, Ruth and Matilda. A middle-aged widowed eccentric, Beatrice is looking for ...", "poster": "https://m.media-amazon.com/images/M/MV5BMzkxMDQ4MTQxMl5BMl5BanBnXkFtZTgwMDY0MTM0MDE@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 107568000000, "runtime": 100, "title": "The Effect of Gamma Rays on Man-in-the-Moon Marigolds", "tomatoes": {"critic": {"meter": 57, "numReviews": 7, "rating": 6.8}, "fresh": 4, "lastUpdated": 1441135796000, "production": "20th Century Fox", "rotten": 3, "viewer": {"meter": 87, "numReviews": 504, "rating": 3.9}}, "type": "movie", "writers": ["Paul Zindel (play)", "Alvin Sargent (screenplay)"], "year": 1972}