{"_id": "573a13a4f29313caabd107d3", "awards": {"nominations": 4, "text": "13 wins & 4 nominations.", "wins": 13}, "cast": ["Nargess Mamizadeh", "Maryiam Palvin Almani", "Mojgan Faramarzi", "Elham Saboktakin"], "countries": ["Iran", "Italy", "Switzerland"], "directors": ["Jafar Panahi"], "fullplot": "In a hospital waiting room a woman learns her daughter, Solmaz Gholami, has just given birth. The ultrasound test had prepared the family for a boy. The baby, it turns out, is a girl. The joy the mother anticipated turns to terror for she knows her son-in-law's family will abandon her daughter. The old woman flees as the in-laws arrive. On the crowded streets of Tehran - a place where women are not permitted to stay out on their own or smoke in public - two women are also on the run. Arezou and Nargess have just been granted temporary leave from prison but they have no plans to return. They manage to scrounge together enough money for the bus trip to Nargess' hometown, but she lacks proper identification, and the police are searching everyone at the station. Meanwhile, their friend Pari has just escaped from prison in order to have an abortion. Threatened with death by her brothers, she flees from her father's house and meets with a former inmate, Elham, who is now married to a doctor and works in a hospital. Despite her connections, Elham is unable to help Pari in her hour of need. Despondent, Pari wanders the streets and chances upon Nayereh, a woman about to abandon her young daughter. Pari tries to stop her, but it is too late. Soon after, Nayareh, falsely accused of prostitution, is taken into custody by the police. As Panahi's narrative shifts dynamically from woman to woman, their stories culminate with tremendous potency, transforming a shared sense of despair and injustice into one kinship, and even hope.", "genres": ["Drama"], "imdb": {"id": 255094, "rating": 7.5, "votes": 4213}, "languages": ["Persian"], "lastupdated": "2015-09-06 00:10:06.213000000", "metacritic": 85, "num_mflix_comments": 1, "plot": "Various women struggle to function in the oppressively sexist society of contemporary Iran.", "poster": "https://m.media-amazon.com/images/M/MV5BMjE1NjczMTI0OV5BMl5BanBnXkFtZTcwMDkzMTkyMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 968371200000, "runtime": 90, "title": "The Circle", "tomatoes": {"consensus": "Bleak, yet powerful, The Circle offers a searing indictment of the oppressive conditions experienced by women in Iran.", "critic": {"meter": 93, "numReviews": 60, "rating": 7.8}, "dvd": 1008633600000, "fresh": 56, "lastUpdated": 1442343175000, "production": "Winstar Cinema", "rotten": 4, "viewer": {"meter": 79, "numReviews": 2256, "rating": 3.7}}, "type": "movie", "writers": ["Kambuzia Partovi", "Jafar Panahi (idea)"], "year": 2000}