{"_id": "573a139af29313caabcefe8d", "awards": {"nominations": 1, "text": "7 wins & 1 nomination.", "wins": 7}, "cast": ["Karishma Jhalani", "Ramanjeet Kaur", "Dilip Mehta", "Javed Jaffrey"], "countries": ["Canada", "India"], "directors": ["Deepa Mehta"], "fullplot": "Ashok runs a family business that sells takeout food that also has a video rental store at the side. Ashok's extended family includes his wife Radha, his brother Jatin, their ailing mother Biji and their manservant Mundu, all living under the same roof. Jatin, at the insistence of Ashok and their mother, Biji, agrees to marry the beautiful Sita in an arranged marriage, although he is actually in love with Julie, a Chinese-Indian. At first glance, you see a happy middle-class family going through the normal paces of everyday life. However, as the layers are slowly peeled back, we find a simmering cauldron of discontent within the family, with almost every family member living a lie. Both marriages in the family turn out to be emotionally empty, without love or passion. While Ashok is an ascetic who has taken a vow of celibacy, Jatin is a handsome ladies' man who is still openly seeing Julie even after his marriage to Sita. Ashok has pledged his total devotion to a religious holy man, a swami, in order to purge his life of worldly desires and temptations. Radha, bound by her sense of duty to her husband, agrees to go along with his wishes. As you can imagine, with both husbands ignoring their spouses' emotional and sexual needs (albeit with reasons that are totally opposite from each other), it is only a matter of time before Radha and Sita look to one another for comfort and to satisfy their own passions. In this environment, it is only natural that Sita and Radha become fast friends, and, in time, much more than that. But their love is not without its share of painful obstacles.", "genres": ["Drama", "Romance"], "imdb": {"id": 116308, "rating": 7.3, "votes": 4497}, "languages": ["English", "Hindi"], "lastupdated": "2015-09-06 00:13:04.917000000", "metacritic": 64, "num_mflix_comments": 1, "plot": "Ashok runs a family business that sells takeout food that also has a video rental store at the side. Ashok's extended family includes his wife Radha, his brother Jatin, their ailing mother ...", "poster": "https://m.media-amazon.com/images/M/MV5BZDJlNjk0NDMtZGYxYy00ZGMxLTljOTUtYTgzZmQ0ODlhY2IzXkEyXkFqcGdeQXVyNTM0NTU5Mg@@._V1_SY1000_SX677_AL_.jpg", "rated": "UNRATED", "released": 872208000000, "runtime": 104, "title": "Fire", "tomatoes": {"dvd": 1050969600000, "lastUpdated": 1442344201000, "production": "Gage & Gage", "viewer": {"meter": 33, "numReviews": 542, "rating": 3.3}}, "type": "movie", "writers": ["Deepa Mehta"], "year": 1996}