{"_id": "573a13d6f29313caabd9e69a", "awards": {"nominations": 5, "text": "Nominated for 2 Primetime Emmys. Another 1 win & 5 nominations.", "wins": 3}, "cast": ["Christopher Plummer", "Frank Langella", "Ed Begley Jr.", "Peter Gerety"], "countries": ["USA"], "directors": ["Stephen Frears"], "fullplot": "In 1964, world champion boxer Muhammad Ali requested exemption from the military draft based on his religious beliefs. His request was denied and when he refused induction into the army, he was convicted and sentenced to 5 years imprisonment. His case eventually works itself up the Supreme Court. In their first conference after the case is presented, the justices decide by majority vote to uphold the conviction and Justice John Harlan is tasked with preparing the majority opinion. He assigns one of his clerks, Kevin Connolly, to prepare a first draft but try as he might he believes that decision his wrong. His draft argues for overturning the conviction and Harlan agrees with him. The justice must now find a way to convince his colleagues.", "genres": ["Drama"], "imdb": {"id": 2061756, "rating": 6.8, "votes": 1403}, "languages": ["English"], "lastupdated": "2015-09-07 00:25:25.457000000", "plot": "Ali's biggest match, his fight with the US government. A film about the politics and hubris surrounding the Vietnam War and the revenge exacted on America's greatest sportsman of the 20th century because he refused to fight in that war.", "poster": "https://m.media-amazon.com/images/M/MV5BMmU1MmQyODAtNjM3MC00NzE3LWFkMzMtZjRmOGZiMTE5MjhjXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "released": 1380931200000, "runtime": 97, "title": "Muhammad Ali's Greatest Fight", "tomatoes": {"critic": {"meter": 43, "numReviews": 8, "rating": 6.3}, "fresh": 3, "lastUpdated": 1441048415000, "production": "Rainmark Films", "rotten": 5, "viewer": {"numReviews": 97, "rating": 3.3}}, "type": "movie", "writers": ["Howard L. Bingham (based on the book by)", "Shawn Slovo", "Mark Wallace (based on the book by)"], "year": 2013}