{"_id": "573a1394f29313caabcdfebb", "awards": {"nominations": 1, "text": "Nominated for 3 BAFTA Film Awards. Another 2 wins & 1 nomination.", "wins": 5}, "cast": ["Ulla Jacobsson", "Eva Dahlbeck", "Harriet Andersson", "Margit Carlqvist"], "countries": ["Sweden"], "directors": ["Ingmar Bergman"], "fullplot": "It's late nineteenth century Sweden. Middle aged lawyer Fredrik Egerman and his nineteen year old current wife Anne Egerman's two-year marriage has not yet been consummated. Fredrik wants to give Anne as much time as she needs to feel comfortable before losing her virginity. Although she loved Fredrik when they got married, Anne realizes she is attracted to Fredrik's adult son, Henrik Egerman, a brooding seminary student who is home following his most recent exams. Also a virgin, Henrik has been in an awkward flirtation with the Egermans' sexually experienced maid, Petra, in an effort to lose his virginity. When she first sees actress Desirèe Armfeldt, Anne, without Fredrik telling her, knows that Desirèe and Fredrik used to be lovers, the two who still have feelings for each other. Desirèe currently is having an affair with married Count Carl-Magnus Malcolm. While he is jealous of any man who Desirèe shows any attention to such as Fredrik, he is not the same with his young wife, the Countess Charlotte Malcolm, who he freely allows to have affairs of her own, or so he says. The Countess and Anne also happen to be friends. Largely orchestrated by Desirèe, these interrelationships may play themselves out on one summer overnight social gathering at Desirèe's mother's house, but not without the potential of some unforeseen tragic consequences.", "genres": ["Comedy", "Romance"], "imdb": {"id": 48641, "rating": 8, "votes": 8389}, "languages": ["Swedish"], "lastupdated": "2015-09-14 17:30:32.880000000", "plot": "It's late nineteenth century Sweden. Middle aged lawyer Fredrik Egerman and his nineteen year old current wife Anne Egerman's two-year marriage has not yet been consummated. Fredrik wants ...", "poster": "https://m.media-amazon.com/images/M/MV5BZjY0Zjg3MGItMTc5Yy00MTlmLThhZjMtZGIzNDI1ZjFjN2VmXkEyXkFqcGdeQXVyNzQxNDExNTU@._V1_SY1000_SX677_AL_.jpg", "rated": "APPROVED", "released": -379468800000, "runtime": 108, "title": "Smiles of a Summer Night", "tomatoes": {"critic": {"meter": 100, "numReviews": 13, "rating": 8.5}, "dvd": 1085443200000, "fresh": 13, "lastUpdated": 1441046608000, "production": "Criterion Collection", "rotten": 0, "viewer": {"meter": 89, "numReviews": 5912, "rating": 4.1}}, "type": "movie", "writers": ["Ingmar Bergman"], "year": 1955}