{"_id": "573a1399f29313caabceda01", "awards": {"nominations": 4, "text": "Nominated for 1 Oscar. Another 2 wins & 4 nominations.", "wins": 3}, "cast": ["Kevin Kline", "Sigourney Weaver", "Frank Langella", "Kevin Dunn"], "countries": ["USA"], "directors": ["Ivan Reitman"], "fullplot": "Bill Mitchell is the philandering and distant President of the United States. Dave Kovic is a sweet-natured and caring Temp Agency operator, who by a staggering coincidence looks exactly like the President. As such, when Mitchell wants to escape an official luncheon, the Secret Service hires Dave to stand in for him. Unfortunately, Mitchell suffers a severe stroke whilst having sex with one of his aides, and Dave finds himself stuck in the role indefinitely. The corrupt and manipulative Chief of Staff, Bob Alexander, plans to use Dave to elevate himself to the White House - but unfortunately, he doesn't count on Dave enjoying himself in office, using his luck to make the country a better place, and falling in love with the beautiful First Lady...", "genres": ["Comedy", "Romance"], "imdb": {"id": 106673, "rating": 6.8, "votes": 39012}, "languages": ["English", "Spanish"], "lastupdated": "2015-09-16 00:10:53.190000000", "num_mflix_comments": 1, "plot": "To avoid a potentially explosive scandal when the U.S. President goes into a coma, an affable temp agency owner with an uncanny resemblance, is put in his place.", "poster": "https://m.media-amazon.com/images/M/MV5BOGVlM2I0NDUtYjQ4ZC00NTJjLTkzZGUtZGM5NGZjZDQwOWZkXkEyXkFqcGdeQXVyNDk3NzU2MTQ@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 736732800000, "runtime": 110, "title": "Dave", "tomatoes": {"consensus": "Ivan Reitman's refreshingly earnest political comedy benefits from an understated, charming script and a breezy performance by Kevin Kline.", "critic": {"meter": 94, "numReviews": 54, "rating": 7.6}, "dvd": 893721600000, "fresh": 51, "lastUpdated": 1442345379000, "production": "Warner Bros.", "rotten": 3, "viewer": {"meter": 71, "numReviews": 42319, "rating": 3.1}}, "type": "movie", "writers": ["Gary Ross"], "year": 1993}