{"_id": "573a13b5f29313caabd441a6", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Ajay Devgn", "Shahid Kapoor", "Bipasha Basu", "Amrita Rao"], "countries": ["India"], "directors": ["John Mathew Matthan"], "fullplot": "How far can greed take a man? Can the 'greens' ever fight the money and might of the builders lobby? Can nature ever win over the bulldozer? These are the riveting issues raised by Shikhar. Pitted against each other in this battle of man vs nature are two different but equally powerful protagonists. Gaurav Gupta (aka GG) is a man who started with nothing and now believes that only money can fuel his ambitions. While Guruji, to the manor born, believes that wealth means nothing if not used for society. Caught in the tussle between the two is the unworldly Jaidev Vardhan, who while respecting his father's philosophy, falls hook, line and sinker for GG's gilt-edged dreams. While Guruji hopes that Jai will return to his roots, GG uses the glamorous Natasha to bewitch Jai and the unscrupulous politician Amrit Patil, to exploit the tribal into selling their lands. Madhavi watches the man she loves being carried away in to a world of wine, women and wealth. If Shikhar is the Pinnacle of good deeds and thoughts, Shikhar is also the height of ambition and greed. Which peak will Jai choose to scale in this battle of man vs. nature?", "genres": ["Drama", "Musical", "Romance"], "imdb": {"id": 475627, "rating": 5, "votes": 776}, "languages": ["Hindi"], "lastupdated": "2015-09-03 00:36:34.007000000", "num_mflix_comments": 3, "plot": "How far can greed take a man? Can the 'greens' ever fight the money and might of the builders lobby? Can nature ever win over the bulldozer? These are the riveting issues raised by Shikhar....", "released": 1135900800000, "title": "Shikhar", "tomatoes": {"critic": {"numReviews": 1}, "dvd": 1145923200000, "fresh": 0, "lastUpdated": 1422455324000, "production": "Cinematt Pictures", "rotten": 1, "viewer": {"meter": 53, "numReviews": 1248, "rating": 3.3}, "website": "http://www.shikharmovie.com/"}, "type": "movie", "writers": ["Dr. Bodhisattva (dialogue)", "Manohar Iyer (lyrics)", "John Mathew Matthan (screenplay)", "Chandrashekhar Rajit (lyrics)", "Sameer (lyrics)", "Anita Sarkar (lyrics)", "C.K. Raajaa Chandra Sekar (lyrics)", "Viju Shah (lyrics)", "Mani Shankar (lyrics)", "Sudhakar Sharma (lyrics)", "Abbas Tyrewala (screenplay)"], "year": 2005}