{"_id": "573a1391f29313caabcd956e", "awards": {"nominations": 1, "text": "1 win & 1 nomination.", "wins": 1}, "cast": ["Max Schreck", "Gustav von Wangenheim", "Greta Schrèder", "Georg H. Schnell"], "countries": ["Germany"], "directors": ["F.W. Murnau"], "fullplot": "Wisbourg, Germany based estate agent Knock dispatches his associate, Hutter, to Count Orlok's castle in Transylvania as the Count wants to purchase an isolated house in Wisbourg. They plan on selling him the one across the way from Hutter's own home. Hutter leaves his innocent wife, Ellen, with some friends while he is away. Hutter's trek is an unusual one, with many locals not wanting to take him near the castle where strange events have been occurring. Once at the castle, Hutter does manage to sell the Count the house, but he also notices and feels unusual occurrences, primarily feeling like there is a dark shadow hanging over him, even in the daytime when the Count is unusually asleep. Hutter eventually sees the Count's sleeping chamber in a crypt, and based on a book he has recently read, believes the Count is really a vampire or Nosferatu. While Hutter is trapped in the castle, the Count, hiding in a shipment of coffins, makes his way to Wisbourg, causing death along his way, which most attribute to the plague. Hutter himself tries to rush home to save his town and most importantly save Ellen from Nosferatu's imminent arrival. In Wisbourg, Ellen can feel the impending darkness as Nosferatu gets closer. But she learns that a sinless woman can sacrifice herself to kill the vampire. Will Hutter be able to save Ellen either from Nosferatu and/or her self-sacrifice?", "genres": ["Horror"], "imdb": {"id": 13442, "rating": 8, "votes": 63557}, "languages": ["German"], "lastupdated": "2015-09-07 07:20:20.853000000", "num_mflix_comments": 1, "plot": "Vampire Count Orlok expresses interest in a new residence and real estate agent Hutter's wife. Silent classic based on the story \"Dracula.\"", "poster": "https://m.media-amazon.com/images/M/MV5BMTAxYjEyMTctZTg3Ni00MGZmLWIxMmMtOGM2NTFiY2U3MmExXkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_SY1000_SX677_AL_.jpg", "rated": "UNRATED", "released": -1280620800000, "runtime": 81, "title": "Nosferatu", "tomatoes": {"consensus": "One of the silent era's most influential masterpieces, Nosferatu's eerie, gothic feel -- and a chilling performance from Max Shrek as the vampire -- set the template for the horror films that followed.", "critic": {"meter": 97, "numReviews": 62, "rating": 9}, "dvd": 877478400000, "fresh": 60, "lastUpdated": 1440098125000, "production": "Film Arts Guild", "rotten": 2, "viewer": {"meter": 87, "numReviews": 46806, "rating": 4}}, "type": "movie", "writers": ["Henrik Galeen (screen play)", "Bram Stoker (based on the novel: \"Dracula\")"], "year": 1922}