{"_id": "573a13cff29313caabd888eb", "awards": {"nominations": 27, "text": "8 wins & 27 nominations.", "wins": 8}, "cast": ["Qianyuan Wang", "Yongzhen Guo", "Shin-yeong Jang", "Qian Liu"], "countries": ["China"], "directors": ["Meng Zhang"], "fullplot": "Steelworker Chen has a passion for music and plays the accordion in a local band with a close group of friends. When his estranged wife returns one day after years of absence, she demands a divorce and sole custody of their daughter. Chen is at a loss. He doesn't mind divorcing a woman who has become a stranger, but he can't bear to part with his daughter. Chen has worked hard to give her a respectable life and has taught her his love of music. When asked if she'd rather stay with her father or go with her mother, the girl gives a practical, devastating answer: she'll go with whomever can provide her with a piano. Chen cannot afford such a luxury item, but the piano becomes his last hope to save what little is left of his family. With the help of his loyal friends and the support of his lover - the singer in his band - Chen concocts several plans to fulfill his daughter's wish, from sneaking her into the local music school at night to drawing a fake piano. He even tries to steal the instrument from the school - anything to keep her near him. Nothing works for long, until Chen looks around his fading steel factory town and hits on the perfect solution.", "genres": ["Comedy", "Drama"], "imdb": {"id": 1723118, "rating": 7.3, "votes": 624}, "languages": ["Chinese", "Mandarin", "Russian"], "lastupdated": "2015-05-07 01:26:47.727000000", "num_mflix_comments": 2, "plot": "To fight for custody of his daughter who loves playing the piano, a steel factory worker decides to forge a piano from scratch.", "poster": "https://m.media-amazon.com/images/M/MV5BNjRkYzVjY2QtNGE0OS00MTVhLWJlMTQtMzU4Mzk2MjdiNjI0XkEyXkFqcGdeQXVyNzI1NzMxNzM@._V1_SY1000_SX677_AL_.jpg", "released": 1310688000000, "runtime": 119, "title": "Gang de qin", "tomatoes": {"dvd": 1323043200000, "lastUpdated": 1440097204000, "production": "Film Movement", "viewer": {"meter": 90, "numReviews": 54, "rating": 3.9}, "website": "http://www.filmmovement.com/filmcatalog/index.asp?MerchandiseID=258"}, "type": "movie", "writers": ["Meng Zhang"], "year": 2010}