{"_id": "573a13cff29313caabd89610", "awards": {"nominations": 3, "text": "2 wins & 3 nominations.", "wins": 2}, "cast": ["Zamand Taha", "Sarwar Fazil", "Diya Mariwan", "Suliman Karim Mohamad"], "countries": ["Sweden", "Finland", "Iraq"], "directors": ["Karzan Kader"], "fullplot": "Iraq in the early 1990 was a devastating land to survive in. When we think of Iraq, the first thing that tends to pop into our minds is the war and Saddam Hussein. But there is another side too - it is perhaps the most notorious country in the world and it goes by the name Kurdistan. Welcome to BEKAS. This is a story about two homeless brothers (Zana, 7) and (Dana, 10) who live on the edge of survival. In the beginning of the story they catch a glimpse of Superman through a hole in the wall at the local cinema. Zana and Dana decide that they want to go to America and live with Superman. Once they get there he can solve all their problems, make their lives easy and punish everyone that has been mean to them. Zana, the younger brother, starts to make a list of all people he is going to tell Superman to punish. On top of the list is Saddam Hussein. Dana on the other hand makes a concrete plan for what they need to get there; money, passports, transportation and a way to get across the boarder. Unfortunately they have neither of those. But in spite of everything they decide to follow the dream.", "genres": ["Drama"], "imdb": {"id": 1733105, "rating": 7.4, "votes": 2062}, "languages": ["Kurdish"], "lastupdated": "2015-09-02 00:14:27.537000000", "num_mflix_comments": 2, "plot": "Iraq in the early 1990 was a devastating land to survive in. When we think of Iraq, the first thing that tends to pop into our minds is the war and Saddam Hussein. But there is another side...", "poster": "https://m.media-amazon.com/images/M/MV5BMTM2NTQzNDI4Ml5BMl5BanBnXkFtZTcwOTU1NDExOQ@@._V1_SY1000_SX677_AL_.jpg", "released": 1354233600000, "runtime": 97, "title": "Bekas", "tomatoes": {"lastUpdated": 1435775159000, "viewer": {"numReviews": 6, "rating": 3.6}}, "type": "movie", "writers": ["Karzan Kader"], "year": 2012}