{"_id": "573a13ccf29313caabd825dd", "awards": {"nominations": 2, "text": "1 win & 2 nominations.", "wins": 1}, "cast": ["Milos Bikovic", "Petar Strugar", "Nina Jankovic", "Danina Jeftic"], "countries": ["Serbia"], "directors": ["Dragan Bjelogrlic"], "fullplot": "Based on the book by famous sport journalist, Vladimir Stankovic, dramatized by renowned screenplay writers Srdjan Dragojevic and Ranko Bozic under the first-time director's palette of actor Dragan Bjelogrlic, this historical melodrama gives us an unique and somewhat nostalgic view into the 1930's of Belgrade and resurrects the old times reminding us of a quite distinctive era when values and virtues were something very different from what they are today. Thanks to the production teams of Intermedia Network, the epoch comes to life and at times we feel hypnotized by the magic of the cobblestone streets of Cubura, audiences sense the hype of using electricity, birth of the radio and the growing trend of cabaret nightclubs and Ford T model cars just like the one owned by then soccer star, Blagoje Mosa Marjanovic (Petar Strugar). This show introduces us to a whole new generation of young actors (Milos Bikovic, Viktor Savic, Aleksandar Radojicic, Nenad Herakovic, Uros Jovcic, Nenad Herakovic, Milan Nikitovic, Rade Cosic, Bojan Krivokapic and Aleksandar Filimonovic) who play the roles of almost forgotten historical figures, soccer gods, players of the then most popular and valiant clubs, BSK and Yugoslavia and a very extraordinary goalie from the less recognized Soko Club (Andrija Kuzmanovic). Other roles were cast out to the very best of Serbian cinematography such as Srdjan Todorovic, Slobodan Boda Ninkovic, Nikola Djuricko, Vojin Cetkovic, Branimir Brstina, Mima Karadzic, Marko Zivic, Sergej Trifunovic, Marko Nikolic, Anita Mancic, Branka Pujic and others, just to name a few. The subject of soccer seems to take lead but very soon we see that love, heroism, companionship, faith, honor, patriotism and respect are actually the main characters. Throughout the episodes, the inhabitants of Belgrade are introduced to us via their individual and almost quirky personalities, aspirations and head-strong ambitions, innovations that were then considered to be ludicrous and the constantly present ideal of an almost impossible trip to the first FIFA World Cup in a place that seems to be at the end of the globe, far away Montevideo, Uruguay.", "genres": ["Adventure", "Comedy", "Drama"], "imdb": {"id": 1634013, "rating": 8.4, "votes": 8562}, "languages": ["Serbian", "Bulgarian", "French"], "lastupdated": "2015-08-27 00:23:43.870000000", "num_mflix_comments": 2, "plot": "A story about one team that decides to follow a dream that takes them on a journey to the First World Football Championship in Montevideo, Uruguay in 1930. A dream that allows them to become true stars and living legends.", "poster": "https://m.media-amazon.com/images/M/MV5BOWQ0ZGFjNDgtYjc3ZC00YzA4LTk4YzctYzU0NGZkNDBlMTgwXkEyXkFqcGdeQXVyMjI0NTYyMTM@._V1_SY1000_SX677_AL_.jpg", "released": 1292803200000, "runtime": 140, "title": "Montevideo: Taste of a Dream", "type": "movie", "writers": ["Ranko Bozic", "Srdjan Dragojevic", "Vladimir Stankovic (novel)"], "year": 2010}