{"_id": "573a1397f29313caabce6b85", "awards": {"nominations": 2, "text": "2 wins & 2 nominations.", "wins": 2}, "cast": ["David Emge", "Ken Foree", "Scott H. Reiniger", "Gaylen Ross"], "countries": ["Italy", "USA"], "directors": ["George A. Romero"], "fullplot": "Following the events of Night of the Living Dead (1968), we follow the exploits of four survivors of the expanding zombie apocalypse as they take refuge in an abandoned shopping mall following a horrific SWAT evacuation of an apartment complex. Taking stock of their surroundings, they arm themselves, lock down the mall, and destroy the zombies inside so they can eke out a living--at least for a while. Tensions begin to build as months go on, and they come to realize that they've fallen prey to consumerism. Soon afterward, they have even heavier problems to worry about, as a large gang of bikers discovers the mall and invades it, ruining the survivors' best-laid plans and forcing them to fight off both lethal bandits and flesh-eating zombies.", "genres": ["Drama", "Horror"], "imdb": {"id": 77402, "rating": 8, "votes": 83383}, "languages": ["English"], "lastupdated": "2015-08-13 00:10:11.207000000", "num_mflix_comments": 1, "plot": "Following an ever-growing epidemic of zombies that have risen from the dead, two Philadelphia S.W.A.T. team members, a traffic reporter, and his television executive girlfriend seek refuge in a secluded shopping mall.", "poster": "https://m.media-amazon.com/images/M/MV5BMzc1YTIyNjctYzhlNy00ZmYzLWI2ZWQtMzk4MmQwYzA0NGQ1XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "UNRATED", "released": 296352000000, "runtime": 127, "title": "Dawn of the Dead", "tomatoes": {"consensus": "One of the most compelling and entertaining zombie films ever, Dawn of the Dead perfectly blends pure horror and gore with social commentary on bourgeois society.", "critic": {"meter": 95, "numReviews": 38, "rating": 8.6}, "dvd": 1094515200000, "fresh": 36, "lastUpdated": 1442336778000, "production": "United Film Distribution Compa", "rotten": 2, "viewer": {"meter": 90, "numReviews": 203820, "rating": 3.6}}, "type": "movie", "writers": ["George A. Romero"], "year": 1978}