{"_id": "573a1395f29313caabce2e15", "awards": {"nominations": 1, "text": "Nominated for 1 Oscar. Another 1 win & 1 nomination.", "wins": 2}, "cast": ["Rock Hudson", "Salome Jens", "John Randolph", "Will Geer"], "countries": ["USA"], "directors": ["John Frankenheimer"], "fullplot": "Middle-aged banker Arthur Hamilton is given the opportunity to start a completely new life when he receives calls from his old friend Charlie. The only problem is that Charlie is supposed to be dead. Hamilton is eventually introduced to a firm that will fake his death and create an entirely new look and life for him. After undergoing physical reconstruction surgery and months of training and psychotherapy, Hamilton returns to the world in the form of artist Tony Wilson. He has a nice house in Malibu and a manservant, a company employee who is there to assist him with his adjustment. He finds that the life he had hoped for isn't quite what he expected and asks the company to go through the process with surprising results.", "genres": ["Drama", "Mystery", "Sci-Fi"], "imdb": {"id": 60955, "rating": 7.7, "votes": 10255}, "languages": ["English"], "lastupdated": "2015-09-10 17:03:36.593000000", "plot": "An unhappy middle-aged banker agrees to a procedure that will fake his death and give him a completely new look and identity - one that comes with its own price.", "poster": "https://m.media-amazon.com/images/M/MV5BYmYwMmFjMDYtYTEyYS00NzUwLWIyZTMtNjFjZmVmZjhkY2M1XkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": -98841600000, "runtime": 106, "title": "Seconds", "tomatoes": {"consensus": "Featuring dazzling, disorienting cinematography from the great James Wong Howe and a strong lead performance by Rock Hudson, Seconds is a compellingly paranoid take on the legend of Faust.", "critic": {"meter": 90, "numReviews": 31, "rating": 8.2}, "dvd": 1010448000000, "fresh": 28, "lastUpdated": 1440612985000, "production": "Paramount Pictures", "rotten": 3, "viewer": {"meter": 88, "numReviews": 4218, "rating": 4}, "website": "http://www.criterion.com/"}, "type": "movie", "writers": ["Lewis John Carlino (screenplay)", "David Ely (based on the novel by)"], "year": 1966}