{"_id": "573a13aff29313caabd325a5", "awards": {"nominations": 4, "text": "4 nominations.", "wins": 0}, "cast": ["John Abraham", "Udita Goswami", "Mohan Agashe", "Gulshan Grover"], "countries": ["India"], "directors": ["Pooja Bhatt"], "fullplot": "Kaya, a Buddhist village girl from Spiti, is waiting to join the monastery. An elderly lama, dreams of his teacher's rebirth and Kaya is assigned to find and bring the reincarnated boy to the monastery. Kaya finds Llahmo in Mumbai and they plan their journey back to Spiti. On their way back, Llahmo witnesses the murder of a police officer. Police Officer Shiven is assigned to investigate the case. He forbids Llahmo from leaving town much to the resentment of Kaya. Shiven gets into danger when he realizes that some police officers are involved in the murder. He escapes with Kaya and Llahmo to Spiti. It is here that love blossoms between Kaya and Shiven and the movie changes track. Kaya's father does not approve of their love because he thinks that romantic feelings are sinful. Kaya is torn between love and celibacy and has to decide which one she wants.", "genres": ["Drama", "Romance", "Thriller"], "imdb": {"id": 399942, "rating": 5.2, "votes": 565}, "languages": ["Hindi", "English"], "lastupdated": "2015-08-19 00:22:02.687000000", "num_mflix_comments": 2, "plot": "Kaya, a Buddhist village girl from Spiti, is waiting to join the monastery. An elderly lama, dreams of his teacher's rebirth and Kaya is assigned to find and bring the reincarnated boy to ...", "poster": "https://m.media-amazon.com/images/M/MV5BZTA3NWMwN2YtNGNhZS00ZmMwLWIxNGYtYTQxN2JmNDAzYzNjXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY1000_SX677_AL_.jpg", "released": 1071878400000, "runtime": 120, "title": "Paap", "tomatoes": {"dvd": 1207267200000, "lastUpdated": 1432065175000, "production": "Nirvana Films", "viewer": {"meter": 55, "numReviews": 242, "rating": 3.3}}, "type": "movie", "writers": ["Mahesh Bhatt", "J.P. Dixit (additional dialogue)", "Niranjan Iyengar (dialogue)"], "year": 2003}