{"_id": "573a13caf29313caabd7cb13", "awards": {"nominations": 1, "text": "8 wins & 1 nomination.", "wins": 8}, "cast": ["Engin Gènaydin", "Binnur Kaya", "Settar Tanriègen", "Ilker Aksum"], "countries": ["Turkey"], "directors": ["Durul Taylan", "Yagmur Taylan"], "fullplot": "Celal, lives an unhappy family life with his wife Sevilay and his child in a small town. Celal and his brother Cemal, running an electrician shop which doesn't go well. They are in debt. The only fun they have is going to the night clubs in Samsun. Celal's love for Sibel Ceylan who works in the night club, will cause him trouble. Celal's wife, Sevilay, saves her money, sent by her father who lives in Germany. She is unaware of the fact that Celal knows her secret. Living an unhappy life, Celal thinks that this money will be his salvation and makes a plan. He gets an automatic door fixed to his car. He plans to push his wife off the cliff by making it seems like an accident and he plans to possess 75.000 Euros that her wife saves. He carries out his plan but two days after his wife Sevilay comes back unexpectedly. Does she know that the one who pushed her off the cliff was Celal? She can't find the money that she saved through all those years. She wonders if her husband saw the money? Sevilay's questions confuse everybody's minds and causes both Celal and herself to go through many things in their lives.", "genres": ["Comedy", "Drama", "Thriller"], "imdb": {"id": 1558877, "rating": 7.5, "votes": 6079}, "languages": ["Turkish"], "lastupdated": "2015-07-26 00:21:53.290000000", "plot": "Celal, lives an unhappy family life with his wife Sevilay and his child in a small town. Celal and his brother Cemal, running an electrician shop which doesn't go well. They are in debt. ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTYwMTk1MTY5MF5BMl5BanBnXkFtZTcwNjUwMDY4Mw@@._V1_SY1000_SX677_AL_.jpg", "released": 1261094400000, "runtime": 100, "title": "Vavien", "tomatoes": {"lastUpdated": 1437417938000, "viewer": {"meter": 76, "numReviews": 65, "rating": 3.7}}, "type": "movie", "writers": ["Engin Gènaydin"], "year": 2009}