{"_id": "573a13dcf29313caabdb20e9", "awards": {"nominations": 11, "text": "6 wins & 11 nominations.", "wins": 6}, "cast": ["Karen Gillan", "Brenton Thwaites", "Katee Sackhoff", "Rory Cochrane"], "countries": ["USA"], "directors": ["Mike Flanagan"], "fullplot": "The twenty-one year-old Timothy \"Tim\" Allen Russell is discharged from a mental institution by his psychiatric Dr. Shawn Graham completely healed from a childhood trauma where his father purportedly tortured and killed his mother before being killed himself by Tim. His sister Kaylie welcomes him in the parking area and brings him home. Then she tells that they need to destroy an ancient mirror that she has found through working at an auction house. She then steals the mirror and the reluctant Tim follows his sister and has fragmented recollections from their childhood, going back to when his father Alan buys a mirror for the home office of their new family home. Kaylie and Tim see a woman with their father in his office and the behaviors of Alan and Marie change, ending in a family tragedy. Kaylie blames the mirror and now she wants to destroy it with Tim. Will they succeed?", "genres": ["Horror"], "imdb": {"id": 2388715, "rating": 6.5, "votes": 70607}, "languages": ["English"], "lastupdated": "2015-08-31 00:00:19.293000000", "metacritic": 61, "num_mflix_comments": 1, "plot": "A woman tries to exonerate her brother, who was convicted of murder, by proving that the crime was committed by a supernatural phenomenon.", "poster": "https://m.media-amazon.com/images/M/MV5BMzE1NzM4MjEyNV5BMl5BanBnXkFtZTgwMjYzMjMzMTE@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1397174400000, "runtime": 104, "title": "Oculus", "tomatoes": {"boxOffice": "$27.7M", "consensus": "With an emphasis on dread over gore and an ending that leaves the door wide open for sequels, Oculus could be just the first spine-tingling chapter in a new franchise for discerning horror fans.", "critic": {"meter": 73, "numReviews": 133, "rating": 6.5}, "dvd": 1407196800000, "fresh": 97, "lastUpdated": 1441909481000, "production": "Relativity Media", "rotten": 36, "viewer": {"meter": 52, "numReviews": 43752, "rating": 3.2}, "website": "http://oculus2014.com/"}, "type": "movie", "writers": ["Mike Flanagan (screenplay)", "Jeff Howard (screenplay)", "Mike Flanagan (based on a short screenplay by)", "Jeff Seidman (based on a short screenplay by)"], "year": 2013}