{"_id": "573a13c4f29313caabd6de27", "awards": {"nominations": 8, "text": "13 wins & 8 nominations.", "wins": 13}, "cast": ["Golshifteh Farahani", "Shahab Hosseini", "Taraneh Alidoosti", "Merila Zare'i"], "countries": ["Iran", "France"], "directors": ["Asghar Farhadi"], "fullplot": "A group of middle-class friends travel from Tehran to spend the weekend at the seaside. Sepideh invites Elly, who is her daughter's teacher, to travel with the three families in order to introduce her to their recently divorced friend Ahmad, now living in Germany. The next morning, the two women go shopping in the town and Elly says that she has to return to Tehran because her mother has been recently submitted to hospital for heart surgery, but Sepideh asks her to stay and hides her luggage. The children are playing in the sea and one mother asks Elly to watch them. Out of the blue, Sepideh's daughter calls to some men playing volleyball to rescue one of the children from the water. After rescuing the little boy they seek out Elly, questioning whether she has drowned or returned to Tehran. What has happened to Elly?", "genres": ["Drama", "Mystery"], "imdb": {"id": 1360860, "rating": 8.2, "votes": 20497}, "languages": ["Persian", "German"], "lastupdated": "2015-08-16 00:52:13.963000000", "metacritic": 87, "plot": "The mysterious disappearance of a kindergarten teacher during a picnic in the north of Iran is followed by a series of misadventures for her follow travelers.", "poster": "https://m.media-amazon.com/images/M/MV5BMTQ0MzQxODQ0MV5BMl5BanBnXkFtZTgwNTQ0NzY4NDE@._V1_SY1000_SX677_AL_.jpg", "released": 1244246400000, "runtime": 119, "title": "About Elly", "tomatoes": {"boxOffice": "$0.1M", "consensus": "About Elly offers viewers performances as powerful as its thought-provoking ideas, and adds another strong entry to Asghar Farhadi's impressive filmography.", "critic": {"meter": 97, "numReviews": 63, "rating": 8.2}, "dvd": 1440979200000, "fresh": 61, "lastUpdated": 1442250616000, "production": "Cinema Guild", "rotten": 2, "viewer": {"meter": 86, "numReviews": 3993, "rating": 4}, "website": "http://www.aboutelly.com"}, "type": "movie", "writers": ["Asghar Farhadi (screenplay)", "Azad Jafarian (story)", "Asghar Farhadi (story)"], "year": 2009}