{"_id": "573a13d1f29313caabd8f594", "awards": {"nominations": 3, "text": "2 wins & 3 nominations.", "wins": 2}, "cast": ["Pier-Gabriel Lajoie", "Walter Borden", "Katie Boland", "Yardly Kavanagh"], "countries": ["Canada"], "directors": ["Bruce La Bruce"], "fullplot": "Lake is an unusual boy: he is a young man with an old soul who discovers he has an odd fixation on the elderly. Realizing that some day, if fate allows, he will be one himself, he is particularly fascinated by old men. He imagines their age to be a beautiful thing and recognizes how these men were once young and vibrant and attractive, as he is now. Although Lake has a girlfriend his own age, named Desiree, he wonders sometimes if his fixation on old men is unnatural and unhealthy - perhaps even sexual. When his mother, who is a nurse, takes on a management job at an old folks home, Lake jumps at her offer of a summer job as an orderly there. Gradually, Lake comes to discover that the old people in the institution are being given psychotropic drugs to keep them in a catatonic state. Lake befriends one old man in particular, Mr. Peabody, who still seems to have some fight left in him. They begin to form a strong bond. Mr. Peabody charms Lake with romantic stories of his youth and confesses his dream of seeing the ocean one last time. Avoiding the vigilant eye of Nurse Baptiste, who administers shots and pills to the old folks, Lake starts to wean Mr. Peabody off his medication. Eventually, Lake springs Mr. Peabody from the institution. Together they embark on a road trip telling everyone they meet that the old man is his grandfather and that they're driving to the Pacific ocean. After numerous life-changing escapades, Lake is finally ready to accept his true feelings for Mr. Peabody, but everything changes when the trip takes a sudden turn.", "genres": ["Comedy", "Romance"], "imdb": {"id": 1815717, "rating": 6.3, "votes": 1011}, "languages": ["English", "French"], "lastupdated": "2015-09-06 00:40:00.337000000", "metacritic": 48, "num_mflix_comments": 3, "plot": "A male youth begins exploring his attraction to much much older men while working in a nursing home.", "poster": "https://m.media-amazon.com/images/M/MV5BMTE0Mjc3NDc3NDVeQTJeQWpwZ15BbWU4MDcyMDk2MzUx._V1_SY1000_SX677_AL_.jpg", "rated": "UNRATED", "released": 1395792000000, "runtime": 82, "title": "Gerontophilia", "tomatoes": {"boxOffice": "$4.8k", "consensus": "Gerontophilia's handful of intriguing ideas are let down by tame execution and unconvincing acting that make the movie's premise feel creepy rather than original.", "critic": {"meter": 43, "numReviews": 23, "rating": 6}, "dvd": 1433721600000, "fresh": 10, "lastUpdated": 1440353076000, "production": "Strand Releasing", "rotten": 13, "viewer": {"meter": 47, "numReviews": 252, "rating": 3.1}, "website": "http://strandreleasing.com/films/gerontophilia/"}, "type": "movie", "writers": ["Bruce La Bruce (story)", "Bruce La Bruce (screenplay)", "Daniel Allen Cox (screenplay)"], "year": 2013}