{"_id": "573a139af29313caabcef077", "awards": {"nominations": 1, "text": "4 wins & 1 nomination.", "wins": 4}, "cast": ["Shari Albert", "Maxine Bahns", "Catharine Bolz", "Connie Britton"], "countries": ["USA"], "directors": ["Edward Burns"], "fullplot": "This angst-filled tale of three Irish-Catholic brothers explores men's relationships with women. Three different situations are set up on parallel plotlines, with each brother facing a different kind of crisis. Their common bond as family, as well as close lifelong friends, allows them to express their feelings frankly and intimately, as they talk and discuss their concerns among each other. Jack finds himself in a marriage gone stale and under pressure to start a family that he does not yet feel ready for. Barry, dedicated to his film career and almost pathologically averse to any type of commitment in a relationship, is suddenly artistically successful and finds true love, both for the first time and both pulling him in opposite directions. Patrick is torn between his love for his religion and ethnic heritage and his love for Susan, his longtime Jewish girlfriend. Ultimately, they are all asked to resist temptation of one sort or another, with various poignant outcomes.", "genres": ["Comedy", "Drama", "Romance"], "imdb": {"id": 112585, "rating": 6.6, "votes": 6108}, "languages": ["English"], "lastupdated": "2015-08-24 00:49:14.070000000", "metacritic": 73, "plot": "Three Irish Catholic brothers from Long Island struggle to deal with love, marriage, and infidelity.", "poster": "https://m.media-amazon.com/images/M/MV5BMTQ2YTY2OWMtODdjNy00MmE4LWE1MDEtOTdmMzc4ZDBjNzQ5XkEyXkFqcGdeQXVyNTM0NTU5Mg@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 807926400000, "runtime": 98, "title": "The Brothers McMullen", "tomatoes": {"critic": {"meter": 91, "numReviews": 35, "rating": 7}, "dvd": 970531200000, "fresh": 32, "lastUpdated": 1439661666000, "production": "Twentieth Century Fox Home Entertainment", "rotten": 3, "viewer": {"meter": 60, "numReviews": 6098, "rating": 3.2}}, "type": "movie", "writers": ["Edward Burns"], "year": 1995}