{"_id": "573a13b7f29313caabd4a850", "awards": {"nominations": 0, "text": "3 wins.", "wins": 3}, "cast": ["Mr. Freeze", "Luis Mateo", "Skwall", "Prince Ken Swift"], "countries": ["USA"], "directors": ["Benson Lee"], "fullplot": "Think breakdancing died in the eighties? Think again. PLANET B-BOY is a feature-length, theatrical documentary that re-discovers one of the most incredible dance phenomena the world has ever seen. Originally known as \"B-boying\", breakdancing was an urban dance form that originated from the streets of New York City during the seventies. Along with Emceeing, Graffiti and DJing, B-boying served as one of the crucial elements in the birth of hip-hop culture in America. Through the help of movies like Flashdance, Breakin', and Beatstreet, breakdancing took the country by storm, and teenagers across America were spinning on their backs doing \"windmills\" and training their bodies to \"pop and lock.\" Like most dance fads, however, breakdancing eventually faded into the annals of pop culture history. Three decades later, B-boying is back in full force and has evolved into an art form, reaching a level never seen before. The basic moves from the early eighties have developed into a highly sophisticated and unimaginably acrobatic dance form. PLANET B-BOY will take you inside the international, underground b-boy scene happening today in Japan, France, Germany, South Korea, and the United States. We will explore the most compelling stories and characters of five of the best b-boy crews from around the globe as they prepare to face off at the BATTLE OF THE YEAR - one of the most prestigious b-boy events in the world, held annually in Germany that serves as the World Cup of b-boying. Along the way, we will gain a poignant insight into their lives, their friends and families, and their unique cultural and social situations that drive them to devote their entire lives to the dance. At the BATTLE OF THE YEAR - our subjects will go head to head with crews from nineteen different countries in one of the fiercest dance competitions ever seen. Ten thousand screaming fans will witness their one shot at glory and see who will be crowned the best on PLANET B-BOY.", "genres": ["Documentary", "History", "Music"], "imdb": {"id": 770796, "rating": 7.8, "votes": 898}, "languages": ["English"], "lastupdated": "2015-09-17 04:44:16.837000000", "metacritic": 63, "num_mflix_comments": 2, "plot": "Jumping continents and crossing cultures, \"Planet B-Boy\" looks at the history of breakdancing and its vibrant resurgence in urban cultures around the world.", "poster": "https://m.media-amazon.com/images/M/MV5BMjI4ODYxODAyNl5BMl5BanBnXkFtZTcwMzQ3MjU1MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "UNRATED", "released": 1206057600000, "runtime": 95, "title": "Planet B-Boy", "tomatoes": {"consensus": "Lee's dazzling documentary makes a compelling argument for breakdancing as an art form.", "critic": {"meter": 83, "numReviews": 41, "rating": 6.9}, "dvd": 1225152000000, "fresh": 34, "lastUpdated": 1441132791000, "production": "Elephant Eye Films", "rotten": 7, "viewer": {"meter": 91, "numReviews": 2241, "rating": 4.1}, "website": "http://www.planetbboy.com/"}, "type": "movie", "year": 2007}