{"_id": "573a1394f29313caabce0024", "awards": {"nominations": 8, "text": "Nominated for 4 Oscars. Another 3 wins & 8 nominations.", "wins": 7}, "cast": ["Karl Malden", "Carroll Baker", "Eli Wallach", "Mildred Dunnock"], "countries": ["USA"], "directors": ["Elia Kazan"], "fullplot": "Living in Tiger Tail County, Mississippi, middle aged Archie Lee Meighan and nineteen year old \"Baby Doll\" Meighan nèe McCargo have been married for close to two years. Their marriage is not based on love, but each getting what they want from the other. Their marriage agreement has them consummating their marriage on her twentieth birthday, which is in three days, the act to which Baby Doll is not really looking forward. But she does taunt him and other men with her overt \"baby doll\" sexuality, the baby doll aspect which she fosters by sleeping in their house's nursery in a crib. Baby Doll's now deceased father allowed the marriage on the stipulation that Archie Lee provide Baby Doll financial security as displayed by the most resplendent house in the south. They currently live in a dilapidated mansion with her Aunt Rose Comfort, and although Archie Lee is making some renovations on it, he no longer has the financial means to make it what Baby Doll wants as his cotton ginning competitor, the recently arrived Sicilian Silva Vacarro who runs the cotton plantation syndicate, has effectively put him and many others in the area out of business. The Meighan's fortunes may change after Vacarro's cotton gin burns down in a case of arson. Vacarro is certain Archie Lee is the arsonist. After meeting the Meighans and learning more about their marriage, Vacarro believes the way to get what he wants is through Baby Doll. This action begins the three way battle of wills between Vacarro, Archie Lee and Baby Doll.", "genres": ["Drama"], "imdb": {"id": 48973, "rating": 7.5, "votes": 4575}, "languages": ["English"], "lastupdated": "2015-08-21 00:57:20.423000000", "num_mflix_comments": 1, "plot": "A steamy tale of two Southern rivals and a sensuous nineteen-year-old virgin.", "poster": "https://m.media-amazon.com/images/M/MV5BYjY0ZTYwZjItMGU5ZS00ZDU5LWI1OWEtNzg2ZTAyZGJiZmNiXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_SY1000_SX677_AL_.jpg", "rated": "APPROVED", "released": -411436800000, "runtime": 114, "title": "Baby Doll", "tomatoes": {"critic": {"meter": 100, "numReviews": 14, "rating": 8}, "dvd": 1057708800000, "fresh": 14, "lastUpdated": 1440094285000, "production": "WARNER BROTHERS PICTURES", "rotten": 0, "viewer": {"meter": 81, "numReviews": 2461, "rating": 3.9}}, "type": "movie", "writers": ["Tennessee Williams (screenplay)"], "year": 1956}