{"_id": "573a1399f29313caabcedc1f", "awards": {"nominations": 11, "text": "Nominated for 3 Oscars. Another 3 wins & 11 nominations.", "wins": 6}, "cast": ["Clint Eastwood", "John Malkovich", "Rene Russo", "Dylan McDermott"], "countries": ["USA"], "directors": ["Wolfgang Petersen"], "fullplot": "Frank Horrigan is a secret service agent who keeps thinking back to November 22, 1963, when, as a hand-picked agent by President Kennedy, he became one of the few agents to have lost a President to an assassin when Kennedy died. Now, former CIA assassin Mitch Leary is stalking the current President, who is running for re-election. Mitch has spent long hours studying Horrigan, and he taunts Horrigan, telling him of his plans to kill the President. Leary plans to kill the president because Leary feels betrayed by the government -- Leary was removed from the CIA, and the CIA is now trying to have him killed. After talking to Leary, Horrigan makes sure he is assigned to presidential protection duty, working with fellow secret service agent Lilly Raines. Horrigan has no intention of failing his President this time around, and he's more than willing to take a bullet. White House Chief of Staff Harry Sargent refuses to alter the President's itinerary, while Horrigan's boss, Secret Service Director Sam Campagna, is supportive of Horrigan. As the election gets closer, Horrigan begins to doubt his own abilities, especially when Horrigan's colleague Al D'Andrea is killed by Leary. But Horrigan may be the only one who can stop Leary.", "genres": ["Action", "Crime", "Drama"], "imdb": {"id": 107206, "rating": 7.2, "votes": 70205}, "languages": ["English"], "lastupdated": "2015-09-10 17:57:15.150000000", "metacritic": 74, "plot": "Secret Service agent Frank Horrigan couldn't save Kennedy, but he's determined not to let a clever assassin take out this president.", "poster": "https://m.media-amazon.com/images/M/MV5BMjdhYjRlMTgtNTMzOS00OTZlLWIxMjAtNjM4NGY0NGQxODM3XkEyXkFqcGdeQXVyNDk3NzU2MTQ@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 742176000000, "runtime": 128, "title": "In the Line of Fire", "tomatoes": {"consensus": "A straightforward thriller of the highest order, In the Line of Fire benefits from Wolfgang Peterson's taut direction and charismatic performances from Clint Eastwood and John Malkovich.", "critic": {"meter": 95, "numReviews": 65, "rating": 7.8}, "dvd": 862272000000, "fresh": 62, "lastUpdated": 1439834484000, "production": "Sony Pictures Home Entertainment", "rotten": 3, "viewer": {"meter": 79, "numReviews": 54162, "rating": 3.4}}, "type": "movie", "writers": ["Jeff Maguire"], "year": 1993}