{"_id": "573a1397f29313caabce7697", "awards": {"nominations": 4, "text": "Nominated for 2 Oscars. Another 1 win & 4 nominations.", "wins": 3}, "cast": ["William Hurt", "Blair Brown", "Bob Balaban", "Charles Haid"], "countries": ["USA"], "directors": ["Ken Russell"], "fullplot": "It's the late 1960's. Just for a lark, graduate student Eddie Jessup, known for being unconventional, brilliant and slightly mad, conducts experiments with an isolation chamber, using himself as the subject. His experiences in the chamber cause him to hallucinate, much of the imagery being religious-based despite he not being a religious man. Seven years later, he is a respected full professor in the Harvard Medical School. Believing he has lost his edge and has fallen into an unwanted state of respectability, Eddie decides to resume his work with sensory deprivation, this time using hallucinogens, specifically untested ones used in mystical Mexican rituals, to enhance the experience of being in the isolation tank. After initial tests, he claims he entered an alternate physical and mental state. Although unbelieving of Eddie's claims, his colleagues Arthur Rosenberg and Mason Parrish, as well as Eddie's wife, Emily, who is in her own right a respected academic, are concerned for Eddie's well being. However, if Eddie's claims are indeed true, he could do irreparable harm to himself and others around him, especially if his altered states are uncontrollable.", "genres": ["Horror", "Sci-Fi", "Thriller"], "imdb": {"id": 80360, "rating": 6.9, "votes": 22142}, "languages": ["English", "Spanish"], "lastupdated": "2015-08-22 00:27:15.140000000", "plot": "A Harvard scientist conducts experiments on himself with a hallucinatory drug and an isolation chamber that may be causing him to regress genetically.", "poster": "https://m.media-amazon.com/images/M/MV5BZTdkOTU5NDYtZjk4NC00NDA0LTlkMDItODY3ZWU2Y2VkNzFjXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 346550400000, "runtime": 102, "title": "Altered States", "tomatoes": {"consensus": "Extraordinarily daring for a Hollywood film, Altered States attacks the viewer with its inventive, aggressive mix of muddled sound effects and visual pyrotechnics.", "critic": {"meter": 86, "numReviews": 42, "rating": 6.8}, "dvd": 1086048000000, "fresh": 36, "lastUpdated": 1442510506000, "production": "Warner Home Video", "rotten": 6, "viewer": {"meter": 71, "numReviews": 18762, "rating": 3.4}}, "type": "movie", "writers": ["Paddy Chayefsky (written for the screen by)", "Paddy Chayefsky (novel)"], "year": 1980}