{"_id": "573a1395f29313caabce1675", "awards": {"nominations": 5, "text": "Nominated for 5 Oscars. Another 2 wins & 5 nominations.", "wins": 7}, "cast": ["Audrey Hepburn", "Shirley MacLaine", "James Garner", "Miriam Hopkins"], "countries": ["USA"], "directors": ["William Wyler"], "fullplot": "Karen Wright and Martha Dobie are best friends since college and they own the boarding school Wright and Dobie School for Girls with twenty students. They are working hard as headmistresses and teachers to grow the school and make it profitable. Karen is engaged with the local doctor Joe Cardin, who is the nephew of the powerful and influent Mrs. Amelia Tilford. While the spiteful and liar Mary, who is Amelia's granddaughter and a bad influence to the other girls, is punished by Karen after telling a lie, Martha has an argument with her snoopy aunt Lily Mortar in another room. Lily accuses Martha of being jealous and having an unnatural relationship with Karen. Mary's roommate Rosalie Wells overhears the shouting and tells Mary what Mrs. Mortar had said about her niece. The malicious Mary accuses Karen and Martha of being lesbians to her grandmother and Amelia spreads the gossip to the parents of the students that withdraw them from the school. Karen and Martha lose a lawsuit against Amelia and have their lives destroyed. Further, Karen calls off her engagement with Joe when he asks her if what was said about Martha and she was true. The lie ends in a tragedy.", "genres": ["Drama"], "imdb": {"id": 54743, "rating": 7.8, "votes": 9471}, "languages": ["English"], "lastupdated": "2015-08-28 00:56:59.753000000", "plot": "A troublemaking student at a girls' school accuses two teachers of being lesbians.", "poster": "https://m.media-amazon.com/images/M/MV5BNDRjYzQ4OTgtZjlmMC00ZmU2LThjYWMtNjYyM2M2NDk5NDc1XkEyXkFqcGdeQXVyNjc0MzMzNjA@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": -253584000000, "runtime": 108, "title": "The Children's Hour", "tomatoes": {"critic": {"meter": 86, "numReviews": 7, "rating": 7}, "dvd": 1047254400000, "fresh": 6, "lastUpdated": 1440183609000, "production": "MGM Home Entertainment", "rotten": 1, "viewer": {"meter": 84, "numReviews": 7100, "rating": 3.9}}, "type": "movie", "writers": ["Lillian Hellman (play)", "John Michael Hayes (screenplay)", "Lillian Hellman (adaptation)"], "year": 1961}