{"_id": "573a13eff29313caabdd83a6", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Giuseppe Andrews", "Vietnam Ron", "Big Ed", "Walt Dongo"], "countries": ["USA"], "directors": ["Adam Rifkin"], "fullplot": "In Ventura, CA, Giuseppe Andrews makes movies in his trailer park where he grew up. A former child actor in some big movies (Independence Day, Unstrung Heroes, Never Been Kissed), Giuseppe is inspired more by the crazy independent filmmakers of history: Bunuel, Cassavetes and Fassbinder. Obsessed with the edges of society, dirty language spoken as poems and occasional nudity, Giuseppe's films may resemble the underground worlds of Harmony Korine, John Waters and Tod Browning. With a handwritten script, a video camera, an acting ensemble of neighbors and homeless friends - and almost no money, Giuseppe has now made 30 feature films. In Giuseppe's new film \"Garbanzo Gas\", Vietnam Ron, one of many homeless men in Ventura that Giuseppe has grown up with, plays a vegan cow on vacation from the slaughterhouse. The doc GIUSEPPE MAKES A MOVIE follows the making of \"Garbanzo Gas.\" From Giuseppe's headquarters - his own mobile home - we follow as he sets out to make a feature film in just two days. The stranger-than-fiction documentary explores the Giuseppe universe, showing how the self-taught filmmaker captures an unexpected level of humanism and creates a family unit for a group of people who needed one.", "genres": ["Documentary"], "imdb": {"id": 3661072, "rating": 8.2, "votes": 63}, "languages": ["English"], "lastupdated": "2015-09-17 02:39:03.027000000", "num_mflix_comments": 1, "plot": "In Ventura, CA, Giuseppe Andrews makes movies in his trailer park where he grew up. A former child actor in some big movies (Independence Day, Unstrung Heroes, Never Been Kissed), Giuseppe ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTc4NzE4MzYxM15BMl5BanBnXkFtZTgwNzM0NDMzMjE@._V1_SY1000_SX677_AL_.jpg", "released": 1421280000000, "runtime": 82, "title": "Giuseppe Makes a Movie", "type": "movie", "writers": ["David Nordstrom", "Mike Plante", "Adam Rifkin"], "year": 2014}