{"_id": "573a139af29313caabcf07b7", "awards": {"nominations": 8, "text": "Nominated for 1 BAFTA Film Award. Another 2 wins & 8 nominations.", "wins": 3}, "cast": ["Daniel Auteuil", "Fabrice Luchini", "Vincent Perez", "Marie Gillain"], "countries": ["France", "Italy", "Germany"], "directors": ["Philippe de Broca"], "fullplot": "The Comte de Gonzague schemes against his cousin, the Duc de Nevers, even though he is the Duke's heir and will inherit his estates. The Count has kept secret the existence of the Duke's bastard, recently born. When the Duke learns of his child, he journeys to wed the mother, a baron's daughter, in her father's isolated chateau. The occupants of the castle are surprised and murdered by the Count and his men. The only ones to escape are the Duke's friend, the skilled swordsman Lagardère, and the infant, a girl, now the rightful heiress to the Duke's vast fortune. The Count believes the pair to have drowned, when in fact they have been concealed by a travelling troupe of Italian players. Twenty years pass. The Count has discovered that the two survive and seeks to have them slain. But Lagardère gains the confidence of the Count, and employment as his bookkeeper, through his clever disguise as a hunch-back...", "genres": ["Drama", "Adventure"], "imdb": {"id": 118756, "rating": 7, "votes": 2522}, "languages": ["French", "Italian"], "lastupdated": "2015-08-15 00:02:14.287000000", "metacritic": 69, "num_mflix_comments": 1, "plot": "The Comte de Gonzague schemes against his cousin, the Duc de Nevers, even though he is the Duke's heir and will inherit his estates. The Count has kept secret the existence of the Duke's ...", "poster": "https://m.media-amazon.com/images/M/MV5BNTBjY2M0ZjYtYjYxZC00NjhiLWIxZWUtOTc5YTU1NTlmMDNlXkEyXkFqcGdeQXVyMjQzMzQzODY@._V1_SY1000_SX677_AL_.jpg", "released": 890352000000, "runtime": 128, "title": "On Guard", "tomatoes": {"consensus": "A spirited, old-fashioned swashbuckler.", "critic": {"meter": 87, "numReviews": 31, "rating": 7}, "dvd": 1078790400000, "fresh": 27, "lastUpdated": 1439061721000, "production": "Empire Pictures", "rotten": 4, "viewer": {"meter": 77, "numReviews": 1180, "rating": 3.7}}, "type": "movie", "writers": ["Philippe de Broca", "Jean Cosmos", "Paul Fèval (book)", "Jèrème Tonnerre"], "year": 1997}