{"_id": "573a13a1f29313caabd07b50", "awards": {"nominations": 2, "text": "2 wins & 2 nominations.", "wins": 2}, "cast": ["Patrick Warburton", "Eugene Roche", "Ron Morgan", "Emily Newman"], "countries": ["USA"], "directors": ["Robinson Devor"], "fullplot": "Set in 1950s Los Angeles, Richard Hudson (Warburton) is a shrewd car dealer who moves from San Francisco and sets up a used-car dealership. Tiring of this job, he turns the lot over to an assistant and starts writing his first movie, The Man Who Got Away. It turns out to be an uncommercial picture chronicling the story of a truck driver who goes berserk, runs over a little girl and dies fending off a platoon of police officers. In making his film, Richard enlists the help of his father-in-law, Leo (Paul Malevich), a washed-up former film director whose notable possession is a Rouault painting of a clown. Through Leo, Richard pitches his idea to the Man (Ernie Vincent), the chief executive of Mammoth Pictures who green-lights the project. Conflict inevitably arises when Richard's obsession for making the movie his way clashes with the Man. Other kooky characters include Richard's mother (Lynette Bennett), a former ballerina who lures her hirsute lug of a son into a comic pas de deux ; Richard's sexually curious stepsister, Becky (Marilyn Rising), who seduces him, and his secretary, Laura (Emily Newman), whom he impregnates with a boorish indifference.", "genres": ["Comedy"], "imdb": {"id": 217894, "rating": 7.2, "votes": 505}, "languages": ["English"], "lastupdated": "2015-07-31 00:48:57.130000000", "metacritic": 46, "num_mflix_comments": 1, "plot": "Set in 1950s Los Angeles, Richard Hudson (Warburton) is a shrewd car dealer who moves from San Francisco and sets up a used-car dealership. Tiring of this job, he turns the lot over to an ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTQxNjI5MjY1MV5BMl5BanBnXkFtZTYwNTcwMzg5._V1_SY1000_SX677_AL_.jpg", "released": 939340800000, "runtime": 90, "title": "The Woman Chaser", "tomatoes": {"critic": {"meter": 73, "numReviews": 11, "rating": 7.1}, "fresh": 8, "lastUpdated": 1442346535000, "production": "The Asylum", "rotten": 3, "viewer": {"meter": 71, "numReviews": 156, "rating": 3.8}}, "type": "movie", "writers": ["Charles Willeford (novel)", "Robinson Devor"], "year": 1999}