{"_id": "573a13bef29313caabd5b3fb", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Bruce Chadwick"], "countries": ["USA"], "directors": ["Godfrey Cheshire"], "fullplot": "At Christmas 2003, New York-based film critic Godfrey Cheshire is visiting his family in North Carolina when his cousin Charlie Silver tells him something startling. Charlie inherited Midway Plantation, the ancestral home of his and Cheshire's extended family, and has been its devoted caretaker. But now Charlie and his wife Dena have made a decision: They want to move Midway - the antebellum manor house and several outbuildings - to a new location to escape Raleigh's encroaching sprawl. Can you really transplant a plantation? Will the \"place\" be the same if it is uprooted from the soil in which it has stood since 1848? Charlie's plan provokes immediate controversy in Cheshire's tradition-minded family. For Cheshire, it brings back memories of the wild, strange and magical place Midway seemed when he was a child, and of the stories he heard there - stories of his mother's family, the Hintons, settling the area in the early 1700s, fighting in the Revolution, being invaded by Yankee troops in the Civil War, and surviving Reconstruction. Yet stories, Cheshire realizes, both convey and conceal. The reality of the Southern plantation was that it depended on the institution of slavery. In Cheshire's family, stories of slaves always depicted them as happy and devoted, which surely disguised a more painful, complex reality. In fact, Midway bred two sets of Hintons, one white, one black. For years, they have rarely encountered each other. But that begins to change as Cheshire sets out to chronicle Charlie's attempt to move Midway.", "genres": ["Documentary"], "imdb": {"id": 1051245, "rating": 7.1, "votes": 137}, "languages": ["English"], "lastupdated": "2015-07-11 00:40:36.603000000", "metacritic": 79, "num_mflix_comments": 2, "plot": "At Christmas 2003, New York-based film critic Godfrey Cheshire is visiting his family in North Carolina when his cousin Charlie Silver tells him something startling. Charlie inherited ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTM0OTE5OTcyOF5BMl5BanBnXkFtZTcwNjkzNjYwMg@@._V1_SY1000_SX677_AL_.jpg", "released": 1176508800000, "runtime": 95, "title": "Moving Midway", "tomatoes": {"consensus": "This strange, heartfelt documentary from film critic Godfrey Cheshire is a fascinating examination of his family roots, as well as an evocative meditation on the complexities of the South.", "critic": {"meter": 100, "numReviews": 25, "rating": 7.8}, "dvd": 1234828800000, "fresh": 25, "lastUpdated": 1442166029000, "production": "First Run Features", "rotten": 0, "viewer": {"meter": 64, "numReviews": 145, "rating": 3.7}, "website": "http://www.movingmidway.com/"}, "type": "movie", "year": 2007}