{"_id": "573a13a4f29313caabd12a01", "awards": {"nominations": 2, "text": "2 nominations.", "wins": 0}, "cast": ["Egbert Jan Weeber", "Michiel Huisman", "Nadja Hèpscher", "Medi Broekman"], "countries": ["Netherlands"], "directors": ["Mijke de Jong"], "fullplot": "Dutch teenagers Jonathan and his best mate Coen were raised as Jehovah's Witnesses, a strict Bible-focused minority community which monopolizes nearly all of the members' lives, imposing missionary work in pairs, knocking at every door trying to sell the magazines and the message which believers consider the whole and only Divine truth. Both boys can however play modern music, rehearsing for the religious Sunday service band, and secretly see girlfriends who aren't \"in the truth\" (converted). Jonathan's Marjan, a rebellious squatter and graphic artist, drags the well-behaved boy along in heathenish gang-mischief such as shop vandalism and can't believe he accepted all his life to do meekly as his parents and (church) elders tell him in God's name instead of making his own choices. When Jonathan's father expects him to join the boss's boat-building firm as apprentice at minimal wage, bagging on the art academy he dreams of as 'barbaric filth', some teenage rebellion sets in; when Coen dumps his 'external' girl but also confesses about both of them, Jonathan proposes to Marjan. However the 'community' takes a more then dim view on 'traitors', without any right of defense the elders fire his father from the rotating hierarchy and judge the well-meaning boy's \"irredeemable moral depravity\" gravely...", "genres": ["Drama"], "imdb": {"id": 264121, "rating": 7.1, "votes": 170}, "languages": ["Dutch"], "lastupdated": "2015-08-31 00:41:23.497000000", "num_mflix_comments": 1, "plot": "Despite the fact that he's a Jehovah's witness, ska-loving high school student Jonathan has a relationship with Marjan, a non-believing artist.", "released": 987292800000, "title": "Uitgesloten", "tomatoes": {"lastUpdated": 1436381499000, "viewer": {"numReviews": 0, "rating": 0}}, "type": "movie", "writers": ["Paulo van Vliet (novel)", "Marco van Geffen (scenario)"], "year": 2001}