{"_id": "573a13abf29313caabd26176", "awards": {"nominations": 16, "text": "16 nominations.", "wins": 0}, "cast": ["Shah Rukh Khan", "Rani Mukerji", "Jas Arora", "Satish Shah"], "countries": ["India"], "directors": ["Aziz Mirza"], "fullplot": "Raj and Priya come from two different strata of society. While Raj owns a small-time transport business and belongs to the economically middle class section of society, Priya belongs to the affluent class and is on the road to becoming a famous fashion designer. But when a chance encounter brings them together, they are drawn towards each other. Raj has fallen for Priya but Priya is already engaged to marry her childhood friend Sameer. Raj follows her all the way to Greece to woo her. During the journey Priya realizes that Raj is her true soulmate and decides to marry him. But after a year of their marriage, things are not quite rosy as the once-lovestruck couple faces the harsh realities of marriage. Raj runs into financial problems and Priya borrows money from Sameer without telling Raj. When Raj finds out, all hell breaks loose and in an angry fit he accuses Priya of infidelity. This is too much to take for Priya and she leaves their home. Will they reunite or will the discord never be set straight?", "genres": ["Drama", "Romance"], "imdb": {"id": 346723, "rating": 6.6, "votes": 10107}, "languages": ["Hindi"], "lastupdated": "2015-09-01 01:06:08.067000000", "num_mflix_comments": 1, "plot": "Raj and Priya come from two different strata of society. While Raj owns a small-time transport business and belongs to the economically middle class section of society, Priya belongs to the...", "poster": "https://m.media-amazon.com/images/M/MV5BYzU4MjI2MjctMzExMC00NTAxLWFjZWMtODk2YzVjMzhkZmU2XkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY1000_SX677_AL_.jpg", "released": 1055462400000, "runtime": 167, "title": "Chalte Chalte", "tomatoes": {"dvd": 1080604800000, "lastUpdated": 1442256083000, "production": "Eros Entertainment", "viewer": {"meter": 71, "numReviews": 7352, "rating": 3.7}, "website": "http://www.chaltechalte.com"}, "type": "movie", "writers": ["Aziz Mirza (story)", "Robin Bhatt (story)", "Aziz Mirza (screenplay)", "Robin Bhatt (screenplay)", "Pramod Sharma (dialogue)", "Ashish Kariya (dialogue)", "Rumi Jaffery (dialogue)"], "year": 2003}