{"_id": "573a13e2f29313caabdbe940", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Gavin Andresen", "Brian Armstrong", "Margaux Avedisian", "Vitalik Buterin"], "countries": ["USA", "Panama", "Japan", "Canada"], "directors": ["Nicholas Mross"], "fullplot": "Dan is a 35 year old computer programmer from Pittsburgh who lives a busy life. Along with balancing work, his marriage, and raising his three boys, Dan spends much of his time actively involved in all things Bitcoin. After discovering Bitcoin in 2011, his love and obsession for the crypto-currency was born, revealing an uncharted world of new possibilities for him to explore. Join us as we take a journey through the rapidly growing world of Bitcoin. Along the way, we'll follow the stories of entrepreneurs and startups that are helping shape the new financial frontier. We'll look at the competitive mining market and the various subcultures within the Bitcoin community. You'll encounter a variety of characters and opinions as we examine the social and political impact of an open-source digital currency. Will the rise of Bitcoin bring a monetary paradigm shift that will forever change the world?", "genres": ["Documentary", "History", "News"], "imdb": {"id": 2821314, "rating": 7.3, "votes": 715}, "languages": ["English"], "lastupdated": "2015-09-12 00:37:33.770000000", "plot": "A computer programmer becomes fascinated with the digital currency Bitcoin, and through his involvement in the Bitcoin community, we learn about the impending global impact of this amazing new technology.", "poster": "https://m.media-amazon.com/images/M/MV5BMjE1NTc4OTAzMl5BMl5BanBnXkFtZTcwMjU0ODA0OQ@@._V1_SY1000_SX677_AL_.jpg", "released": 1412899200000, "runtime": 96, "title": "The Rise and Rise of Bitcoin", "tomatoes": {"critic": {"meter": 63, "numReviews": 8, "rating": 5.8}, "dvd": 1438560000000, "fresh": 5, "lastUpdated": 1440268508000, "production": "Gravitas Ventures", "rotten": 3, "viewer": {"meter": 88, "numReviews": 207, "rating": 4.3}, "website": "http://www.bitcoindoc.com"}, "type": "movie", "writers": ["Patrick Lope", "Daniel Mross", "Nicholas Mross"], "year": 2014}