{"_id": "573a13b2f29313caabd38985", "awards": {"nominations": 4, "text": "4 nominations.", "wins": 0}, "cast": ["Leo Gregory", "Paddy Considine", "Sam Sharwood", "David Morrissey"], "countries": ["UK"], "directors": ["Stephen Woolley"], "fullplot": "Fact-based story about the drug-addled and sordid life of The Rolling Stones founder Brian Jones. Unfortunately the story moves so quickly into the sensationalized decadence and drug-induced state of Jones, that the unknowing viewer has to wonder why anyone would care. There are only a few framing sequences with members of The Stones, particularly Keith Richards, that show they had a great respect for him and tried to bring him back into the band as he drifted away. Mixed into the destruction of Jones is a common builder, Frank Thorogood, who is given the unenviable task of trying to please Jones by rebuilding his estate and to watch him per Jones' manager's instructions. Thorogood's life is so far removed from all of the sex and drugs that he sees, that he envies and desires the tawdry life as well, but never quite fits in. Unfortunately, at least according to this film and according to a supposed death bed confessional of Thorogood in 1993, it led to Thorogood's murder of Jones in a swimming pool \"accident\".", "genres": ["Biography", "Drama", "Music"], "imdb": {"id": 426627, "rating": 5.8, "votes": 3370}, "languages": ["English"], "lastupdated": "2015-08-22 00:40:15.500000000", "metacritic": 41, "plot": "A chronicle of the sordid life and suspicious death of Rolling Stones co-founder Brian Jones, who was found in the bottom of his swimming pool weeks after being let go from the band.", "poster": "https://m.media-amazon.com/images/M/MV5BMTM1NzM1Njg3MV5BMl5BanBnXkFtZTcwOTE2ODMzMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1132272000000, "runtime": 102, "title": "Stoned", "tomatoes": {"critic": {"meter": 15, "numReviews": 48, "rating": 4}, "dvd": 1151971200000, "fresh": 7, "lastUpdated": 1441134963000, "production": "Screen Media Films", "rotten": 41, "viewer": {"meter": 45, "numReviews": 22407, "rating": 3}, "website": "http://www.stonedthemovie.com/"}, "type": "movie", "writers": ["Neal Purvis", "Robert Wade"], "year": 2005}