{"_id": "573a1397f29313caabce8744", "awards": {"nominations": 9, "text": "2 wins & 9 nominations.", "wins": 2}, "cast": ["William Shatner", "Leonard Nimoy", "DeForest Kelley", "James Doohan"], "countries": ["USA"], "directors": ["Nicholas Meyer"], "fullplot": "The Federation along with a group of scientists are working on Project Genesis, which is to bring a dead planet to life. So far the preliminary experiments have been a success. Now for the next phase which is to actually bring a planet to life, a dead planet is required. So the Federation sends a starship, the USS Reliant to find one and its first officer is Commander Pavel Chekov. They come across what appears to be a dead planet in the Ceti Alpha system. But the sensors detect something which makes it not a dead planet. But the Captain thinks maybe they can remove it, so he and Chekov go and investigate. But they find what appears to be a lifepod. When Chekov sees something, he tells the Captain they should leave, but they are captured by the inhabitants. When they meet the leader, Chekov recognizes him as Khan Noonien Singh, the genetic superman from late 20th century whom Kirk found 15 years ago. Khan tried to take over the Enterprise and kill Kirk, but Kirk subdued him and left him on Ceti Alpha V. Khan reveals that Ceti Alpha VI exploded shortly after they were left and the force shifted Ceti Alpha V's orbit which turned the planet into a wasteland. Khan deduces that Chekov and the Captain thought they were on Ceti Alpha VI. When he asks them why they are there, they don't answer, and Khan puts wormlike creatures in them, which makes them susceptible to suggestion. Upon learning why there are there, Khan takes over the Reliant, tries to steal Genesis and have revenge on Kirk. He starts by making Chekov contact the scientist in charge of Genesis and telling her that Kirk has ordered him to take possession of Genesis. She then calls Kirk who has no knowledge of what she is talking about but before they can talk any further, they lose contact. Admiral James T. Kirk is attended by Mr. Spock, who is now in command of the Enterprise, and is taking some cadets on a training cruise. But now he tells them they have to investigate what is happening. So they go and meet the Reliant, that's when Khan attacks the Enterprise crippling it. Khan then calls Kirk and demands that Kirk turn himself and all data on Genesis. Kirk uses the time to come with a counter move which he executes. So while Khan repairs the Reliant, Kirk heads off to find the Genesis scientists.", "genres": ["Action", "Adventure", "Drama"], "imdb": {"id": 84726, "rating": 7.7, "votes": 85358}, "languages": ["English"], "lastupdated": "2015-09-10 17:39:26.920000000", "metacritic": 71, "num_mflix_comments": 1, "plot": "With the assistance of the Enterprise crew, Admiral Kirk must stop an old nemesis, Khan Noonien Singh, from using a life-generating device, the Genesis Device, as the ultimate weapon.", "poster": "https://m.media-amazon.com/images/M/MV5BMzcyYWE5YmQtNDE1Yi00ZjlmLWFlZTAtMzRjODBiYjM3OTA3XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 391996800000, "runtime": 113, "title": "Star Trek II: The Wrath of Khan", "tomatoes": {"consensus": "Considered by many fans to be the best of the Star Trek movies, Khan features a strong plot, increased tension, and a sharp supporting performance from Ricardo Montalban.", "critic": {"meter": 88, "numReviews": 49, "rating": 8}, "dvd": 963273600000, "fresh": 43, "lastUpdated": 1442080257000, "production": "Paramount Pictures", "rotten": 6, "viewer": {"meter": 90, "numReviews": 84116, "rating": 3.8}}, "type": "movie", "writers": ["Gene Roddenberry (television series Star Trek)", "Harve Bennett (story)", "Jack B. Sowards (story)", "Jack B. Sowards (screenplay)"], "year": 1982}