{"_id": "573a13aef29313caabd2ce63", "awards": {"nominations": 12, "text": "4 wins & 12 nominations.", "wins": 4}, "cast": ["Daniel Craig", "Samantha Morton", "Bill Weston", "Jeremy McCurdie"], "countries": ["UK"], "directors": ["Roger Michell"], "fullplot": "On a beautiful cloudless day a young couple celebrate their reunion with a picnic. Joe has planned a postcard-perfect afternoon in the English countryside with his partner, Claire. But as Joe and Claire prepare to open a bottle of champagne, their idyll comes to an abrupt end. A hot air balloon drifts into the field, obviously in trouble. The pilot catches his leg in the anchor rope, while the only passenger, a boy, is too scared to jump down. Joe and three other men rush to secure the basket. Just as they secure the balloon, the wind rushes into the field, and at once the rescuers are airborne. Joe manages to drop to the ground, as do most of his companions, but one man is lifted skywards. As Joe, Claire and the other rescuers watch this strangely beautiful sight, they see the man fall to his death. Recalling the day's events at dinner with his friends Robin and Rachel, Joe reveals the impact the accident has had on his battered psyche. Ironically the balloon eventually lands safely, the boy unscathed. But fate has far more unpleasant things in store for Joe. Going to retrieve the body of the fallen man with fellow rescuer Jed Parry, for example, turns out to be a very bad move. Jed feels an instant connection with Joe--one that, as the weeks go by, becomes ever more intense.", "genres": ["Drama", "Mystery", "Romance"], "imdb": {"id": 375735, "rating": 6.4, "votes": 8441}, "languages": ["English"], "lastupdated": "2015-09-05 00:44:33.667000000", "metacritic": 61, "num_mflix_comments": 2, "plot": "Two strangers become dangerously close after witnessing a deadly accident.", "poster": "https://m.media-amazon.com/images/M/MV5BZmUzZDZlZTMtMDg0Mi00ZDA4LThkMjAtNDRlODMxMGVkNDk0XkEyXkFqcGdeQXVyNjU0NTI0Nw@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1101427200000, "runtime": 100, "title": "Enduring Love", "type": "movie", "writers": ["Ian McEwan (novel)", "Joe Penhall (screenplay)"], "year": 2004}