{"_id": "573a1393f29313caabcdd4f9", "awards": {"nominations": 5, "text": "Won 1 Oscar. Another 3 wins & 5 nominations.", "wins": 4}, "cast": ["Joan Crawford", "Jack Carson", "Zachary Scott", "Eve Arden"], "countries": ["USA"], "directors": ["Michael Curtiz"], "fullplot": "Mildred Pierce dotes on her daughters while husband Bert looks to Maggie Binderhof for affection. They separate leaving Mildred to raise the girls on her own. Elder daughter Veda goads her mother about their lack of money and in response Mildred proposes opening a small restaurant. Realtor Wally Fay advises her while making numerous rebuffed passes and introduces her to Monte Baragon whose property becomes the first of a chain of restaurants. Mildred has an affair with Monte. Meanwhile, money-hungry Veda pretends to be pregnant by wealthy Ted Forrester in order to bilk his family of $10,000. Mildred tears up the check, is slapped by Veda, and orders her daughter to leave. After time away, Mildred returns to find Veda singing in a cheap club. Veda will return only if Mildred promises luxury, so Mildred agrees to marry Monte in exchange for a third of her businesses. It soon becomes clear that something is going on between Veda and Monte. Mildred learns of this only after Monte has sold out his third of the her business leaving her bankrupt. She goes to Monte's beach house to kill him... Shots ring out, but what really happened?", "genres": ["Crime", "Drama", "Film-Noir"], "imdb": {"id": 37913, "rating": 8, "votes": 14696}, "languages": ["English"], "lastupdated": "2015-08-08 00:36:56.960000000", "num_mflix_comments": 2, "plot": "After her cheating husband leaves her, Mildred Pierce proves she can become independent and successful, but cannot seem to win the approval of her spoiled daughter.", "poster": "https://m.media-amazon.com/images/M/MV5BNzljY2U2MDItYWE3Yi00OWE3LWEyMjQtMGNkZmJjNDE0NDJjXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": -763689600000, "runtime": 111, "title": "Mildred Pierce", "tomatoes": {"critic": {"meter": 82, "numReviews": 34, "rating": 7.7}, "dvd": 1044316800000, "fresh": 28, "lastUpdated": 1440531218000, "production": "MGM Home Entertainment", "rotten": 6, "viewer": {"meter": 91, "numReviews": 7962, "rating": 4.1}}, "type": "movie", "writers": ["Ranald MacDougall (screenplay)", "James M. Cain (novel)"], "year": 1945}