{"_id": "573a13d8f29313caabda6394", "awards": {"nominations": 1, "text": "1 win & 1 nomination.", "wins": 1}, "cast": ["Jennifer Ellis", "Steve Coogan", "Nick Hopper", "Paul Popplewell"], "countries": ["UK", "USA"], "directors": ["Michael Winterbottom"], "fullplot": "After the untimely death of his daughter, Paul Raymond reflects on his life. Rising from a mind-reading act, Raymond grew to have a fabulously successful career as an erotica magnate that would make him the richest man in Britain. However, for all his material success, Paul's appetites mess up his personal life, such as alienating his wife with his philandering. Furthermore, even as he challenged his society's sexual mores, Paul's relationship with his daughter proves troublingly problematic as she came of age. While trying to be the best father he could, Paul gradually comes to realize that his proclivities have impoverished him in ways that mere money cannot address.", "genres": ["Biography", "Comedy", "Drama"], "imdb": {"id": 1951216, "rating": 6, "votes": 4886}, "languages": ["English"], "lastupdated": "2015-09-01 17:10:51.333000000", "metacritic": 57, "num_mflix_comments": 2, "plot": "The life of Paul Raymond, the controversial entrepreneur who became Britain's richest man.", "poster": "https://m.media-amazon.com/images/M/MV5BMTAxNDIyMDIxNjheQTJeQWpwZ15BbWU3MDYzNTk3MTk@._V1_SY1000_SX677_AL_.jpg", "released": 1373155200000, "runtime": 101, "title": "The Look of Love", "tomatoes": {"boxOffice": "$14.6k", "consensus": "While it may not add up to the definitive Paul Raymond biopic -- or take full advantage of Steve Coogan's many gifts -- The Look of Love still proves an entertainingly old-fashioned look at the Swinging London of the 1960s.", "critic": {"meter": 54, "numReviews": 70, "rating": 5.7}, "dvd": 1381190400000, "fresh": 38, "lastUpdated": 1442269096000, "production": "IFC Films", "rotten": 32, "viewer": {"meter": 35, "numReviews": 2757, "rating": 3}, "website": "http://www.facebook.com/TheLookofLoveMovie"}, "type": "movie", "writers": ["Matt Greenhalgh", "Paul Willetts (based on biographical material from \"Members Only: The Life and Times of Paul Raymond\")", "Jean de Letraz (extract from \"Pyjama Tops originally titled Moumou\")", "Simone Peigniet (extract from \"Pyjama Tops originally titled Moumou\")", "Mawby Green (English translation extract from \"Pyjama Tops originally titled Moumou\")", "Ed Feilbert (English translation extract from \"Pyjama Tops originally titled Moumou\")", "Tom Eyen (extract from \"Women Behind Bars\")"], "year": 2013}