{"_id": "573a139af29313caabcf0a4e", "awards": {"nominations": 5, "text": "3 wins & 5 nominations.", "wins": 3}, "cast": ["Louis Gossett Jr.", "Barbara Eve Harris", "Rachael Crawford", "Djanet Sears"], "countries": ["Canada", "USA"], "directors": ["Vic Sarin"], "fullplot": "A fortyish cancer-stricken, emaciated Frank Crosby and his fifteen-year-old son Clay, who is the healthful, youthful image of his father, are spending an afternoon enjoying the atmosphere of Venice Beach. They enter Oddities, a store where the gypsy woman owner gives them a pair of special wingtip shoes. Later that night in the hospital where Frank lay dying, he shares with Clay his memory of a postcard image: a golf course where people are playing and are leisurely sipping tea. Frank dies and leaves behind a distraught family: Clay, his little sister Maggie, and their mother Janice. Clay wistfully goes to his father's closet and finds the wingtips from earlier in the day. Putting them on, he is transported back in time and becomes his father as a child. He discovers he can travel back and forth in time just by putting on or taking off the shoes. Clay learns a great deal about his father's early years and is eager to learn more...", "genres": ["Drama"], "imdb": {"id": 119358, "rating": 6.6, "votes": 216}, "languages": ["English"], "lastupdated": "2015-08-14 00:52:40.130000000", "num_mflix_comments": 2, "plot": "A fortyish cancer-stricken, emaciated Frank Crosby and his fifteen-year-old son Clay, who is the healthful, youthful image of his father, are spending an afternoon enjoying the atmosphere ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTY3MjQ1MTYzNl5BMl5BanBnXkFtZTcwMjkzMjkzMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 866332800000, "runtime": 105, "title": "In His Father's Shoes", "tomatoes": {"dvd": 1104796800000, "lastUpdated": 1441914952000, "production": "Sonar Entertainment", "viewer": {"meter": 44, "numReviews": 134, "rating": 3.6}}, "type": "movie", "writers": ["Gary Gelt"], "year": 1997}