{"_id": "573a1393f29313caabcdd544", "awards": {"nominations": 2, "text": "Won 1 Oscar. Another 2 wins & 2 nominations.", "wins": 3}, "cast": ["George Sanders", "Hurd Hatfield", "Donna Reed", "Angela Lansbury"], "countries": ["USA"], "directors": ["Albert Lewin"], "fullplot": "In 1886, in the Victorian London, the corrupt Lord Henry Wotton meets the pure Dorian Gray posing for talented painter Basil Hallward. Basil paints Dorian's portrait and gives the beautiful painting and an Egyptian sculpture of a cat to him while Henry corrupts his mind and soul telling that Dorian should seek pleasure in life. Dorian wishes that his portrait could age instead of him. Dorian goes to a side show in the Two Turtles in the poor neighborhood of London and he falls in love with the singer Sibyl Vane. Dorian decides to get married with her and tells to Lord Henry that convinces him to test the honor of Sibyl. Dorian Gray leaves Sibyl and travels abroad and when he returns to London, Lord Henry tells him that Sibyl committed suicide for love. Along the years, Dorian's friends age while he is still the same, but his picture discloses his evilness and corruptive life. Can he still have salvation or is his soul trapped in the doomed painting?", "genres": ["Drama", "Fantasy", "Horror"], "imdb": {"id": 37988, "rating": 7.6, "votes": 8505}, "languages": ["English"], "lastupdated": "2015-09-15 06:14:03.833000000", "num_mflix_comments": 1, "plot": "A corrupt young man somehow keeps his youthful beauty, but a special painting gradually reveals his inner ugliness to all.", "poster": "https://m.media-amazon.com/images/M/MV5BYTQxMzgxNjQtZTgzMC00ZjYwLTlhMmUtODBkMTBmYTE3MTMzXkEyXkFqcGdeQXVyNTEwNDcxNDc@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": -783648000000, "runtime": 110, "title": "The Picture of Dorian Gray", "tomatoes": {"critic": {"meter": 90, "numReviews": 10, "rating": 8}, "dvd": 1021939200000, "fresh": 9, "lastUpdated": 1441912403000, "production": "WARNER BROTHERS PICTURES", "rotten": 1, "viewer": {"meter": 77, "numReviews": 5664, "rating": 3.6}}, "type": "movie", "writers": ["Albert Lewin (screen play)", "Oscar Wilde (based upon the novel by)"], "year": 1945}