{"_id": "573a13d7f29313caabda2694", "awards": {"nominations": 23, "text": "10 wins & 23 nominations.", "wins": 10}, "cast": ["Lorraine Barrett", "June Downs", "Phillip Froehlich", "Marissa Gaspay"], "countries": ["USA", "Netherlands", "UK", "Denmark"], "directors": ["Lauren Greenfield"], "fullplot": "In 2008, the Siegel family was top of the heap with the wealthy and politically influential David Siegel running the successful Westgate Resorts time-share business. To enjoy their good life, he and his engineer turned beauty queen trophy wife, Jackie, were building the largest single family private home in America. Suddenly, both the US economy and Westgate were rocked by the devastating sub-prime mortgage collapse. In the new economic reality with the business teetering on ruin, we follow the Siegels as they struggle to scale down their grotesquely ostentatious lifestyle. For this overprivileged family, accepting that situation proved a dispiriting struggle even as their unfinished dream home became a monument of their superficial values.", "genres": ["Documentary"], "imdb": {"id": 2125666, "rating": 7.1, "votes": 9939}, "languages": ["English"], "lastupdated": "2015-09-13 00:42:25.173000000", "metacritic": 80, "num_mflix_comments": 2, "plot": "A documentary that follows a billionaire couple as they begin construction on a mansion inspired by Versailles. During the next two years, their empire, fueled by the real estate bubble and cheap money, falters due to the economic crisis.", "poster": "https://m.media-amazon.com/images/M/MV5BMTM0MzY0NDc3NV5BMl5BanBnXkFtZTcwMTAyODY4Nw@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 1408147200000, "runtime": 100, "title": "The Queen of Versailles", "tomatoes": {"boxOffice": "$2.4M", "consensus": "The Queen of Versailles is a timely, engaging, and richly drawn portrait of the American Dream improbably composed of equal parts compassion and schadenfreude.", "critic": {"meter": 94, "numReviews": 106, "rating": 8}, "dvd": 1352764800000, "fresh": 100, "lastUpdated": 1440961407000, "production": "Magnolia Pictures", "rotten": 6, "viewer": {"meter": 73, "numReviews": 15322, "rating": 3.7}, "website": "http://www.magpictures.com/queenofversailles/"}, "type": "movie", "year": 2012}