{"_id": "573a13daf29313caabdad462", "awards": {"nominations": 19, "text": "19 wins & 19 nominations.", "wins": 19}, "cast": ["Jake Gyllenhaal", "Mèlanie Laurent", "Sarah Gadon", "Isabella Rossellini"], "countries": ["Canada", "Spain", "France"], "directors": ["Denis Villeneuve"], "fullplot": "Adam Bell is a Toronto area History college professor. He is a rather somber man, largely because he is stuck in a routine, which includes a relationship with his live-in girlfriend, Mary. While watching a rental movie, he spots an actor in a bit part that looks like him. He becomes obsessed with finding out about this double of his. He learns that the actor's stage name is Daniel Saint Claire, whose legal name is Anthony Claire. Claire is a Toronto based actor with only a few on-screen credits, and is married to a woman named Helen who is currently several months pregnant. Adam then becomes obsessed with meeting Claire, who he learns upon first sighting that they look exactly the same, from the facial hair to a scar each has, but Claire who outwardly is more \"put together\" than Adam. Their lives become intertwined as Claire himself ends up becoming obsessed with Adam, but in a slightly different way.", "genres": ["Mystery", "Thriller"], "imdb": {"id": 2316411, "rating": 6.8, "votes": 74013}, "languages": ["English"], "lastupdated": "2015-09-15 04:38:09.437000000", "metacritic": 61, "plot": "A man seeks out his exact look-alike after spotting him in a movie.", "poster": "https://m.media-amazon.com/images/M/MV5BMTQ2NzA5NjE4N15BMl5BanBnXkFtZTgwMjQ4NzMxMTE@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1391644800000, "runtime": 91, "title": "Enemy", "tomatoes": {"boxOffice": "$1.0M", "consensus": "Thanks to a strong performance from Jake Gyllenhaal and smart direction from Denis Villeneuve, Enemy hits the mark as a tense, uncommonly adventurous thriller.", "critic": {"meter": 75, "numReviews": 104, "rating": 6.7}, "dvd": 1403568000000, "fresh": 78, "lastUpdated": 1441906932000, "production": "A24 Films", "rotten": 26, "viewer": {"meter": 61, "numReviews": 22948, "rating": 3.3}, "website": "http://enemy-movie.com/"}, "type": "movie", "writers": ["Josè Saramago (novel)", "Javier Gullèn"], "year": 2013}