{"_id": "573a13c1f29313caabd63795", "awards": {"nominations": 11, "text": "1 win & 11 nominations.", "wins": 1}, "cast": ["Jeremy Renner", "Scott Glenn", "Stacy Keach", "Edward Norton"], "countries": ["Japan", "USA"], "directors": ["Tony Gilroy"], "fullplot": "The events in this movie take place around the same time as the events in The Bourne Ultimatum (2007). When a British reporter was writing an expose about Black Ops operations Treadstone and Black Briar, and the ones responsible for them are concerned. And when Jason Bourne, former Treadstone operative got the file on Treadstone and Black Briar and gave it to Pamela Landy who then passed it to the media. When the men behind Treadstone and Black Briar learn of this, they're concerned how this will affect other ops they have. They decide it's best to shut down all ops and make sure make everyone involved disappears. They try to take out Aaron Cross who is part of another op called Outcome, but he manages to survive. He then seeks out Dr. Marta Shearing who worked on him when he began. It seems part of the program is for all subjects to take medications but he has run out, which is why he seeks her. But someone tries to kill her. He saves her and she tells him, he should have stopped taking the medications long ago. They go to Manila so that she can help him. Later the men behind Outcome learn that Cross and Shearing are still alive. They try to get them.", "genres": ["Action", "Adventure", "Mystery"], "imdb": {"id": 1194173, "rating": 6.7, "votes": 209943}, "languages": ["English", "Russian", "Filipino"], "lastupdated": "2015-09-15 02:51:48.150000000", "metacritic": 61, "num_mflix_comments": 1, "plot": "An expansion of the universe from Robert Ludlum's novels, centered on a new hero whose stakes have been triggered by the events of the previous three films.", "poster": "https://m.media-amazon.com/images/M/MV5BMTc4Njk3MDM1Nl5BMl5BanBnXkFtZTcwODgyOTMxOA@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1344556800000, "runtime": 135, "title": "The Bourne Legacy", "tomatoes": {"boxOffice": "$113.2M", "consensus": "It isn't quite as compelling as the earlier trilogy, but The Bourne Legacy proves the franchise has stories left to tell -- and benefits from Jeremy Renner's magnetic work in the starring role.", "critic": {"meter": 55, "numReviews": 215, "rating": 5.8}, "dvd": 1355184000000, "fresh": 119, "lastUpdated": 1442079713000, "production": "Universal Pictures", "rotten": 96, "viewer": {"meter": 59, "numReviews": 280933, "rating": 3.5}, "website": "http://www.thebournelegacy.com/"}, "type": "movie", "writers": ["Tony Gilroy (screenplay)", "Dan Gilroy (screenplay)", "Tony Gilroy (story)"], "year": 2012}