{"_id": "573a13d8f29313caabda7337", "awards": {"nominations": 5, "text": "2 wins & 5 nominations.", "wins": 2}, "cast": ["Johnny Depp", "Rebecca Hall", "Paul Bettany", "Cillian Murphy"], "countries": ["UK", "China", "USA"], "directors": ["Wally Pfister"], "fullplot": "Dr. Will Caster (Johnny Depp) is the foremost researcher in the field of Artificial Intelligence, working to create a sentient machine that combines the collective intelligence of everything ever known with the full range of human emotions. His highly controversial experiments have made him famous, but they have also made him the prime target of anti-technology extremists who will do whatever it takes to stop him. However, in their attempt to destroy Will, they inadvertently become the catalyst for him to succeed-to be a participant in his own transcendence. For his wife Evelyn (Rebecca Hall) and best friend Max Waters (Paul Bettany), both fellow researchers, the question is not if they can...but if they should. Their worst fears are realized as Will's thirst for knowledge evolves into a seemingly omnipresent quest for power, to what end is unknown. The only thing that is becoming terrifyingly clear is there may be no way to stop him.", "genres": ["Drama", "Mystery", "Romance"], "imdb": {"id": 2209764, "rating": 6.3, "votes": 151500}, "languages": ["English"], "lastupdated": "2015-09-10 17:16:05.043000000", "metacritic": 42, "num_mflix_comments": 1, "plot": "A scientist's drive for artificial intelligence, takes on dangerous implications when his consciousness is uploaded into one such program.", "poster": "https://m.media-amazon.com/images/M/MV5BMTc1MjQ3ODAyOV5BMl5BanBnXkFtZTgwNjI1NDQ0MTE@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1397779200000, "runtime": 119, "title": "Transcendence", "tomatoes": {"boxOffice": "$23.0M", "consensus": "In his directorial debut, ace cinematographer Wally Pfister remains a distinctive visual stylist, but Transcendence's thought-provoking themes exceed the movie's narrative grasp.", "critic": {"meter": 19, "numReviews": 197, "rating": 4.6}, "dvd": 1405987200000, "fresh": 38, "lastUpdated": 1440528789000, "production": "Warner Bros. Pictures", "rotten": 159, "viewer": {"meter": 37, "numReviews": 63461, "rating": 2.9}, "website": "http://www.transcendencemovie.com/"}, "type": "movie", "writers": ["Jack Paglen"], "year": 2014}