{"_id": "573a1394f29313caabcdf4ba", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["James Mason", "Claire Bloom", "Hildegard Knef", "Geoffrey Toone"], "countries": ["UK"], "directors": ["Carol Reed"], "fullplot": "In the Post-World War II, the British Susanne Mallison travels to Berlin to visit her older brother Martin Mallison, a military that has married the German Bettina Mallison. The naive Susanne snoops on Bettina and suspects that she is hiding a secret from her brother. When Susanne meets Bettina with her friend Ivo Kern, he offers to show Berlin to her and they date. But Ivo meets the strange Halendar from the East Germany and Susanne takes a cab and return to her home alone. Then she dates Ivo again and he meets Olaf Kastner, who is a friend of Martin and Bettina. But soon Susanne, who has fallen in love with Ivo, learns that he was a former attorney married to Bettina but with a criminal past during the war. Now he is blackmailed by Halendar to kidnap Kastner and bring him back to the other side of the border. The plan fails and Halender asks his men to abduct Bettina to get Kastner. However, Susanne is kidnapped by mistake and is imprisoned in the basement of a house in East Berlin. Now Ivo plots a plan to rescue Susanne from Halender and help her to cross the border. Will they succeed in their intent?", "genres": ["Drama", "Thriller"], "imdb": {"id": 46031, "rating": 7.2, "votes": 913}, "languages": ["English", "German", "Russian"], "lastupdated": "2015-08-17 00:47:35.470000000", "num_mflix_comments": 1, "plot": "In the Post-World War II, the British Susanne Mallison travels to Berlin to visit her older brother Martin Mallison, a military that has married the German Bettina Mallison. The naive ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTQ0MDAyMjQxN15BMl5BanBnXkFtZTgwMjU1NzIwMjE@._V1_SY1000_SX677_AL_.jpg", "released": -510105600000, "runtime": 100, "title": "The Man Between", "tomatoes": {"lastUpdated": 1439923836000, "production": "LionsGate Entertainment", "viewer": {"meter": 78, "numReviews": 111, "rating": 3.6}}, "type": "movie", "writers": ["Walter Ebert (story)", "Harry Kurnitz (screenplay)"], "year": 1953}