{"_id": "573a139af29313caabcf0df0", "awards": {"nominations": 1, "text": "Nominated for 1 Oscar. Another 6 wins & 1 nomination.", "wins": 7}, "cast": ["Dan Gifford", "Clive Doyle", "Jack Harwell", "Dick J. Reavis"], "countries": ["USA"], "directors": ["William Gazecki"], "fullplot": "This controversial documentary about the stand-off between an unorthodox Christian group - the Branch Davidians, under the leadership of the young, charismatic David Koresh - and the FBI and ATF in Waco, Texas, from February to April 1993 presents a different spin on the events from that of the United States government, which held that the Branch Davidians set the fire that destroyed their compound, and killed the vast majority of them, on April 19, 1993. Using footage from the 51 day siege, from the congressional hearings afterwards, from people involved in all aspects of the siege, and from experts technical, psychological, and religious, the movie suggests that the Branch Davidians were not a cult, but a valid religious group practicing under First Amendment freedoms who fell victim to first the ineptitude of an ATF raid designed to garner the agency positive attention and later the cruel, methodical work of the FBI, who over-saw the murder of the Davidians and then quickly covered it up.", "genres": ["Documentary", "History"], "imdb": {"id": 120472, "rating": 8, "votes": 2514}, "languages": ["English"], "lastupdated": "2015-08-13 00:19:32.380000000", "num_mflix_comments": 1, "plot": "This controversial documentary about the stand-off between an unorthodox Christian group - the Branch Davidians, under the leadership of the young, charismatic David Koresh - and the FBI ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTgyODA4MjQ0OF5BMl5BanBnXkFtZTcwOTkxMzQyMQ@@._V1_SY1000_SX677_AL_.jpg", "released": 874627200000, "runtime": 165, "title": "Waco: The Rules of Engagement", "tomatoes": {"critic": {"meter": 88, "numReviews": 16, "rating": 7.8}, "dvd": 1070928000000, "fresh": 14, "lastUpdated": 1437417240000, "production": "Artefact Films", "rotten": 2, "viewer": {"meter": 86, "numReviews": 1327, "rating": 3.8}}, "type": "movie", "writers": ["William Gazecki", "Dan Gifford", "Michael McNulty"], "year": 1997}