{"_id": "573a13acf29313caabd28d08", "awards": {"nominations": 33, "text": "Won 1 Oscar. Another 43 wins & 33 nominations.", "wins": 44}, "cast": ["Joaquin Phoenix", "Reese Witherspoon", "Ginnifer Goodwin", "Robert Patrick"], "countries": ["USA", "Germany"], "directors": ["James Mangold"], "fullplot": "While growing up in the Great Depression era, Johnny Cash takes an interest in music and eventually moves out of his Arkansas town to join the air force in Germany. While there, he buys his first guitar and writes his own music, and proposes to Vivian. When they got married, they settled in Tennessee and with a daughter, he supported the family by being a salesman. He discovers a man who can pursue his dreams and ends up getting a record with the boys. Shortly after that, he was on a short tour, promoting his songs, and meets the already famous and beautiful June Carter. Then as they get on the long-term tours with June, the boys, and Jerry Lee Lewis, they have this unspoken relationship that grows. But when June leaves the tour because of his behavior, he was a drug addict. His marriage was also falling apart, and when he sees June years later at an awards show, he forces June to tour with them again, promising June to support her two kids and herself. While the tour goes on, the relationship between June and John grow more,and his marriage to his first wife ends. June finds out about the drugs, and help him overcome it. True love and care helped John eventually stop the drug usage, and finally proposes to her in front of an audience at a show.", "genres": ["Biography", "Drama", "Music"], "imdb": {"id": 358273, "rating": 7.9, "votes": 178442}, "languages": ["English", "Russian"], "lastupdated": "2015-09-10 17:06:18.597000000", "metacritic": 72, "num_mflix_comments": 1, "plot": "A chronicle of country music legend Johnny Cash's life, from his early days on an Arkansas cotton farm to his rise to fame with Sun Records in Memphis, where he recorded alongside Elvis Presley, Jerry Lee Lewis and Carl Perkins.", "poster": "https://m.media-amazon.com/images/M/MV5BMjIyOTU3MjUxOF5BMl5BanBnXkFtZTcwMTQ0NjYzMw@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1132272000000, "runtime": 136, "title": "Walk the Line", "tomatoes": {"boxOffice": "$119.3M", "consensus": "Superior acting and authentic crooning capture the emotional subtleties of the legend of Johnny Cash with a freshness that is a pleasure to watch.", "critic": {"meter": 82, "numReviews": 204, "rating": 7.2}, "dvd": 1141084800000, "fresh": 168, "lastUpdated": 1442426389000, "production": "20th Century Fox", "rotten": 36, "viewer": {"meter": 90, "numReviews": 544262, "rating": 3.9}, "website": "http://www.walkthelinethemovie.com/"}, "type": "movie", "writers": ["Johnny Cash (book)", "Johnny Cash (book)", "Gill Dennis", "James Mangold"], "year": 2005}