{"_id": "573a13c7f29313caabd76465", "awards": {"nominations": 4, "text": "1 win & 4 nominations.", "wins": 1}, "cast": ["Ed Helms", "John C. Reilly", "Anne Heche", "Isiah Whitlock Jr."], "countries": ["USA"], "directors": ["Miguel Arteta"], "fullplot": "Tim Lippe (Helms) was the guy people always thought would go places but then he just ... didn't. He's been living in èber-sleepy Brown Valley, Wisconsin his whole life, still \"pre-engaged\" to his 7th grade teacher Macy Vanderhei (Weaver), while selling insurance to protect other people's dreams. But now, Tim's stalled life is about to get a kick-start because, for the first time in his 34 years, he's headed to a \"major\" metropolis - Cedar Rapids, Iowa - where he must try to save his company at a do-or-die insurance convention that, for him, will be entirely unconventional. From the minute he checks into his hotel with his ancient American Tourister and cummerbund money belt, it's clear Tim has no idea how the modern world really works. He is soon smitten with seductive Nebraskan insurance agent Joan Ostrowski-Fox (Heche) and awed by his experienced roommates, the straight-shooting Ronald Wilkes (Whitlock Jr.) and the suspicious Dean Zeigler (Reilly). Disheartened when he comes face-to-face with corporate corruption, Tim is ultimately lured beyond the lobby into an urban jungle he's only ever seen on DVD and when it seems his life - and chances to succeed - have gone completely topsy-turvy, he finds his own unjaded way to turn it all around.", "genres": ["Comedy"], "imdb": {"id": 1477837, "rating": 6.3, "votes": 31747}, "languages": ["English"], "lastupdated": "2015-08-22 01:08:12.907000000", "metacritic": 70, "num_mflix_comments": 1, "plot": "Tim Lippe has no idea what he's in for when he's sent to Cedar Rapids, Iowa to represent his company at an annual insurance convention, where he soon finds himself under the \"guidance\" of three convention veterans.", "poster": "https://m.media-amazon.com/images/M/MV5BNDUwMjQ3MzQwM15BMl5BanBnXkFtZTcwMDAzNjUyNA@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1300406400000, "runtime": 87, "title": "Cedar Rapids", "tomatoes": {"boxOffice": "$6.9M", "consensus": "It's as conventional as its Midwestern setting, but Cedar Rapids boasts a terrific cast and a script that deftly blends R-rated raunch and endearing sweetness.", "critic": {"meter": 86, "numReviews": 159, "rating": 6.7}, "dvd": 1308614400000, "fresh": 136, "lastUpdated": 1440010221000, "production": "Fox Searchlight Pictures", "rotten": 23, "viewer": {"meter": 59, "numReviews": 25780, "rating": 3.3}, "website": "http://www.foxsearchlight.com/cedarrapids/"}, "type": "movie", "writers": ["Phil Johnston"], "year": 2011}