{"_id": "573a13aff29313caabd2f173", "awards": {"nominations": 0, "text": "4 wins.", "wins": 4}, "cast": ["Elijah Wood", "Charlie Hunnam", "Claire Forlani", "Marc Warren"], "countries": ["USA", "UK"], "directors": ["Lexi Alexander"], "fullplot": "Unjustly expelled from Harvard when a stash of cocaine is found in his possession, Matt moves to London to live with his sister and her husband Steve. He is quickly introduced to Steve's chirpy, cock-sure younger brother Pete. Initially, Pete is reluctant to get acquainted with Matt and allow him to tread around the capital city with him because he may be seen by others as an 'outsider', but after a heavy drinking session with him and his mates he quickly changes his opinion of him. On the way back from a football match, Matt is viciously accosted by a gang of Birmingham City thugs, until Pete and his friends step in and save him. It is from here that Matt learns the truth about Pete and his friends- they are football hooligans, operating the GSE (Green Street Elite) 'firm.' Initially afraid of the violence, Matt soon ends up becoming as desensitized to it as his new found friends - but as events roll on, suspicion, shocking revelations and unsettled scores combine to a devastating climax where London's most fierce football rivals - Millwall and West Ham United - are set to go head to head.", "genres": ["Crime", "Drama", "Sport"], "imdb": {"id": 385002, "rating": 7.5, "votes": 109166}, "languages": ["English", "Italian", "German"], "lastupdated": "2015-09-04 00:04:52.583000000", "metacritic": 55, "num_mflix_comments": 1, "plot": "A wrongfully expelled Harvard undergrad moves to London, where he is introduced to the violent underworld of football hooliganism.", "poster": "https://m.media-amazon.com/images/M/MV5BMjExNTg3NzYwMV5BMl5BanBnXkFtZTcwMzcxMTEzMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1126224000000, "runtime": 109, "title": "Green Street Hooligans", "type": "movie", "writers": ["Lexi Alexander (story)", "Dougie Brimson (story)", "Dougie Brimson (screenplay)", "Josh Shelov (screenplay)", "Lexi Alexander (screenplay)"], "year": 2005}