{"_id": "573a13d4f29313caabd983fa", "awards": {"nominations": 4, "text": "7 wins & 4 nominations.", "wins": 7}, "cast": ["Ranveer Singh", "Anushka Sharma", "Parineeti Chopra", "Dipannita Sharma"], "countries": ["India"], "directors": ["Maneesh Sharma"], "fullplot": "Delhi-based Dimple Chaddha lives a wealthy lifestyle with her parents, and has a steady boyfriend in Sunny Singh. On the pretext of attending a Sangeet, she goes on a date with him, consumes alcohol, passes out, and is brought home in his arms. He impresses her parents and they not only approve of him but Mr. Chaddha uses goon-power to evict tenants from a Bungalow on Barakhamba Road which belongs to Sunny's grandfather. He then offers to purchase it for Rs.2 Crores and advances Rs.20 Lakhs to Sunny, who takes the cash and disappears - leaving Mr. Chaddha to face the real owners as well as being arrested by the police. Sunny strikes again, this time as Deven Shah in Mumbai, and his target is business executive, Raina Parulekar, who he cons for Rs.90 Lakhs by selling her a fake painting. The media gets involved. Dimple, together with a Lucknow-based widow, Saira Rashid, who has lost Rs.10 Lakhs to a man called Iqbal Khan, contact her. They soon discover that Sunny, Deven and Iqbal are one and the same, and get together in Mumbai, hire a fast-talking sales-girl, Ishika Desai, to con Sunny. They then manage to trace him to Goa where he is going by the name of Vikram Thapar. Watch as events unfold when the trio put forth their plan to get even with this con-man.", "genres": ["Comedy", "Drama"], "imdb": {"id": 1954598, "rating": 6, "votes": 5398}, "languages": ["Hindi", "Panjabi", "Urdu", "English"], "lastupdated": "2015-09-04 00:37:13.413000000", "num_mflix_comments": 1, "plot": "Three women hire a fourth to try and get even with a con-man.", "poster": "https://m.media-amazon.com/images/M/MV5BZDBkNGU4OGEtZTc0Ny00MTNiLThhYzItZjgzODU3ZjJiYzE4XkEyXkFqcGdeQXVyNTkzNDQ4ODc@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 1323388800000, "runtime": 140, "title": "Ladies vs. Ricky Bahl", "tomatoes": {"lastUpdated": 1441997280000, "production": "Yash Raj Films", "viewer": {"meter": 37, "numReviews": 835, "rating": 3}, "website": "http://www.yashrajfilms.com/microsites/lvrb/index.html"}, "type": "movie", "writers": ["Devika Bhagat (screenplay)", "Aditya Chopra (story)", "Habib Faisal (additional screenplay)", "Habib Faisal (dialogue)"], "year": 2011}