{"_id": "573a13a5f29313caabd134d8", "awards": {"nominations": 2, "text": "2 wins & 2 nominations.", "wins": 2}, "cast": ["Ryan Gosling", "David Morse", "Clea DuVall", "David Cale"], "countries": ["USA"], "directors": ["Alex Smith", "Andrew J. Smith"], "fullplot": "In Blue Springs, Montana, high school student Roy Chutney is beginning to lose his way in life largely the result of two simultaneous events. The first is that his father, Nelson Chutney, dies. Roy hadn't seen his father much since his parents divorced and his father remarried. Nelson was run over by a train, but Roy's mother, Evangeline Chutney, with who Roy has a somewhat emotionally distant relationship, believes he committed suicide. The second is that because funding to the school has reduced the football program to just a varsity team with no junior varsity, Roy, along with half the other players, is cut from the football squad, as his coach doesn't believe he is mentally tough enough despite he being a skilled player. The two incidents combined make the situation even worse for Roy as football was his primary connection to his father. Into Roy's life enters Gideon Ferguson, the local newspaper seller, who asks Roy to be part of his newly formed football team, which will play in a six-man back field league. Gid ends up being that father figure that is missing in Roy's life. That guidance is especially important as Roy begins his first sexual relationship, with Skyla Sisco, a local barmaid. However, Roy and Gid's relationship begins to change when rumors abound that Gid is gay and is romantically interested in Roy. Roy has to wade through the rumors and his own feelings both for Gid and Skyla in figuring out what to do regarding his relationships with them.", "genres": ["Drama", "Sport"], "imdb": {"id": 266971, "rating": 6.1, "votes": 1951}, "languages": ["English"], "lastupdated": "2015-08-05 01:20:24.680000000", "metacritic": 65, "num_mflix_comments": 1, "plot": "A young man finds solace with a young woman, his mother, and a high-school football coach who recruits him to quarterback a six-man team.", "poster": "https://m.media-amazon.com/images/M/MV5BOWNmOGZhNTEtNGQzZS00ZTIxLWJmZjMtNWYxZGY5MTUxOWY5XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1010707200000, "runtime": 112, "title": "The Slaughter Rule", "tomatoes": {"consensus": "A bleak but original indie, The Slaughter Rule benefits from outstanding performances by Ryan Gosling and David Morse.", "critic": {"meter": 73, "numReviews": 30, "rating": 5.9}, "dvd": 1045440000000, "fresh": 22, "lastUpdated": 1438280667000, "production": "Cowboy Pictures", "rotten": 8, "viewer": {"meter": 44, "numReviews": 919, "rating": 3.1}, "website": "http://www.theslaughterrule.com"}, "type": "movie", "writers": ["Alex Smith", "Andrew J. Smith"], "year": 2002}