{"_id": "573a139af29313caabcf0f01", "awards": {"nominations": 27, "text": "Won 1 Golden Globe. Another 13 wins & 27 nominations.", "wins": 14}, "cast": ["Liev Schreiber", "James Cromwell", "Melanie Griffith", "John Malkovich"], "countries": ["USA", "UK"], "directors": ["Benjamin Ross"], "fullplot": "Coming to Hollywood as a celebrated boy genius featuring a spectacular career arc in New York including his radio hoax War of the Worlds, Orson Welles is stymied on the subject for his first film. After a dinner party at Hearst Castle, during which he has a verbal altercation with William Randolph Hearst, Welles decides to do a movie about Hearst. It takes him some time to convince co-writer Herman J. Mankiewicz and the studio, but Welles eventually gets the script and the green light, keeping the subject very hush-hush with the press. The movie is about an aging newspaper publisher who controlled his enemies as ruthlessly as he controlled his friends; and whose mistress was destined for fame. When a rough cut is screened, Hearst gets wind of the movie's theme and begins a campaign to see that it is not only never publicly screened, but destroyed.", "genres": ["Biography", "Drama"], "imdb": {"id": 120801, "rating": 7.1, "votes": 4818}, "languages": ["English"], "lastupdated": "2015-08-28 00:02:51.783000000", "num_mflix_comments": 1, "plot": "Orson Welles produces his greatest film, Citizen Kane (1941), despite the opposition of the film's de facto subject, William Randolph Hearst.", "poster": "https://m.media-amazon.com/images/M/MV5BMTcwNjQ0MTY0N15BMl5BanBnXkFtZTYwMzE4MDI5._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 943056000000, "runtime": 86, "title": "RKO 281", "tomatoes": {"critic": {"meter": 92, "numReviews": 13, "rating": 7}, "dvd": 956620800000, "fresh": 12, "lastUpdated": 1440094475000, "production": "HBO Video", "rotten": 1, "viewer": {"meter": 75, "numReviews": 2836, "rating": 3.6}}, "type": "movie", "writers": ["John Logan", "Richard Ben Cramer (documentary \"The Battle Over Citizen Kane\")", "Thomas Lennon (documentary \"The Battle Over Citizen Kane\")"], "year": 1999}