{"_id": "573a13c9f29313caabd7ae48", "awards": {"nominations": 2, "text": "1 win & 2 nominations.", "wins": 1}, "cast": ["Dave Potter", "Jed Himel", "Matthew Avant", "Hal Maynor"], "countries": ["USA"], "directors": ["Matthew Avant"], "fullplot": "Through a late night conspiracy broadcast, a frantic caller claims human beings from the future are living on the moon, controlling our every action. His call is cut short, but when a box of unusual materials arrives at the radio station several days later, filmmakers Matt and Sonny become involved and pursue the story, following the lead and chasing a set of hidden coordinates deep into Louisiana's Atchafalaya Basin. An enormous and dark underground facility reveals there may be more truth to the caller's story than believed, and quickly entangles the filmmakers in uncovering a history that was meant to be long forgotten. They narrowly escape with one unusual artifact, but soon find themselves in a threatening encounter with the bizarre and reclusive Church of Lunology, an organization very dedicated to keeping their mysterious secrets, and silencing anyone who stands in their way. Now hunted and on the run, they flee their homes only to encounter David James, a man who claims to have escaped from the moon as a child. His interview provides much needed answers, and even a solution to their problem. Committed to protecting themselves by filming their story, they keep the cameras rolling as they discover earth's secret history, and fight to survive a hunt that would have already taken their lives, if they weren't in possession of one unusual artifact. Time is almost up, but their story cannot end until they face head-on the most powerful and secret organization in the world.", "genres": ["Sci-Fi"], "imdb": {"id": 1539313, "rating": 6.6, "votes": 1015}, "languages": ["English"], "lastupdated": "2015-08-21 00:28:55.437000000", "plot": "Two documentary filmmakers accidentally uncover the greatest moon secret the world has never known, and the powerful organization determined to keep it that way.", "poster": "https://m.media-amazon.com/images/M/MV5BMTk2OTM1Njk4MV5BMl5BanBnXkFtZTcwNzAxNTEwMw@@._V1_SY1000_SX677_AL_.jpg", "runtime": 98, "title": "Lunopolis", "tomatoes": {"dvd": 1318291200000, "lastUpdated": 1441131226000, "production": "Matthew Josiah Avant", "viewer": {"meter": 68, "numReviews": 233, "rating": 3.7}, "website": "http://www.lunopolis.com/"}, "type": "movie", "writers": ["Matthew Avant (story)", "Matthew Avant"], "year": 2009}