{"_id": "573a13acf29313caabd27dc1", "awards": {"nominations": 1, "text": "3 wins & 1 nomination.", "wins": 3}, "cast": ["Li Gong", "Tony Ka Fai Leung", "Honglei Sun", "Zhixiong Li"], "countries": ["China", "Hong Kong"], "directors": ["Zhou Sun"], "fullplot": "Zhou Yu, a ceramic decorative artist, travels twice a week from her home town of San Ming to Chongyang to visit her boyfriend, Chen Qing, a government worker and budding poet. The two met at a dance while Chen Qing was in San Ming, his old home town, on a business trip. She is the inspiration for the best of his poetry. Zhou Yu is a strong willed woman, whereas Cheng Qing is a sensitive soul. These differences in addition to the growing disparity in their life situations places an unspoken strain in their relationship, despite each truly loving the other. As such, Zhou Yu befriends Zhang Qiang, a veterinarian who travels on the same trains as her. Like Zhou Yu, Zhang Qiang is a strong personality whose emotional temperament more closely matches hers. Ultimately, the three, individually and collectively, have to decide if, and if so how each of the others fits into his/her future life, especially as Cheng Qing has to make a further decision about his professional life.", "genres": ["Drama", "Romance"], "imdb": {"id": 354243, "rating": 6.6, "votes": 1293}, "languages": ["Mandarin"], "lastupdated": "2015-08-25 00:05:22.023000000", "metacritic": 49, "num_mflix_comments": 1, "plot": "Zhou Yu, a ceramic decorative artist, travels twice a week from her home town of San Ming to Chongyang to visit her boyfriend, Chen Qing, a government worker and budding poet. The two met ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTgzODg2MTAyNl5BMl5BanBnXkFtZTcwODk2MDYyMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1028160000000, "runtime": 97, "title": "Zhou Yu de huo che", "tomatoes": {"consensus": "Despite some beautifully framed images, this mood piece, told in a fractured fashion, is confounding and, ultimately, unsatisfying.", "critic": {"meter": 41, "numReviews": 56, "rating": 5.3}, "dvd": 1101168000000, "fresh": 23, "lastUpdated": 1437072593000, "production": "Sony Pictures Classics", "rotten": 33, "viewer": {"meter": 59, "numReviews": 2528, "rating": 3.3}, "website": "http://www.sonyclassics.com/comingsoon.php?filmid=62&page=1"}, "type": "movie", "writers": ["Cun Bei (novel)", "Zhou Sun", "Mei Zhang"], "year": 2002}