{"_id": "573a13d6f29313caabd9f70f", "awards": {"nominations": 6, "text": "8 wins & 6 nominations.", "wins": 8}, "cast": ["Connor Jessup", "Alexia Fast", "Michael Buie", "Alex Ozerov"], "countries": ["Canada"], "directors": ["Jason Buxton"], "fullplot": "This is a film about a troubled teen, Sean Randall, who is falsely accused of planning a Columbine shooting scenario. It all begins when an unlikely bond forms between Sean (Connor Jessup) and a preppy teenage girl named Deanna Roy (Alexia Fast). Deanna's boyfriend is deeply threatened by Sean and Deanna's friendship, resulting in a violent confrontation. Seeking to protect himself, Sean issues a death threat online - and is swiftly arrested. When the police raid Sean's home, they find rifles, shotguns, knives and ammunition - all property of Sean's father Ricky (Michael Buie), an avid hunter. They also find a supposed \"hit list\" with twenty names of people who have tormented Sean. The authorities and the media proclaim another Columbine has been narrowly averted, and soon Sean faces a terrifying imprisonment in a youth detention facility. Sean's only hope is to overcome his dark image, and prove his innocence to Deanna and to his community.", "genres": ["Drama"], "imdb": {"id": 2077721, "rating": 7.1, "votes": 1041}, "languages": ["English"], "lastupdated": "2015-08-17 00:59:11.580000000", "plot": "An alienated teenager's posturing online threat ignites a firestorm of fear in a small community.", "poster": "https://m.media-amazon.com/images/M/MV5BMTAyMDAzMjY5NzheQTJeQWpwZ15BbWU4MDQ0NTQ4NDMx._V1_SY1000_SX677_AL_.jpg", "released": 1370995200000, "runtime": 103, "title": "Blackbird", "tomatoes": {"critic": {"meter": 57, "numReviews": 7, "rating": 5.8}, "dvd": 1412553600000, "fresh": 4, "lastUpdated": 1441049810000, "production": "Blackbird Pictures", "rotten": 3, "viewer": {"meter": 77, "numReviews": 173, "rating": 3.8}, "website": "http://www.blackbirdthefilm.com"}, "type": "movie", "writers": ["Jason Buxton"], "year": 2012}