{"_id": "573a139cf29313caabcf5947", "awards": {"nominations": 5, "text": "Nominated for 3 Primetime Emmys. Another 2 nominations.", "wins": 0}, "cast": ["Rob Morrow", "Lance Henriksen", "Donna Murphy", "Jean Louisa Kelly"], "countries": ["USA"], "directors": ["John Gray"], "fullplot": "April 14, 1865. As four year of Civil War draw to a close, our country again faces unforgettable tragedy: the assassination of the President. Starring Lance Henriksen as the Great Emancipator and Rob Morrow as assassin John Wilkes Booth, this riveting recreation of The Day Lincoln Was Shot (from Jim Bishop's landmark book) is a thrilling and detailed chronicle of the plot, murder and manhunt that changed America forever. To avenge what he called the Confederacy's \"noble cause,\" Booth conspires with his motley followers, rages and boasts, and aspires to a place in history as a Great Man. The weary Lincoln, longing for a just peace, meets with his Cabinet, steals precious time with his family and dreams - literally - of the death of a President. Minute by minute, killer and victim edge closer to the burst of gunfire at Ford's Theatre that stopped Lincoln's heart - and shattered the country's soul.", "genres": ["Biography", "Drama", "History"], "imdb": {"id": 140613, "rating": 7, "votes": 296}, "languages": ["English"], "lastupdated": "2015-08-07 01:09:35.257000000", "plot": "April 14, 1865. As four year of Civil War draw to a close, our country again faces unforgettable tragedy: the assassination of the President. Starring Lance Henriksen as the Great ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTM2NjkyMzY4NF5BMl5BanBnXkFtZTcwNzI4MDkxMQ@@._V1_SY1000_SX677_AL_.jpg", "released": 892339200000, "runtime": 95, "title": "The Day Lincoln Was Shot", "tomatoes": {"dvd": 1305504000000, "lastUpdated": 1437936004000, "production": "Warner Home Video", "viewer": {"meter": 64, "numReviews": 74, "rating": 3.7}, "website": "http://www.wbshop.com/"}, "type": "movie", "writers": ["Jim Bishop (book)", "Tim Metcalfe (teleplay)", "John Gray (teleplay)"], "year": 1998}