{"_id": "573a13c1f29313caabd65214", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Milla Jovovich", "Will Patton", "Hakeem Kae-Kazim", "Corey Johnson"], "countries": ["USA", "UK"], "directors": ["Olatunde Osunsanmi"], "fullplot": "In 1972, a scale of measurement was established for alien encounters. When a UFO is sighted, it is called an encounter of the first kind. When evidence is collected, it is known as an encounter of the second kind. When contact is made with extraterrestrials, it is the third kind. The next level, abduction, is the fourth kind. Modern-day, Alaska, where-mysteriously since the 1960s-a disproportionate number of the population has been reported missing every year. Despite multiple FBI investigations of the region, the truth has never been discovered. Here in this remote region, psychologist Dr. Abigail Tyler began videotaping sessions with traumatized patients and unwittingly discovered some of the most disturbing evidence of alien abduction ever documented. The Fourth Kind exposes the terrified revelations of multiple witnesses. Their accounts of being visited by alien figures all share disturbingly identical details, the validity of which is investigated throughout the film.", "genres": ["Mystery", "Sci-Fi", "Thriller"], "imdb": {"id": 1220198, "rating": 5.9, "votes": 59584}, "languages": ["English", "Aboriginal"], "lastupdated": "2015-09-17 04:49:14.617000000", "metacritic": 34, "num_mflix_comments": 2, "plot": "A thriller involving an ongoing unsolved mystery in Alaska, where one town has seen an extraordinary number of unexplained disappearances during the past 40 years and there are accusations of a federal cover up.", "poster": "https://m.media-amazon.com/images/M/MV5BMTY2OTM0NDEyM15BMl5BanBnXkFtZTcwNTAzMDY4Mg@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1257465600000, "runtime": 98, "title": "The Fourth Kind", "tomatoes": {"boxOffice": "$25.5M", "consensus": "While it boasts a handful of shocks, The Fourth Kind is hokey and clumsy and makes its close encounters seem eerily mundane.", "critic": {"meter": 19, "numReviews": 111, "rating": 4}, "dvd": 1268697600000, "fresh": 21, "lastUpdated": 1442163626000, "production": "Universal Pictures", "rotten": 90, "viewer": {"meter": 41, "numReviews": 171417, "rating": 3}, "website": "http://www.thefourthkind.net/"}, "type": "movie", "writers": ["Olatunde Osunsanmi (screenplay)", "Olatunde Osunsanmi (story)", "Terry Robbins (story)"], "year": 2009}