{"_id": "573a13b7f29313caabd4a598", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Claire Danes", "Toni Collette", "Vanessa Redgrave", "Patrick Wilson"], "countries": ["USA", "Germany"], "directors": ["Lajos Koltai"], "fullplot": "The love which binds mother and daughter -- seen through the prism of one mother's life as it crests with optimism, navigates a turning point, and ebbs to its close. Overcome by the power of memory, Ann Lord reveals a long-held secret to her concerned daughters; Constance, a content wife and mother, and Nina, a restless single woman. Both are bedside when Ann calls out for the man she loved more than any other. But who is this \"Harris,\" wonder her daughters, and what is he to our mother? While Constance and Nina try to take stock of Ann's life and their own lives, their mother is tended to by a night nurse as she journeys in her mind back to a summer weekend some fifty years before, when she was Ann Grant, a young woman who has come from New York City to be maid of honor at the high-society Newport wedding of her dearest friend from college, Lila Wittenborn. The bride-to-be is jittery, and turns to her maid of honor rather than her own mother for support. Ann stays close to her friend, yet is even closer to Lila's irrepressible brother Buddy. Unexpected feelings surge forth once Ann meets wedding guest Harris Arden, a lifelong friend and intimate of the Wittenborn family. Ann's love for Harris will change her life, and those of her daughters, forever.", "genres": ["Drama", "Romance"], "imdb": {"id": 765447, "rating": 6.6, "votes": 11256}, "languages": ["English"], "lastupdated": "2015-09-16 08:12:41.813000000", "metacritic": 45, "num_mflix_comments": 1, "plot": "A drama exploring the romantic past and emotional present of Ann Grant and her daughters, Constance and Nina. As Ann lays dying, she remembers, and is moved to convey to her daughters, the defining moments in her life 50 years prior, when she was a young woman. Harris is the man Ann loves in the 1950s and never forgets.", "poster": "https://m.media-amazon.com/images/M/MV5BMTQ3NTAzNzgzMV5BMl5BanBnXkFtZTcwMDIyMjY0MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1183075200000, "runtime": 117, "title": "Evening", "tomatoes": {"boxOffice": "$12.4M", "consensus": "Beautifully filmed, but decidedly dull, Evening is a collossal waste of a talented cast.", "critic": {"meter": 27, "numReviews": 128, "rating": 4.9}, "dvd": 1190678400000, "fresh": 35, "lastUpdated": 1440182197000, "production": "Focus Features", "rotten": 93, "viewer": {"meter": 48, "numReviews": 123678, "rating": 3.1}, "website": "http://www.focusfeatures.com/evening/"}, "type": "movie", "writers": ["Susan Minot (screenplay)", "Michael Cunningham (screenplay)", "Susan Minot (novel)"], "year": 2007}