{"_id": "573a139af29313caabcf0014", "awards": {"nominations": 1, "text": "2 wins & 1 nomination.", "wins": 2}, "cast": ["Arnold Schwarzenegger", "Sinbad", "Phil Hartman", "Rita Wilson"], "countries": ["USA"], "directors": ["Brian Levant"], "fullplot": "Meet Howard Langston, a salesman for a mattress company is constantly busy at his job, and he also constantly disappoints his son, after he misses his son's karate exposition, he tries hard to come up with a way to make it up to him, this is when his son tells Howard that he wants for Christmas is an action figure of his son's television hero, Turbo Man. Unfotunately for Howard, it is Christmas Eve, and every store is sold out of Turbo Man figures, now Howard must travel all over town and compete with everybody else including a mail man named Myron to find a Turbo Man action figure, and to make it to the Wintertainment parade which will feature Turbo Man.", "genres": ["Comedy", "Family"], "imdb": {"id": 116705, "rating": 5.4, "votes": 63039}, "languages": ["English"], "lastupdated": "2015-09-15 03:22:04.183000000", "num_mflix_comments": 2, "plot": "A father needs to get a Turbo Man action figure for his son just before Christmas. Unfotunately, every store is sold out of Turbo Man figures, and he must travel all over town and compete with everybody else to find a Turbo Man figure.", "poster": "https://m.media-amazon.com/images/M/MV5BMmJlYzViNzctMjQ1Ni00ZWQ4LThkN2YtMzI2ZGU5Nzk0NTAyXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 848620800000, "runtime": 89, "title": "Jingle All the Way", "tomatoes": {"consensus": "Arnold Schwarzenegger tries his best, but Jingle All the Way suffers from an uneven tone, shifting wildly from a would-be satire on materialism to an antic, slapstick yuk-fest.", "critic": {"meter": 17, "numReviews": 42, "rating": 4}, "dvd": 910051200000, "fresh": 7, "lastUpdated": 1442336445000, "production": "20th Century Fox", "rotten": 35, "viewer": {"meter": 37, "numReviews": 227729, "rating": 2.6}}, "type": "movie", "writers": ["Randy Kornfield"], "year": 1996}