{"_id": "573a139ef29313caabcfcbe1", "awards": {"nominations": 0, "text": "2 wins.", "wins": 2}, "cast": ["Michael Rooker", "Big Daddy Wayne", "Jack Wallace", "Will Sasso"], "countries": ["USA"], "directors": ["Jason Freeland"], "fullplot": "Fritz Brown is an ex-LAPD, recovering alcoholic who now splits his time repossessing cars for a used car lot and staffing his one-man private detective agency. When a filthy caddie named Freddy \"Fat Dog\" Baker wanders into Fritz's office one day, flashing a wad of cash, Fritz is hired to follow Fat Dog's kid sister Jane, who is holed up with a Beverly Hills sugar daddy named Sol Kupferman. Kupferman is a 70 year-old bag man for the mob, and Fat Dog claims that \"Solly K\" is up to something evil that may harm Jane. The trail leads Fritz to an encounter with his dark past in the person of Haywood Cathcart, current head of LAPD internal affairs and the person who kicked Fritz off the police force. But what is Cathcart doing in business with a mobster? And why is Jane shacked up with a man old enough to be her grandfather? Fritz starts asking some questions, and the answers are all bad news. Fritz finds himself back on Haywood Cathcart's short list, and as the bodies start to pile up around him, Fritz stands to lose more than his job this time around as some old debts get repaid.", "genres": ["Crime", "Drama", "Thriller"], "imdb": {"id": 171135, "rating": 5.9, "votes": 792}, "languages": ["English"], "lastupdated": "2015-08-12 00:07:59.330000000", "num_mflix_comments": 3, "plot": "Recovering alcoholic ex-LAPD private detective Fritz Brown is hired by caddie \"Fat Dog\" to follow his kid sister, who is holed up with an old sugar daddy. The trail leads to his old police boss Cathcart, and the bodies start to pile up.", "poster": "https://m.media-amazon.com/images/M/MV5BMjE0ODQ0NTA4M15BMl5BanBnXkFtZTcwOTk3MjUyMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 928368000000, "runtime": 104, "title": "Brown's Requiem", "tomatoes": {"critic": {"meter": 50, "numReviews": 6, "rating": 6}, "dvd": 955411200000, "fresh": 3, "lastUpdated": 1440614450000, "production": "Sterling Entertainment", "rotten": 3, "viewer": {"meter": 35, "numReviews": 493, "rating": 3}}, "type": "movie", "writers": ["Jason Freeland", "James Ellroy (novel)"], "year": 1998}