{"_id": "573a1395f29313caabce19ac", "awards": {"nominations": 7, "text": "Won 10 Oscars. Another 20 wins & 7 nominations.", "wins": 30}, "cast": ["Natalie Wood", "Richard Beymer", "Russ Tamblyn", "Rita Moreno"], "countries": ["USA"], "directors": ["Jerome Robbins", "Robert Wise"], "fullplot": "West Side Story is the award-winning adaptation of the classic romantic tragedy, \"Romeo and Juliet\". The feuding families become two warring New York City gangs- the white Jets led by Riff and the Puerto Rican Sharks, led by Bernardo. Their hatred escalates to a point where neither can coexist with any form of understanding. But when Riff's best friend (and former Jet) Tony and Bernardo's younger sister Maria meet at a dance, no one can do anything to stop their love. Maria and Tony begin meeting in secret, planning to run away. Then the Sharks and Jets plan a rumble under the highway - whoever wins gains control of the streets. Maria sends Tony to stop it, hoping it can end the violence. It goes terribly wrong, and before the lovers know what's happened, tragedy strikes and doesn't stop until the climactic and heartbreaking ending.", "genres": ["Crime", "Drama", "Musical"], "imdb": {"id": 55614, "rating": 7.6, "votes": 66158}, "languages": ["English", "Spanish"], "lastupdated": "2015-09-10 17:07:38.620000000", "plot": "Two youngsters from rival New York City gangs fall in love, but tensions between their respective friends build toward tragedy.", "poster": "https://m.media-amazon.com/images/M/MV5BMTM0NDAxOTI5MF5BMl5BanBnXkFtZTcwNjI4Mjg3NA@@._V1_SY1000_SX677_AL_.jpg", "rated": "UNRATED", "released": -253238400000, "runtime": 152, "title": "West Side Story", "tomatoes": {"consensus": "Buoyed by Robert Wise's dazzling direction, Leonard Bernstein's score, and Stephen Sondheim's lyrics, West Side Story remains perhaps the most iconic of all the Shakespeare adaptations to visit the big screen.", "critic": {"meter": 94, "numReviews": 64, "rating": 8.3}, "dvd": 908841600000, "fresh": 60, "lastUpdated": 1440180029000, "production": "United Artists Films", "rotten": 4, "viewer": {"meter": 84, "numReviews": 167938, "rating": 3.5}, "website": "http://www.westsidestory-themovie.com/"}, "type": "movie", "writers": ["Ernest Lehman (screenplay)", "Arthur Laurents (book)", "Jerome Robbins (play)"], "year": 1961}