{"_id": "573a1398f29313caabceb17a", "awards": {"nominations": 19, "text": "Won 4 Oscars. Another 23 wins & 19 nominations.", "wins": 27}, "cast": ["Dustin Hoffman", "Tom Cruise", "Valeria Golino", "Gerald R. Molen"], "countries": ["USA"], "directors": ["Barry Levinson"], "fullplot": "Charles Sanford \"Charlie\" Babbit is a self-centered Los Angeles-based automobile dealer/hustler/bookie who is at war with his own life. Charlie, as a young teenager, used his father's 1948 Buick convertible without permission and as a result, he went to jail for two days on account that his father reported it stolen. It is then that Charlie learns that his estranged father died and left him from his last will and testament a huge bed of roses and the car while the remainder will of $3 Million goes into a trust fund to be distributed to someone. Charlie seemed pretty angry by this and decides to look into this matter. It seems as if that \"someone\" is Raymond, Charlie's unknown brother, an autistic savant who lives in a world of his own, resides at the Walbrook Institute. Charlie then kidnaps Raymond and decides to take him on a lust for life trip to the west coast as a threat to get the $3 Million inheritance. Raymond's acts and nagging, including repeated talks of \"Abbott & Costello\", \"Four minutes till Wapner\" and refusal to fly on an airline except Quantas drives Charlie insane... and out of his selfish world into a cross-country trek of pure love and understanding that these two both have.", "genres": ["Drama"], "imdb": {"id": 95953, "rating": 8, "votes": 359903}, "languages": ["English", "Italian"], "lastupdated": "2015-09-01 00:44:44.303000000", "metacritic": 65, "num_mflix_comments": 1, "plot": "Selfish yuppie Charlie Babbitt's father left a fortune to his savant brother Raymond and a pittance to Charlie; they travel cross-country.", "poster": "https://m.media-amazon.com/images/M/MV5BMzVjNzI4NzYtMjE4NS00M2IzLWFkOWMtOTYwMWUzN2ZlNGVjL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 598233600000, "runtime": 133, "title": "Rain Man", "tomatoes": {"consensus": "This road-trip movie about an autistic savant and his callow brother is far from seamless, but Barry Levinson's direction is impressive, and strong performances from Tom Cruise and Dustin Hoffman add to its appeal.", "critic": {"meter": 90, "numReviews": 69, "rating": 7.9}, "dvd": 946684800000, "fresh": 62, "lastUpdated": 1442256405000, "production": "MGM", "rotten": 7, "viewer": {"meter": 90, "numReviews": 312071, "rating": 3.8}}, "type": "movie", "writers": ["Barry Morrow (story)", "Ronald Bass (screenplay)", "Barry Morrow (screenplay)"], "year": 1988}