{"_id": "573a139af29313caabcf0e97", "awards": {"nominations": 16, "text": "5 wins & 16 nominations.", "wins": 5}, "cast": ["Will Smith", "Gene Hackman", "Jon Voight", "Lisa Bonet"], "countries": ["USA"], "directors": ["Tony Scott"], "fullplot": "Robert dean is a mild-mannered lawyer who works in Washington D.C. He is on the trail of a kingpin named Pintero. Meanwhile, a politician named Thomas Reynolds is negotiating with Congressman Phillip Hammersley about a new surveillance system with satellites. But, Hammersley declines, that is when Reynolds had Hammersley killed, but this murder was caught on tape, and this person was being chased by Reynolds' team of NSA agents, the guy must ditch the tape, so he plants it on Dean (unbeknownst to Dean). Then, the NSA decides to get into Dean's life. That is when Dean's life began to fall apart all around him, with his wife and job both gone. Dean wants to find out what is going on. Then, he meets a man named \"Brill\" who tells him that Dean has something that the government wants. That is when Dean and Brill formulate a plan to get Dean's life back and turn the Tables on Reynolds.", "genres": ["Action", "Crime", "Drama"], "imdb": {"id": 120660, "rating": 7.3, "votes": 175848}, "languages": ["English"], "lastupdated": "2015-08-25 00:09:36.320000000", "metacritic": 67, "num_mflix_comments": 1, "plot": "A lawyer becomes a target by a corrupt politician and his NSA goons when he accidentally receives key evidence to a serious politically motivated crime.", "poster": "https://m.media-amazon.com/images/M/MV5BMWI0Y2NhMzMtYTE5ZS00MDlhLTg0ZjEtMjAwZmEwNTc0ODc2XkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 911520000000, "runtime": 132, "title": "Enemy of the State", "tomatoes": {"consensus": "An entertaining, topical thriller that finds director Tony Scott on solid form and Will Smith confirming his action headliner status.", "critic": {"meter": 71, "numReviews": 84, "rating": 6.4}, "dvd": 929404800000, "fresh": 60, "lastUpdated": 1442077568000, "production": "Buena Vista Pictures", "rotten": 24, "viewer": {"meter": 78, "numReviews": 372071, "rating": 3.5}, "website": "http://www.enemyofthestate.com"}, "type": "movie", "writers": ["David Marconi"], "year": 1998}