{"_id": "573a1398f29313caabce9bfa", "awards": {"nominations": 2, "text": "3 wins & 2 nominations.", "wins": 3}, "cast": ["Kris Kristofferson", "Keith Carradine", "Lori Singer", "Geneviève Bujold"], "countries": ["USA"], "directors": ["Alan Rudolph"], "fullplot": "In the metropolis of Rain City which is run under a military state, Wanda's Cafè is the meeting point for several individuals, who, in the words of Lt. Gunther of the police department, are converging on \"the shit (they're) wallowing in\". Former Rain City police officer John Hawkins - Hawk to his friends - has just been released from prison where he served eight years for murder, a crime to which he readily admits. He killed Fat Adolph, a mobster, in an effort to clean up the streets and protect the ones he loved. He has returned to Wanda's - Wanda who was his former lover - to restart his life. Straightforward Wanda still loves Hawk, but is not in love with him, and as such offers him a place to stay with no strings. Wanda has just hired largely innocent Georgia to work in the cafè. Penniless Georgia and her husband Coop have just arrived in Rain City with their infant son Spike in the run-down camper in which they live. They believed moving to the city - their first time ever in such - would solve all their problems. Frustrated Coop has been unable to find work, so he ends up hooking up with another Wanda's regular, a criminal named Solo. The power and money associated with this new criminal life changes Coop. His and Solo's problem is that their criminal activities are impinging on that of a more ruthless criminal named Hilly Blue, who will not sit idly by without getting what he considers his fair share of the activity. In the meantime, Hawk starts to fall for Georgia, who is torn between the love she felt for the man she married as opposed to who Coop has become, and the support provided by Hawk, who wants to care for her and Spike. Hawk has to decide what to do to help Georgia while getting what he wants for his renewed life.", "genres": ["Comedy", "Crime", "Drama"], "imdb": {"id": 90209, "rating": 6.7, "votes": 1111}, "languages": ["English", "Korean", "Spanish", "Japanese", "Latin"], "lastupdated": "2015-08-08 00:25:28.880000000", "num_mflix_comments": 1, "plot": "The lives of an ex-con, a coffee-shop owner, and a young couple looking to make it rich intersect in the fictional and hypnotic Rain City.", "poster": "https://m.media-amazon.com/images/M/MV5BN2M5NWRhMWYtMzc1MS00ZWU2LWJlMDgtM2RjOTBhYmUwZGJkL2ltYWdlXkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 510019200000, "runtime": 111, "title": "Trouble in Mind", "type": "movie", "writers": ["Alan Rudolph"], "year": 1985}