{"_id": "573a13aaf29313caabd21c77", "awards": {"nominations": 5, "text": "Nominated for 1 Golden Globe. Another 4 nominations.", "wins": 0}, "cast": ["Diane Lane", "Sandra Oh", "Lindsay Duncan", "Raoul Bova"], "countries": ["USA", "Italy"], "directors": ["Audrey Wells"], "fullplot": "Frances Mayes is a San Francisco based literature professor, literary reviewer and author, who is struggling in writing her latest book. Her outwardly perfect and stable life takes a turn when her husband files for divorce as he wants to marry the woman with who he is having an affair, the infidelity and marital problem of which Frances was unaware. As Frances was supporting him as he was writing his own book, he sues for alimony despite Frances not being wealthy herself. And he wants to keep the house. Frances eventually accepts her best friend Patti's offer of a vacation, a gay tour of Tuscany which Patti and her lesbian partner Grace originally purchased for themselves before Patti found out that she is pregnant. The gift is a means to escape dealing with the divorce, from which Patti feels Frances may never recover emotionally without some intervention. Feeling that Patti's assessment may be correct in that she has too much emotional baggage ever to return to San Francisco, Frances, while in Tuscany, impulsively ditches the tour to purchase an aged villa, which ends up being a fixer-upper. Frances has many obstacles in eking out a productive and happy life in her new surroundings, that happy life which she hopes will eventually include rediscovering romantic love. In a discussion with sympathetic real estate agent Signor Martini, Frances outlines what emotionally she wants to accomplish with the villa, despite none of those items in a substantive material sense currently being in her life. In response, Martini tells her the story of a set of railroad tracks that were laid between Vienna and Venice before an engine that could make the trek being built, a train which now regularly travels the route. The question becomes whether Frances, in going through the process, will be laying another Vienna to Venice track, and if so whether that end product emotionally will be exactly as she envisions.", "genres": ["Comedy", "Drama", "Romance"], "imdb": {"id": 328589, "rating": 6.7, "votes": 33226}, "languages": ["English", "Italian", "Polish", "French", "Spanish", "German"], "lastupdated": "2015-09-16 09:44:49.643000000", "metacritic": 52, "num_mflix_comments": 1, "plot": "A writer impulsively buys a villa in Tuscany in order to change her life.", "poster": "https://m.media-amazon.com/images/M/MV5BOGY5ZjQ4M2ItMjQ0NC00NjY4LWIwYmEtMTIxNzFmNjA4YmJlXkEyXkFqcGdeQXVyNDk3NzU2MTQ@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1064534400000, "runtime": 113, "title": "Under the Tuscan Sun", "tomatoes": {"boxOffice": "$43.5M", "consensus": "Though formulaic and superficial, Under the Tuscan Sun is redeemed by Lane's vibrant performance.", "critic": {"meter": 62, "numReviews": 149, "rating": 6.2}, "dvd": 1075766400000, "fresh": 92, "lastUpdated": 1442509441000, "production": "Buena Vista Pictures", "rotten": 57, "viewer": {"meter": 79, "numReviews": 63464, "rating": 3.4}, "website": "http://tuscansun.movies.go.com/main.html"}, "type": "movie", "writers": ["Frances Mayes (book)", "Audrey Wells (screen story)", "Audrey Wells (screenplay)"], "year": 2003}