{"_id": "573a1392f29313caabcda98f", "awards": {"nominations": 1, "text": "Won 1 Oscar. Another 2 wins & 1 nomination.", "wins": 3}, "cast": ["Jeanette MacDonald", "Nelson Eddy", "Frank Morgan", "Elsa Lanchester"], "countries": ["USA"], "directors": ["Robert Z. Leonard", "W.S. Van Dyke"], "fullplot": "Princess Marie de Namours de la Bonfain is a beautiful, young, sophisticated French princess of 23, who finds more worth in true love than a title. On the eve of her arranged marriage, to a Spanish-grandee, whom she doesn't love, her maid, Marietta comes to her to say farewell. Marietta is to leave that night on a cargo ship bound for New Orleans where she is to make a new life and find a husband. Princess Marie trades places with Marietta to escape her unwanted marriage and takes on the maid, Marietta's identity. While sailing, the cargo ship is taken hostage by pirates, but, Captain Richard Warrington and his mercenaries soon come to the rescue. Captain Warrington is quickly taken by the beautiful princess aka Marietta and she with him. But, he has no interest in marriage and she's afraid she might be recognized. Meanwhile in France, a search and reward is out for Princess Marie's whereabouts. Princess Marie's Uncle and fiancèe soon discover that she is in New Orleans and sail for America. When they arrive Princess Maria's true identity is revealed. That eve, a elegant ball is thrown in her honor. Captain Warrington learns that the Princess will be sent back that night to France, but, he isn't going to let the women he loves get away that easy.", "genres": ["Drama", "Musical", "Romance"], "imdb": {"id": 26768, "rating": 7, "votes": 766}, "languages": ["English"], "lastupdated": "2015-09-17 04:39:53.683000000", "num_mflix_comments": 2, "plot": "In order to avoid a prearranged marriage, a rebellious French princess sheds her identity and escapes to colonial New Orleans, where she finds an unlikely true love.", "poster": "https://m.media-amazon.com/images/M/MV5BMTM5Nzk2MzU5Nl5BMl5BanBnXkFtZTgwMzM2MzgzMTE@._V1._CR3,40,333,459_SY264_CR7,0,178,264_AL_.jpg", "rated": "G", "released": -1097020800000, "runtime": 105, "title": "Naughty Marietta", "tomatoes": {"critic": {"meter": 43, "numReviews": 7, "rating": 7}, "dvd": 1310515200000, "fresh": 3, "lastUpdated": 1441911363000, "production": "MGM Home Entertainment", "rotten": 4, "viewer": {"meter": 83, "numReviews": 614, "rating": 4.2}}, "type": "movie", "writers": ["Rida Johnson Young (book)", "John Lee Mahin (screen play)", "Frances Goodrich (screen play)", "Albert Hackett (screen play)"], "year": 1935}