{"_id": "573a13c3f29313caabd6a099", "awards": {"nominations": 39, "text": "Won 1 Oscar. Another 51 wins & 39 nominations.", "wins": 52}, "cast": ["Soledad Villamil", "Ricardo Darèn", "Carla Quevedo", "Pablo Rago"], "countries": ["Argentina", "Spain"], "directors": ["Juan Josè Campanella"], "fullplot": "In 1999, retired Argentinian federal justice agent Benjamèn Espèsito is writing a novel, using an old closed case as the source material. That case is the brutal rape and murder of Liliana Coloto. In addition to seeing the extreme grief of the victim's husband Ricardo Morales, Benjamèn, his assistant Pablo Sandoval, and newly hired department chief Irene Menèndez-Hastings were personally affected by the case as Benjamèn and Pablo tracked the killer, hence the reason why the unsatisfactory ending to the case has always bothered him. Despite the department already having two other suspects, Benjamèn and Pablo ultimately were certain that a man named Isidoro Gèmez is the real killer. Although he is aware that historical accuracy is not paramount for the novel, the process of revisiting the case is more an issue of closure for him. He tries to speak to the key players in the case, most specifically Irene, who still works in the justice department and who he has always been attracted to but never pursued due to the differences in their ages and social classes. The other issue is that Gèmez is still at large, no one aware if he is alive or dead. But as Pablo at the time mentioned that passion is one thing that cannot be changed in behavior, Benjamèn learns now that that premise still holds true.", "genres": ["Drama", "Mystery", "Thriller"], "imdb": {"id": 1305806, "rating": 8.2, "votes": 112005}, "languages": ["Spanish"], "lastupdated": "2015-09-16 08:12:36.423000000", "metacritic": 81, "num_mflix_comments": 1, "plot": "A retired legal counselor writes a novel hoping to find closure for one of his past unresolved homicide cases and for his unreciprocated love with his superior - both of which still haunt him decades later.", "poster": "https://m.media-amazon.com/images/M/MV5BMTgwNTI3OTczOV5BMl5BanBnXkFtZTcwMTM3MTUyMw@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1274400000000, "runtime": 129, "title": "The Secret in Their Eyes", "tomatoes": {"boxOffice": "$6.4M", "consensus": "Unpredictable and rich with symbolism, this Argentinian murder mystery lives up to its Oscar with an engrossing plot, Juan Jose Campanella's assured direction, and mesmerizing performances from its cast.", "critic": {"meter": 91, "numReviews": 132, "rating": 7.8}, "dvd": 1285027200000, "fresh": 120, "lastUpdated": 1442510027000, "production": "Sony Pictures Classics", "rotten": 12, "viewer": {"meter": 93, "numReviews": 27308, "rating": 4.2}, "website": "http://www.sonyclassics.com/thesecretintheireyes/"}, "type": "movie", "writers": ["Eduardo Sacheri", "Juan Josè Campanella", "Eduardo Sacheri (novel)"], "year": 2009}