{"_id": "573a13a5f29313caabd13247", "awards": {"nominations": 8, "text": "7 wins & 8 nominations.", "wins": 7}, "cast": ["Tatsuya Fujiwara", "Aki Maeda", "Tarè Yamamoto", "Takeshi Kitano"], "countries": ["Japan"], "directors": ["Kinji Fukasaku"], "fullplot": "Forty-two students, three days, one deserted Island: welcome to Battle Royale. A group of ninth-grade students from a Japanese high school have been forced by legislation to compete in a Battle Royale. The students are each given a bag with a randomly selected weapon and a few rations of food and water and sent off to kill each other in a no-holds-barred (with a few minor rules) game to the death, which means that the students have three days to kill each other until one survives--or they all die. The movie focuses on a few of the students and how they cope. Some decide to play the game like the psychotic Kiriyama or the sexual Mitsuko, while others like the heroes of the movie--Shuya, Noriko, and Kawada--are trying to find a way to get off the Island without violence. However, as the numbers dwell down lower and lower on an hourly basis, is there any way for Shuya and his classmates to survive?", "genres": ["Action", "Drama", "Sci-Fi"], "imdb": {"id": 266308, "rating": 7.8, "votes": 130103}, "languages": ["Japanese"], "lastupdated": "2015-09-13 00:22:26.913000000", "metacritic": 81, "num_mflix_comments": 1, "plot": "In the future, the Japanese government captures a class of ninth-grade students and forces them to kill each other under the revolutionary \"Battle Royale\" act.", "poster": "https://m.media-amazon.com/images/M/MV5BMTgxMmJhNjItMmFlMS00MWVlLWIyMjktYjUyYTI4MzA0YzgxXkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 976924800000, "runtime": 114, "title": "Battle Royale", "tomatoes": {"consensus": "Battle Royale is a controversial and violent parable of adolescence, heightening teenage melodrama with life-or-death stakes.", "critic": {"meter": 86, "numReviews": 43, "rating": 7.5}, "dvd": 1332201600000, "fresh": 37, "lastUpdated": 1442253677000, "production": "Anchor Bay Entertainment", "rotten": 6, "viewer": {"meter": 89, "numReviews": 85068, "rating": 4.1}}, "type": "movie", "writers": ["Koushun Takami (novel)", "Kenta Fukasaku (screenplay)"], "year": 2000}