{"_id": "573a13bcf29313caabd574da", "awards": {"nominations": 4, "text": "2 wins & 4 nominations.", "wins": 2}, "cast": ["German Alexander", "Bob Avian", "Justin Bellero", "Michael Bennett"], "countries": ["USA"], "directors": ["Adam Del Deo", "James D. Stern"], "fullplot": "Starting at midnight January 26, 1974, dancer and choreographer Michael Bennett held a twelve-hour taped get-together with twenty-two dancers talking about themselves, he not knowing exactly where it would lead. It would become the genesis for what has become one of the most influential Broadway musicals of all time, and a show which speaks to theatrical dancers' hearts: \"A Chorus Line\". In 2008, a Broadway revival of the show is being mounted, with many involved in the original production part of the creative team behind the revival. The issue for the revival's creative team is to make the show and the casting fresh, while respecting the original, where the characters, their stories and their related songs all came out of the 1974 dancers' stories, they who were cast in the original production. Although the names and the faces have changed from 1974, the dancers auditioning mirror many of the stories and issues faced by those original dancers. As such, they \"really want this job\" as it speaks to who they are and what they do and want to do for a living. It ends up being a difficult process for both sides as there end up being 3,000 dancers at the start of the eight month audition process.", "genres": ["Documentary", "Music"], "imdb": {"id": 977648, "rating": 7.4, "votes": 1194}, "languages": ["English"], "lastupdated": "2015-08-22 00:13:41.733000000", "metacritic": 76, "num_mflix_comments": 2, "plot": "Follows the plight of real-life dancers as they struggle through auditions for the Broadway revival of \"A Chorus Line\". Also investigates the history of the show and the creative minds behind the original and current incarnations.", "poster": "https://m.media-amazon.com/images/M/MV5BMTY3ODk2MDQxMl5BMl5BanBnXkFtZTcwNjk2MjczMg@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1244764800000, "runtime": 96, "title": "Every Little Step", "tomatoes": {"boxOffice": "$1.5M", "consensus": "Fascinating and insightful, Every Little Step is a thoroughly engrossing behind the scenes look at Broadway performers.", "critic": {"meter": 92, "numReviews": 95, "rating": 7.6}, "dvd": 1255392000000, "fresh": 87, "lastUpdated": 1437328846000, "production": "Sony Pictures Classics", "rotten": 8, "viewer": {"meter": 87, "numReviews": 3014, "rating": 4}, "website": "http://www.sonyclassics.com/everylittlestep"}, "type": "movie", "year": 2008}