{"_id": "573a13a7f29313caabd1b6af", "awards": {"nominations": 4, "text": "4 nominations.", "wins": 0}, "cast": ["French Stewart", "Elaine Hendrix", "Tony Martin", "Caitlin Wachs"], "countries": ["USA"], "directors": ["Alex Zamm"], "fullplot": "On the outskirts of Riverton, \"The Safest City in America\", a pensive Inspector Gadget sits in his Gadgetmobile, along with his canine companion, Brain. Gadget is back on the job, on stakeout, but he is concerned that everything is too quiet in Riverton. He has a very simple, rational answer to this; \" it's always the most quiet just before criminals strike\". Evil must be afoot. In a moment of overzealous crime fighting Gadget arrests an elderly women for wreckless driving, but not without incident. In his effort to make the arrest Gadget's many crime fighting \"accessories\" go wildly astray. It's time to report back to headquarters for a checkup. Baxter, the \"Q\" of the Police Department, delivers the prognosis - as he is a prototype things are bound to have some glitches. The remedy is close at hand. But, before Baxter can tell of his new \"top secret\", Gadget is confronted by a furious Chief Quimby. The little old lady arrested earlier for wreckless driving turns out to be Quimby's mother. Gadget is put on notice - any more mistakes and he is on probation. Meanwhile, in the dead of night, and in a raging storm, something happens that will change Gadget's destiny forever - his arch enemy, his nemesis, Claw makes a daring escape from Riverton Prison. Now, evil really is afoot. Chief Quimby offers Inspector Gadget one last chance to redeem himself through the capture, and return to incarceration, of Claw. And so the chase begins.", "genres": ["Action", "Comedy", "Family"], "imdb": {"id": 301454, "rating": 3.4, "votes": 3571}, "languages": ["English"], "lastupdated": "2015-08-21 00:36:05.517000000", "num_mflix_comments": 2, "plot": "Inspector Gadget returns in this sequel to the 1999 hit, \"Inspector Gadget.\" Gadget once again has to fight his arch nemesis, Claw.", "poster": "https://m.media-amazon.com/images/M/MV5BMTIxNjY1MTg4NF5BMl5BanBnXkFtZTcwMDU1MTQyMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 1047340800000, "runtime": 89, "title": "Inspector Gadget 2", "tomatoes": {"critic": {"meter": 40, "numReviews": 5, "rating": 4.4}, "dvd": 1047340800000, "fresh": 2, "lastUpdated": 1440009682000, "production": "Walt Disney Pictures", "rotten": 3, "viewer": {"meter": 21, "numReviews": 14098, "rating": 2.3}}, "type": "movie", "writers": ["Andy Heyward (characters)", "Jean Chalopin (characters)", "Bruno Bianchi (characters)", "Ron Anderson", "William Robertson", "Alex Zamm"], "year": 2003}