{"_id": "573a13b4f29313caabd3f9bf", "awards": {"nominations": 15, "text": "12 wins & 15 nominations.", "wins": 12}, "cast": ["Jèrèmie Renier", "Dèborah Franèois", "Jèrèmie Segard", "Fabrizio Rongione"], "countries": ["Belgium", "France"], "directors": ["Jean-Pierre Dardenne", "Luc Dardenne"], "fullplot": "Young, unmarried couple Sonia and Bruno have just had a son, who Sonia names Jimmy. Bruno, who did not visit her while she was in the hospital, scoffs at the notion of what he considers traditional employment, instead eking out a living primarily on petty crimes committed with his fourteen year old associate, Steve. He even sublets Sonia's small apartment while she is in the hospital, he sleeping either in the homeless shelter or squatting in what he calls his \"shack\" down by the river. On the day after Sonia gets out of the hospital, she allows Bruno to take Jimmy for a walk while she stands in line for her benefits. On that walk, Bruno makes the unilateral decision to sell Jimmy to a black market adoption agency. Upon finding out what Bruno has done, Sonia has a breakdown and falls unconscious. Fearing that Sonia will turn him over to the police when she regains consciousness, Bruno tries to get Jimmy back while he leaves Sonia in the hospital in her unconscious state. But Bruno will soon learn that regaining Sonia's trust will not be as simple as getting Jimmy back. And he will also learn that getting Jimmy back is not as easy as giving back the money.", "genres": ["Crime", "Drama", "Romance"], "imdb": {"id": 456396, "rating": 7.5, "votes": 13378}, "languages": ["French"], "lastupdated": "2015-08-07 01:04:58.397000000", "metacritic": 87, "plot": "Bruno and Sonia, a young couple living off her benefit and the thefts committed by his gang, have a new source of money: their newborn son.", "poster": "https://m.media-amazon.com/images/M/MV5BMTk5NjI0NDExNl5BMl5BanBnXkFtZTcwOTQwNzIzMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1126656000000, "runtime": 95, "title": "L'enfant", "tomatoes": {"boxOffice": "$0.4M", "consensus": "The Dardennes continue to excel at presenting works of rigorous naturalism, with detached observations of authentic characters that nevertheless resonate with complex moral issues.", "critic": {"meter": 86, "numReviews": 106, "rating": 7.5}, "dvd": 1155600000000, "fresh": 91, "lastUpdated": 1440528935000, "production": "Sony Picture Classics", "rotten": 15, "viewer": {"meter": 72, "numReviews": 32495, "rating": 3.3}, "website": "http://www.sonyclassics.com/thechild/"}, "type": "movie", "writers": ["Jean-Pierre Dardenne", "Luc Dardenne"], "year": 2005}