{"_id": "573a13aff29313caabd301c6", "awards": {"nominations": 1, "text": "1 win & 1 nomination.", "wins": 1}, "cast": ["Jeff Clark", "Darrick Doerner", "Sarah Gerhardt", "Laird John Hamilton"], "countries": ["USA", "France"], "directors": ["Stacy Peralta"], "fullplot": "A semiserious, often rollicking, multigenerational insider's look at the origins of surfing, the colorful and subversive birth of surf culture, and the mythology and lure of the big wave. This passionate and fluid film is without question the first authentic history of surfing from its humble Hawaiian beginnings to the big business it became to the still-rebellious universe it inhabits today. Riding Giants is a study in individuality and freedom, the pursuit and techniques of pure kinetic pleasure, and the risk taking and attitudes that characterize its leading figures. For some viewers, this is perhaps more than they ever wanted to know. But Peralta's detailed knowledge of the surfing lifestyle, its icons and locations, its boom and exploitation by the media, and the fascination it has held for young men for more than five decades is unparalleled and fuels this expedition for the expert and initiate alike. Closely chronicling the sometimes-life-and-death drama that big-wave riding entails, Riding Giants is an often-mesmerizing visual thrill ride. But the most appealing aspect of this often revelatory documentary is the realization that the man versus nature dialectic never ends; the search for the ultimate wave and the spiritual pinnacle can only be pursued but never reached.", "genres": ["Documentary", "History", "Sport"], "imdb": {"id": 389326, "rating": 7.9, "votes": 3676}, "languages": ["English"], "lastupdated": "2015-08-19 00:40:16.063000000", "metacritic": 80, "num_mflix_comments": 1, "plot": "Documentary detailing the origins and history of surf culture.", "poster": "https://m.media-amazon.com/images/M/MV5BMjA3NjczNTgxMF5BMl5BanBnXkFtZTcwMzk2MDYyMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1092355200000, "runtime": 105, "title": "Riding Giants", "type": "movie", "writers": ["Stacy Peralta", "Sam George"], "year": 2004}