{"_id": "573a13c2f29313caabd68acb", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Andrew Scott", "Fiona Glascott", "Tobias Menzies", "Niall Buggy"], "countries": ["USA"], "directors": ["Dover Koshashvili"], "fullplot": "In ANTON CHEKHOV'S THE DUEL, escalating animosity between two men with opposing philosophies of life is played out against the backdrop of a decaying seaside resort along the Black Sea coast. Laevsky is a dissipated romantic given to gambling and flirtation. He has run off to the sea with beautiful, emotionally empty, Nadya, another man's wife. Laevsky has now grown tired of her, but two obstacles block his route to escape: he is broke, and he faces the absolute enmity of Von Koren, an arrogant zoologist and former friend who can no longer tolerate Laevsky's irresponsibility. Soon Laevsky confronts Von Koren, accusing him of meddling in his affairs, but Von Koren maneuvers a criticism Laevsky makes of their mutual friend, Dr. Samoylenko, into a challenge to a duel. Utterly discombobulated and honor bound, Laevsky agrees to this absurdity -- a duel it shall be! A duel as comically inadvertent as it is inevitable.", "genres": ["Drama"], "imdb": {"id": 1282041, "rating": 6.2, "votes": 384}, "languages": ["English", "Spanish"], "lastupdated": "2015-09-06 00:14:48.823000000", "metacritic": 75, "plot": "In ANTON CHEKHOV'S THE DUEL, escalating animosity between two men with opposing philosophies of life is played out against the backdrop of a decaying seaside resort along the Black Sea ...", "poster": "https://m.media-amazon.com/images/M/MV5BNTY1NzA0NjU3M15BMl5BanBnXkFtZTcwNTc3MDM2Mw@@._V1_SY1000_SX677_AL_.jpg", "released": 1272412800000, "runtime": 95, "title": "Anton Chekhov's The Duel", "tomatoes": {"critic": {"meter": 81, "numReviews": 37, "rating": 6.9}, "dvd": 1306195200000, "fresh": 30, "lastUpdated": 1441995140000, "production": "Independent Pictures", "rotten": 7, "viewer": {"meter": 66, "numReviews": 309, "rating": 3.5}, "website": "http://www.filmforum.org/films/duel.html"}, "type": "movie", "writers": ["Mary Bing", "Anton Chekhov (novel)"], "year": 2010}