{"_id": "573a1398f29313caabceb878", "awards": {"nominations": 1, "text": "2 wins & 1 nomination.", "wins": 2}, "cast": ["Erika Alexander", "Maurice Bènichou", "Amba Bihler", "Lou Bihler"], "countries": ["Belgium", "Australia", "USA", "Sweden", "Portugal", "Norway", "Netherlands", "Japan", "Ireland", "Iceland", "Finland", "Denmark", "UK", "France"], "fullplot": "In ancient India the five Pandava brothers, Yudhishthira, Bhima, Arjuna, Nakula and Sahadeva, are cousins of the sons of king Dhritharashtra, known as the Kaurava. The five are the sons of the wives of king Pandu, who seceded in favor of his blind brother after he was cursed. The men are raised together, but from the beginning there are difficulties. They are prone to fight and when Arjuna becomes a great archer, the Kaurava are both jealous and afraid. Is it the kingdom the Pandava are after? Yudhishthira, the eldest of the Pandava, strives after it as he is told by the deity Krishna that he will become king. The hatred and jealousy of the Kaurava grows even stronger when the Pandava turn a barren wasteland Dhritharashtra gave them into a great court. This can't go on forever. Inevitably a war will follow, a war that will shake the foundations of the Earth.", "genres": ["Drama", "War"], "imdb": {"id": 97810, "rating": 7.9, "votes": 803}, "languages": ["English"], "lastupdated": "2015-07-22 00:39:23.813000000", "plot": "Jealousy and hatred is what separates the Pandava and Kaurava. The Kaurava fear the Pandava are after the throne of their father. Yudhishthira of the Pandava gets told by the deity Krishna that he will become king. A war is inevitable.", "poster": "https://m.media-amazon.com/images/M/MV5BMTcwMzg5MjExMl5BMl5BanBnXkFtZTcwODA0ODMyMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 635040000000, "runtime": 318, "title": "The Mahabharata", "tomatoes": {"dvd": 1038268800000, "lastUpdated": 1438972760000, "viewer": {"meter": 85, "numReviews": 767, "rating": 4}}, "type": "movie", "year": 1989}