{"_id": "573a139af29313caabcf08f5", "awards": {"nominations": 21, "text": "Nominated for 1 Oscar. Another 11 wins & 21 nominations.", "wins": 12}, "cast": ["John Travolta", "Nicolas Cage", "Joan Allen", "Alessandro Nivola"], "countries": ["USA"], "directors": ["John Woo"], "fullplot": "Sean Archer, a very tough, rugged FBI Agent. Who is still grieving for his dead son Michael. Archer believes that his son's killer is his sworn enemy, a very powerful criminal, Castor Troy. One day, Archer has finally cornered Castor, however, their fight has knocked out Troy cold. As Archer finally breathes easy over the capture of his enemy, he finds out that Troy has planted a bomb that will destroy the entire city of Los Angeles and all of its inhabitants. Unfortunately the only other person who knows its location is Castor's brother Pollux, and he refuses to talk. The solution, a special operation doctor that can cut off people's faces, and can place a person's face onto another person. Archer undergoes one of those surgeries to talk to Pollux. However, Castor Troy somehow regains consciousness and now wants revenge on Archer for taking his face. Not only is Troy ruining Archer's mission, but his personal life as well. Archer must stop Troy again. This time, it's personal.", "genres": ["Action", "Crime", "Sci-Fi"], "imdb": {"id": 119094, "rating": 7.3, "votes": 263648}, "languages": ["English", "Latin"], "lastupdated": "2015-09-01 00:13:25.520000000", "metacritic": 82, "num_mflix_comments": 2, "plot": "To foil an extortion plot, an FBI agent undergoes a face-transplant surgery and assumes the identity of a ruthless terrorist. But the plan backfires when the same criminal impersonates the cop with the same method.", "poster": "https://m.media-amazon.com/images/M/MV5BYzFjNzIxMmEtMzY5NS00YTgzLTkwYWEtN2FjMmY0NmNkZWY3XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 867369600000, "runtime": 138, "title": "Face/Off", "tomatoes": {"consensus": "John Travolta and Nicolas Cage play cat-and-mouse (and literally play each other) against a beautifully stylized backdrop of typically elegant, over-the-top John Woo violence.", "critic": {"meter": 92, "numReviews": 83, "rating": 7.9}, "dvd": 907632000000, "fresh": 76, "lastUpdated": 1442078947000, "production": "Paramount Pictures", "rotten": 7, "viewer": {"meter": 83, "numReviews": 448873, "rating": 3.5}}, "type": "movie", "writers": ["Mike Werb", "Michael Colleary"], "year": 1997}