{"_id": "573a13c9f29313caabd7a7d7", "awards": {"nominations": 4, "text": "2 wins & 4 nominations.", "wins": 2}, "cast": ["Lauren German", "Michael Biehn", "Milo Ventimiglia", "Courtney B. Vance"], "countries": ["Germany", "USA", "Canada", "France"], "directors": ["Xavier Gens"], "fullplot": "After a nuclear attack, seven dwellers of an apartment building seek refugee in a bunker in the basement of the building where the super, Mickey, lives. He rations water and supplies among the group formed by Eva and her boyfriend Sam; the gays Bobby and Josh and his brother Adrien; Marilyn and her daughter Wendi; and Delvin. When five invaders break into their shelter wearing protective clothing and breathing apparatuses, they abduct Wendi but the survivors succeed in killing two of the men. Josh wears the only clothing that was not damaged and discovers a strange research center where he finds Wendi contained in some kind of stasis device along with other children apparently collected by the unknown men in suits. He is discovered and ends up shoots at three men and returns to the shelter. Soon the group learns that the invaders have welded their access door from outside and they are trapped inside the bunker. Marilyn and Sam get crazy and the tense situation and the lack of water and food brings friction among Mickey, Delvin, Bobby and Josh. When Delvin finds a panic room hidden in Mickey's room, they fight and Delvin is killed. Bobby and Josh subdue and torture Mickey to get the combination of the room and they discover that the place is a store of supplies. Now the two perverts control the situation and submit the other survivors to sick games and humiliations.", "genres": ["Drama", "Sci-Fi", "Thriller"], "imdb": {"id": 1535616, "rating": 5.8, "votes": 28958}, "languages": ["English"], "lastupdated": "2015-09-16 12:00:43.900000000", "metacritic": 28, "num_mflix_comments": 2, "plot": "Survivors of a nuclear attack are grouped together for days in the basement of their apartment building, where fear and dwindling supplies wear away at their dynamic.", "poster": "https://m.media-amazon.com/images/M/MV5BMjMwNjcxODY5OV5BMl5BanBnXkFtZTcwMDA1OTg4Ng@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1334880000000, "runtime": 112, "title": "The Divide", "tomatoes": {"boxOffice": "$18.0k", "critic": {"meter": 25, "numReviews": 53, "rating": 4}, "dvd": 1334620800000, "fresh": 13, "lastUpdated": 1442340761000, "production": "Anchor Bay Entertainment", "rotten": 40, "viewer": {"meter": 37, "numReviews": 6068, "rating": 2.8}, "website": "http://www.thedividethemovie.com/"}, "type": "movie", "writers": ["Karl Mueller", "Eron Sheean"], "year": 2011}