{"_id": "573a1393f29313caabcde2d7", "awards": {"nominations": 2, "text": "Nominated for 1 Oscar. Another 2 wins & 2 nominations.", "wins": 3}, "cast": ["Ronald Reagan", "Patricia Neal", "Richard Todd", "Anthony Nicholls"], "countries": ["USA"], "directors": ["Vincent Sherman"], "fullplot": "It's 1945, Burma, the day the war is over! For many this means they've survived and will be going home. But not for everyone. A Scottish soldier, Corporal Lachlan \"Lachie\" MacLachlan is the victim of a wound to the lower back on this day. He's moved to a M.A.S.H. unit and undergoes surgery. As time goes by he begins to recover and watches, in dismay as soldiers pack up and head for home. The doctors have told him he needs to remain \"for observation\". The Colonel takes Sister Parker, the unit head nurse, into his confidence and tells her that the real reason Cpl. MacLachlan can't go home is because the wound he sustained destroyed one of his kidneys and the other one is defective and will shut down in three to four weeks. He asks her to put Lachlan up with some other soldiers she has waiting to go home so that he can spend his last days with friends. But Cpl. MacLachlan wants nothing to do with friends and prefers his own privacy to \"idle chat\". He's a hard nut to crack and their work is cut out for them to make him as comfortable as possible.", "genres": ["Drama", "War"], "imdb": {"id": 41445, "rating": 7.5, "votes": 784}, "languages": ["English"], "lastupdated": "2015-08-05 00:00:55.273000000", "num_mflix_comments": 1, "plot": "It's 1945, Burma, the day the war is over! For many this means they've survived and will be going home. But not for everyone. A Scottish soldier, Corporal Lachlan \"Lachie\" MacLachlan is the...", "poster": "https://m.media-amazon.com/images/M/MV5BMmNmNmI0YTQtZTMwYy00ZWE2LTgwOTEtZmQ4ZjFiZjFlYzc2L2ltYWdlXkEyXkFqcGdeQXVyMjU4NzU2OTA@._V1_SY1000_SX677_AL_.jpg", "rated": "APPROVED", "released": -633744000000, "runtime": 102, "title": "The Hasty Heart", "tomatoes": {"dvd": 1155600000000, "lastUpdated": 1441995465000, "production": "Warner Home Video", "viewer": {"meter": 70, "numReviews": 164, "rating": 3.8}}, "type": "movie", "writers": ["Ranald MacDougall (screenplay)", "John Patrick (play)"], "year": 1949}