{"_id": "573a13c2f29313caabd67e48", "awards": {"nominations": 2, "text": "2 nominations.", "wins": 0}, "cast": ["Dwayne Johnson", "Ian McShane", "John Hurt", "Rufus Sewell"], "countries": ["USA"], "directors": ["Brett Ratner"], "fullplot": "Fourteen hundred years BCE, a tormented soul walked the earth that was neither man nor god. Hercules was the powerful son of the god king Zeus, for this he received nothing but suffering his entire life. After twelve arduous labours and the loss of his family, this dark, world-weary soul turned his back on the gods finding his only solace in bloody battle. Over the years he warmed to the company of six similar souls, their only bond being their love of fighting and presence of death. These men and women never question where they go to fight or why or whom, just how much they will be paid. Now the King of Thrace has hired these mercenaries to train his men to become the greatest army of all time. It is time for this bunch of lost souls to finally have their eyes opened to how far they have fallen when they must train an army to become as ruthless and blood thirsty as their reputation has become.", "genres": ["Action", "Adventure"], "imdb": {"id": 1267297, "rating": 6.1, "votes": 99772}, "languages": ["English"], "lastupdated": "2015-08-24 00:30:32.057000000", "metacritic": 47, "num_mflix_comments": 2, "plot": "Having endured his legendary twelve labors, Hercules, the Greek demigod, has his life as a sword-for-hire tested when the King of Thrace and his daughter seek his aid in defeating a tyrannical warlord.", "poster": "https://m.media-amazon.com/images/M/MV5BMTQ4ODA5MTA4OF5BMl5BanBnXkFtZTgwNjMyODM5MTE@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1406246400000, "runtime": 98, "title": "Hercules", "tomatoes": {"boxOffice": "$72.7M", "consensus": "Hercules has Brett Ratner behind the cameras and Dwayne Johnson rocking the loincloth -- and delivers exactly what any reasonable person reading that description might expect.", "critic": {"meter": 60, "numReviews": 104, "rating": 5.4}, "dvd": 1415059200000, "fresh": 62, "lastUpdated": 1441217350000, "production": "Paramount Pictures", "rotten": 42, "viewer": {"meter": 49, "numReviews": 102076, "rating": 3.3}, "website": "http://www.mightyhercules.com/"}, "type": "movie", "writers": ["Ryan Condal (screenplay)", "Evan Spiliotopoulos (screenplay)", "Steve Moore (Radical comic \"Hercules\")"], "year": 2014}