{"_id": "573a13daf29313caabdaba15", "awards": {"nominations": 4, "text": "3 wins & 4 nominations.", "wins": 3}, "cast": ["Ayako Fujitani", "Pepe Serna", "Kazuki Kitamura", "Yasuyo Shiba"], "countries": ["USA"], "directors": ["Dave Boyle"], "fullplot": "In a small town south of San Francisco, Sheriff Paul Del Moral (Pepe Serna) is driving home through the fog when he accidentally strikes a pedestrian, a lone Japanese man. However, before an investigation can take place the man disappears from the hospital without a trace. At the same time, Japanese mystery author Aki Akahori (Ayako Fujitani) takes a trip to San Francisco in order to escape the press tour for her latest book--a potboiler in her world famous \"Inspector Takabe\" series. Feeling lonely and vulnerable, she begins a romantic affair with a mysterious Japanese traveler from Reno (Kazuki Kitamura). Her new lover is charismatic and charming but abruptly disappears from the hotel, leaving behind his suitcase and a trail of questions...", "genres": ["Crime", "Drama", "Mystery"], "imdb": {"id": 2287170, "rating": 7.1, "votes": 340}, "languages": ["English", "Japanese"], "lastupdated": "2015-08-31 00:01:58.233000000", "metacritic": 69, "num_mflix_comments": 1, "plot": "A mystery outside of San Francisco brings together small-town sheriff Paul Del Moral, Japanese author Aki Akahori, and a traveler from Reno who soon disappears, leaving behind his suitcase and a trail of questions.", "poster": "https://m.media-amazon.com/images/M/MV5BMjE5NDA2NDg1N15BMl5BanBnXkFtZTgwNjM1NDQ1MzE@._V1_SY1000_SX677_AL_.jpg", "released": 1427414400000, "runtime": 111, "title": "Man from Reno", "tomatoes": {"boxOffice": "$92.9k", "consensus": "Man from Reno rises on the strength of solid performances and a sharp script, adding up to a densely plotted neo-noir with some subtle twists.", "critic": {"meter": 94, "numReviews": 31, "rating": 7.1}, "fresh": 29, "lastUpdated": 1441309847000, "production": "First Pond Entertainment", "rotten": 2, "viewer": {"meter": 87, "numReviews": 472, "rating": 4.2}, "website": "http://www.manfromrenomovie.com/"}, "type": "movie", "writers": ["Dave Boyle", "Joel Clark", "Michael Lerman"], "year": 2014}