{"_id": "573a13b1f29313caabd36cf1", "awards": {"nominations": 2, "text": "2 nominations.", "wins": 0}, "cast": ["Akshay Kumar", "Sunil Shetty", "Paresh Rawal", "Bipasha Basu"], "countries": ["India"], "directors": ["Neeraj Vora"], "fullplot": "Using their wits, Ganpatrao \"Babubhai\" Apte, Ghanshyam \"Shyam\", and Raju find themselves wealthy beyond their imagination. They each have a car, a palatial house with a huge swimming pool, that Babubhai is yet to familiarize himself with, and a very easy life. Then Raju finds out that he can double his wealth in 21 days, and meets with an attractive young woman named Anuradha from an agency in Bombay's business district. She informs him that the minimum investment is one Crore, and Raju quickly agrees to invest this money. He dupes another man by the name of Pappu into parting with 50 Lakhs, and the rest of the money comes through by getting Shyam and Babu to sign away their respective investments. After 21 days when the trio go to collect their doubled wealth, they find that Anuradha and her company have disappeared. Devastated, they move out of their bungalow and are now living in a shanty room in a Chawl when they get a visit from Pappu, who wants his money back, as he owes this money to Tiwari, an underworld Don. The trio decide to meet with Tiwari and plead with him, but all in vain, then they decide to stage a robbery, however, that does not go well either. It is then they find out that a rich Parsi man owns an antique gun collection that is worth more than their loss. They plan to steal these guns, and make a deal with Tiwari, however, once again Murphy's Law prevails and the hapless trio find themselves on the run from a multitude of gangsters and killers - including a man who can bite through steel and a faceless 8 foot monster - who will not stop at anything to get their hands on the guns.", "genres": ["Comedy", "Crime"], "imdb": {"id": 419058, "rating": 6, "votes": 4845}, "languages": ["Hindi"], "lastupdated": "2015-08-11 00:15:00.733000000", "num_mflix_comments": 3, "plot": "Babu Rao, Raju and Shyam, are living happily after having risen from rags to riches. Still, money brings the joy of riches and with it the greed to make more money - and so, with a don as an unknowing investor, Raju initiates a new game.", "released": 1149811200000, "runtime": 153, "title": "Phir Hera Pheri", "tomatoes": {"dvd": 1159228800000, "lastUpdated": 1440442439000, "production": "Tip Top Entertainment", "viewer": {"meter": 67, "numReviews": 1946, "rating": 3.6}, "website": "http://203.199.103.166/index1.htm"}, "type": "movie", "writers": ["Neeraj Vora"], "year": 2006}