{"_id": "573a13e6f29313caabdc5c19", "awards": {"nominations": 2, "text": "2 nominations.", "wins": 0}, "cast": ["Andy Garcia", "Mandy Moore", "Cheri Oteri", "Riley Smith"], "countries": ["USA"], "directors": ["John Kent Harrison"], "fullplot": "To the folks in Conway, South Carolina, Duncan Mayor is a very cranky guy. To \"my sweet girl\" - his wife, Suzy - he's a doting pussycat. But Suzy is just home from the hospital and cared for 24/7 by nurse Natalie, whom Duncan tries his best to ignore. Duncan decides the best medicine Suzy could possibly have - and a Christmas present she'll never forget -- is a ride on a real Ferris wheel, set up in their own back yard. Why a Ferris wheel? Because it was while riding one many moons ago that Duncan asked Suzy to marry him. Where to find a 45-foot-high used Ferris wheel? Duncan strikes gold in an abandoned amusement park, presided over by a lonely ex-carnival worker -- Henry. Assembling the mechanical monstrosity is not exactly a one-man job. Duncan gets a crucial assist from Tommy, a former student of Suzy's, who is deeply in her debt. He's become a successful landscape designer after a troubled youth; it was Suzy who set him straight. Meanwhile, the neighbors are not amused; especially prim and proper Gayle Matthews. She's entered her garden in an upscale magazine's \"Christmas Showcase\" contest. The interest of the contest's judges witnessing the atrocity next door is more than Gayle can bear. Fortunately, her brother is the local sheriff - and there are zoning laws to prevent this kind of thing, aren't there?", "genres": ["Drama", "Romance"], "imdb": {"id": 3072182, "rating": 7, "votes": 690}, "languages": ["English"], "lastupdated": "2015-09-14 05:38:00.073000000", "plot": "To the folks in Conway, South Carolina, Duncan Mayor is a very cranky guy. To \"my sweet girl\" - his wife, Suzy - he's a doting pussycat. But Suzy is just home from the hospital and cared ...", "poster": "https://m.media-amazon.com/images/M/MV5BNGU0YjkzZGUtYjI2Ni00ZGFiLTk1ZjYtMzQ5OTQyODM1YmRkL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNjg5MzE4NTA@._V1_SY1000_SX677_AL_.jpg", "rated": "TV-PG", "released": 1385856000000, "runtime": 96, "title": "Christmas in Conway", "tomatoes": {"lastUpdated": 1441911914000, "production": "Hallmark Hall of Fame Productions, Inc.", "viewer": {"meter": 50, "numReviews": 38, "rating": 3.4}}, "type": "movie", "writers": ["Stephen P. Lindsey", "Luis Ugaz"], "year": 2013}