{"_id": "573a13aff29313caabd2f91d", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Richard Gere", "Juliette Binoche", "Flora Cross", "Max Minghella"], "countries": ["USA", "Germany"], "directors": ["Scott McGehee", "David Siegel"], "fullplot": "Living in Oakland, California, the Naumanns are outwardly a loving, supportive family. Husband and father Saul Naumann is a Religious Studies professor, and looks to his religious training in Judaism as tenets for his family to live. He has high expectations for all members of his family. His mid-teen son, Aaron Naumann, idolizes his father, and does whatever he can to please him. His pre-teen daughter, Eliza Naumann, often feels the neglected child. So when Saul eventually learns that Eliza is participating and excelling in spelling bees, she becomes the focus of his life as he believes that letters in the form of words will lead to answers to the universe. That change in focus to Eliza makes Aaron now feel the neglected one, he who strikes out quietly in his own way with the help of Chali, a young woman he meets. But the person who has felt the most pressure within Saul's way of life is his wife, Miriam Naumann, a microbiologist. She converted from Catholicism to Judaism when she and Saul married. But as Saul espouses the concept of tikkun olam, bringing together the shards of the world to make it whole, it affects Miriam negatively in trying to cope with an incident from her childhood. Through it all, Eliza may understand her father's way of life the best, and use it in a way unexpected to bring the family back together.", "genres": ["Drama"], "imdb": {"id": 387059, "rating": 5.5, "votes": 5855}, "languages": ["English", "Hebrew"], "lastupdated": "2015-08-16 00:06:06.963000000", "metacritic": 54, "plot": "A wife and mother begins a downward emotional spiral, as her husband avoids their collapsing marriage by immersing himself in his 11 year-old daughter's quest to become a spelling bee champion.", "poster": "https://m.media-amazon.com/images/M/MV5BMTIxODcyMjI2MV5BMl5BanBnXkFtZTcwMjY0MjEzMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1132704000000, "runtime": 104, "title": "Bee Season", "type": "movie", "writers": ["Myla Goldberg (novel)", "Naomi Foner (screenplay)"], "year": 2005}