{"_id": "573a13e7f29313caabdc73d0", "awards": {"nominations": 3, "text": "3 nominations.", "wins": 0}, "cast": ["Christina Ricci", "Clea DuVall", "Gregg Henry", "Stephen McHattie"], "countries": ["USA"], "directors": ["Nick Gomez"], "fullplot": "On a scorching, hot summer day in 1892 in Fall River, Massachusetts, Lizzie Borden returns home to the house she shares with her father Andrew, stepmother Abby and sister Emma. But, unlike any normal day, Lizzie encounters the bloody scene of her parents violently murdered. Police quickly question multiple suspects in town, but evidence keeps pointing back to the Borden's youngest daughter Lizzie, the seemingly wholesome Sunday school teacher, as the prime suspect. Lizzie's lawyer, Andrew Jennings, proclaims her innocence arguing that it is inconceivable a woman could commit the heinous crime of brutally murdering her family with an ax. Or is it? Lizzie is put on trial for the murders, both in the courtroom and in the press, sparking a widespread debate about her culpability. As the case rages on, the courtroom proceedings fuel an enormous amount of sensationalized stories and headlines in newspapers throughout the country, forever leaving Lizzie Borden's name in infamy.", "genres": ["Crime", "Drama", "Mystery"], "imdb": {"id": 3118958, "rating": 5.7, "votes": 2988}, "languages": ["English"], "lastupdated": "2015-09-06 00:17:18.493000000", "num_mflix_comments": 1, "plot": "The true story of Lizzie Borden, a young woman tried and acquitted in the 1892 murders of her father and stepmother.", "poster": "https://m.media-amazon.com/images/M/MV5BMTk0NTYyNTk2M15BMl5BanBnXkFtZTgwNTg4ODEwMTE@._V1_SY1000_SX677_AL_.jpg", "rated": "TV-14", "released": 1390608000000, "runtime": 91, "title": "Lizzie Borden Took an Ax", "tomatoes": {"critic": {"meter": 43, "numReviews": 14, "rating": 5.6}, "dvd": 1396915200000, "fresh": 6, "lastUpdated": 1439665929000, "production": "Sony Pictures Entertainment", "rotten": 8, "viewer": {"meter": 34, "numReviews": 330, "rating": 2.9}}, "type": "movie", "writers": ["Stephen Kay"], "year": 2014}