{"_id": "573a13aef29313caabd2d803", "awards": {"nominations": 7, "text": "13 wins & 7 nominations.", "wins": 13}, "cast": ["Anders W. Berthelsen", "Sèren Pilmark", "Nastja Arcel", "Nicolas Bro"], "countries": ["Sweden", "Denmark"], "directors": ["Nikolaj Arcel"], "fullplot": "Three weeks before general elections, the leader of one of the country's largest parties, the Center Party, is involved in a severe car accident. The political scene is thrown into disarray. At the same time, young, ambitious journalist, Ulrik Torp, is given the opportunity of a life time and made Dagbladet's correspondent in Parliament. Before long, Ulrik gets caught up in a ruthless struggle for power headed by the party's two successors to the leadership, chairman Erik Dreier and spokesman Lone Kjeldsen. Ulrik barely geets to dip his toes in the water, before all hell breaks loose. Speculation in the press and calculated lies fuel the controversy at great personal cost to many of the people involved. Ulrik slowly uncovers a cynical plot that involves the country's incumbent Prime Minister. He becomes obsessed with learning the truth. But no one will listen to him, be it politicians or colleagues in the press corps, and as election day draws near, Ulrik has to face the power elite on his own.", "genres": ["Thriller"], "imdb": {"id": 378215, "rating": 7.4, "votes": 3411}, "languages": ["Danish"], "lastupdated": "2015-08-24 00:08:10.557000000", "num_mflix_comments": 3, "plot": "Three weeks before general elections, the leader of one of the country's largest parties, the Center Party, is involved in a severe car accident. The political scene is thrown into disarray...", "poster": "https://m.media-amazon.com/images/M/MV5BMjEyNDkxMTI5MV5BMl5BanBnXkFtZTcwNTkxOTI0MQ@@._V1_SY1000_SX677_AL_.jpg", "released": 1096588800000, "runtime": 107, "title": "King's Game", "type": "movie", "writers": ["Nikolaj Arcel (screenplay)", "Rasmus Heisterberg (screenplay)", "Niels Krause-Kjèr (novel)"], "year": 2004}