{"_id": "573a13daf29313caabdac23e", "awards": {"nominations": 53, "text": "Won 2 Oscars. Another 76 wins & 53 nominations.", "wins": 78}, "cast": ["Kristen Bell", "Idina Menzel", "Jonathan Groff", "Josh Gad"], "countries": ["USA"], "directors": ["Chris Buck", "Jennifer Lee"], "fullplot": "Anna, a fearless optimist, sets off on an epic journey - teaming up with rugged mountain man Kristoff and his loyal reindeer Sven - to find her sister Elsa, whose icy powers have trapped the kingdom of Arendelle in eternal winter. Encountering Everest-like conditions, mystical trolls and a hilarious snowman named Olaf, Anna and Kristoff battle the elements in a race to save the kingdom. From the outside Anna's sister, Elsa looks poised, regal and reserved, but in reality, she lives in fear as she wrestles with a mighty secret-she was born with the power to create ice and snow. It's a beautiful ability, but also extremely dangerous. Haunted by the moment her magic nearly killed her younger sister Anna, Elsa has isolated herself, spending every waking minute trying to suppress her growing powers. Her mounting emotions trigger the magic, accidentally setting off an eternal winter that she can't stop. She fears she's becoming a monster and that no one, not even her sister, can help her.", "genres": ["Animation", "Adventure", "Comedy"], "imdb": {"id": 2294629, "rating": 7.6, "votes": 367582}, "languages": ["English", "Icelandic"], "lastupdated": "2015-09-10 17:03:19.203000000", "metacritic": 74, "num_mflix_comments": 1, "plot": "When the newly crowned Queen Elsa accidentally uses her power to turn things into ice to curse her home in infinite winter, her sister, Anna, teams up with a mountain man, his playful reindeer, and a snowman to change the weather condition.", "poster": "https://m.media-amazon.com/images/M/MV5BMTQ1MjQwMTE5OF5BMl5BanBnXkFtZTgwNjk3MTcyMDE@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 1385510400000, "runtime": 102, "title": "Frozen", "tomatoes": {"boxOffice": "$400.7M", "consensus": "Beautifully animated, smartly written, and stocked with singalong songs, Frozen adds another worthy entry to the Disney canon.", "critic": {"meter": 89, "numReviews": 216, "rating": 7.7}, "dvd": 1395100800000, "fresh": 192, "lastUpdated": 1440093645000, "production": "Walt Disney Pictures", "rotten": 24, "viewer": {"meter": 86, "numReviews": 299829, "rating": 4.3}, "website": "http://www.disney.com/frozen"}, "type": "movie", "writers": ["Jennifer Lee (screenplay)", "Hans Christian Andersen (inspired by the story \"The Snow Queen\" by)", "Chris Buck (story)", "Jennifer Lee (story)", "Shane Morris (story)", "Dean Wellins (additional story)"], "year": 2013}