{"_id": "573a1393f29313caabcdca27", "awards": {"nominations": 2, "text": "Won 1 Oscar. Another 1 win & 2 nominations.", "wins": 2}, "cast": ["Bette Davis", "Paul Henreid", "Claude Rains", "Gladys Cooper"], "countries": ["USA"], "directors": ["Irving Rapper"], "fullplot": "In Boston, the over-weight spinster Charlotte Vale is a repressed woman without self-esteem and completely dominated by her wealthy mother Mrs. Henry Vale. When her sister-in-law Lisa Vale brings the renowned psychiatrist Dr. Jaquith, who is her friend, to visit Charlotte, he invites her to spend some time in his sanatorium. Soon Charlotte transforms in a sophisticated and confident woman and travels in a cruise to South America. She meets architect Jerry Durrance, who is married, and they have a love affair in Rio de Janeiro. Six months later, she returns home and confronts her mother with her independence and own free will. One day, Charlotte has an argument with her mother and she dies of a heart attack. Charlotte becomes the heir of the Vale's fortune but she feels guilty for the death of her mother. She decides to return to Dr. Jaquith's sanatorium whether she befriends Tina, who is the twelve-year-old daughter of Jerry rejected by her mother. She brings the girl to her house in Boston and one day, Jerry visits Tina and Charlotte with Dr. Jaquith.", "genres": ["Drama", "Romance"], "imdb": {"id": 35140, "rating": 8.1, "votes": 10494}, "languages": ["English", "Portuguese"], "lastupdated": "2015-09-10 17:58:03.280000000", "plot": "Boston spinster blossoms under therapy and finds impossible romance.", "poster": "https://m.media-amazon.com/images/M/MV5BZDQ2YWUxOTctYWNjMi00NzE3LTg4MjUtMzUyNzA0OTJjZjNjXkEyXkFqcGdeQXVyMTAwMzUyOTc@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": -857433600000, "runtime": 117, "title": "Now, Voyager", "tomatoes": {"critic": {"meter": 91, "numReviews": 22, "rating": 8.1}, "dvd": 1005609600000, "fresh": 20, "lastUpdated": 1440096828000, "production": "MGM Home Entertainment", "rotten": 2, "viewer": {"meter": 90, "numReviews": 7297, "rating": 4.1}}, "type": "movie", "writers": ["Casey Robinson (screenplay)", "Olive Higgins Prouty (from the novel by)"], "year": 1942}