{"_id": "573a13dbf29313caabdb0040", "awards": {"nominations": 1, "text": "9 wins & 1 nomination.", "wins": 9}, "cast": ["Sasha Andreev", "Cindy Bitney", "Thomas Bridegroom", "David Crone"], "countries": ["USA"], "directors": ["Linda Bloodworth-Thomason"], "fullplot": "BRIDEGROOM tells the emotional journey of Shane and Tom, two young men in a loving and committed relationship - a relationship that was cut tragically short by a misstep off the side of a roof. The story of what happened after this accidental death - of how people without the legal protections of marriage can find themselves completely shut out and ostracized - is poignant, enraging and opens a window onto the issue of marriage equality like no speech or lecture ever will. On May 7, 2012, the anniversary of Tom's death, after a year of documenting his own grief, Shane decided to make a video tribute to his partner entitled \"It Could Happen To You.\" This film, posted on YouTube, received over 3.2 million hits and inspired over 50 thousand e-mails and comments on YouTube and Facebook. The impact of Shane's original film and the raw nerve it touched, tells us this is an important story that needs to be brought to the world stage.", "genres": ["Documentary"], "imdb": {"id": 2357788, "rating": 8.1, "votes": 2746}, "languages": ["English"], "lastupdated": "2015-08-28 00:07:18.923000000", "metacritic": 85, "plot": "Shane Bitney Crone's plans to marry Tom Bridegroom in California after the same-sex marriage law is passed takes a tragic turn when his partner of six years accidentally dies and Tom's family refuses Shane from attending the funeral.", "poster": "https://m.media-amazon.com/images/M/MV5BMTQyNzQ2NjI0N15BMl5BanBnXkFtZTgwNTc5NjA0MDE@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1384819200000, "title": "Bridegroom", "tomatoes": {"critic": {"meter": 82, "numReviews": 11, "rating": 5.2}, "dvd": 1384819200000, "fresh": 9, "lastUpdated": 1440267956000, "production": "Virgil Films", "rotten": 2, "viewer": {"meter": 86, "numReviews": 775, "rating": 4.3}, "website": "http://bridegroommovie.com/"}, "type": "movie", "year": 2013}