{"_id": "573a13b1f29313caabd35ea2", "awards": {"nominations": 0, "text": "4 wins.", "wins": 4}, "cast": ["Tzi Ma", "Jacqueline Kim", "Elaine Kao", "Freda Foh Shen"], "countries": ["USA"], "directors": ["Georgia Lee"], "fullplot": "Red Doors tells the story of the Wongs, a bizarrely dysfunctional Chinese-American family living in the New York suburbs. Ed Wong has just retired and plots to escape his mundane life. However, the tumultuous, madcap lives of his three rebellious daughters change his plans. The eldest daughter, Samantha, is an ambitious businesswoman in Manhattan who suddenly gets cold feet about her upcoming marriage when she runs into an old high school flame. Julie, the shy middle sister, finds her life as a studious medical student turned upside down when she falls for a movie starlet visiting the hospital. Katie, the youngest sister, is a disaffected high school senior who engages in a continually escalating and dangerous prank war with her longtime neighbor and nemesis, Simon. Ultimately, Ed's disappearance compels each daughter to examine her own understanding of the role and connection she has to the family. At the same time, the Wongs learn to live their own lives outside the invisible fences of their home.", "genres": ["Drama"], "imdb": {"id": 415234, "rating": 6.5, "votes": 881}, "languages": ["English"], "lastupdated": "2015-07-22 00:56:15.830000000", "metacritic": 60, "num_mflix_comments": 2, "plot": "The Wongs struggle to cope with life, love, and family dysfunction in the suburbs of New York.", "poster": "https://m.media-amazon.com/images/M/MV5BMTUwOTEyNDQzM15BMl5BanBnXkFtZTcwMTc1MTMzMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1157673600000, "runtime": 90, "title": "Red Doors", "tomatoes": {"critic": {"meter": 59, "numReviews": 22, "rating": 6}, "dvd": 1170115200000, "fresh": 13, "lastUpdated": 1438544435000, "production": "Polychrome Pictures", "rotten": 9, "viewer": {"meter": 71, "numReviews": 1596, "rating": 3.6}, "website": "http://www.reddoorsthemovie.com"}, "type": "movie", "writers": ["Georgia Lee"], "year": 2005}