{"_id": "573a1396f29313caabce40e4", "awards": {"nominations": 19, "text": "Won 1 Oscar. Another 20 wins & 19 nominations.", "wins": 21}, "cast": ["Donald Sutherland", "Elliott Gould", "Tom Skerritt", "Sally Kellerman"], "countries": ["USA"], "directors": ["Robert Altman"], "fullplot": "The personnel at the 4077 MASH unit deal with the horrors of the Korean War and the stresses faced in surgery by whatever means. The tone at the MASH is established by recent arrivals, surgeons Captains 'Hawkeye' Pierce, 'Duke' Forrest, and 'Trapper' John McIntyre - the latter who Hawkeye knows he's met somewhere, but Trapper who won't divulge where - whose antics can be best described as non-regulation, and in the negative words of one of their fellow MASH-ers: unmilitary. The unit's commanding officer, Colonel Henry Blake, doesn't care about this behavior as long as it doesn't affect him, and as long as they do their job and do it well, which they do. Their behavior does extremely bother fellow surgeon, Major Frank Burns, and recently arrived head nurse, Major Margaret Houlihan, who obtains the nickname 'Hot Lips' based on information they glean about her through underhanded means. Beyond their battles with Frank and Hot Lips, Hawkeye, Duke and/or Trapper help unit dentist Painless with a personal crisis, try to figure out if Hot Lips is a true blond, travel to Japan for a work and what they hope is a recreational trip, and hope to win big on a football bet against another unit in which they on the surface are the underdogs.", "genres": ["Comedy", "War", "Drama"], "imdb": {"id": 66026, "rating": 7.7, "votes": 52071}, "languages": ["English", "Japanese", "Korean"], "lastupdated": "2015-08-20 00:59:10.610000000", "metacritic": 79, "num_mflix_comments": 2, "plot": "The staff of a Korean War field hospital use humor and hijinks to keep their sanity in the face of the horror of war.", "poster": "https://m.media-amazon.com/images/M/MV5BMTc4NjE4MzI0N15BMl5BanBnXkFtZTgwMzIwMTM0MDE@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 5097600000, "runtime": 116, "title": "MASH", "tomatoes": {"consensus": "Bold, timely, subversive, and above all funny, M*A*S*H remains a high point in Robert Altman's distinguished filmography.", "critic": {"meter": 87, "numReviews": 45, "rating": 8.4}, "dvd": 1010448000000, "fresh": 39, "lastUpdated": 1440268346000, "production": "20th Century Fox", "rotten": 6, "viewer": {"meter": 84, "numReviews": 52642, "rating": 3.7}}, "type": "movie", "writers": ["Richard Hooker (from the novel by)", "Ring Lardner Jr. (screenplay)"], "year": 1970}