{"_id": "573a13d5f29313caabd9ab83", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Ingrid Bolsè Berdal", "Dimitri Diatchenko", "Olivia Taylor Dudley", "Devin Kelley"], "countries": ["USA"], "directors": ["Bradley Parker"], "fullplot": "Americans Chris, his girlfriend Natalie and their friend Amanda travel to Europe on vacation. They meet up with Chris' brother Paul living in Kiev, Ukraine. Chris wants to travel to Moscow to propose to Natalie, but Paul convinces the group to first visit Chernobyl with an extreme tourism guide. They meet the guide Uri and another couple who are also going on the tour. Uri explains that because of the radiation levels he can only take them to Pripyat, a deserted city very near Chernobyl. They travel by van, but are stopped by a military checkpoint that makes them turn back. Not giving up, Uri finds an alternative route to the town. The group spends the day taking photographs and exploring abandoned buildings. Uri becomes nervous and decides it's time to head home. However, the van won't start and they discover the engine was sabotaged. Soon they discover that they are stranded, no one knows they are there and that they are definitely not alone.", "genres": ["Horror", "Mystery", "Thriller"], "imdb": {"id": 1991245, "rating": 5, "votes": 49660}, "languages": ["English"], "lastupdated": "2015-09-13 00:34:28.350000000", "plot": "Six tourists hire an extreme tour guide who takes them to the abandoned city Pripyat, the former home to the workers of the Chernobyl nuclear reactor. During their exploration, they soon discover they are not alone.", "poster": "https://m.media-amazon.com/images/M/MV5BNzkwNDkyNTUxNV5BMl5BanBnXkFtZTcwODY1NTE3Nw@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1337904000000, "runtime": 86, "title": "Chernobyl Diaries", "tomatoes": {"lastUpdated": 1442340208000, "viewer": {"numReviews": 25, "rating": 3.8}}, "type": "movie", "writers": ["Oren Peli (screenplay)", "Carey Van Dyke (screenplay)", "Shane Van Dyke (screenplay)", "Oren Peli (story)"], "year": 2012}