{"_id": "573a13b1f29313caabd3635b", "awards": {"nominations": 6, "text": "3 wins & 6 nominations.", "wins": 3}, "cast": ["Anne Hathaway", "James McAvoy", "Julie Walters", "James Cromwell"], "countries": ["UK", "Ireland"], "directors": ["Julian Jarrold"], "fullplot": "The year is 1795 and young Jane Austen is a feisty 20-year-old and emerging writer who already sees a world beyond class and commerce, beyond pride and prejudice, and dreams of doing what was then nearly unthinkable - marrying for love. Naturally, her parents are searching for a wealthy, well-appointed husband to assure their daughter's future social standing. They are eyeing Mr. Wisley, nephew to the very formidable, not to mention very rich, local aristocrat Lady Gresham, as a prospective match. But when Jane meets the roguish and decidedly non-aristocratic Tom Lefroy, sparks soon fly along with the sharp repartee. His intellect and arrogance raise her ire - then knock her head over heels. Now, the couple, whose flirtation flies in the face of the sense and sensibility of the age, is faced with a terrible dilemma. If they attempt to marry, they will risk everything that matters - family, friends and fortune.", "genres": ["Biography", "Drama", "Romance"], "imdb": {"id": 416508, "rating": 7.1, "votes": 41563}, "languages": ["English"], "lastupdated": "2015-08-25 00:07:35.587000000", "metacritic": 55, "plot": "A biographical portrait of a pre-fame Jane Austen and her romance with a young Irishman.", "poster": "https://m.media-amazon.com/images/M/MV5BMTIzMjQyMDMxM15BMl5BanBnXkFtZTcwMjAwOTM1MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 1186704000000, "runtime": 120, "title": "Becoming Jane", "tomatoes": {"boxOffice": "$18.6M", "consensus": "Although Becoming Jane is a well-crafted period piece, it lacks fresh insight into the life and works of Jane Austen. The film focuses too much on wardrobe and not enough on Austen's achievements.", "critic": {"meter": 57, "numReviews": 136, "rating": 6}, "dvd": 1202774400000, "fresh": 78, "lastUpdated": 1442345349000, "production": "Miramax Films", "rotten": 58, "viewer": {"meter": 74, "numReviews": 135106, "rating": 3.7}, "website": "http://www.miramax.com/movie/becoming-jane"}, "type": "movie", "writers": ["Jane Austen (letters)", "Kevin Hood", "Sarah Williams"], "year": 2007}