{"_id": "573a13a8f29313caabd1e26d", "awards": {"nominations": 13, "text": "Nominated for 1 Oscar. Another 21 wins & 13 nominations.", "wins": 22}, "cast": ["Gael Garcèa Bernal", "Ana Claudia Talancèn", "Sancho Gracia", "Angèlica Aragèn"], "countries": ["Mexico", "Spain", "Argentina", "France"], "directors": ["Carlos Carrera"], "fullplot": "Recently ordained a priest, 24-year-old Father Amaro is sent to a small parish church in Los Reyes, Mexico to assist the aging Father Benito in his daily work. Benito--for years a fixture in the church as well as the community--welcomes Father Amaro into a new life of unseen challenges. Upon arriving in Los Reyes, the ambitious Father Amaro meets Amelia, a beautiful 16-year-old girl whose religious devotion soon becomes helplessly entangles in a growing attraction to the new priest. Amelia is quickly following into the footsteps of her mother, Sanjuanera, who has been engaged in a long-time affair with Father Benito. Amaro soon discovers that corruption and the Church are old acquaintances in Los Reyes. Father Benito has been receiving financial help from the region's drug lord for the construction of a new health clinic. As well, another priest in the diocese, Father Natalio, is suspected of assisting guerilla troops in the highlands. Maenwhile, Amelia and Father Amaro have fallen in love and have begun a passionate sexual relationship. As things become increasingly more complicated in the small community, the walls around Father Amaro begin to crumble. Torn between the divine and the carnal, the righteous and the unjust, Father Amaro must summon his strength to choose which life he will lead.", "genres": ["Drama", "Romance"], "imdb": {"id": 313196, "rating": 6.8, "votes": 10621}, "languages": ["Spanish"], "lastupdated": "2015-09-01 00:02:37.897000000", "metacritic": 60, "plot": "Politics and sexual passions threaten to corrupt a young, newly-ordained priest in a small Mexican town.", "poster": "https://m.media-amazon.com/images/M/MV5BOTNjN2FjNDktM2E0YS00NDU3LWFkYmEtZDAwNDc1MDUzMTBjXkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1039737600000, "runtime": 118, "title": "El crimen del padre Amaro", "tomatoes": {"boxOffice": "$5.4M", "consensus": "Though melodramatic, El Crimen del Padre Amaro's critique of the Catholic church is a timely one.", "critic": {"meter": 62, "numReviews": 82, "rating": 6.2}, "dvd": 1049155200000, "fresh": 51, "lastUpdated": 1442083365000, "production": "Samuel Goldwyn Films", "rotten": 31, "viewer": {"meter": 74, "numReviews": 12666, "rating": 3.6}, "website": "http://www.padreamaromovie.com/"}, "type": "movie", "writers": ["Vicente Leèero", "Eèa de Queirès (novel)"], "year": 2002}