{"_id": "573a1395f29313caabce28ba", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Aleksandr Demyanenko", "Aleksei Smirnov", "Vladimir Basov", "Emmanuil Geller"], "countries": ["Soviet Union"], "directors": ["Leonid Gayday"], "fullplot": "The movie consists of 3 short movies, each about Shurik - a nerdy student.. 1. \"Naparnik\" (\"Partner\"). Shurik has a fight in a bus with a bully named Fedya because Fedya didn't want to allow a pregnant woman to take his place. Fedya is punished by community work at a construction site, where Shurik also works part-time. Of course, Fedya wants revenge... 2. \"Navazhdenie\" (\"Strange Impression\"). It's final exam time. Shurik (like other students) is very busy trying to find material to study. Suddenly he notices necessary material in someone's hands. Shurik follows this person all over the city reading over the shoulder, not even noticing who this person is and where they are going. Next day, after having met a beautiful girl, Shurik constantly has an impression that he's already seen her, visited her apartment etc... 3. \"Operatsiya Y\" (\"Operation Y\"). A depository director, trying to cover up embezzlement on his depository, hires 3 crooks to simulate robbery. The plan is to get there at night, overpower an old lady guard and break a few things to make an impression of a big crime. The problem is that the very night the operation \"Y\" was planned for, the old lady-guard asked the tenant of her apartment (that of course happened to be Shurik) to guard the depository for her.", "genres": ["Comedy", "Crime", "Romance"], "imdb": {"id": 59550, "rating": 8.5, "votes": 5739}, "languages": ["Russian"], "lastupdated": "2015-07-12 00:50:43.937000000", "plot": "The movie consists of 3 short movies, each about Shurik - a nerdy student.. 1. \"Naparnik\" (\"Partner\"). Shurik has a fight in a bus with a bully named Fedya because Fedya didn't want to ...", "poster": "https://m.media-amazon.com/images/M/MV5BODFkYTI1ZTYtYTQ5Ni00M2FhLWI4YWMtODZkMDhiY2I1OGMwXkEyXkFqcGdeQXVyNjg3MTIwODI@._V1_SY1000_SX677_AL_.jpg", "released": -140227200000, "runtime": 95, "title": "Operation 'Y' & Other Shurik's Adventures", "tomatoes": {"critic": {"meter": 80, "numReviews": 10, "rating": 6.8}, "dvd": 1187049600000, "fresh": 8, "lastUpdated": 1438454460000, "rotten": 2, "viewer": {"meter": 63, "numReviews": 480, "rating": 3.6}}, "type": "movie", "writers": ["Leonid Gayday", "Yakov Kostyukovskiy", "Moris Slobodskoy"], "year": 1965}