{"_id": "573a13a6f29313caabd17461", "awards": {"nominations": 28, "text": "10 wins & 28 nominations.", "wins": 10}, "cast": ["Danielle Darrieux", "Catherine Deneuve", "Isabelle Huppert", "Emmanuelle Bèart"], "countries": ["France", "Italy"], "directors": ["Franèois Ozon"], "fullplot": "One morning at an isolated mansion in the snowy countryside of 1950s France, a family is gathered for the holiday season. But there will be no celebration at all because their beloved patriarch has been murdered! The killer can only be one of the eight women closest to the man of the house. Was it his powerful wife? His spinster sister-in-law? His miserly mother-in-law? Maybe the insolent chambermaid or the loyal housekeeper? Could it possibly have been one of his two young daughters? A surprise visit from the victim's chic sister sends the household into a tizzy, encouraging hysterics, exacerbating rivalries, and encompassing musical interludes. Comedic situations arise with the revelations of dark family secrets. Seduction dances with betrayal. The mystery of the female psyche is revealed. There are eight women and each is a suspect. Each has a motive. Each has a secret. Beautiful, tempestuous, intelligent, sensual, and dangerous...one of them is guilty. Which one is it?", "genres": ["Comedy", "Crime", "Musical"], "imdb": {"id": 283832, "rating": 7.1, "votes": 22433}, "languages": ["French", "English"], "lastupdated": "2015-08-10 00:26:57.220000000", "metacritic": 64, "num_mflix_comments": 1, "plot": "One murdered man, eight women, each seeming to be more eager than the others to know the truth. Gimme, gimme, gimme some clues to make up my mind. And eventually enter the truth. Oh, thou cruel woman!", "poster": "https://m.media-amazon.com/images/M/MV5BMTJkYTg4N2MtMzcwMy00ZjFiLWFlNzItMmJhMTllZjI2YjRlXkEyXkFqcGdeQXVyNzA5NjUyNjM@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1033689600000, "runtime": 111, "title": "8 Women", "tomatoes": {"consensus": "Featuring some of the best French actresses working today, 8 Women is frothy, delirious, over-the-top fun.", "critic": {"meter": 79, "numReviews": 124, "rating": 7}, "dvd": 1044921600000, "fresh": 98, "lastUpdated": 1440353314000, "production": "USA Films", "rotten": 26, "viewer": {"meter": 76, "numReviews": 22733, "rating": 3.6}, "website": "http://www.8femmes-lefilm.com/"}, "type": "movie", "writers": ["Franèois Ozon", "Robert Thomas (play)", "Marina de Van"], "year": 2002}