{"_id": "573a13bbf29313caabd53752", "awards": {"nominations": 2, "text": "2 nominations.", "wins": 0}, "cast": ["Marc Worden", "Gwendoline Yeo", "Fred Tatasciore", "Rodney Saulsberry"], "countries": ["USA"], "directors": ["Patrick Archibald", "Jay Oliva", "Frank Paur"], "fullplot": "Billionaire inventor Tony Stark digs up far more than he bargained for. He unleashes an age-old prophecy that foretells the resurrection of the Mandarin, the emperor of China's darkest and most violent dynasty. When his best friend James \"Rhodey\" Rhodes has been kidnapped, Tony travels to China to investigate, he is captured and badly injured by the Jade Dragons, his life only saved thanks to a Chinese shaman and Rhodes' skills as an army medic after a piece of shrapnel damages his heart. In order to confront the destructive force in this ultimate battle, Tony creates an armored suit infused with high-tech weaponry. To stop the evil that he himself has raised form the earth, Tony must become his greatest invention ever which becomes known as \"Iron Man\"! The newly born champion must travel to the four corners of the earth to battle the Mandarin's henchmen, the Elementals four magical warriors who harness the power of the elements earth, water, wind, and fire with deadly chemistry.", "genres": ["Animation", "Action", "Adventure"], "imdb": {"id": 903135, "rating": 6, "votes": 5336}, "languages": ["English"], "lastupdated": "2015-09-03 00:29:57.070000000", "num_mflix_comments": 1, "plot": "When a cocky industrialist's efforts to raise an ancient Chinese temple leads him to be seriously wounded and captured by enemy forces, he must use his ideas for a revolutionary power armor in order to fight back as a superhero.", "poster": "https://m.media-amazon.com/images/M/MV5BOGRmZDg1YjMtMDA5YS00OTFjLTgyMjQtNDgzNTIyNzAwZDg0L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1169510400000, "runtime": 83, "title": "The Invincible Iron Man", "tomatoes": {"dvd": 1169510400000, "lastUpdated": 1439922699000, "production": "LionsGate Entertainment", "viewer": {"meter": 46, "numReviews": 17363, "rating": 3.3}}, "type": "movie", "writers": ["Avi Arad (story)", "Greg Johnson", "Craig Kyle", "Stan Lee (comic book and characters)", "Larry Lieber (comic book and characters)"], "year": 2007}