{"_id": "573a13d5f29313caabd9ccf9", "awards": {"nominations": 4, "text": "2 wins & 4 nominations.", "wins": 2}, "cast": ["Guillaume Canet", "Leèla Bekhti", "Slimane Khettabi", "Abraham Belaga"], "countries": ["France"], "directors": ["Cèdric Kahn"], "fullplot": "Yann (Guillaume Canet) and Nadia (Leèla Bekhti) fall in love. Nadia has acquired a crumbling building in a Paris suburb and the couple decide to renovate it to launch a restaurant. But things turn upside down, high financing costs make things difficult, and Nadia, has to accept a temporary work opportunity in Montreal to pitch in with extra money. She has to leave her son Slimane (Slimane Khettabi) to Yann. Things get even worse when Nadia disappears without a trace.[1] Yann has to sell the building at a low price, not enough to pay all his debts, and has to move with Slimane from his nearby caravan to an unattractive room, which he rents from the buyer. He robs the man and travels with Slimane to Canada. He finds Nadia, she is in custody. He comes to the prison but at first she refuses to accept the visit. The next day she allows him to visit her but to Slimane's regret she refuses to see him, out of shame. She is there for drug possession, but she is innocent. The next time she allows Yann to visit her with Slimane.", "genres": ["Drama"], "imdb": {"id": 2027265, "rating": 6.6, "votes": 1179}, "languages": ["French", "English"], "lastupdated": "2015-08-10 01:00:00.550000000", "num_mflix_comments": 2, "plot": "Yann (Guillaume Canet) and Nadia (Leèla Bekhti) fall in love. Nadia has acquired a crumbling building in a Paris suburb and the couple decide to renovate it to launch a restaurant. But ...", "poster": "https://m.media-amazon.com/images/M/MV5BMzJkNGI1NmMtYTEwOC00ZDcyLWFkOTktNmI5MmY2NTcwMjA0XkEyXkFqcGdeQXVyMTk4MDgwNA@@._V1_SY1000_SX677_AL_.jpg", "released": 1325635200000, "runtime": 110, "title": "A Better Life", "tomatoes": {"lastUpdated": 1441994189000, "production": "Mars Distribution", "viewer": {"numReviews": 242, "rating": 3.2}, "website": "http://fr-fr.facebook.com/UneVieMeilleure"}, "type": "movie", "writers": ["Catherine Paillè (scenario)", "Cèdric Kahn (scenario)"], "year": 2011}