{"_id": "573a13dbf29313caabdae9c2", "awards": {"nominations": 50, "text": "41 wins & 50 nominations.", "wins": 41}, "cast": ["Michael B. Jordan", "Melonie Diaz", "Octavia Spencer", "Kevin Durand"], "countries": ["USA"], "directors": ["Ryan Coogler"], "fullplot": "This is the true story of Oscar, a 22-year-old Bay Area resident who wakes up on the morning of December 31, 2008 and feels something in the air. Not sure what it is, he takes it as a sign to get a head start on his resolutions: being a better son to his mother, whose birthday falls on New Year's Eve, being a better partner to his girlfriend, who he hasn't been completely honest with as of late, and being a better father to T, their beautiful 4 year old daughter. He starts out well, but as the day goes on, he realizes that change is not going to come easy. He crosses paths with friends, family, and strangers, each exchange showing us that there is much more to Oscar than meets the eye. But it would be his final encounter of the day, with police officers at the Fruitvale BART station that would shake the Bay Area to its very core, and cause the entire nation to be witnesses to the story of Oscar Grant.", "genres": ["Biography", "Drama", "Romance"], "imdb": {"id": 2334649, "rating": 7.5, "votes": 44650}, "languages": ["English"], "lastupdated": "2015-09-07 00:07:59.990000000", "metacritic": 85, "plot": "The story of Oscar Grant III, a 22-year-old Bay Area resident, who crosses paths with friends, enemies, family, and strangers on the last day of 2008.", "poster": "https://m.media-amazon.com/images/M/MV5BMTQ0OTU1MDkxMF5BMl5BanBnXkFtZTcwNjI5OTA3OQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1374796800000, "runtime": 85, "title": "Fruitvale Station", "tomatoes": {"boxOffice": "$16.1M", "consensus": "Passionate and powerfully acted, Fruitvale Station serves as a celebration of life, a condemnation of death, and a triumph for star Michael B. Jordan.", "critic": {"meter": 94, "numReviews": 187, "rating": 8.1}, "dvd": 1389657600000, "fresh": 175, "lastUpdated": 1442341364000, "production": "The Weinstein Company", "rotten": 12, "viewer": {"meter": 87, "numReviews": 37300, "rating": 4.1}, "website": "http://www.fruitvalefilm.com/"}, "type": "movie", "writers": ["Ryan Coogler"], "year": 2013}