{"_id": "573a13b2f29313caabd394be", "awards": {"nominations": 4, "text": "1 win & 4 nominations.", "wins": 1}, "cast": ["Julia Roberts", "Nicolas Cage", "Meryl Streep", "Paul Giamatti"], "countries": ["USA"], "directors": ["John A. Davis"], "fullplot": "This is the story of a ten-year-old boy named Lucas Nickle, who has just moved to a new neighborhood, has no friends, and is the target for the local bully and his gang. His parents are leaving for a honeymoon in Puerto Vallarta, so they are too busy to attend to his problems. His sister is distracted by her cellular phone, and the grandmother is obsessed with UFOs and aliens. Lucas is constantly being beat up by the obese yet intimidating neighborhood bully. Because he cannot fight back, he takes out his anger on an anthill in his front yard; He kicks it, stomps it, squirts it with his water gun, and floods it with a hose. This terrifies the ants, who call Lucas the Destroyer. One wizard ant, known as Zoc being a hopeful and adventurous type, is trying to solve this dilemma. He tries to devise a magic potion that he believes will solve all their problems. As the plan to shrink Lucas down to their size with a magic potion and forcing him to live like an ant within the colony--an astonishing new world opens up to him. Lucas learns, first-hand, the value of friendship and teamwork, ultimately leading the ants in an effort to save their colony from annihilation. And in the process, Lucas obtains the things he wants most: friends, companionship, acceptance and the courage to stand up for himself.", "genres": ["Animation", "Adventure", "Comedy"], "imdb": {"id": 429589, "rating": 5.9, "votes": 28382}, "languages": ["English"], "lastupdated": "2015-09-02 00:47:44.430000000", "metacritic": 59, "num_mflix_comments": 2, "plot": "After Lucas Nickle floods an ant colony with his watergun, he's magically shrunken down to insect size and sentenced to hard labor in the ruins.", "poster": "https://m.media-amazon.com/images/M/MV5BMjE2OTYwMzQzNl5BMl5BanBnXkFtZTcwNDM1MjMzMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 1154044800000, "runtime": 88, "title": "The Ant Bully", "tomatoes": {"boxOffice": "$28.1M", "consensus": "Sometimes inventive and witty, this animated adventure into an ant-sized world is a pleasant diversion.", "critic": {"meter": 63, "numReviews": 115, "rating": 6.2}, "dvd": 1164672000000, "fresh": 72, "lastUpdated": 1440353086000, "production": "Warner Bros. Pictures", "rotten": 43, "viewer": {"meter": 43, "numReviews": 88544, "rating": 3.1}, "website": "http://theantbully.warnerbros.com/"}, "type": "movie", "writers": ["John A. Davis", "John Nickle (book)"], "year": 2006}