{"_id": "573a13a7f29313caabd1b19d", "awards": {"nominations": 11, "text": "12 wins & 11 nominations.", "wins": 12}, "cast": ["Oksana Akinshina", "Artyom Bogucharskiy", "Lyubov Agapova", "Liliya Shinkaryova"], "countries": ["Sweden", "Denmark"], "directors": ["Lukas Moodysson"], "fullplot": "While waiting for her mothers reply to take her to the USA, Lilya idles the time away smoking, drinking and having fun with her, too, outcast friend Volodya. In time, the chance of a new life becomes non-existent; her life is going nowhere. Meeting a young man, she then finds a plane ticket in her hand and a new life in Sweden: a job, an apartment and prospects. All is not what it seems. There shall be work, there shall be housing and there shall be no escape. This is the stark, frank and disturbing vision of the life of a young victim of the underground sex trade and in all its tone of realism of abject poverty, despicable actions and of wanting to show that dreaming of a better life is not a crime but that life can shatter the illusion of a happy ending.", "genres": ["Crime", "Drama"], "imdb": {"id": 300140, "rating": 7.9, "votes": 33459}, "languages": ["Russian", "Swedish", "English", "Polish"], "lastupdated": "2015-09-01 00:05:03.850000000", "metacritic": 82, "plot": "Sixteen-year-old Lilja and her only friend, the young boy Volodja, live in Estonia, fantasizing about a better life. One day, Lilja falls in love with Andrej, who is going to Sweden, and invites Lilja to come along and start a new life.", "poster": "https://m.media-amazon.com/images/M/MV5BMTQ1ODM1Nzc1OF5BMl5BanBnXkFtZTcwMDI3MDg4NA@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1030060800000, "runtime": 109, "title": "Lilya 4-Ever", "tomatoes": {"consensus": "A tragic, hard-hitting story about a teenager trapped in a life of prostitution.", "critic": {"meter": 87, "numReviews": 67, "rating": 7.6}, "dvd": 1116288000000, "fresh": 58, "lastUpdated": 1442080027000, "production": "Newmarket Films", "rotten": 9, "viewer": {"meter": 91, "numReviews": 13250, "rating": 4.1}}, "type": "movie", "writers": ["Lukas Moodysson"], "year": 2002}