{"_id": "573a1392f29313caabcdb700", "awards": {"nominations": 2, "text": "Won 1 Oscar. Another 1 win & 2 nominations.", "wins": 2}, "cast": ["Luise Rainer", "Fernand Gravey", "Miliza Korjus", "Hugh Herbert"], "countries": ["USA"], "directors": ["Julien Duvivier", "Victor Fleming", "Josef von Sternberg"], "fullplot": "In 1845 Vienna, Johann Strauè II - Schani to his friends - would rather write and perform waltzes than anything else, this at a time when a waltz is not considered proper society music. After he is fired from his clerical bank job because of his preoccupation with composing, he decides to follow his passion and form an orchestra. After some famed opera singers, including Carla Donner, hear his music, they expose Schani's music to the masses, to royalty and to music publisher Julius Hofbauer. As such, Schani becomes the toast of Vienna. With his new found musical fame, Schani's life, which includes his work in the European Revolutions, changes. He becomes torn for his love for his loving and faithful wife Poldi Vogelhuber and his more emotionally passionate but somewhat destructive love for Carla Donner, who herself is involved with Count Anton Hohenfried.", "genres": ["Biography", "Drama", "Music"], "imdb": {"id": 30202, "rating": 6.7, "votes": 722}, "languages": ["English"], "lastupdated": "2015-08-23 00:19:27.547000000", "plot": "In 1845 Vienna, Johann Strauè II - Schani to his friends - would rather write and perform waltzes than anything else, this at a time when a waltz is not considered proper society music. ...", "poster": "https://m.media-amazon.com/images/M/MV5BN2I3NmRjNTYtNGE2Ny00NzgwLTk0NDMtYTYxNGNkZjQ1ODkzXkEyXkFqcGdeQXVyNjc0MzMzNjA@._V1_SY1000_SX677_AL_.jpg", "rated": "PASSED", "released": -983318400000, "runtime": 104, "title": "The Great Waltz", "tomatoes": {"dvd": 1172534400000, "lastUpdated": 1441912205000, "production": "MGM", "viewer": {"meter": 61, "numReviews": 411, "rating": 3.5}}, "type": "movie", "writers": ["Gottfried Reinhardt (original story)", "Samuel Hoffenstein (screen play)", "Walter Reisch (screen play)"], "year": 1938}