{"_id": "573a13a2f29313caabd0c1fb", "awards": {"nominations": 5, "text": "9 wins & 5 nominations.", "wins": 9}, "cast": ["Rupert Everett", "Klaus Mèller", "Karl Gorath", "Pierre Seel"], "countries": ["UK", "Germany", "USA"], "directors": ["Rob Epstein", "Jeffrey Friedman"], "fullplot": "By the 1920's, Berlin had become known as a homosexual eden, where gay men and lesbians lived relatively open lives amidst an exciting subculture of artists and intellectuals. With the coming to power of the Nazis, all this changed. Between 1933 and 1945 100,000 men were arrested for homosexuality under Paragraph 175, the sodomy provision of the German penal code dating back to 1871. Some were imprisoned, others were sent to concentration camps. Of the latter, only about 4,000 survived. Today, fewer than ten of these men are known to be living. Five of them have now come forward to tell their stories for the first time in this powerful new film. The Nazi persecution of homosexuals may be the last untold story of the Third Reich. Paragraph 175 fills a crucial gap in the historical record, and reveals the lasting consequences of this hidden chapter of 20th century history, as told through personal stories of men and women who lived through it: the half Jewish gay resistance fighter who spent the war helping refugees in Berlin; the Jewish lesbian who escaped to England with the help of a woman she had a crush on; the German Christian photographer who was arrested and imprisoned for homosexuality, then joined the army on his release because he \"wanted to be with men\"; the French Alsatian teenager who watched as his lover was tortured and murdered in the camps. These are stories of survivors -- sometimes bitter, but just as often filled with irony and humor; tortured by their memories, yet infused with a powerful will to endure. Their moving testimonies, rendered with evocative images of their lives and times, tell a haunting, compelling story of human resilience in the face of unspeakable cruelty. Intimate in its portrayals, sweeping in its implications, Paragraph 175 raises provocative questions about memory, history, and identity.", "genres": ["Documentary", "History", "War"], "imdb": {"id": 236576, "rating": 7.9, "votes": 1525}, "languages": ["French", "English", "German"], "lastupdated": "2015-09-11 00:34:44.583000000", "metacritic": 85, "num_mflix_comments": 2, "plot": "Historian Klaus Mèller interviews survivors of the Nazi persecution of homosexuals because of the German Penal Code of 1871, Paragraph 175.", "poster": "https://m.media-amazon.com/images/M/MV5BMjE0ODYwMTU0OF5BMl5BanBnXkFtZTcwMTczMTEyMQ@@._V1_SY1000_SX677_AL_.jpg", "released": 1013040000000, "runtime": 81, "title": "Paragraph 175", "tomatoes": {"critic": {"meter": 93, "numReviews": 15, "rating": 7.4}, "dvd": 1027382400000, "fresh": 14, "lastUpdated": 1441134505000, "production": "Telling Pictures", "rotten": 1, "viewer": {"meter": 83, "numReviews": 965, "rating": 3.9}}, "type": "movie", "writers": ["Sharon Wood"], "year": 2000}