{"_id": "573a13bef29313caabd5cb7b", "awards": {"nominations": 4, "text": "1 win & 4 nominations.", "wins": 1}, "cast": ["Jackie Chan", "Naoto Takenaka", "Daniel Wu", "Jinglei Xu"], "countries": ["Hong Kong"], "directors": ["Tung-Shing Yee"], "fullplot": "In China, the poor worker Tietou repairs tractors and misses his sweetheart Xiu Xiu, back in Japan, she having never sent any news to her family or him. While illegally emigrating to Japan, Tietou loses his Chinese documents and so cannot return to his country. He is welcomed by his countrymen who lodge and work in Shinjuku where they also help him to find illegal work. While running from a police raid through the sewage system where Chinese are illegally working, Tietou saves Inspector Kitano from drowning in the dirty water. Later, after an incident with his cousin, Joe, and a Taiwan gang, Tietou saves the powerful Yakuza boss Toshinari Eguchi. He is the husband of Xiu Xiu, who is now called Yuko and are parents of a little daughter. The mobster offers a dirty job to Tietou; in retribution, he promises to deliver the quarter dominated by the Taiwan gang to him. Tietou becomes the boss of the Chinese illegal immigrants. But his peaceful methods make him unpopular and Tietou starts to lose control over his men which escalates into a giant gang war.", "genres": ["Action", "Crime", "Drama"], "imdb": {"id": 1075419, "rating": 7.1, "votes": 8686}, "languages": ["Mandarin", "Japanese", "Cantonese", "English", "Min Nan", "Hokkien"], "lastupdated": "2015-08-26 01:06:21.557000000", "metacritic": 63, "num_mflix_comments": 1, "plot": "A simple Chinese immigrant wages a perilous war against one of the most powerful criminal organizations on the planet.", "poster": "https://m.media-amazon.com/images/M/MV5BNDExNjUxMjQyNl5BMl5BanBnXkFtZTcwMTU2MDQxMw@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1238630400000, "runtime": 119, "title": "Shinjuku Incident", "tomatoes": {"critic": {"meter": 60, "numReviews": 5, "rating": 6.6}, "dvd": 1275955200000, "fresh": 3, "lastUpdated": 1440528979000, "production": "Columbia Pictures", "rotten": 2, "viewer": {"meter": 67, "numReviews": 10733, "rating": 3.4}, "website": "http://shinjukuincident.emp.hk/en_main.html"}, "type": "movie", "writers": ["Tung-Shing Yee", "Tin Nam Chun"], "year": 2009}