{"_id": "573a13b8f29313caabd4c3c5", "awards": {"nominations": 13, "text": "9 wins & 13 nominations.", "wins": 9}, "cast": ["Don Cheadle", "Chiwetel Ejiofor", "Bruce McFee", "Mike Epps"], "countries": ["USA"], "directors": ["Kasi Lemmons"], "fullplot": "The true life story of Ralph Waldo \"Petey\" Greene Jr. In the mid-to-late 1960s, in Washington, D.C., vibrant soul music and exploding social consciousness were combining to unique and powerful effect. It was the place and time for Petey to fully express himself - sometimes to outrageous effect - and \"tell it like it is.\" With the support of his irrepressible and tempestuous girlfriend Vernell, the newly minted ex-con talks his way into an on-air radio gig. He forges a friendship and a partnership with fellow prison inmate Milo's brother Dewey Hughes. From the first wild morning on the air, Petey relies on the more straight-laced Dewey to run interference at WOL-AM, where Dewey is the program director. At the station, Petey becomes an iconic radio personality, surpassing even the established popularity of his fellow disc jockeys, Nighthawk and Sunny Jim. Combining biting humor with social commentary, Petey openly courts controversy for station owner E.G. Sonderling. Petey was determined to make not just himself but his community heard during an exciting and turbulent period in American history. As Petey's voice, humor, and spirit surge across the airwaves with the vitality of the era, listeners tune in to hear not only incredible music but also a man speaking directly to them about race and power in America like few people ever have. Through the years, Petey's \"The truth just is\" style --- on - and off-air - would redefine both Petey and Dewey, and empower each to become the man he would most like to be.", "genres": ["Biography", "Drama", "History"], "imdb": {"id": 796368, "rating": 7.4, "votes": 8259}, "languages": ["English"], "lastupdated": "2015-09-05 00:01:15.643000000", "metacritic": 69, "num_mflix_comments": 2, "plot": "The story of Washington D.C. radio personality Ralph \"Petey\" Greene, an ex-con who became a popular talk show host and community activist in the 1960s.", "poster": "https://m.media-amazon.com/images/M/MV5BMzgyMTMxNjg4OF5BMl5BanBnXkFtZTYwMDkwNDc3._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1186099200000, "runtime": 118, "title": "Talk to Me", "tomatoes": {"boxOffice": "$4.4M", "consensus": "A riveting look at the life of legendary DJ \"Petey\" Greene, Talk to Me goes beyond the typical biopic with explosive performances from Don Cheadle and Chiwetal Ejiofor.", "critic": {"meter": 82, "numReviews": 127, "rating": 6.9}, "dvd": 1193702400000, "fresh": 104, "lastUpdated": 1439575462000, "production": "Focus Features", "rotten": 23, "viewer": {"meter": 77, "numReviews": 41411, "rating": 3.6}, "website": "http://www.focusfeatures.com/talktome"}, "type": "movie", "writers": ["Michael Genet (screenplay)", "Rick Famuyiwa (screenplay)", "Michael Genet (story)"], "year": 2007}