{"_id": "573a13acf29313caabd27651", "awards": {"nominations": 34, "text": "Nominated for 3 Oscars. Another 17 wins & 34 nominations.", "wins": 20}, "cast": ["Russell Crowe", "Renèe Zellweger", "Paul Giamatti", "Craig Bierko"], "countries": ["USA"], "directors": ["Ron Howard"], "fullplot": "During the Great Depression, a common-man hero, James J. Braddock--a.k.a. the Cinderella Man--was to become one of the most surprising sports legends in history. By the early 1930s, the impoverished ex-prizefighter was seemingly as broken-down, beaten-up and out-of-luck as much of the rest of the American populace who had hit rock bottom. His career appeared to be finished, he was unable to pay the bills, the only thing that mattered to him--his family--was in danger, and he was even forced to go on Public Relief. But deep inside, Jim Braddock never relinquished his determination. Driven by love, honor and an incredible dose of grit, he willed an impossible dream to come true. In a last-chance bid to help his family, Braddock returned to the ring. No one thought he had a shot. However Braddock, fueled by something beyond mere competition, kept winning. Suddenly, the ordinary working man became the mythic athlete. Carrying the hopes and dreams of the disenfranchised on his shoulders, Braddock rocketed through the ranks, until this underdog chose to do the unthinkable: take on the heavyweight champ of the world, the unstoppable Max Baer, renowned for having killed two men in the ring.", "genres": ["Biography", "Drama", "Sport"], "imdb": {"id": 352248, "rating": 8, "votes": 140006}, "languages": ["English"], "lastupdated": "2015-09-07 00:12:40.283000000", "metacritic": 69, "num_mflix_comments": 2, "plot": "The story of James Braddock, a supposedly washed-up boxer who came back to become a champion and an inspiration in the 1930s.", "poster": "https://m.media-amazon.com/images/M/MV5BODEyYmQxZjUtZGQ0NS00ZTAwLTkwOGQtNGY2NzEwMWE0MDc3XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1117756800000, "runtime": 144, "title": "Cinderella Man", "tomatoes": {"boxOffice": "$61.6M", "consensus": "With grittiness and an evocative sense of time and place, Cinderella Man is a powerful underdog story. And Ron Howard and Russell Crowe prove to be a solid combination.", "critic": {"meter": 80, "numReviews": 209, "rating": 7.4}, "dvd": 1133827200000, "fresh": 167, "lastUpdated": 1442163979000, "production": "Universal Pictures", "rotten": 42, "viewer": {"meter": 91, "numReviews": 281112, "rating": 3.8}, "website": "http://www.cinderellamanmovie.com"}, "type": "movie", "writers": ["Cliff Hollingsworth (screenplay)", "Akiva Goldsman (screenplay)", "Cliff Hollingsworth (story)"], "year": 2005}