{"_id": "573a139af29313caabcf04cb", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Uma Thurman", "Janeane Garofalo", "Ben Chaplin", "Jamie Foxx"], "countries": ["USA"], "directors": ["Michael Lehmann"], "fullplot": "Janeane Garofalo plays Dr. Abby Barnes, the \"Truth About Cats and Dogs\" radio question-and-answer show host who unwittingly entices a listener over the radio with her soothing voice and personality. This listener, Brian, tries to meet the Abby from the radio, but Noelle, played by Uma Thurman, is mistaken for the real thing when Brian comes to the studio. Instead of clearing things up right away, the self-conscious Abby allows her best friend, Noelle, a tall, stunning blonde, to take her place for a while. Abby takes on the made-up persona of Donna, while thinking Brian would never go for her, a short, cute, brunette, who thinks she's unattractive. As the real Abby woos Brian over the phone and radio, Noelle, the pseudo-Abby, takes her place in the flesh. As time goes on, Abby feels more and more confident that Brian would rather have the beautiful Noelle than the simply attractive Abby.", "genres": ["Comedy", "Romance"], "imdb": {"id": 117979, "rating": 6.3, "votes": 21815}, "languages": ["English"], "lastupdated": "2015-09-17 03:00:08.310000000", "metacritic": 64, "num_mflix_comments": 1, "plot": "A successful veternarian & radio show host with low self-esteem asks her model friend to impersonate her when a handsome man wants to see her.", "poster": "https://m.media-amazon.com/images/M/MV5BOWM0MTA4NjItMzM3ZS00NDJmLTg3NWItNGE5ODIyOGJhNzQ0L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 830476800000, "runtime": 97, "title": "The Truth About Cats & Dogs", "tomatoes": {"consensus": "Sharp, witty, and charming, The Truth About Cats and Dogs features a standout performance from Janeane Garofalo.", "critic": {"meter": 84, "numReviews": 38, "rating": 6.7}, "dvd": 987465600000, "fresh": 32, "lastUpdated": 1439750013000, "production": "Twentieth Century Fox Home Entertainment", "rotten": 6, "viewer": {"meter": 56, "numReviews": 52380, "rating": 2.9}}, "type": "movie", "writers": ["Audrey Wells"], "year": 1996}