{"_id": "573a139af29313caabcf0eb3", "awards": {"nominations": 8, "text": "8 nominations.", "wins": 0}, "cast": ["Johnny Depp", "Heather Graham", "Ian Holm", "Robbie Coltrane"], "countries": ["USA"], "directors": ["Albert Hughes", "Allen Hughes"], "fullplot": "It is 1888 in London, and the unfortunate poor lead horrifying lives in the city's deadliest slum, Whitechapel. Harassed by gangs and forced to walk the streets for a living, Mary Kelly and her small group of companions trudge on through this daily misery, their only consolation being that things can't get any worse. Yet things somehow do when their friend Ann is kidnapped and they are drawn into a conspiracy with links higher up than they could possibly imagine. The kidnapping is soon followed by the gruesome murder of another woman, Polly, and it becomes apparent that they are being hunted down, one by one. Sinister even by Whitechapel standards, the murder grabs the attention of Inspector Fred Abberline, a brilliant yet troubled man whose police work is often aided by his psychic abilities. Abberline becomes deeply involved with the case, which takes on personal meaning to him when he and Mary begin to fall in love. But as he gets closer to the truth Whitechapel becomes more and more dangerous for Abberline, Mary, and the other girls. Whoever is responsible for the grisly acts is not going to give up his secret without a fight....will they be able to survive the avenging force that has been sent after them from hell?", "genres": ["Horror", "Mystery", "Thriller"], "imdb": {"id": 120681, "rating": 6.8, "votes": 116865}, "languages": ["English"], "lastupdated": "2015-09-10 17:03:00.390000000", "metacritic": 54, "num_mflix_comments": 2, "plot": "In Victorian Era London, a troubled clairvoyant police detective investigates the murders by Jack The Ripper.", "poster": "https://m.media-amazon.com/images/M/MV5BMTM1MjkxNTQxMV5BMl5BanBnXkFtZTYwMDMxNDg2._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1003449600000, "runtime": 122, "title": "From Hell", "tomatoes": {"boxOffice": "$30.7M", "consensus": "Visually impressive, but this latest Ripper tale is dull and far from scary.", "critic": {"meter": 57, "numReviews": 150, "rating": 5.7}, "dvd": 1021334400000, "fresh": 86, "lastUpdated": 1442080728000, "production": "20th Century Fox", "rotten": 64, "viewer": {"meter": 66, "numReviews": 202710, "rating": 3.3}, "website": "http://www.fromhellmovie.com"}, "type": "movie", "writers": ["Alan Moore (graphic novel)", "Eddie Campbell (graphic novel)", "Terry Hayes (screenplay)", "Rafael Yglesias (screenplay)"], "year": 2001}