{"_id": "573a139af29313caabcf0de2", "awards": {"nominations": 2, "text": "8 wins & 2 nominations.", "wins": 8}, "cast": ["Anil Kapoor", "Tabu", "Pooja Batra", "Milind Gunaji"], "countries": ["India"], "directors": ["Priyadarshan"], "fullplot": "After completing his studies in London, England, Shakti Thakur returns home to India in a small town where his family resides. Accompanying him is his leggy girlfriend, Anita, who he is in love with and wants to marry, much to the disapproval of his family. After a few days, Shakti starts to feel that nothing much has changed in this part of India and longs to return, as he is unable to bear the animosity between the townspeople, in general, and in particular between his Zamindar dad, Raja Thakur, and rival Zamindar Birju, none other than Raja's crippled brother. When Anita leaves the town to meet her parents elsewhere in India, Shakti too wants to follow her, but his plans change suddenly when his father passes away, and the region is ravaged by unprecedented natural calamities. Following the funeral he decides to stay on to look after the family estate and business temporarily, and that is when he meets local town belle, Gehna, who has given her heart to him years ago, hopes to marry him, with approval from his very own family. Anita returns to find that nothing is the same anymore, and that her role may be reduced to that of a mistress, she must now make a choice to either return back home, or fight and win back Shakti's love.", "genres": ["Drama", "Family", "Musical"], "imdb": {"id": 120456, "rating": 7.5, "votes": 1631}, "languages": ["Hindi", "English"], "lastupdated": "2015-08-22 01:18:46.733000000", "num_mflix_comments": 2, "plot": "After completing his studies in London, England, Shakti Thakur returns home to India in a small town where his family resides. Accompanying him is his leggy girlfriend, Anita, who he is in ...", "poster": "https://m.media-amazon.com/images/M/MV5BNmVhOGU1NTQtNWE3OS00ODZkLTkyZWQtN2Y4NmEyYmU3NDQ1XkEyXkFqcGdeQXVyODEzOTQwNTY@._V1_SY1000_SX677_AL_.jpg", "runtime": 165, "title": "Virasat", "tomatoes": {"dvd": 913075200000, "lastUpdated": 1438886881000, "viewer": {"meter": 67, "numReviews": 536, "rating": 3.6}}, "type": "movie", "writers": ["Kamal Haasan (story)", "Vinay Shukla (dialogue)", "Vinay Shukla (screenplay)"], "year": 1997}