{"_id": "573a1396f29313caabce4272", "awards": {"nominations": 2, "text": "2 nominations.", "wins": 0}, "cast": ["Robert Duvall", "Donald Pleasence", "Don Pedro Colley", "Maggie McOmie"], "countries": ["USA"], "directors": ["George Lucas"], "fullplot": "In an undefined future, a dystopian underground society is oriented to production and consumption in the malls. The population is controlled by drugs and people do not feel affection or sympathy for others. Sexual intercourse is absolutely forbidden and roommates are chosen by a computer. Faceless androids are responsible for the surveillance of the behavior of the dwellers and people pray in Unichapels for their god OMM 0910 that responds through recorded electronic messages. The worker THX 1138 handles radioactive materials in a factory and lives with his roommate LUH 3417. When she decides to stop using drugs, she becomes lucid and replaces the drugs of her partner for harmless pills. THX becomes emotional again and falls in love with LUH. He plans to escape with LUH to the superstructure, where they expect to live in freedom. But when SEN 5241 manipulates the computer to live with THX, he reports a complaint to the authorities and SEN is arrested. When THX commits a mistake in his work, the Powers That Be discover that THX and LUH are not taking drugs and having sexual intercourse and they are sentenced to be imprisoned in a weird white place. THX and SEN plan to escape with SRT and THX discover that LUH was killed by the authorities and he decides to find the way out to the surface.", "genres": ["Drama", "Sci-Fi", "Thriller"], "imdb": {"id": 66434, "rating": 6.8, "votes": 36591}, "languages": ["English"], "lastupdated": "2015-08-24 00:57:22.383000000", "metacritic": 75, "num_mflix_comments": 5, "plot": "Set in the 25th century, the story centers around a man and a woman who rebel against their rigidly controlled society.", "poster": "https://m.media-amazon.com/images/M/MV5BYzRiY2I3M2EtODJkMy00NTEyLTgxNmYtYzYwYjk1ZDE1MDE1XkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 37497600000, "runtime": 86, "title": "THX 1138", "tomatoes": {"consensus": "George Lucas' feature debut presents a spare, bleak, dystopian future, and features evocatively minimal set design and creepy sound effects.", "critic": {"meter": 88, "numReviews": 59, "rating": 6.9}, "dvd": 1095120000000, "fresh": 52, "lastUpdated": 1440612994000, "production": "Warner Bros. Pictures", "rotten": 7, "viewer": {"meter": 74, "numReviews": 27462, "rating": 3.5}, "website": "http://www.thx1138movie.com/"}, "type": "movie", "writers": ["George Lucas (story)", "George Lucas (earlier screenplay)", "George Lucas (screenplay)", "Walter Murch (screenplay)"], "year": 1971}