{"_id": "573a13b2f29313caabd397ac", "awards": {"nominations": 5, "text": "1 win & 5 nominations.", "wins": 1}, "cast": ["Colin Farrell", "Jamie Foxx", "Li Gong", "Naomie Harris"], "countries": ["USA", "Germany", "Paraguay", "Uruguay"], "directors": ["Michael Mann"], "fullplot": "Ricardo Tubbs is urbane and dead smart. He lives with Bronx-born Intel analyst Trudy, as they work undercover transporting drug loads into South Florida to identify a group responsible for three murders. Sonny Crockett [to the untrained eye, his presentation may seem unorthodox, but procedurally, he is sound] is charismatic and flirtatious until - while undercover working with the supplier of the South Florida group - he gets romantically entangled with Isabella, the Chinese-Cuban wife of an arms and drugs trafficker. The best undercover identity is oneself with the volume turned up and restraint unplugged. The intensity of the case pushes Crockett and Tubbs out onto the edge where identity and fabrication become blurred, where cop and player become one - especially for Crockett in his romance with Isabella and for Tubbs in the provocation of an assault on those he loves.", "genres": ["Action", "Crime", "Thriller"], "imdb": {"id": 430357, "rating": 6, "votes": 88309}, "languages": ["English", "Spanish"], "lastupdated": "2015-08-20 00:11:43.563000000", "metacritic": 65, "num_mflix_comments": 1, "plot": "Based on the 1980s TV action/drama, this update focuses on vice detectives Crockett and Tubbs as their respective personal and professional lives become dangerously intertwined.", "poster": "https://m.media-amazon.com/images/M/MV5BMTM4MDQ5MTkxMV5BMl5BanBnXkFtZTcwMTU4MzUzMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1154044800000, "runtime": 134, "title": "Miami Vice", "tomatoes": {"boxOffice": "$63.4M", "consensus": "Miami Vice is beautifully shot but the lead characters lack the charisma of their TV series counterparts, and the underdeveloped story is well below the standards of Michael Mann's better films.", "critic": {"meter": 47, "numReviews": 195, "rating": 5.6}, "dvd": 1165276800000, "fresh": 92, "lastUpdated": 1442426421000, "production": "Universal Pictures", "rotten": 103, "viewer": {"meter": 43, "numReviews": 359863, "rating": 2.8}, "website": "http://www.miamivice.com/main.html"}, "type": "movie", "writers": ["Michael Mann", "Anthony Yerkovich (TV series)"], "year": 2006}