{"_id": "573a1396f29313caabce3f65", "awards": {"nominations": 4, "text": "Nominated for 3 Oscars. Another 1 win & 4 nominations.", "wins": 4}, "cast": ["Julie Andrews", "Rock Hudson", "Jeremy Kemp", "Lance Percival"], "countries": ["USA"], "directors": ["Blake Edwards"], "fullplot": "WWI. Lili Smith is a beloved British music hall singer, often providing inspiration for the British and French troops and general populace singing rallying patriotic songs. She is also half German - her real last name being Schmidt - and is an undercover German spy, using her feminine wiles to gather information from the high ranking and generally older military officers and diplomats she seduces. Masquerading as her Swiss uncle, Colonel Kurt Von Ruger is not only her German handler but her lover. Kurt's boss, General Kessler, doesn't fully trust Lili as she is still half British. That is why it irks him that Kurt has entrusted Lili with the important mission of finding out more about the Allied air defense plans, the air which is becoming a more important battleground of the war. Of the five men who are most privy to such information, Kurt believes the best target is American pilot, Major William Larrabee as he is young, single and a ladies man. Lili is more than easily able to strike a romantic and sexual relationship with Bill. Lili's mission is threatened when she learns that two French agents believe that Larrabee is passing information to a female German spy. But Lili believes she's also stumbled onto some vital information when she accidentally learns from one of Bill's pilot compatriots, T.C. Carstairs, of a secret mission code named \"Crepe Suzette\". Crepe Suzette ends up being a game changer for Lili, not only with her position as a spy, but in her relationship with Bill. The outcome of \"Suzette\" also threatens both Bill and Lili's lives.", "genres": ["Comedy", "Drama", "Musical"], "imdb": {"id": 65611, "rating": 6.2, "votes": 1468}, "languages": ["English", "German"], "lastupdated": "2015-08-30 00:12:03.540000000", "num_mflix_comments": 2, "plot": "Set during WWI, this movie is a cute spin on the Mata Hari legend.", "poster": "https://m.media-amazon.com/images/M/MV5BNTE1MzU4NWItOGRhNC00NjIzLThlZmItNTE0NTdlY2VjYjYzXkEyXkFqcGdeQXVyNjE5MjUyOTM@._V1_SY1000_SX677_AL_.jpg", "rated": "G", "released": 15033600000, "runtime": 136, "title": "Darling Lili", "tomatoes": {"dvd": 1130198400000, "lastUpdated": 1441304098000, "production": "Paramount", "viewer": {"meter": 71, "numReviews": 1843, "rating": 3.6}}, "type": "movie", "writers": ["Blake Edwards", "William Peter Blatty"], "year": 1970}