{"_id": "573a1395f29313caabce248d", "awards": {"nominations": 2, "text": "Nominated for 5 Oscars. Another 5 wins & 2 nominations.", "wins": 10}, "cast": ["Catherine Deneuve", "Nino Castelnuovo", "Anne Vernon", "Marc Michel"], "countries": ["France", "West Germany"], "directors": ["Jacques Demy"], "fullplot": "Told in four acts, the lives of Geneviève Emery and Guy Foucher of Cherbourg France are presented. Act 1 begins in November 1957, when sixteen year old Geneviève, who works in her widowed mother's umbrella shop called \"Les parapluies de Cherbourg\", and twenty year old Guy, who works as a mechanic at a gas station, are madly in love and want to get married. They are reluctant to tell anyone not only of their want to get married, but of their relationship. Geneviève believes her mother will think her too young, and would want her to marry someone with better prospects, especially considering her own tenuous financial situation. And Guy is more concerned now about not abandoning his ailing godmother, Aunt èlise, who raised him, and who he looks after along with a young woman named Madeleine. Act 2, told largely from Geneviève's perspective, begins in February 1958. Guy, drafted to fight for the French in Algeria, has been gone for two months, and is expected to be gone for two years. Geneviève rarely hears from Guy. In order to solve their many problems, Geneviève's mother wants her to marry Roland Cassard, a refined and well appointed diamond merchant who travels often for his work but who is devoted to Geneviève whenever he is in Cherbourg. Geneviève, who still loves Guy but who she is slowly losing in terms of him as a person in her mind, has to decide what to do about Roland, especially as it may become more difficult to accept his proposal as time progresses. Act 3, told largely from Guy's perspective, begins in March 1959 upon his military discharge and return to Cherbourg. Life circumstances, including what happened during the war, has changed Guy, and he has to figure out what the next phase of his life will look like because of his new perspective. Act 4 takes place on one snowy day in December 1963, when Geneviève and Guy are shown in their current lives, that based on what has happened in those previous three acts.", "genres": ["Drama", "Musical", "Romance"], "imdb": {"id": 58450, "rating": 7.8, "votes": 13883}, "languages": ["French"], "lastupdated": "2015-08-24 00:30:03.493000000", "metacritic": 86, "plot": "A young girl separated from her lover by war faces a life altering decision.", "poster": "https://m.media-amazon.com/images/M/MV5BZmMyNzg3MGYtZTllNS00MjVjLWI0NmQtMTZlNzBmZjBjZTZmXkEyXkFqcGdeQXVyMjgyNjk3MzE@._V1_SY1000_SX677_AL_.jpg", "rated": "UNRATED", "released": -159148800000, "runtime": 91, "title": "The Umbrellas of Cherbourg", "tomatoes": {"consensus": "Jacques Demy elevates the basic drama of everyday life into a soaring opera full of bittersweet passion and playful charm, featuring a timeless performance from Catherine Deneuve.", "critic": {"meter": 98, "numReviews": 53, "rating": 8.7}, "dvd": 877996800000, "fresh": 52, "lastUpdated": 1441991559000, "production": "Zeitgeist Films", "rotten": 1, "viewer": {"meter": 87, "numReviews": 9318, "rating": 4.1}}, "type": "movie", "writers": ["Jacques Demy (scenario and dialogue)"], "year": 1964}