{"_id": "573a13b4f29313caabd3efa4", "awards": {"nominations": 10, "text": "2 wins & 10 nominations.", "wins": 2}, "cast": ["Naseeruddin Shah", "Girish Karnad", "Shreyas Talpade", "Shweta Prasad"], "countries": ["India"], "directors": ["Nagesh Kukunoor"], "fullplot": "India - a Nation obsessed with cricket - and it is not very often one comes across anyone who loathes cricket as much as farmer Anwar Khan, who feels that it is a waste of time watching some grown men playing, not only getting paid, but costing the nation millions of lost work hours. His family, especially his wife, Saida, does not quite agree with him. As a matter of fact, she broke water when watching a cricket match with a TV set perched on a branch of a tree with almost the entire village in attendance. This is how Iqbal was born, followed by the birth of his sister, Khadija. Iqbal, though deaf and dumb, shared his mother's and sister's passion for cricket, he would tend to the buffaloes, who though all female, had been named after male cricketers, including Kapil Dev. While tending to them, he would stop and watch youngsters being trained by the renowned Guruji. When Guruji finds out about Iqbal's interest in the game, he recruits him, but lets him go when a dispute flares up between his top pupil, Kamal, and Iqbal. A disheartened Iqbal finds a new mentor, in the form of alcoholic farmhand, Mohit, who reluctantly decides to tutor Iqbal, so much so that Iqbal qualifies to play in the Andhra Pradesh team for a Ranjee trophy match. The match is won, and a way is cleared for Iqbal to find a place in the Indian team. Then all chaos breaks lose when Anwar refuses to let Iqbal indulge anymore in this waste of time, and asks him to go to the farm and help him. But Mohit is able to convince him to change his mind, only to find out that Guruji, who favors his star pupil Kamal, for a place in the Indian cricket team, and will do his utmost to foil any attempt by Mohit to promote Iqbal.", "genres": ["Drama"], "imdb": {"id": 453729, "rating": 8.2, "votes": 6445}, "languages": ["Hindi"], "lastupdated": "2015-09-07 00:34:48.350000000", "num_mflix_comments": 1, "plot": "Iqbal, the deaf and mute son of a farmer, has a passion for the game of cricket and seeks the tutelage of washed-up, alcoholic ex-player.", "poster": "https://m.media-amazon.com/images/M/MV5BMjA3NzUzMjU5MF5BMl5BanBnXkFtZTgwNzMxMDAxMzE@._V1_SY1000_SX677_AL_.jpg", "released": 1137715200000, "runtime": 132, "title": "Iqbal", "tomatoes": {"lastUpdated": 1438025106000, "viewer": {"meter": 82, "numReviews": 460, "rating": 3.8}}, "type": "movie", "writers": ["Nagesh Kukunoor"], "year": 2005}