{"_id": "573a13d4f29313caabd97d72", "awards": {"nominations": 4, "text": "3 wins & 4 nominations.", "wins": 3}, "cast": ["Ajay Devgn", "Kajal Agarwal", "Prakash Raj", "Sonali Kulkarni"], "countries": ["India"], "directors": ["Rohit Shetty"], "fullplot": "Following charges of corruption, Colva's (Goa) Police Inspector Rakesh Kadam kills himself, leaving a devastated wife, Megha, and son, Nitin. She takes it upon herself to canvas support that her husband was framed by a gangster, Jaykant Shikre, and vainly insists on a CBI Inquiry. When the High Court requires Jaykant, on unrelated charges, to present himself at Shivgad Police Station, which is located at the borders of Maharashtra and Karnataka, he refuses to do so, and the local Inspector Bajirao Singham, who has recently fallen in love with stunning Kavya Bhosle, summons him. An enraged Jaikant does appear along with an army of goons, but is no match for Bajirao, who has support from the entire community. Humbled and humiliated, Jaykant returns to Goa, and ensures Bajirao gets transferred there. It is here he not only plans to use an army of goons, his control and influence over politicians and senior police officers to plan the ultimate vengeance with impunity but also contest and win the local elections.", "genres": ["Action", "Crime", "Drama"], "imdb": {"id": 1948150, "rating": 6.7, "votes": 9228}, "languages": ["Hindi", "Marathi", "Gujarati", "Tulu", "English"], "lastupdated": "2015-08-18 00:36:00.580000000", "num_mflix_comments": 2, "plot": "A humiliated gangster uses his influence and goon power to terrorize a newly transferred police officer.", "poster": "https://m.media-amazon.com/images/M/MV5BMTA2NTAyNTMyMDdeQTJeQWpwZ15BbWU3MDEyMTY1ODU@._V1_SY1000_SX677_AL_.jpg", "released": 1311292800000, "runtime": 143, "title": "Singham", "tomatoes": {"boxOffice": "$0.3M", "lastUpdated": 1442265507000, "production": "Reliance Big Entertainment", "viewer": {"meter": 71, "numReviews": 1506, "rating": 3.6}, "website": "http://www.relianceentertainment.net/"}, "type": "movie", "writers": ["Farhad", "Hari (original story)", "Yunus Sajawal (screenplay)", "Sajid (dialogue)"], "year": 2011}