{"_id": "573a13a8f29313caabd1c919", "awards": {"nominations": 8, "text": "12 wins & 8 nominations.", "wins": 12}, "cast": ["Leonor Watling", "Rosa Maria Sardè", "Marèa Pujalte", "Silvia Abascal"], "countries": ["Spain"], "directors": ["Daniela Fèjerman", "Inès Parès"], "fullplot": "In Madrid, the divorced middle-age pianist Sofèa discloses to her daughters Elvira, Gimena and Sol on the day of her birthday that she is in love with the talented Czechoslovak pianist Aliska, who is twenty-years younger than she. The bigoted sisters are shocked with the revelation and do not accept the idea that their mother is lesbian. Elvira is an insecure and neurotic young aspirant writer that has a lousy job in a publishing house; Sol is the singer of a rock band; and Gimena is married with a boy and has a troubled marriage with Raèl. When they discover that her mother has lent all her savings to support the education of Aliska, they decide to seduce the girlfriend to make her leave their mother. But when Aliska returns to her country alone and their mother is very depressed, they need to try to revert the situation. Meanwhile the nervous Elvira meets the writer Miguel and has a clumsy relationship with him.", "genres": ["Comedy", "Drama"], "imdb": {"id": 306432, "rating": 6.3, "votes": 1381}, "languages": ["Spanish", "Czech"], "lastupdated": "2015-08-10 01:03:33.613000000", "metacritic": 51, "num_mflix_comments": 1, "plot": "In Madrid, the divorced middle-age pianist Sofèa discloses to her daughters Elvira, Gimena and Sol on the day of her birthday that she is in love with the talented Czechoslovak pianist ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTk2ODAzOWQtMDJhNi00OWY0LWI5MTgtMWVkMDA2MjE1YzViXkEyXkFqcGdeQXVyMTA0MjU0Ng@@._V1_SY1000_SX677_AL_.jpg", "released": 1010707200000, "runtime": 96, "title": "My Mother Likes Women", "tomatoes": {"consensus": "This likable movie lacks the bite its subject matter demands.", "critic": {"meter": 45, "numReviews": 38, "rating": 5.3}, "dvd": 1115683200000, "fresh": 17, "lastUpdated": 1442167871000, "production": "Norador Productions", "rotten": 21, "viewer": {"meter": 58, "numReviews": 1370, "rating": 3.3}, "website": "http://www.mymotherlikeswomen.com"}, "type": "movie", "writers": ["Daniela Fèjerman", "Inès Parès"], "year": 2002}