{"_id": "573a13a4f29313caabd11f36", "awards": {"nominations": 1, "text": "6 wins & 1 nomination.", "wins": 6}, "cast": ["Bart Klever", "Devika Strooker", "Rick de Leeuw", "Don Duyns"], "countries": ["Netherlands"], "directors": ["Gert de Graaff"], "fullplot": "The Sea That Thinks is a surprising film about itself. A film overflowing with twists and turns and new angles. It focuses on Bart, a scriptwriter who is writing the script for this film. In the film, Bart himself plays the scriptwriter writing the script of The Sea That Thinks. He types what he does and does what he types. In his film, he finds the answer to the urgent question: How do we find happiness? He uses stunning examples to show us that our world is only to be found in our consciousness. What is real and what is illusion? Do we believe in our dream world while we dream? Do we believe in the reality of film while we see it? And why? His combination of pictures and text has a hypnotic effect on the viewer. It provides an exciting, dislocating and humorous adventure. Later it also becomes apparent that the film is not about this tormented scriptwriter at all. In a game filled with optical illusions and continually changing points of view, the surprised viewers gradually find out they are looking at themselves: How do I observe? What do I assume to be true? What do I think I see? What do I think I am? The viewer turns out to bear a striking similarity to the Sea that thinks it's a Tree.", "genres": ["Adventure", "Biography", "Comedy"], "imdb": {"id": 261277, "rating": 7.2, "votes": 381}, "languages": ["Dutch"], "lastupdated": "2015-06-15 01:28:19.637000000", "num_mflix_comments": 1, "plot": "Incredible optical illusions in a story in a story in a story helps the surprised viewer finally to find out that he has been watching himself all along.", "released": 977356800000, "runtime": 100, "title": "The Sea That Thinks", "tomatoes": {"lastUpdated": 1437936389000, "viewer": {"meter": 88, "numReviews": 21, "rating": 4.3}}, "type": "movie", "writers": ["Gert de Graaff"], "year": 2000}