{"_id": "573a13bdf29313caabd5ad05", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Ai Kobayashi", "Kèichi Yamadera", "Yèji Kishi", "Kong Kuwata"], "countries": ["Japan"], "directors": ["Shinji Aramaki"], "fullplot": "When a paramilitary task force called E.S.W.A.T. and its operations in the year 2133 Olympus, a futuristic utopia where humans, cyborgs, and bio-engineered human beings called \"Bioroids\" are attempting to live in perfect harmony. However, a series of random terrorist attacks perpetrated by cyborgs and humans alike threaten to throw Olympus into total chaos. As it turns out, these humans and machines have come under the influence of an unknown electronic signal that hacks into their nervous systems and they then become the unwilling servants of a malevolent computerized entity. Thrown into the action is the plucky female E.S.W.A.T. warrior Deunan Knute and her cyborg lover/partner Briareos as they investigate these bizarre occurrences with the other members of their unit. Things become complicated when a bioroid named Tereus, who resembles Briareous in his human form, joins their unit and threatens to come between their relationship. But these three must put aside their differences to face an even greater threat that promises world destruction in its wake.", "genres": ["Animation", "Action", "Sci-Fi"], "imdb": {"id": 1043842, "rating": 7.2, "votes": 7847}, "languages": ["Japanese"], "lastupdated": "2015-08-24 00:07:04.180000000", "num_mflix_comments": 4, "plot": "With Brialeos convalescing after a mission, Deunan is assigned a new and remarkably familiar partner as a strange wave of terrorist attacks plague Olympus.", "poster": "https://m.media-amazon.com/images/M/MV5BMzg0ZDI4NzgtNjM0OC00ZDUyLWEyZTktNzI5MTcyNGRlMDdjXkEyXkFqcGdeQXVyMzM4MjM0Nzg@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1192838400000, "runtime": 105, "title": "Appleseed Saga: Ex Machina", "tomatoes": {"dvd": 1205193600000, "lastUpdated": 1442167953000, "production": "Toei Company", "viewer": {"meter": 78, "numReviews": 4551, "rating": 3.9}, "website": "http://www.exmachina.jp/"}, "type": "movie", "writers": ["Masamune Shirow (characters)", "Kiyoto Takeuchi (screenplay)", "Todd Weinger"], "year": 2007}