{"_id": "573a13bef29313caabd5c41c", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Con O'Neill", "Kevin Spacey", "Pam Ferris", "JJ Feild"], "countries": ["UK"], "directors": ["Nick Moran"], "fullplot": "In the early 1960s self-taught electronics whizz Joe Meek amazingly produces a string of home made hit singles from his studio in his flat above a leather shop in London. His biggest success is the instrumental 'Telstar' but accusations of plagiarism delay royalties. Joe's mercurial temper causes his artists to forsake him for other labels,in particular his young lover Heinz Burt. Now in debt and after unwisely parting from his chief financier Major Banks,Joe finds himself unable to control his life. Increasingly paranoid,believing he is being bugged by rival record companies and that everybody is out to get him,the last straw comes when landlady Violet tells him she is selling the building in which he lives. Joe had once confiscated a shotgun from Heinz. Now it is dangerously close at hand and about to end the Joe Meek story.", "genres": ["Biography", "Drama", "Music"], "imdb": {"id": 1068669, "rating": 6.4, "votes": 1189}, "languages": ["English"], "lastupdated": "2015-08-20 00:54:43.610000000", "num_mflix_comments": 2, "plot": "A music-infused drama about Joe Meek, the flamboyantly gay, tone deaf, songwriter-producer behind the '60s hits \"Have I the Right,\" \"Just Like Eddie,\" \"Johnny, Remember Me\" and \"Telstar.\"", "poster": "https://m.media-amazon.com/images/M/MV5BMTkxMDgxNDQxNV5BMl5BanBnXkFtZTcwNzc2MDg2Mg@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1245369600000, "runtime": 119, "title": "Telstar: The Joe Meek Story", "tomatoes": {"consensus": "Nick Moran's excellent portrait of an often forgotten pop legend is as eccentric and chaotic as its subject.", "critic": {"meter": 84, "numReviews": 25, "rating": 5.9}, "dvd": 1332115200000, "fresh": 21, "lastUpdated": 1442340329000, "production": "PreviewNetworks", "rotten": 4, "viewer": {"meter": 68, "numReviews": 534, "rating": 3.5}}, "type": "movie", "writers": ["Nick Moran", "James Hicks"], "year": 2008}