{"_id": "573a13c4f29313caabd6b921", "awards": {"nominations": 2, "text": "2 nominations.", "wins": 0}, "cast": ["Mark Rendall", "Sergiy Kotelenets", "Nataliya Alyexeyenko", "Holly Deveaux"], "countries": ["Canada"], "directors": ["David Bezmozgis"], "fullplot": "It is May 1988 in Toronto. The school year is coming to a close. The Victoria Day long weekend heralds the beginning of summer. In Boston, Wayne Gretzky's dynastic Edmonton Oilers are playing in the Stanley Cup Finals. Best of all, Bob Dylan is coming to town. Ben Spektor, 16, attends the concert with his two closest friends, Sammy and Noah. Though the year is 1988, they exist as if in a time warp, idolizing the music and culture of the 1960s. Outside the concert, Ben sees what looks like a routine exchange: two teenagers buying drugs. In a way he could never have predicted, the consequences of this drug deal will alter the course of his summer and, quite possibly, the rest of his life. This one event, barely significant at the time, initiates Ben into love, as well as death, and forces him to confront his conscience, his friends, and his family. Over the span of one week, seemingly disparate forces converge on him - the search for a missing boy, his romance with the boy's sister, the Stanley Cup finals, the fortunes of his own hockey team, and a peculiar Vietnam re-enactment with Victoria Day firecrackers. These events conspire to displace the certainty of childhood with the disorientation of adulthood.", "genres": ["Drama"], "imdb": {"id": 1331126, "rating": 6.5, "votes": 106}, "languages": ["English", "Russian"], "lastupdated": "2015-01-17 00:27:14.610000000", "num_mflix_comments": 1, "plot": "Over the course of one week in 1988, the search for a missing teammate, parental expectations, a burgeoning sexual awakening and the rock concert of the century all threaten to jolt a 16-year-old into adulthood.", "released": 1232150400000, "runtime": 88, "title": "Victoria Day", "tomatoes": {"lastUpdated": 1439751525000, "viewer": {"numReviews": 121, "rating": 3.4}}, "type": "movie", "writers": ["David Bezmozgis"], "year": 2009}