{"_id": "573a13b4f29313caabd3f3fe", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Ron Perlman", "James Le Gros", "Connie Britton", "Zach Gilford"], "countries": ["USA", "Iceland"], "directors": ["Larry Fessenden"], "fullplot": "The American oil company KIC Corporation is building an ice road to explore the remote Northern Arctic National Wildlife Refuge seeking energy independence. Independent environmentalists work together in a drilling base headed by the tough Ed Pollack in a sort of agreement with the government, approving procedures and sending reports of the operation. When one insane team member is found dead naked on the snow, the environmentalist James Hoffman suspects that sour gases may have been accidentally released in the spot provoking hallucinations and insanity in the group. After a second fatal incident, he convinces Ed to travel with the team to a hospital for examination. However, weird events happen trapping the group in the base.", "genres": ["Horror", "Thriller"], "imdb": {"id": 454864, "rating": 5.6, "votes": 6814}, "languages": ["English"], "lastupdated": "2015-09-11 00:25:44.353000000", "metacritic": 69, "plot": "The American oil company KIC Corporation is building an ice road to explore the remote Northern Arctic National Wildlife Refuge seeking energy independence. Independent environmentalists ...", "poster": "https://m.media-amazon.com/images/M/MV5BMjE5NzYyNTU5MV5BMl5BanBnXkFtZTcwMTUyOTA1MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 1222214400000, "runtime": 101, "title": "The Last Winter", "tomatoes": {"consensus": "The Last Winter creatively and effectively uses horror tactics -- fear, tension, anticipation, and just enough gore -- to shock, but never repulse, its audience.", "critic": {"meter": 76, "numReviews": 50, "rating": 6.7}, "dvd": 1216684800000, "fresh": 38, "lastUpdated": 1442339554000, "production": "IFC First Take", "rotten": 12, "viewer": {"meter": 33, "numReviews": 5172, "rating": 2.7}, "website": "http://www.antidotefilms.com/"}, "type": "movie", "writers": ["Larry Fessenden", "Robert Leaver"], "year": 2006}