{"_id": "573a139af29313caabcef876", "awards": {"nominations": 3, "text": "Nominated for 2 Golden Globes. Another 1 nomination.", "wins": 0}, "cast": ["Wesley Snipes", "Patrick Swayze", "John Leguizamo", "Stockard Channing"], "countries": ["USA"], "directors": ["Beeban Kidron"], "fullplot": "After jointly winning a local drag queen pageant in New York City, Noxeema Jackson and Vida Boheme win the right and are given the round trip airfare to compete in the Drag Queen of America pageant in Hollywood, California. Noxeema sees herself as the next Dorothy Dandridge, who bucked the trend of most black American movie actresses of her time by never playing the slave house maid. Vida's style reflects her past of growing up in upper class suburban Pennsylvania. One of their fellow New York contestants, Chi-Chi Rodriguez, is a straight-talking but naive and inexperienced drag queen. Seeing that Chi-Chi needs some drag queen confidence (despite her bravada), Vida and a reluctant Noxeema decide to cash in their plane tickets and buy an older model Cadillac convertible and drive to Hollywood with Chi-Chi. Their drive takes them through much of the country where alternate lifestyles are less tolerated than they may be in New York or Los Angeles. The three have an extended stay in small town Snydersville, where their car breaks down. If they ever make it out of Snydersville, they may be the better for their stay by learning more about themselves while dealing with the issues of town residents and spending more time together. Their stay is made even more precarious when they find out that Sheriff Dollard, a homophobic, racist and sexist highway sheriff with who they had an earlier encounter, is on their tail.", "genres": ["Comedy", "Drama"], "imdb": {"id": 114682, "rating": 6.3, "votes": 19635}, "languages": ["English", "French", "Italian"], "lastupdated": "2015-09-01 01:18:41.757000000", "num_mflix_comments": 1, "plot": "Three drag queens travel cross-country until their car breaks down, leaving them stranded in a small town.", "poster": "https://m.media-amazon.com/images/M/MV5BYjZmOTU3MjYtY2NhNi00ZmMxLWE5ZDgtNGVlYjVmOWMxYzI4XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 810518400000, "runtime": 109, "title": "To Wong Foo Thanks for Everything, Julie Newmar", "tomatoes": {"critic": {"meter": 41, "numReviews": 32, "rating": 5.1}, "dvd": 1041897600000, "fresh": 13, "lastUpdated": 1441992096000, "production": "Universal Pictures", "rotten": 19, "viewer": {"meter": 71, "numReviews": 50374, "rating": 3.2}}, "type": "movie", "writers": ["Douglas Carter Beane"], "year": 1995}