{"_id": "573a1396f29313caabce4c18", "awards": {"nominations": 0, "text": "Nominated for 1 Oscar. Another 9 wins.", "wins": 10}, "cast": ["Max von Sydow", "Liv Ullmann", "Eddie Axberg", "Pierre Lindstedt"], "countries": ["Sweden"], "directors": ["Jan Troell"], "fullplot": "This film continues from where Utvandrarna (1971) left off. Starting a new life in the New World from almost nothing is not easy. The winters and summers are more extreme than in the Old World. But the immigrants are rewarded for their hard work. They now live a better life than they did in Sweden. Bad times also come, however. The civil war starts and the Sioux Indians make a bloody uprising against the white settlers. Karl-Oskar's family survives all these. His brother, Robert, decides to seek his fortune in the gold fields of California. He never reaches California but acquires some fortune from his boss who dies of yellow fever on the way to the gold fields. An immigrant Swede dupes him of this fortune. Robert returns to his brother where he dies from a disease contracted on the trip. Kristina, whose thoughts never leave Sweden, has several more births and gets pregnant again against the advice of her doctor. This last pregnancy kills her. The children grow up and take over the farm. Karl-Oskar becomes old and lonely. He spends his last days dreaming of his youth in the Old World.", "genres": ["Drama", "Western"], "imdb": {"id": 69035, "rating": 8, "votes": 2067}, "languages": ["English", "Swedish"], "lastupdated": "2015-09-17 04:45:53.080000000", "num_mflix_comments": 1, "plot": "The life of an immigrant family from Sweden in the Minnesota's forests, during mid 19th century", "poster": "https://m.media-amazon.com/images/M/MV5BNDU0MmI0YWUtMzZiZS00OTg5LWFjMWYtOWRiMmZiYmY5MjlkXkEyXkFqcGdeQXVyNzQxNDExNTU@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 67910400000, "runtime": 102, "title": "The New Land", "tomatoes": {"lastUpdated": 1441909273000, "viewer": {"meter": 88, "numReviews": 424, "rating": 4.1}}, "type": "movie", "writers": ["Bengt Forslund", "Vilhelm Moberg (novel)", "Jan Troell"], "year": 1972}