{"_id": "573a13d5f29313caabd9ac04", "awards": {"nominations": 1, "text": "2 wins & 1 nomination.", "wins": 2}, "cast": ["John Abraham", "Genelia D'Souza", "Raj Babbar", "Mohnish Bahl"], "countries": ["India"], "directors": ["Nishikant Kamat"], "fullplot": "Critically wounded and lying unconscious in a Mumbai hospital, ACP Yashvardhan of the Narcotics Control Bureau reflects on his life and his love-affair with Maya. With the assistance of the Commissioner as well as his colleagues, Atul, Kamlesh and Mahesh Pandey, and an informer, Arvind Shetty, he was able to apprehend drug-dealers in Kutch, Gujarat; Jalandhar, Punjab, as well as in Himachal Pradesh. Unknowingly, he paved the way for Vasu Anna Reddy to become the sole drug-dealer and invite his Mombasa-based brother, Vishnu, to join him. An encounter with the team kills Vasu, and some of the team gets suspended. A vengeful Vishnu decides to target the entire police unit as well as their respective families, and vows that he will not rest until he has killed them all. He starts with brutally killing Mahesh and his wife, Rachna, and then abducts Atul's wife, Swati - with a motive of forcing the former to do away with the remainder of this police team.", "genres": ["Action", "Crime", "Drama"], "imdb": {"id": 1992138, "rating": 6.1, "votes": 4127}, "languages": ["Hindi", "Panjabi", "Marathi", "English"], "lastupdated": "2015-09-07 00:59:42.160000000", "num_mflix_comments": 1, "plot": "A vengeful drug-dealer/gangster targets and terrorizes an entire police unit and their families.", "poster": "https://m.media-amazon.com/images/M/MV5BMTczOTYwODAyNV5BMl5BanBnXkFtZTcwNTU2MjQ5Ng@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1317340800000, "runtime": 137, "title": "Force", "tomatoes": {"lastUpdated": 1442337501000, "production": "Fox Searchlight", "viewer": {"meter": 55, "numReviews": 740, "rating": 3.3}, "website": "http://www.forcethemovie.com/"}, "type": "movie", "writers": ["Gautham Menon (original story by)", "Ritesh Shah"], "year": 2011}