{"_id": "573a1394f29313caabce0732", "awards": {"nominations": 0, "text": "Nominated for 1 Oscar. Another 3 wins.", "wins": 4}, "cast": ["Ray Salyer", "Gorman Hendricks", "Frank Matthews"], "countries": ["USA"], "directors": ["Lionel Rogosin"], "fullplot": "The Bowery is a neighborhood in New York City populated largely by the down and out, and largely by transients. Those that can work generally can only find short term employment on a day to day basis, their daily earnings which primarily go into booze. Those that can't or won't work generally sponge off whoever they can, especially for that next drink. New to the neighborhood is Ray, who most recently had been working the rails in New Jersey. He is one of those who can and still does work, but like the others spends what little money he has on booze, which means he usually sleeps on the streets in a drunken stupor. The only person he would probably consider a friend in the neighborhood is the elderly Gorman, who in turn takes advantage of his new friend at whatever opportunity. When he's sober, Ray understands that alcohol is ruining his life, and as such states that he will try to stop drinking. The questions become whether Ray has either the will or the support necessary to fulfill this goal, or whether he is destined to become another Gorman and the legions like Gorman in the Bowery.", "genres": ["Documentary"], "imdb": {"id": 50800, "rating": 7.6, "votes": 467}, "languages": ["English"], "lastupdated": "2015-07-15 00:30:58.303000000", "num_mflix_comments": 2, "plot": "The Bowery is a neighborhood in New York City populated largely by the down and out, and largely by transients. Those that can work generally can only find short term employment on a day to...", "poster": "https://m.media-amazon.com/images/M/MV5BNTI0NTUyODE5OF5BMl5BanBnXkFtZTcwNjk0MzUyNw@@._V1_SY1000_SX677_AL_.jpg", "released": -235267200000, "runtime": 65, "title": "On the Bowery", "tomatoes": {"critic": {"meter": 95, "numReviews": 22, "rating": 9.1}, "dvd": 1333324800000, "fresh": 21, "lastUpdated": 1431022900000, "production": "Milestone Film", "rotten": 1, "viewer": {"meter": 89, "numReviews": 235, "rating": 3.9}, "website": "http://www.ontheboweryfilm.com/"}, "type": "movie", "year": 1956}