{"_id": "573a13c1f29313caabd639e9", "awards": {"nominations": 8, "text": "5 wins & 8 nominations.", "wins": 5}, "cast": ["Zachary Gordon", "Robert Capron", "Rachael Harris", "Steve Zahn"], "countries": ["USA"], "directors": ["Thor Freudenthal"], "fullplot": "To Greg Heffley, middle school is the dumbest idea ever invented. It's a place rigged with hundreds of social landmines, not the least of which are morons, wedgies, swirlies, bullies, lunchtime banishment to the cafeteria floor - and a festering piece of cheese with nuclear cooties. To survive the never-ending ordeal and attain the recognition and status he feels he so richly deserves, Greg devises an endless series of can't-miss schemes, all of which, of course, go awry. And he's getting it all down on paper, via a diary - \"it's NOT a diary, it's a journal!\" Greg insists, preferring the less-sissyfied designation - filled with his opinions, thoughts, tales of family trials and tribulations, and (would-be) schoolyard triumphs. \"One day when I'm famous,\" writes Greg, \"I'll have better things to do than answer people's stupid questions all day.\" So was born the Wimpy Kid's diary.", "genres": ["Comedy", "Family"], "imdb": {"id": 1196141, "rating": 6.2, "votes": 29446}, "languages": ["English"], "lastupdated": "2015-09-13 00:16:17.293000000", "metacritic": 56, "plot": "The adventures of a teenager who is fresh out and in Middle School, where he has to learn the consequences and responsibility to survive the year.", "poster": "https://m.media-amazon.com/images/M/MV5BMTg3NzQ2NDgyNF5BMl5BanBnXkFtZTcwMDc1NzIyMw@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 1268956800000, "runtime": 94, "title": "Diary of a Wimpy Kid", "tomatoes": {"boxOffice": "$64.0M", "consensus": "Unlike its bestselling source material, Diary of a Wimpy Kid fails to place a likable protagonist at the center of its middle-school humor -- and its underlying message is drowned out as a result.", "critic": {"meter": 53, "numReviews": 105, "rating": 5.5}, "dvd": 1280793600000, "fresh": 56, "lastUpdated": 1442078353000, "production": "20th Century Fox", "rotten": 49, "viewer": {"meter": 49, "numReviews": 102603, "rating": 3.2}, "website": "http://www.diaryofawimpykidmovie.com/"}, "type": "movie", "writers": ["Jackie Filgo (screenplay)", "Jeff Filgo (screenplay)", "Gabe Sachs (screenplay)", "Jeff Judah (screenplay)", "Jeff Kinney (book)"], "year": 2010}