{"_id": "573a13d5f29313caabd9a45b", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Eric Schaeffer", "Lizzie Brocherè", "Marie Luneau", "Christian Mulot"], "countries": ["France"], "directors": ["Eric Schaeffer"], "fullplot": "WINTER is a dangerous, sexy, poignant and at times darkly funny story about two people who desperately want intimacy but have fashioned lives of reclusivity and emotional fracture which ultimately spells the doom of their great love. WINTER begins with Michael, in his mid forties, suicidal about his writing career, which once flourished and now is on a downturn. He leaves his home in New York and goes to Paris in hopes of igniting his passion for writing and life. He also has a penchant for S and M. Soon after is arrival he meets Sophie, a sexy, smart, soulful, nurse who helps dying people transition to the after world. She and Michael instantly have chemistry albeit combative. Sophie has a secret. Her other job is being a dominatrix. Throughout the film, Sophie is nursing a little girl, Anais, who is dying of leukemia.", "genres": ["Drama"], "imdb": {"id": 1986204, "rating": 6.6, "votes": 662}, "languages": ["English", "French"], "lastupdated": "2015-08-03 00:58:02.880000000", "metacritic": 19, "plot": "WINTER is a dangerous, sexy, poignant and at times darkly funny story about two people who desperately want intimacy but have fashioned lives of reclusivity and emotional fracture which ...", "poster": "https://m.media-amazon.com/images/M/MV5BNjQ1NTYwMzMwN15BMl5BanBnXkFtZTcwNjIxNTUzNw@@._V1_SY1000_SX677_AL_.jpg", "released": 1327622400000, "runtime": 132, "title": "After Fall, Winter", "tomatoes": {"critic": {"meter": 13, "numReviews": 8, "rating": 3.6}, "dvd": 1357603200000, "fresh": 1, "lastUpdated": 1440009924000, "production": "Independent Pictures", "rotten": 7, "viewer": {"meter": 68, "numReviews": 576, "rating": 3.7}, "website": "http://mrericschaeffer.com/afterfallwinter/1/"}, "type": "movie", "writers": ["Eric Schaeffer"], "year": 2011}