{"_id": "573a1394f29313caabce048d", "awards": {"nominations": 2, "text": "Nominated for 1 Oscar. Another 2 wins & 2 nominations.", "wins": 3}, "cast": ["Pat Boone", "Shirley Jones", "Dolores Michaels", "Arthur O'Connell"], "countries": ["USA"], "directors": ["Henry Levin"], "fullplot": "Chicagoan Nick Conover received a suspended sentence for being caught joyriding in a stolen car, with his driver's license suspended indefinitely. Nicky's problems are seen as running around with the wrong crowd. Nicky's sentence is predicated on him living at the run down Kentucky horse farm of his Aunt Henrietta and Uncle Jed Bruce, who he hasn't seen since he was a child. The judge figured this more wholesome environment would get Nicky away from his bad influences. Henrietta wants to be a part of Nicky's salvation, but Jed doesn't trust the fact of a delinquent being under his roof, although he has other more personal reasons not having to do with Nicky for his initially antagonistic relationship with his nephew. Nicky doesn't rebel against farm life, but ends up gravitating toward anything mechanical, especially the sports car owned by sophisticated Fran Templeton - the elder daughter of Dan Templeton, who owns the luxurious neighboring horse farm - and by association Fran herself. With his infatuation with Fran, Nicky doesn't see that Fran's younger sister, the tomboyish and horse loving Liz Templeton, hangs around him because she is falling for him. It isn't until a couple of incidents involving Jed's only remaining horse, the spirited Tugfire, occur that Nicky begins to see his uncle and Liz in a different light. But Nicky's past catching up with him may get in the way of a Nicky/Liz happy ending.", "genres": ["Comedy", "Drama", "Musical"], "imdb": {"id": 50135, "rating": 6.1, "votes": 400}, "languages": ["English"], "lastupdated": "2015-08-26 01:09:06.900000000", "plot": "A young man visiting his relatives' farm in Kentucky falls in love with their neighbor.", "poster": "https://m.media-amazon.com/images/M/MV5BMjExNTczMDM3OF5BMl5BanBnXkFtZTcwMTEyNDYyMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "UNRATED", "released": -374544000000, "runtime": 97, "title": "April Love", "tomatoes": {"lastUpdated": 1441052549000, "production": "20th Century Fox Film Corporation", "viewer": {"meter": 33, "numReviews": 76, "rating": 3.6}}, "type": "movie", "writers": ["George Agnew Chamberlain (novel)", "Winston Miller"], "year": 1957}