{"_id": "573a13b3f29313caabd3baad", "awards": {"nominations": 2, "text": "5 wins & 2 nominations.", "wins": 5}, "cast": ["Aamir Khan", "Kajol", "Rishi Kapoor", "Tabu"], "countries": ["India"], "directors": ["Kunal Kohli"], "fullplot": "Choices--to choose between right or wrong is simple, but what defines one's life is the decision between the greater of two goods or the lesser of two evils. This is the advice that Zooni Ali Beg receives from her father, just as she is about to venture out into the world on her own for the very first time. Little does she know that these very words will shape her life. Zooni, a blind Kashmiri girl, meets Rehan Qadri, a local tour guide and an incorrigible flirt, who goes from city to city exploring their architecture--and also their women. Her friends warn her against this good-for-nothing roadside Romeo, but she chooses to ignore them. She is not one to be protected. It is now her time discover life, and love. Is this really the right choice? Rehan is fascinated by Zooni. He truly wants her to see life as it should be seen, in its many colors--and as he promises her, the time spent with him will be the most precious in all her life. Zooni sees Delhi, life and love like she never has before, because of Rehan. What Zooni doesn't know is that Rehan has another side of his life that he has kept from her--something that can not only change her life, but can also destroy it.", "genres": ["Drama", "Romance", "Thriller"], "imdb": {"id": 439662, "rating": 7.2, "votes": 18525}, "languages": ["Hindi", "Indonesian"], "lastupdated": "2015-08-13 00:17:48.503000000", "plot": "Set in Delhi and the Kashmir Valley, a blind woman falls in love with a rakish tour guide who hides a terrible secret...", "poster": "https://m.media-amazon.com/images/M/MV5BYzhkNTYzMzktNmZlZi00YmU4LTlmYjgtZTJmYWJjZWI5ZGRkXkEyXkFqcGdeQXVyNTkzNDQ4ODc@._V1_SY1000_SX677_AL_.jpg", "released": 1148601600000, "runtime": 168, "title": "Fanaa", "tomatoes": {"boxOffice": "$2.0M", "critic": {"meter": 100, "numReviews": 6, "rating": 6.5}, "dvd": 1159228800000, "fresh": 6, "lastUpdated": 1442140600000, "production": "Yash Raj Films", "rotten": 0, "viewer": {"meter": 78, "numReviews": 9356, "rating": 3.9}, "website": "http://www1.yashrajfilms.com/fanaamicro/index.asp?popid=0"}, "type": "movie", "writers": ["Shibani Bathija (screenplay)", "Shibani Bathija (story)", "Shibani Bathija"], "year": 2006}