{"_id": "573a1391f29313caabcd7f07", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Harold Lloyd", "Jobyna Ralston", "Brooks Benedict", "James Anderson"], "countries": ["USA"], "directors": ["Fred C. Newmeyer", "Sam Taylor"], "fullplot": "Harold Lamb's dream is to go to college and become the most popular student on campus, much like the character Speedy played by actor Lester Laurel in the movie \"The College Hero\". Accepted into Tate College, Harold plans on emulating Speedy, including giving himself the nickname Speedy, to gain that popularity, not realizing that if he does so, he will be more the buffoon than the hero. To be the most popular student, he will have to outdo the current most popular student, football captain Chet Trask. Unaware Speedy's task is made all the more difficult when one of the upperclassmen, seeing how hard Speedy is trying to impress, does whatever he can to make Speedy look all the more ridiculous, all the while Speedy believing he is achieving his dream. The bully's efforts are made all the more easy as Speedy is able to buy his way to seeming popularity with the small nest egg he was able to accumulate from work. The one thing that Speedy may not be able to buy is his way onto the football team, which he is convinced is the only surefire way to becoming the campus hero, despite not realizing that he truly is not the football type. While Speedy remains unaware how he truly looks to his classmates, Peggy, the daughter of the owner of the rooming house where he is staying, is aware, she who is in love with him, and he with her. The love of a good woman may be able to provide Speedy with a clearer understanding of who he truly should be to impress, and/or get his mind focused on other things other than being everyone's best friend.", "genres": ["Comedy", "Family", "Sport"], "imdb": {"id": 15841, "rating": 7.6, "votes": 3377}, "languages": ["English"], "lastupdated": "2015-08-19 00:30:51.783000000", "plot": "Nerdy college student will do anything to become popular on campus.", "poster": "https://m.media-amazon.com/images/M/MV5BMGJmNTE4MGYtZWY2My00YmUzLWFiOWUtY2VkNmEzZGQ1ZGViXkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": -1397433600000, "runtime": 76, "title": "The Freshman", "tomatoes": {"critic": {"meter": 92, "numReviews": 12, "rating": 8.5}, "dvd": 1395705600000, "fresh": 11, "lastUpdated": 1441046124000, "production": "Criterion Collection", "rotten": 1, "viewer": {"meter": 78, "numReviews": 255, "rating": 3.9}}, "type": "movie", "writers": ["Sam Taylor (story)", "Ted Wilde (story)", "John Grey (story)", "Tim Whelan (story)"], "year": 1925}