{"_id": "573a13a1f29313caabd082de", "awards": {"nominations": 0, "text": "6 wins.", "wins": 6}, "cast": ["Barbara Hershey"], "countries": ["Austria"], "directors": ["Peter Tscherkassky"], "fullplot": "A premonition of a horror film, lurking danger: A house - at night, slightly tilted in the camera's view, eerily lit - surfaces from the pitch black, then sinks back into it again. A young woman begins to move slowly towards the building. She enters it. The film cuts crackle, the sound track grates, suppressed, smothered. Found footage from Hollywood forms the basis for the film. The figure who creeps through the images, who is thrown around by them and who attacks them is Barbara Hershey. Tscherkassky's dramatic frame by frame re-cycling, re-copying and new exposure of the material, folds the images and the rooms into each other. It removes the ground from under the viewer's feet and splits faces, like in a bad dream. From the off, from outer space, foreign bodies penetrate the images and cause the montage to become panic stricken. The outer edges of the film image, the empty perforations and the skeletons of the optical sound track rehearse an invasion. They puncture the anyway indeterminate action of the film. Cinema tearing itself apart, driven by the expectation of a final ecstasy. Glass walls explode, furniture topples over. Tscherkassky puts his heroine under pressure, drives her to extremes. Time and time again she appears to hit out against the cinematic apparatus, until the images begin to stutter, are thrown off track...", "genres": ["Animation", "Short", "Horror"], "imdb": {"id": 219964, "rating": 7.2, "votes": 906}, "lastupdated": "2015-08-02 00:05:30.700000000", "num_mflix_comments": 1, "plot": "A premonition of a horror film, lurking danger: A house - at night, slightly tilted in the camera's view, eerily lit - surfaces from the pitch black, then sinks back into it again. A young ...", "runtime": 10, "title": "Outer Space", "tomatoes": {"lastUpdated": 1439836494000, "viewer": {"meter": 80, "numReviews": 97, "rating": 3.9}}, "type": "movie", "writers": ["Peter Tscherkassky"], "year": 1999}