{"_id": "573a13d2f29313caabd920ae", "awards": {"nominations": 9, "text": "5 wins & 9 nominations.", "wins": 5}, "cast": ["Rutger Hauer", "Reinout Scholten van Aschat", "Gijs Naber", "Teun Kuilboer"], "countries": ["Netherlands"], "directors": ["Maarten Treurniet"], "fullplot": "Rem's Amsterdam family lives a nightmare since his father got an alcohol abuse problem related to working for multinational Heineken's brewery distribution and was fired before it became terminal. Rem learns that his bully work colleague Cor is planning to kidnap a businessman with two freak acolytes. Rem convinces them to let him in and aim higher, beer king Alfred Heineken himself, after being nearly run over and left with a token banknote by his driver. They pretend having taken Heineken and his driver to Germany and cash a huge ransom. Heineken hires private detectives and pushes the Dutch and French police, who soon capture the gang. The faulty extradition treaty, up for revision but too late, prevents a Dutch trail for Rem and Cor, but the French authorities fly them to the French half of Antillian island St.Martin and Heineken's cash is spread liberally in a plot to drive the pair over the island border, on Dutch soil.", "genres": ["Crime", "History", "Thriller"], "imdb": {"id": 1846526, "rating": 6.5, "votes": 3911}, "languages": ["Dutch", "English", "French"], "lastupdated": "2015-08-31 00:52:59.043000000", "plot": "A bold, amateur kidnapping goes wildly awry in this fictionalized account of beer magnate Freddy Heineken's 1983 abduction, which would go on to become one of The Netherlands' most infamous crimes.", "poster": "https://m.media-amazon.com/images/M/MV5BMTA0MDc0ODI3NzJeQTJeQWpwZ15BbWU3MDAwMzUwNTc@._V1_SY1000_SX677_AL_.jpg", "released": 1319673600000, "runtime": 127, "title": "The Heineken Kidnapping", "tomatoes": {"lastUpdated": 1429906162000, "production": "Relativity Media", "viewer": {"numReviews": 377, "rating": 4.2}}, "type": "movie", "writers": ["Maarten Treurniet", "Kees van Beijnum"], "year": 2011}