{"_id": "573a13a7f29313caabd1b5c0", "awards": {"nominations": 1, "text": "1 win & 1 nomination.", "wins": 1}, "cast": ["Egbert Jan Weeber", "Katja Schuurman", "Johnny de Mol", "Edwin Jonker"], "countries": ["Netherlands", "Germany"], "directors": ["Pollo de Pimentel"], "fullplot": "Berry is a nice teenage boy from a Dutch suburban villa family, who alas abuses the excessive liberty granted by his mostly absent pa, an actor, committing truancy from his elite school in bad down-town company. Despite this dwindling future perspectives, his cute and cocky appearance makes him quite a lady-killer; Berry counts himself quite lucky to become the instantly intimate boyfriend of crazy Thera, a junkie who stopped modeling professionally or anything else productive. The pair engages in a passionate affair, and impulsively decides to embark on a 'world tour' to their arbitrary favorite destinations -Barcelona, Denver and Tonga- which they finance by cashing rent and warrants from many interested persons for the fine residence of an old lady Thera was in fact just house-sitting. After Berry says goodbye indefinitely to his well-groomed and -behaved elder brother Rein while showering together, the 'elopers' start spending the ill-gotten funds like water in a luxury hotel, but even there the flimsy foundation of their purposeless relationship starts crumbling, as does drug-addicted Thera's health...", "genres": ["Drama", "Romance"], "imdb": {"id": 301245, "rating": 5.4, "votes": 1191}, "languages": ["Dutch", "English", "French"], "lastupdated": "2015-09-15 03:35:30.010000000", "plot": "A young dropout falls in love with a nightclub dancer...", "poster": "https://m.media-amazon.com/images/M/MV5BMTQxNjIzNzYwMF5BMl5BanBnXkFtZTcwMDEzNzUyMQ@@._V1_SY1000_SX677_AL_.jpg", "released": 1031184000000, "runtime": 99, "title": "Oysters at Nam Kee's", "tomatoes": {"lastUpdated": 1437418577000, "viewer": {"numReviews": 16, "rating": 3.1}}, "type": "movie", "writers": ["Hans de Wolf", "Kees van Beijnum (novel)"], "year": 2002}