{"_id": "573a13acf29313caabd2970e", "awards": {"nominations": 3, "text": "3 nominations.", "wins": 0}, "cast": ["Benjamin Fletcher", "Nicole Frilot", "Roxanne Frilot", "David Ingber"], "countries": ["USA"], "directors": ["Rick de Oliveira"], "fullplot": "After a nationwide casting search including college campuses across the country--Arizona State University, University of Oklahoma, University of Vermont, University of Wisconsin at Madison, University of Georgia, Texas Tech, Boston University and Washington State University--the filmmakers cast a unique collection of real people ready to explore reality's barriers beyond the limits of television, while on the ultimate Spring Break vacation, with surprising results. Designed to be the first true reality feature film, six camera crews followed the cast--made up of 16 American college students--and filmed their exploits as they immersed and indulged in the Spring Break revelry of Cancun, Mexico. Filmed 24 hours a day over the course of a week in March 2003, the movie was shot on location and reveals the students' exploits through interviews and planned group activities, as well as through their own spontaneous adventures.", "genres": ["Documentary"], "imdb": {"id": 360916, "rating": 2.7, "votes": 3600}, "languages": ["English"], "lastupdated": "2015-08-09 00:53:50.350000000", "metacritic": 34, "plot": "Sixteen American college students drink, flirt, fight and canoodle during their Spring Break vacation in Cancun, Mexico.", "poster": "https://m.media-amazon.com/images/M/MV5BMTk1NDA0ODUyOF5BMl5BanBnXkFtZTYwMzI4NTA3._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1051228800000, "runtime": 96, "title": "The Real Cancun", "tomatoes": {"boxOffice": "$3.7M", "consensus": "The footage is predictable and rather tame, and most of the people are uninteresting.", "critic": {"meter": 35, "numReviews": 88, "rating": 4.2}, "dvd": 1057017600000, "fresh": 31, "lastUpdated": 1438109470000, "production": "New Line Cinema", "rotten": 57, "viewer": {"meter": 28, "numReviews": 4921, "rating": 2.2}, "website": "http://www.therealcancun.com"}, "type": "movie", "writers": ["Brian Caldirola"], "year": 2003}