{"_id": "573a13acf29313caabd26963", "awards": {"nominations": 2, "text": "1 win & 2 nominations.", "wins": 1}, "cast": ["èlodie Bouchez", "Didda Jènsdèttir", "Baltasar Kormèkur", "Ingvar Eggert Sigurèsson"], "countries": ["Belgium", "Iceland", "France"], "directors": ["Sèlveig Anspach"], "fullplot": "A very sad but genuinely human story. The middle-aged Icelandic woman Loa is seriously mentally ill. Finally it turns out that her husband is a latent alcoholic who submits to his addiction whenever Loa leaves him. When she is at home, she is living a normal life and taking care of her children. Sometimes she cannot stand it any longer and just runs away. During one such tour she was eventually found in England. During the tour of the present movie she has ended up in a mental hospital in France, without identification papers and apparently being mute. The young psychiatrist Cora is in charge of her and applies unorthodox methods. She is the only one who suspected that Loa might not be French. Interpol soon identified Loa and on Cora's day off she was sent home. Cora immediately flows to Iceland, where everyone including Loa's husband thinks she is a tourist wanting to see the volcano. Loa is prepared to follow Cora back to the French hospital. Unfortunately, the local doctor happens to see them on their way to the boat. He knows nothing of psychiatry and prevents what he perceives as 'criminal kidnapping'. The movie ends with a complete failure for both Loa and Cora.", "genres": ["Drama"], "imdb": {"id": 348876, "rating": 6.5, "votes": 177}, "languages": ["French", "English"], "lastupdated": "2015-08-19 00:24:05.983000000", "num_mflix_comments": 1, "plot": "A very sad but genuinely human story. The middle-aged Icelandic woman Loa is seriously mentally ill. Finally it turns out that her husband is a latent alcoholic who submits to his addiction...", "poster": "https://m.media-amazon.com/images/M/MV5BMTQzMTUxNDQ3NF5BMl5BanBnXkFtZTgwMDkxMDI2MTE@._V1_SY1000_SX677_AL_.jpg", "released": 1063929600000, "runtime": 91, "title": "Stormy Weather", "tomatoes": {"lastUpdated": 1438887936000, "viewer": {"meter": 50, "numReviews": 52, "rating": 3.8}}, "type": "movie", "writers": ["Sèlveig Anspach", "Roger Bohbot", "Pierre-Erwan Guillaume", "Cècile Vargaftig"], "year": 2003}