{"_id": "573a13a1f29313caabd06ca0", "awards": {"nominations": 22, "text": "11 wins & 22 nominations.", "wins": 11}, "cast": ["Amitabh Bachchan", "Shah Rukh Khan", "Uday Chopra", "Jugal Hansraj"], "countries": ["India"], "directors": ["Aditya Chopra"], "fullplot": "In India, open romance is forbidden, as is showing affection in public. A college principal named Narayan is a strong believer in this, aware that a male student named Vicky is in love with Ishika; while another male student is hopelessly in love with Sanjana; and a third man named Karan is in love with a married woman named Kiran. No amount of persuasion can get Narayan to change his mind. Then the college recruits a music teacher named Raj, who eventually starts fanning the flames of love among the students, much to Narayan's chagrin, anger, and displeasure. Things get worse when Narayan finds out that Raj was the very man who fell in love with his daughter who eventually committed suicide when he didn't grant them permission to get married. Will the six young people be also heartbroken by Narayan, and if so, who will be the first to kill himself or herself?", "genres": ["Musical", "Drama", "Romance"], "imdb": {"id": 213890, "rating": 7.1, "votes": 15620}, "languages": ["Hindi"], "lastupdated": "2015-09-13 00:08:23.040000000", "num_mflix_comments": 2, "plot": "In India, open romance is forbidden, as is showing affection in public. A college principal named Narayan is a strong believer in this, aware that a male student named Vicky is in love with...", "poster": "https://m.media-amazon.com/images/M/MV5BYzU5ZGJiYzQtYjA2Yi00MmNmLTlmZmYtZTcxZjBhZGM1NDcxXkEyXkFqcGdeQXVyNTkzNDQ4ODc@._V1_SY1000_SX677_AL_.jpg", "released": 972604800000, "runtime": 216, "title": "Mohabbatein", "tomatoes": {"dvd": 1066089600000, "lastUpdated": 1442435503000, "viewer": {"meter": 81, "numReviews": 8058, "rating": 4}}, "type": "movie", "writers": ["Aditya Chopra (dialogue)", "Aditya Chopra (screenplay)", "Aditya Chopra (story)", "Aditya Chopra"], "year": 2000}