{"_id": "573a139cf29313caabcf5a48", "awards": {"nominations": 1, "text": "1 win & 1 nomination.", "wins": 1}, "cast": ["Cathy Moriarty", "Shelley Duvall", "Teri Garr", "George Hamilton"], "countries": ["USA"], "directors": ["Sean McNamara"], "fullplot": "Living under the care of his uncles: The Ghostly Trio, Casper has been letting them push him around and making his afterlife miserable by having him do choirs for them while they are scaring \"fleshes\" for their amusement. Whenever Casper would try to stand up to them, he gets to timid to do so. While they are on vacation in a place called Sunnybrite Resorts, Casper meets with a good little witch girl name Wendy, whom she and her bewitching aunts are on the run from an evil warlock: Desmond Spellman who attempts on destroying her after discovering that she will be a greater witch than him. Like Casper, Wendy is a kind witch who also have her relatives mistreating her. Casper and Wendy have become good friends as they discover that ghosts and witches are each others worst enemies, so they come up with a plan to make their elders pair up to one another. Once Desmond comes into town, he determines to destroy Wendy at once. It is now up to Casper to do what he can to save his friend from the villainous warlock.", "genres": ["Adventure", "Comedy", "Family"], "imdb": {"id": 140883, "rating": 5.3, "votes": 4376}, "languages": ["English"], "lastupdated": "2015-08-20 00:34:57.783000000", "plot": "Casper, a ghost, teams up with Wendy, a witch, against an evil warlock.", "poster": "https://m.media-amazon.com/images/M/MV5BMTg5NDA4MTI4Ml5BMl5BanBnXkFtZTcwOTI1NjAzMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 910742400000, "runtime": 90, "title": "Casper Meets Wendy", "tomatoes": {"critic": {"meter": 20, "numReviews": 5, "rating": 4}, "dvd": 1031011200000, "fresh": 1, "lastUpdated": 1440097202000, "production": "Saban Entertainment", "rotten": 4, "viewer": {"meter": 46, "numReviews": 65774, "rating": 2.9}}, "type": "movie", "writers": ["Jymn Magon (screenplay)", "Jymn Magon (story)", "Rob Kerchner (story)"], "year": 1998}