{"_id": "573a13b7f29313caabd4a594", "awards": {"nominations": 63, "text": "Nominated for 1 Oscar. Another 32 wins & 63 nominations.", "wins": 33}, "cast": ["Josef Altin", "Mina E. Mina", "Aleksandar Mikic", "Sarah-Jeanne Labrosse"], "countries": ["USA", "UK", "Canada"], "directors": ["David Cronenberg"], "fullplot": "In London, the Russian pregnant teenager Tatiana arrives bleeding in a hospital, and the doctors save her baby only. The Russian descendant midwife Anna Khitrova finds Tatiana's diary written in Russian language in her belongings and decided to find her family to deliver the baby, she brings the diary home and ask her uncle Stepan to translate the document. Stepan refuses, but Anna finds a card of a restaurant owned by the Russian Semyon inside the diary and she visits the old man trying to find a lead to contact Tatiana's family. When she mentions the existence of the diary, Semyon immediately offers to translate the document. However, Stepan translates part of the diary and Anna discovers that Semyon and his sick son Kirill had raped Tatiana when she was fourteen years old and forced her to work as prostitute in a brothel of their own. Further, Semyon is the dangerous boss of the Russian mafia \"Vory v Zakone\", jeopardizing the safety of Anna and her family. Meanwhile, Semyon's driver Nikolai Luzhin gets close to Kirill and Semyon, climbing positions in the criminal organization, but he helps Anna, her family and the baby.", "genres": ["Crime", "Thriller"], "imdb": {"id": 765443, "rating": 7.7, "votes": 179733}, "languages": ["English", "Russian", "Turkish", "Ukrainian", "Urdu"], "lastupdated": "2015-09-10 17:07:42.297000000", "metacritic": 82, "plot": "A Russian teenager living in London who dies during childbirth leaves clues to a midwife in her journal that could tie her child to a rape involving a violent Russian mob family.", "poster": "https://m.media-amazon.com/images/M/MV5BMTcwMzU0OTY3NF5BMl5BanBnXkFtZTYwNzkwNjg2._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1190332800000, "runtime": 100, "title": "Eastern Promises", "tomatoes": {"boxOffice": "$17.1M", "consensus": "David Cronenberg triumphs again, showcasing the Viggo Mortensen's onscreen prowess in a daring performance. Bearing the trademarks of psychological drama and gritty violence, Eastern Promises is a very compelling crime story.", "critic": {"meter": 89, "numReviews": 194, "rating": 7.6}, "dvd": 1198368000000, "fresh": 173, "lastUpdated": 1442079447000, "production": "Focus Features", "rotten": 21, "viewer": {"meter": 83, "numReviews": 147800, "rating": 3.8}, "website": "http://www.focusfeatures.com/easternpromises/"}, "type": "movie", "writers": ["Steven Knight (screenplay)"], "year": 2007}