{"_id": "573a139ef29313caabcfbad2", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Fabrizio Ambrassa", "Fabio Biaggi", "Aldo", "Saturno Brioschi"], "countries": ["Italy"], "directors": ["Aldo", "Giacomo", "Giovanni", "Massimo Venier"], "fullplot": "Bancomat è un piccolo truffatore, \"specializzato\" in carte di credito. Una mattina deve essere scortato dal carcere al tribunale da un giovane poliziotto, frustrato aspirante scrittore. Per caso quest'ultimo si trova disarmato dal carcerato ed in sua balia. Nel frattempo arriva un altro giovane, aspirante inventore di giocattoli, che vorrebbe denunciare al poliziotto il furto della sua auto, ma viene sequestrato anche lui. La situazione precipita : un'altra auto della polizia si accorge dell'accaduto e comincia l'inseguimento. Ne succedono di tutti i colori : gli inseguiti vengono dati per morti nell'esplosione dell'auto, si trovano a dormire in un cimitero e prendono i vestiti ad un cadavere, incontrano una ragazza...particolare, che cambierè la loro vita. Continuano il tragitto insieme e diventano amici, scoprendo alla fine che......non tutto è quello che sembra ! Cosè è la vita !", "genres": ["Comedy", "Adventure"], "imdb": {"id": 166556, "rating": 6.8, "votes": 2316}, "languages": ["Italian"], "lastupdated": "2015-09-10 17:50:49.480000000", "num_mflix_comments": 1, "plot": "Bancomat è un piccolo truffatore, \"specializzato\" in carte di credito. Una mattina deve essere scortato dal carcere al tribunale da un giovane poliziotto, frustrato aspirante scrittore. Per...", "poster": "https://m.media-amazon.com/images/M/MV5BMTc5MjMyNTUwOV5BMl5BanBnXkFtZTcwODE0NDQzMQ@@._V1_SY1000_SX677_AL_.jpg", "released": 913939200000, "runtime": 108, "title": "Cosè è la vita", "tomatoes": {"lastUpdated": 1440441632000, "viewer": {"meter": 56, "numReviews": 134, "rating": 3.3}}, "type": "movie", "writers": ["Aldo", "Giovanni", "Giacomo", "Massimo Venier", "Gino", "Michele", "Giorgio Gherarducci"], "year": 1998}