{"_id": "573a1399f29313caabceeab9", "awards": {"nominations": 7, "text": "2 wins & 7 nominations.", "wins": 2}, "cast": ["Tim Allen", "Judge Reinhold", "Wendy Crewson", "Eric Lloyd"], "countries": ["USA"], "directors": ["John Pasquin"], "fullplot": "Divorcee Scott Calvin is disgusted to learn that his ex and her husband have tried - and failed - to break it easy to their 6-year-old son Charlie that Santa isn't real. On Christmas Eve, Scott reads The Night Before Christmas... then receives an unexpected visitor on his roof. When he's startled by Scott's calling out and falls, the Santa impersonator disappears, leaving only an 8-reindeer sleigh and a suit with instructions to put it on if he's involved in an accident. Scott does, and is transported around the town dropping gifts through chimneys until he's taken to the North Pole and informed by a group who claim they're elves that he is now Santa. Charlie is proud of his dad's new job, though Scott's convinced it's a dream. Until his hair turns white, his beard refuses to stay shaved, he gains weight inexplicably, even for his sudden love of junk food... Now he's accepted it, there's just one problem: how to keep it secret from his disbelieving family?", "genres": ["Comedy", "Drama", "Family"], "imdb": {"id": 111070, "rating": 6.3, "votes": 57430}, "languages": ["English", "Spanish"], "lastupdated": "2015-08-19 00:02:48.953000000", "metacritic": 57, "num_mflix_comments": 1, "plot": "When a man inadvertantly kills Santa on Christmas Eve, he finds himself magically recruited to take his place.", "poster": "https://m.media-amazon.com/images/M/MV5BMTZlNzk1MjItYjJlYy00MTAxLWJkNjEtZmNiNmVlNjQ4NDE5XkEyXkFqcGdeQXVyMzI0NDc4ODY@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 784512000000, "runtime": 97, "title": "The Santa Clause", "tomatoes": {"consensus": "The Santa Clause is utterly undemanding, but it's firmly rooted in the sort of good old-fashioned holiday spirit missing from too many modern yuletide films.", "critic": {"meter": 75, "numReviews": 52, "rating": 6}, "dvd": 908236800000, "fresh": 39, "lastUpdated": 1442080509000, "production": "Buena Vista Distribution Compa", "rotten": 13, "viewer": {"meter": 64, "numReviews": 368429, "rating": 3.1}}, "type": "movie", "writers": ["Leo Benvenuti", "Steve Rudnick"], "year": 1994}