{"_id": "573a13ddf29313caabdb39ff", "awards": {"nominations": 3, "text": "3 nominations.", "wins": 0}, "cast": ["Josefine Preuè", "Florian Bartholomèi", "Uwe Kockisch", "Johannes Silberschneider"], "countries": ["Germany"], "directors": ["Felix Fuchssteiner"], "fullplot": "Gwendolyn Shepherd is actually a very normal 16-year-old teen. What's annoying is that her family definitely has a tad too many secrets. They all have to do with the time-travel gene that is passed down in the family. Everyone is certain that Gwen's cousin Charlotte has the gene, and so everything is all Charlotte, all the time. Until the day Gwen, out of the clear blue sky, suddenly finds herself in London at the end of the 19th century. She knows right away that she, and not Charlotte, was born to be a time traveler - even if she could certainly do without it. Just as she could do without Charlotte's arrogant boyfriend Gideon de Villiers, with whom she now has to forge an alliance in order to clear up the biggest secret of her family history. One thing is clear: she will do everything possible to solve the ancient mysteries. What isn't clear is that one should not fall in love between the times. For that really makes things complicated!", "genres": ["Drama", "Fantasy", "Mystery"], "imdb": {"id": 2418558, "rating": 6.1, "votes": 4133}, "languages": ["German"], "lastupdated": "2015-08-21 00:10:17.907000000", "num_mflix_comments": 1, "plot": "Gwendolyn Shepherd is actually a very normal 16-year-old teen. What's annoying is that her family definitely has a tad too many secrets. They all have to do with the time-travel gene that ...", "poster": "https://m.media-amazon.com/images/M/MV5BMjE5NjM0MDQwN15BMl5BanBnXkFtZTcwMjY3NzQxOQ@@._V1_SY1000_SX677_AL_.jpg", "released": 1363219200000, "runtime": 122, "title": "Rubinrot", "tomatoes": {"lastUpdated": 1440346998000, "production": "Lieblingsfilm", "viewer": {"numReviews": 97, "rating": 3.5}}, "type": "movie", "writers": ["Katharina Schède (screenplay)", "Kerstin Gier (novel)"], "year": 2013}