{"_id": "573a13c9f29313caabd7a35d", "awards": {"nominations": 21, "text": "Won 1 Oscar. Another 37 wins & 21 nominations.", "wins": 38}, "cast": ["Ewan McGregor", "Christopher Plummer", "Mèlanie Laurent", "Goran Visnjic"], "countries": ["USA"], "directors": ["Mike Mills"], "fullplot": "It's 2003. Thirty-eight year old graphic artist Oliver Fields has just lost his father Hal Fields to cancer, after Oliver's mother Georgia Fields passed away five years earlier. Oliver is naturally a sullen man due to his growing up relationship with his parents (his mother who had a unique view on life) and watching his parents' cordial but somewhat distant relationship with each other, but is more so now because of his personal family loss. Oliver embarks on a relationship with Anna, a French actress. Oliver is hoping that his re-energized relationship with Hal following Georgia's death and Hal's new outlook on life during that time will show Oliver how to act in a loving relationship. After Georgia's death, Hal came out of the closet and began to live with a joie de vivre that did not exist before, which included an open relationship with a much younger man named Andy. Oliver's relationship with Anna has other obstacles, including Anna's own vagabond lifestyle and Oliver needing to take care of who was originally Hal's very needy Jack Russell terrier, Arthur.", "genres": ["Comedy", "Drama", "Romance"], "imdb": {"id": 1532503, "rating": 7.2, "votes": 67740}, "languages": ["English", "French"], "lastupdated": "2015-09-16 13:00:18.143000000", "metacritic": 81, "num_mflix_comments": 3, "plot": "A young man is rocked by two announcements from his elderly father: that he has terminal cancer, and that he has a young male lover.", "poster": "https://m.media-amazon.com/images/M/MV5BMjAyNDcxNTk3NV5BMl5BanBnXkFtZTcwMjk4MDU2NA@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1307577600000, "runtime": 105, "title": "Beginners", "tomatoes": {"boxOffice": "$5.8M", "consensus": "Wearing its twee heart on its sleeve, Beginners explores the depths of modern, multi-generational romance with wit and depth.", "critic": {"meter": 84, "numReviews": 148, "rating": 7.3}, "dvd": 1321315200000, "fresh": 124, "lastUpdated": 1439664254000, "production": "Focus Features", "rotten": 24, "viewer": {"meter": 77, "numReviews": 23803, "rating": 3.8}, "website": "http://www.BeginnersMovie.com/"}, "type": "movie", "writers": ["Mike Mills"], "year": 2010}