{"_id": "573a13abf29313caabd24011", "awards": {"nominations": 12, "text": "12 wins & 12 nominations.", "wins": 12}, "cast": ["Diego Luna", "Lucas Crespi", "Norman Sotolongo", "Jesès Ochoa"], "countries": ["Mexico", "Argentina", "Spain"], "directors": ["Hugo Rodrèguez"], "fullplot": "\"Nicotina,\" is a crime caper set in Mexico City about a simple exchange that goes awry, causing the lives of nine unsuspecting characters to explode in one tumultuous night over a fortune in diamonds. Diego Luna stars as computer hacker Lolo, who is infatuated with his neighbor Andrea and catalogs her every move via high-tech peeping devices. Lolo teams with amateur criminals Tomson and his younger counterpart Nene in a deal with a Russian mobster that involves the exchange of diamonds for computer access to Swiss bank accounts. But the deal goes terribly wrong after Lolo's attempts to spoil Andrea's romantic trysts spiral out of control. Down the street, the irritable pharmacist Beto and his fed-up wife Clara get inadvertently entangled in the exchange, along with the humble barber Goyo and his domineering other half Carmen. Infected with diamond lust, these characters become obsessed with the intoxicating possibility of an easy life and their greed quickly transforms into fiery desperation. When the haze finally clears, computers have been hacked, people have been whacked and lives have gone up in a cloud of smoke.", "genres": ["Action", "Comedy", "Crime"], "imdb": {"id": 337930, "rating": 6.7, "votes": 2969}, "languages": ["Spanish"], "lastupdated": "2015-08-21 00:24:15.220000000", "metacritic": 49, "num_mflix_comments": 2, "plot": "A real-time dark comedy about a science geek who tangles with a clutch of Russian gangsters after he delivers them the wrong computer disk.", "poster": "https://m.media-amazon.com/images/M/MV5BMTY5MzQyODkwNl5BMl5BanBnXkFtZTcwMDc3NzYyMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1092960000000, "runtime": 90, "title": "Nicotina", "tomatoes": {"boxOffice": "$0.8M", "critic": {"meter": 45, "numReviews": 47, "rating": 5.6}, "dvd": 1199059200000, "fresh": 21, "lastUpdated": 1440613475000, "production": "Arenas Entertainment", "rotten": 26, "viewer": {"meter": 73, "numReviews": 2718, "rating": 3.7}, "website": "http://www.arenasgroup.com/nicotina.html"}, "type": "movie", "writers": ["Martèn Salinas"], "year": 2003}