{"_id": "573a13c2f29313caabd680df", "awards": {"nominations": 1, "text": "1 win & 1 nomination.", "wins": 1}, "cast": ["Christopher Thornton", "Mark Ruffalo", "Juliette Lewis", "Laura Linney"], "countries": ["USA"], "directors": ["Mark Ruffalo"], "fullplot": "Dean O'Dwyer, also known as \"\"Delicious D,\" is an up-and-coming DJ on the underground music scene in Los Angeles. When a motorcycle accident leaves Dean paralyzed, he abandons his turntables for a wheelchair as his once promising career disappears before his eyes. Forced to live out of his car on skid row, Dean begins his descent into depression when he meets Father Joe Roselli, a passionate young priest. Father Joe introduces Dean to the world of faith-healing, an unlikely way for him to begin his quest to walk again. He soon discovers that he possesses the otherworldly power to heal people, but in an odd twist of fate, he is utterly unable to heal himself. Despite Father Joe's warnings, Dean angrily decides to use his newfound gift for fame and fortune. He joins a rock band led by charismatic front man The Stain with bassist Ariel, and manager Nina Hogue. But his newfound notoriety is unable to cure the hurt that encompasses his life. To find true healing, Dean must ultimately confront his worst demons and come to terms with his own humanity.", "genres": ["Drama"], "imdb": {"id": 1270277, "rating": 5.7, "votes": 1551}, "languages": ["English"], "lastupdated": "2015-09-15 04:48:55.290000000", "metacritic": 44, "num_mflix_comments": 1, "plot": "A newly paralyzed DJ gets more than he bargained for when he seeks out the world of faith healing.", "poster": "https://m.media-amazon.com/images/M/MV5BMjI0MzU0MzA4NV5BMl5BanBnXkFtZTcwNzkyNTYwNQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1304121600000, "runtime": 96, "title": "Sympathy for Delicious", "tomatoes": {"boxOffice": "$13.1k", "critic": {"meter": 29, "numReviews": 24, "rating": 4.9}, "dvd": 1314057600000, "fresh": 7, "lastUpdated": 1441045443000, "production": "Maya Entertainment", "rotten": 17, "viewer": {"meter": 40, "numReviews": 1813, "rating": 2.9}, "website": "http://sympathyfordelicious.com/"}, "type": "movie", "writers": ["Christopher Thornton"], "year": 2010}