{"_id": "573a1394f29313caabce0326", "awards": {"nominations": 5, "text": "Won 1 Oscar. Another 4 nominations.", "wins": 0}, "cast": ["Judy Holliday", "Paul Douglas", "Fred Clark", "John Williams"], "countries": ["USA"], "directors": ["Richard Quine"], "fullplot": "Laura Partridge is a very enthusiastic small stockholder of 10 shares in International Projects, a large corporation based in New York. She attends her first stockholder meeting ready to question the board of directors from their salaries to their operations. These are not the questions which the board expected to be asked of them, especially since they are all crooked, except for Edward McKeever, the current CEO who has resigned in order to take an advisory position at the Pentagon. Following the meeting, he bumps into Laura and offers to drive her home. On the way there, Laura displays her enthusiasm for being a stockholder, as a result, Edward takes a liking to her. With Edward in Washington, John Blessington and Clifford Snell establish their hold on International Projects - They see greater riches now that Edward has influence with the US senate, especially with the awarding of federal contracts, unfortunately for them he is honest, and won't do their bidding. In the meantime, Laura continues to be a nusance to the board. Blessington believes the only way to silence her, is to give her a high paying position with the company. The idea is for her to do absolutely nothing - Laura has other plans. She begins to correspond with other small stockholders in the company - a problem for the board. They decide to use her influence on Edward and send her to Washington to get contracts. Laura now knowing their true intentions for her, has her own agenda, that is, get Edward back in charge of the company.", "genres": ["Comedy", "Romance"], "imdb": {"id": 49777, "rating": 7.6, "votes": 1072}, "languages": ["English"], "lastupdated": "2015-08-26 00:16:41.837000000", "num_mflix_comments": 3, "plot": "A minority stockholder takes on the crooked board of directors at a billion dollar corporation.", "poster": "https://m.media-amazon.com/images/M/MV5BNGUwYmZlNmMtZjhmZi00ODgwLThkNTItNTczYmU2MDQ0NmZkXkEyXkFqcGdeQXVyNjE5MjUyOTM@._V1_SY1000_SX677_AL_.jpg", "rated": "APPROVED", "released": -421632000000, "runtime": 99, "title": "The Solid Gold Cadillac", "tomatoes": {"critic": {"meter": 100, "numReviews": 5, "rating": 7.5}, "dvd": 1067299200000, "fresh": 5, "lastUpdated": 1440444402000, "production": "Sony Pictures Entertainment", "rotten": 0, "viewer": {"meter": 65, "numReviews": 525, "rating": 3.6}}, "type": "movie", "writers": ["Abe Burrows (screen play)", "George S. Kaufman (from the play by)", "Howard Teichmann (from the play by)"], "year": 1956}