{"_id": "573a13a3f29313caabd0dec6", "awards": {"nominations": 5, "text": "1 win & 5 nominations.", "wins": 1}, "cast": ["Benoèt Magimel", "Boris Terral", "Tchèky Karyo", "Colette Emmanuelle"], "countries": ["France", "Germany", "Belgium"], "directors": ["Gèrard Corbiau"], "fullplot": "Corbiau repeats the Farinelli formula, artistic rivalry and social private drama expressed in dazzling, sometimes excessively lavish baroque scenery, music and costume, but this time in its ultimate setting: Versailles. There are two protagonists - first the title character, Louis XIV, the French sun-king who has two passions, establishing absolute rule over the realm -after decades of religious/civil wars- by divine right and artistic brilliancy as a dancer (like Nero wrote and performed musical poetry), and starts asserting himself against the entourage of his Medici mother, the regent during his minority, by building his palace complex and launching a 'fitting' new, mainly musical display of baroque show. Secondly the musical genius Gianbattista Lulli ('Jean-Baptiste') Lully, a Florentine upstart of unbridled ambition, quickly gains the king's absolute trust, despite the nationalist and aristocratic opposition to a low-born Italian, and thus turns the normally socially humble post of court composer into a 'ministerial portfolio of culture' of Cabinet rank, complete with a monopoly which kills of his artistic rivals in operatic theater. The script also weaves a complex web of court scheming for individual power and social interests, and even a sadistic but accidental murder on a young valet, producing a sensuous and sumptuous drama too complex for this format, ending in a freakish but fatal accident. Louis XIV's mother was Ana de Austria (in French, Anne d' Autriche), the daughter of one of the Hapsburgh Kings of Spain. Maria di Medici (in French, Marie de Mèdicis) was his grandmother, his father's mother. She was dead before Louis XIV reached the throne. Please correct the reference to \"his Medici mother\"", "genres": ["Drama", "History", "Music"], "imdb": {"id": 244173, "rating": 6.8, "votes": 1558}, "languages": ["French"], "lastupdated": "2015-09-02 00:22:14.787000000", "plot": "Corbiau repeats the Farinelli formula, artistic rivalry and social private drama expressed in dazzling, sometimes excessively lavish baroque scenery, music and costume, but this time in its...", "poster": "https://m.media-amazon.com/images/M/MV5BMjA0OTk0ODI2Ml5BMl5BanBnXkFtZTYwMzQ2MjM5._V1_SY1000_SX677_AL_.jpg", "released": 976060800000, "runtime": 115, "title": "The King Is Dancing", "tomatoes": {"lastUpdated": 1433966065000, "viewer": {"numReviews": 29, "rating": 4.5}, "website": "http://www.leroidanse.com"}, "type": "movie", "writers": ["ève de Castro (scenario", " adaptation and dialogue)", "Andrèe Corbiau (scenario", " adaptation and dialogue)", "Gèrard Corbiau (scenario", " adaptation and dialogue)", "Didier Decoin (participation)", "Philippe Beaussant (book)"], "year": 2000}