{"_id": "573a13b7f29313caabd4a109", "awards": {"nominations": 25, "text": "Won 3 Golden Globes. Another 13 wins & 25 nominations.", "wins": 16}, "cast": ["Lee Boardman", "Jim Broadbent", "Tam Dean Burn", "Lindsay Duncan"], "countries": ["UK", "USA"], "directors": ["Tom Hooper"], "fullplot": "Biopic of Lord Longford, known for many years for his work with prisoners and prisoners rights in general. The film focuses on Longford's work on behalf of Myra Hindley convicted, along with her boyfriend Ian Brady, of several child murders. Hindley is nothing short of notorious and even Longord's wife is shocked when he announces that he will visit her in prison. When Prime Minister Harold Wilson removes him as the Government Leader in the House of Lords soon after his visits to Hindley are made public, Longford continues to work for her release. A devout convert to Roman Catholicism, Longford sees hope for Hindley when he learns that she too once converted to Catholicism. In the end, his campaign to get her released on parole is for naught when she reveals that other murders took place. Longford stood by his convictions however and never regretted the good work he had done over a great many years.", "genres": ["Biography", "Crime", "Drama"], "imdb": {"id": 759612, "rating": 7.7, "votes": 2218}, "languages": ["English"], "lastupdated": "2015-08-27 00:31:06.150000000", "plot": "A portrait of Lord Longford, a tireless British campaigner whose controversial beliefs often resulted in furious political debate and personal conflict.", "poster": "https://m.media-amazon.com/images/M/MV5BNTYyNzgzNjk1MV5BMl5BanBnXkFtZTgwODk1MDA5NTE@._V1_SY1000_SX677_AL_.jpg", "rated": "TV-MA", "released": 1171670400000, "runtime": 93, "title": "Longford", "tomatoes": {"critic": {"meter": 100, "numReviews": 5, "rating": 8.2}, "dvd": 1182211200000, "fresh": 5, "lastUpdated": 1442268201000, "production": "Granada Television", "rotten": 0, "viewer": {"meter": 86, "numReviews": 1109, "rating": 3.8}}, "type": "movie", "writers": ["Peter Morgan"], "year": 2006}