{"_id": "573a13d8f29313caabda5981", "awards": {"nominations": 1, "text": "3 wins & 1 nomination.", "wins": 3}, "cast": ["Sebastian Frèsdorf", "Godehard Giese", "Karin Hanczewski", "Alice Pehlivanyan"], "countries": ["Germany", "France"], "directors": ["Tom Sommerlatte"], "fullplot": "Matthias is the younger of the two Landberg brothers. While his brother David has followed in their father's footsteps on the path to success, Matthias lives his life far away from ambitions and career options. He shares his family's holiday home at the French Atlantic coast with his girlfriend Camille and her 6-year-old son Etienne from a previous relationship. Together they idle about day after day. The story begins when David and his wife Lena arrive with the intention of spending their holiday in the family home. Matthias' carefree days are over in a beat, David's presence changes everything. Within ten minutes after his arrival, David insists on sleeping in the room Matthias and Camille have made their own and demands that Etienne is brought to his father, as he wants peace and quiet. Matthias quietly complies because \"what David wants, David gets\" has been a rule for him from early age on. Camille, however, disgusted by David's bossy behavior, and unwilling to accept his air of entitlement and superiority, secretly concocts a plan to rearrange the pecking order between the two brothers. Her cunning maneuvers make for many surprises!", "genres": ["Comedy", "Drama"], "imdb": {"id": 2181814, "rating": 8.4, "votes": 25}, "languages": ["German", "French", "English"], "lastupdated": "2015-08-20 00:20:13.423000000", "num_mflix_comments": 2, "plot": "Matthias is the younger of the two Landberg brothers. While his brother David has followed in their father's footsteps on the path to success, Matthias lives his life far away from ...", "runtime": 100, "title": "Im Sommer wohnt er unten", "tomatoes": {"lastUpdated": 1425232457000, "viewer": {"numReviews": 0, "rating": 0}, "website": "http://www.imsommerwohnterunten.de/"}, "type": "movie", "writers": ["Tom Sommerlatte"], "year": 2015}