{"_id": "573a13c0f29313caabd60bfb", "awards": {"nominations": 1, "text": "1 win & 1 nomination.", "wins": 1}, "cast": ["Alex Pettyfer", "Justin Bradley", "Mary-Kate Olsen", "Dakota Johnson"], "countries": ["USA"], "directors": ["Daniel Barnz"], "fullplot": "At the Buckeston Academy High School, the wealthy, arrogant, narcissistic, and bigoted Kyle Kingson is a student who does not respect his classmates. When Kyle is elected representative of the students, he plays a prank on the outcast Kendra, who has a reputation as a witch: he invites her to a party and humiliates her in front of their classmates. However, Kendra curses him with a spell that makes Kyle as ugly as his soul. Further, she tells him that if he does not find anyone who loves him within a year, he will be doomed to that appearance forever. When Kyle's father, Rob Kingson, sees him, he takes Kyle to specialists but the doctors do not know what to do, so Rob hides Kyle in an apartment with a maid and a blind tutor. When Kyle sees his mate Lindy on the streets, he saves her from a dangerous drug dealer and he brings her to his apartment to protect her. Now his only hope is that Lindy will fall in love with him.", "genres": ["Drama", "Fantasy", "Romance"], "imdb": {"id": 1152398, "rating": 5.6, "votes": 59038}, "languages": ["English"], "lastupdated": "2015-09-05 01:00:48.463000000", "metacritic": 40, "num_mflix_comments": 1, "plot": "A modern-day take on the \"Beauty and the Beast\" tale where a New York teen is transformed into a hideous monster in order to find true love.", "poster": "https://m.media-amazon.com/images/M/MV5BMzUzMTcxMTEzNV5BMl5BanBnXkFtZTcwMTcwNjcxNA@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1299196800000, "runtime": 86, "title": "Beastly", "tomatoes": {"boxOffice": "$27.9M", "consensus": "Fundamentally misguided, poorly written, and badly acted, Beastly adds little to the legacy of its timeless source material.", "critic": {"meter": 21, "numReviews": 92, "rating": 3.7}, "dvd": 1309219200000, "fresh": 19, "lastUpdated": 1442252637000, "production": "CBS Films", "rotten": 73, "viewer": {"meter": 48, "numReviews": 57713, "rating": 3.2}, "website": "http://www.beastlythemovie.com/"}, "type": "movie", "writers": ["Daniel Barnz (screenplay)", "Alex Flinn (novel)"], "year": 2011}