{"_id": "573a13b2f29313caabd385a2", "awards": {"nominations": 4, "text": "2 wins & 4 nominations.", "wins": 2}, "cast": ["Robin Wright", "Abdellatif Kechiche", "èlodie Bouchez", "Aasif Mandvi"], "countries": ["USA"], "directors": ["Jeff Stanzler"], "fullplot": "With a PhD in Chemistry, devout and bearded, Syria-born Ashade Mouhana (Abdellatif Kechiche) drives a cab in New York, and must accept financial assistance from friends who attend the Islamic Council of America so that he can pay a lawyer to get his Canadian brother, who is being detained as a '2nd tier suspect', released. He also has to look after his toddler nephew and French-speaking Caucasian sister-in-law, Eloise (Elodie Bouchez), and is fearful that his brother may be tortured in Syria. One night he befriends a passenger, who identifies herself as Phyllis (Robin Wright Penn), claims she is Head of Programming of Q-Dog Television, sympathizes and offers to assist him get his brother released. He gets a shock when she asks him to carry out an act of terrorism as retribution against America. He walks away, and subsequently finds out that she has stolen his money. Shortly thereafter, his cab is confiscated by secret agents, and Eloise is held for questioning. Vengeful, he shaves off his beard, assumes the name of Habib and attends the offices of Q-Dog Television in order to confront Phyllis - not realizing the shock and trauma that await him when he finds out who Phyllis really is.", "genres": ["Drama", "Thriller"], "imdb": {"id": 425600, "rating": 6.3, "votes": 1297}, "languages": ["English", "Arabic", "French"], "lastupdated": "2015-09-14 11:07:04.127000000", "metacritic": 43, "num_mflix_comments": 3, "plot": "Against the anxieties and fears of post-9/11 America, an Arab cab driver picks up a troubled professional woman with unexpected results.", "poster": "https://m.media-amazon.com/images/M/MV5BMTg3NTQ0NjAyMF5BMl5BanBnXkFtZTcwMDUwNzMzMQ@@._V1_SY1000_SX677_AL_.jpg", "released": 1141171200000, "runtime": 83, "title": "Sorry, Haters", "tomatoes": {"critic": {"meter": 37, "numReviews": 38, "rating": 4.9}, "dvd": 1154995200000, "fresh": 14, "lastUpdated": 1438365907000, "production": "IFC Films", "rotten": 24, "viewer": {"meter": 47, "numReviews": 4436, "rating": 2.9}, "website": "http://www.sorryhaters2006.com"}, "type": "movie", "writers": ["Jeff Stanzler"], "year": 2005}