{"_id": "573a13acf29313caabd29433", "awards": {"nominations": 5, "text": "5 nominations.", "wins": 0}, "cast": ["Mandy Moore", "Stark Sands", "Tony Jayawardena", "Jeremy Piven"], "countries": ["USA", "UK"], "directors": ["Andy Cadiff"], "fullplot": "Anna Foster has never had an ordinary life. At eighteen years old, she is the most protected girl in America; she is the First Daughter. Frustrated with her overprotective father, the President of the United States of America, Anna makes a deal with him: only two agents are allowed to guard her while she attends a concert in Prague. When her father backs out of his promise, Anna flies into a temper and goes on the run with Ben Calder, a handsome photographer she runs into outside of the music club. They travel together with the intention of going to the Love Parade in Berlin. Anna hasn't told Ben who she is but more importantly, Ben hasn't told her who he is. Under the orders of Anna's father, Ben is supposed to keep an eye on the rebellious girl but falling in love with her wasn't something he expected to do. Romance blossoms between the wild, sassy Anna and the cool, distant Ben as they backpack through Europe. Problem is, when it is time to go back and Anna finds out about Ben, what will happen to the two lovers?", "genres": ["Comedy", "Romance"], "imdb": {"id": 360139, "rating": 6.1, "votes": 27839}, "languages": ["English", "French", "German", "Hebrew", "Italian", "Spanish"], "lastupdated": "2015-09-14 09:24:12.567000000", "metacritic": 46, "plot": "Anna Foster has never had an ordinary life. At eighteen years old, she is the most protected girl in America; she is the First Daughter. Frustrated with her overprotective father, the ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTU2MTg5NDg4N15BMl5BanBnXkFtZTYwMjQ1NDI3._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1073606400000, "runtime": 111, "title": "Chasing Liberty", "tomatoes": {"dvd": 1096329600000, "lastUpdated": 1440613674000, "viewer": {"meter": 100, "numReviews": 305, "rating": 3.3}}, "type": "movie", "writers": ["Derek Guiley", "David Schneiderman"], "year": 2004}