{"_id": "573a13bbf29313caabd53f9c", "awards": {"nominations": 4, "text": "12 wins & 4 nominations.", "wins": 12}, "cast": ["Ayèa Damgaci", "Hama Ali Kahn", "Cengiz Bozkurt", "Nesrin Cavadzade"], "countries": ["Turkey"], "directors": ["Huseyin Karabey"], "fullplot": "Three years ago, in real-life, Hama Ali, a charismatic actor from Iraq famous locally for his performance as Iraq's version of Superman, met Ayca on a film-set. He and Ayca, a fiery actress from Turkey, had a passionate love affair before returning to their respective homes. From his Kurdish village, Hama Ali sends Ayca video love letters which he has filmed on his handycam. She watches them from her sofa in Istanbul, with her cat for company. The video love letters capture the hellish violence engulfing Iraq, the goats and uncles populating his rural area, and also his tender affection towards her. Feeling suffocated by her own city and angered by the indifference towards the war that surrounds her, Ayca decides to make the journey eastwards to Iraq to be reunited with her lover. GITMEK, a dramatic feature film, is based on the true story of Ayca's departure from Istanbul and her extraordinary journey to the Iraqi border. At a time when many people were fleeing from East to West in search of safety, Ayca makes the opposite journey, in search of love. She is helped by immigrant artists who live in the slums of Istanbul and the mothers of long distance truck drivers who she meets at various border towns. The journey takes her through breathtaking landscapes, strange encounters and terrifying times.", "genres": ["Drama", "Romance", "War"], "imdb": {"id": 920460, "rating": 6.6, "votes": 628}, "languages": ["English", "Kurdish", "Turkish"], "lastupdated": "2015-07-04 00:20:59.083000000", "num_mflix_comments": 2, "plot": "Three years ago, in real-life, Hama Ali, a charismatic actor from Iraq famous locally for his performance as Iraq's version of Superman, met Ayca on a film-set. He and Ayca, a fiery actress...", "poster": "https://m.media-amazon.com/images/M/MV5BMjA1OTI1MjI4OV5BMl5BanBnXkFtZTgwODk1MTA2MDE@._V1_SY1000_SX677_AL_.jpg", "released": 1226620800000, "runtime": 93, "title": "Gitmek: My Marlon and Brando", "tomatoes": {"lastUpdated": 1437070238000, "viewer": {"meter": 79, "numReviews": 181, "rating": 3.7}}, "type": "movie", "writers": ["Ayèa Damgaci", "Huseyin Karabey"], "year": 2008}