{"_id": "573a13bcf29313caabd56292", "awards": {"nominations": 15, "text": "1 win & 15 nominations.", "wins": 1}, "cast": ["Russell Crowe", "Cate Blanchett", "Max von Sydow", "William Hurt"], "countries": ["USA", "UK"], "directors": ["Ridley Scott"], "fullplot": "Birth of a legend. Following King Richard's death in France, archer Robin Longstride, along with Will Scarlett, Alan-a-Dale and Little John, returns to England. They encounter the dying Robert of Locksley, whose party was ambushed by treacherous Godfrey, who hopes to facilitate a French invasion of England. Robin promises the dying knight he will return his sword to his father Walter in Nottingham. Here Walter encourages him to impersonate the dead man to prevent his land being confiscated by the crown, and he finds himself with Marian, a ready-made wife. Hoping to stir baronial opposition to weak King John and allow an easy French take-over, Godfrey worms his way into the king's service as Earl Marshal of England and brutally invades towns under the pretext of collecting Royal taxes. Can Robin navigate the politics of barons, royals, traitors, and the French?", "genres": ["Action", "Adventure", "Drama"], "imdb": {"id": 955308, "rating": 6.7, "votes": 197688}, "languages": ["English", "French"], "lastupdated": "2015-09-10 17:05:28.260000000", "metacritic": 53, "plot": "In 13th century England, Robin and his band of marauders confront corruption in a local village and lead an uprising against the crown that will forever alter the balance of world power.", "poster": "https://m.media-amazon.com/images/M/MV5BMTM5NzcwMzEwOF5BMl5BanBnXkFtZTcwNjg5MTgwMw@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1273795200000, "runtime": 140, "title": "Robin Hood", "tomatoes": {"boxOffice": "$105.2M", "consensus": "Ridley Scott's revisionist take on this oft-told tale offers some fine acting and a few gripping action sequences, but it's missing the thrill of adventure that made Robin Hood a legend in the first place.", "critic": {"meter": 43, "numReviews": 239, "rating": 5.4}, "dvd": 1285027200000, "fresh": 103, "lastUpdated": 1442080404000, "production": "Universal", "rotten": 136, "viewer": {"meter": 58, "numReviews": 264516, "rating": 3.5}, "website": "http://www.robinhoodthemovie.com/"}, "type": "movie", "writers": ["Brian Helgeland (screenplay)", "Brian Helgeland (story)", "Ethan Reiff (story)", "Cyrus Voris (story)"], "year": 2010}