{"_id": "573a13b1f29313caabd36bce", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Dennis Hopper", "Gerard Damiano", "John Waters", "Larry Flynt"], "countries": ["USA"], "directors": ["Fenton Bailey", "Randy Barbato"], "fullplot": "In 1972, a seemingly typical shoestring budget pornographic film was made in a Florida hotel, \"Deep Throat,\" starring Linda Lovelace. This film would surpass the wildest expectation of everyone involved to become one of the most successful independent films of all time. It caught the public imagination which met the spirit of the times, even as the self appointed guardians of public morality struggled to suppress it, and created, for a brief moment, a possible future where sexuality in film had a bold artistic potential. This film covers the story of the making of this controversial film, its stunning success, its hysterical opposition along with its dark side of mob influence and allegations of the on set mistreatment of the film's star. In short, the combined events would redefine the popular appeal of pornography, even as more cynical developments would lead it down other paths.", "genres": ["Documentary", "Biography", "History"], "imdb": {"id": 418753, "rating": 6.8, "votes": 5400}, "languages": ["English"], "lastupdated": "2015-08-18 00:42:54.250000000", "metacritic": 64, "plot": "More than 30 years after Deep Throat's provocative debut, this documentary examines the legacy that the most profitable film of all-time left on society.", "poster": "https://m.media-amazon.com/images/M/MV5BMTYyOTkyMjk5MV5BMl5BanBnXkFtZTcwMzI2MDgyMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "NC-17", "released": 1114041600000, "runtime": 92, "title": "Inside Deep Throat", "tomatoes": {"boxOffice": "$0.5M", "consensus": "A documentary on the film that brought smut mainstream, Inside Deep Throat is gaining praise as an entertaining look at a pop culture milestone. However, some critics say the film could have gone a little deeper into the people involved.", "critic": {"meter": 83, "numReviews": 120, "rating": 7}, "dvd": 1127174400000, "fresh": 99, "lastUpdated": 1442164487000, "production": "Universal Pictures", "rotten": 21, "viewer": {"meter": 67, "numReviews": 6467, "rating": 3.4}, "website": "http://www.insidedeepthroatmovie.com/"}, "type": "movie", "writers": ["Fenton Bailey", "Randy Barbato"], "year": 2005}