{"_id": "573a13aaf29313caabd21acf", "awards": {"nominations": 6, "text": "1 win & 6 nominations.", "wins": 1}, "cast": ["Denzel Washington", "Dakota Fanning", "Radha Mitchell", "Christopher Walken"], "countries": ["USA", "UK"], "directors": ["Tony Scott"], "fullplot": "A wave of kidnappings has swept through Mexico, feeding a growing sense of panic among its wealthier citizens, especially parents. In one six-day period, there were twenty-four abductions, leading many to hire bodyguards for their children. Into this world enters John Creasy, a burned-out ex-CIA operative/assassin, who has given up on life. Creasy's friend Rayburn brings him to Mexico City to be a bodyguard to nine-year-old Pita Ramos, daughter of industrialist Samuel Ramos and his wife Lisa. Creasy is not interested in being a bodyguard, especially to a youngster, but for lack of something better to do, he accepts the assignment. Creasy barely tolerates the precocious child and her pestering questions about him and his life. But slowly, she chips away at his seemingly impenetrable exterior, his defenses drop, and he opens up to her. Creasy's new-found purpose in life is shattered when Pita is kidnapped. Despite being seriously wounded during the kidnapping, he vows to kill anyone involved in or profiting from the kidnapping. And no one can stop him.", "genres": ["Action", "Crime", "Drama"], "imdb": {"id": 328107, "rating": 7.7, "votes": 246990}, "languages": ["English", "Spanish"], "lastupdated": "2015-09-04 00:20:55.693000000", "metacritic": 47, "plot": "In Mexico City, a former assassin swears vengeance on those who committed an unspeakable act against the family he was hired to protect.", "poster": "https://m.media-amazon.com/images/M/MV5BODFlMmEwMDgtYjhmZi00ZTE5LTk2NWQtMWE1Y2M0NjkzOGYxXkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1082678400000, "runtime": 146, "title": "Man on Fire", "tomatoes": {"boxOffice": "$77.7M", "consensus": "Man on Fire starts out well, but goes over the top in the violent second half.", "critic": {"meter": 39, "numReviews": 161, "rating": 5.2}, "dvd": 1095120000000, "fresh": 62, "lastUpdated": 1442080331000, "production": "20th Century Fox", "rotten": 99, "viewer": {"meter": 90, "numReviews": 422293, "rating": 3.8}, "website": "http://www.manonfiremovie.com/"}, "type": "movie", "writers": ["A.J. Quinnell (novel)", "Brian Helgeland (screenplay)"], "year": 2004}