{"_id": "573a13b3f29313caabd3e396", "awards": {"nominations": 14, "text": "8 wins & 14 nominations.", "wins": 8}, "cast": ["Emily Barclay", "Steve Bastoni", "Laurence Breuls", "Michael Dorman"], "countries": ["Australia"], "directors": ["Paul Goldman"], "fullplot": "Why does a 19 year-old girl plot to kill her own father? Katrina Skinner is stuck in suburbia with her toddler daughter and her devoted dad. Her brother Danny is in jail for life for murder. Her mother abandoned her years ago. The neighbors are scared of her. The police can't keep up with her. Nobody can control her but everybody's trying. Her dad won't mind his own business. Katrina misses her brother. She needs money for his appeal. She's bored and she's sick of living with her dad. She's not going to work a day in her life and she knows her dad's not going to help her financially anymore. She's first in line for the family inheritance. All she needs to do now is convince one of her lovers to do the deed and she's never had much trouble getting men to do what she wants. All for the love of her brother. It's John Skinner's funeral, inside the Golden Grove Crematorium. Kat sits on the front pew between her cheeky fiancè Rusty and her toddler daughter Bailee. Her mobile phone interrupts the service when she receives a text message. Suddenly we are thrust into Katrina's world: youth culture, crime, sex and suburban mayhem. This story is told from many perspectives: a kaleidoscope of flashbacks and testimonies fueled by small town gossip, the police, friends and family, her fiancè, and her many lovers. It seems everybody has a \"story\" to tell about Katrina Skinner. The stories don't add up, but they all take us to the same place.", "genres": ["Comedy", "Drama", "Thriller"], "imdb": {"id": 450506, "rating": 5.9, "votes": 1240}, "languages": ["English"], "lastupdated": "2015-08-21 01:02:50.470000000", "num_mflix_comments": 1, "plot": "The neighbors are scared of her. The police can't keep up with her. Nobody can control her, but everybody's trying.", "poster": "https://m.media-amazon.com/images/M/MV5BMTIzNjIwNTk1OF5BMl5BanBnXkFtZTcwMzMzMTczMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1161820800000, "runtime": 95, "title": "Suburban Mayhem", "tomatoes": {"critic": {"meter": 20, "numReviews": 5, "rating": 4}, "dvd": 1191283200000, "fresh": 1, "lastUpdated": 1440266495000, "production": "Fortissimo Films", "rotten": 4, "viewer": {"meter": 58, "numReviews": 15263, "rating": 3}, "website": "http://www.suburbanmayhem.com/"}, "type": "movie", "writers": ["Alice Bell (original screenplay)"], "year": 2006}