{"_id": "573a1398f29313caabcea8a7", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Anil Kapoor", "Sridevi", "Amrish Puri", "Satish Kaushik"], "countries": ["India"], "directors": ["Shekhar Kapur"], "fullplot": "Orphaned as a child, Arun Verma (Anil Kapoor) has dedicated his adult life to looking after orphaned children, in a house where he is unable to afford to pay the rent nor even day to day expenses for necessities. He decides to rent one of the rooms, and the tenant is a newspaper reporter named Seema Sohni (Sridevi), who happens to dislike children. Internation crime lord and terrorist Mogambo (Amrish Puri) takes an interest in his very house to store his firearms, and other weapons, and sends his men to force Arun to vacate. Arun and some of the children are beaten-up and threatened with dire consequences if they do not vacate the house. Arun's dad's friend Professor Sinha (Ashok Kumar) shows Arun a device that will make in him invisible, and thereby he will find a way to fight to keep the house. Arun tries the device, and he becomes invisible. Using this, he is able to turn the tables on Mogambo's men, and calls himself \"Mr.India\". Mr. India becomes popular with the masses, and people everywhere rejoice and claim him to be their new savior. No one knows that Mr. India is Arun, save for Jugal (Aftab Shivdasani). This does not auger well with Mogambo, and he spreads his terror, killing hundreds of innocent citizens, including a child in Arun's care. Mogambo decides to kidnap the children, Seema, and Arun himself, and hopes to trap Mr. India, when he attempts to rescue them. The abduction takes place, and Arun, Seema, and the children are locked in a cell. In this skirmish, Arun misplaces the device, while Seema and the children await the arrival of Mr. India to rescue them, not knowing that time is running out, and Mogambo has already planned their deaths in a pit full of acid.", "genres": ["Action", "Adventure", "Comedy"], "imdb": {"id": 93578, "rating": 7.8, "votes": 4697}, "languages": ["Hindi"], "lastupdated": "2015-08-27 00:32:20.620000000", "plot": "A poor but big-hearted man takes orphans into his home. After discovering his scientist father's invisibility device, he rises to the occasion and fights to save his children and all of India from the clutches of a megalomaniac.", "released": 548899200000, "runtime": 179, "title": "Mr India", "tomatoes": {"dvd": 1125964800000, "lastUpdated": 1439925951000, "viewer": {"meter": 84, "numReviews": 2707, "rating": 3.9}}, "type": "movie", "writers": ["Javed Akhtar", "Salim Khan"], "year": 1987}