{"_id": "573a1394f29313caabce0158", "awards": {"nominations": 2, "text": "Nominated for 1 Oscar. Another 1 nomination.", "wins": 0}, "cast": ["Humphrey Bogart", "Rod Steiger", "Jan Sterling", "Mike Lane"], "countries": ["USA"], "directors": ["Mark Robson"], "fullplot": "After 17 years as a recognized and respected sports journalist in New York City, Eddie Willis finds himself out of a job when his newspaper folds. He's approached by a major fight promoter, Nick Benko, to act as a public relations man for his new heavyweight fighter Toro Moreno. Eddie knows the how the fight game works and after watching Toro in the ring, realizes Toro is nothing but a stiff who has no hope of succeeding. Benko offers him a sizable salary and an unlimited expense account and given his financial situation, he agrees. Benko's strategy to make money is one that has been used time again. Starting in California and moving east, they arrange a series of fights for Toro with stiffs and has-beens. All of the fights are rigged to build up his record and get him a fight with the heavyweight champion, Buddy Brannen, where they will make a sizable profit at the gate. Along the way, one boxer gets killed in the ring and Eddie begins to have serious doubts about what he is doing.", "genres": ["Drama", "Film-Noir", "Sport"], "imdb": {"id": 49291, "rating": 7.6, "votes": 4725}, "languages": ["English", "Spanish"], "lastupdated": "2015-08-23 00:12:26.220000000", "num_mflix_comments": 2, "plot": "Down-on-his-luck ex-sportswriter Eddie Willis is hired by shady fight promoter Nick Benko to promote his latest find, an unknown but easily exploitable phenom from Argentina.", "poster": "https://m.media-amazon.com/images/M/MV5BYjRkNDZjYzUtOGMyOS00NWRmLTg4NWItMDNmYzk5NTRiNzE5XkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": -430790400000, "runtime": 109, "title": "The Harder They Fall", "tomatoes": {"critic": {"meter": 100, "numReviews": 10, "rating": 7.6}, "dvd": 1043107200000, "fresh": 10, "lastUpdated": 1441220344000, "production": "Sony Pictures Entertainment", "rotten": 0, "viewer": {"meter": 79, "numReviews": 2067, "rating": 3.7}}, "type": "movie", "writers": ["Philip Yordan (screen play)", "Budd Schulberg (based on a novel by)"], "year": 1956}