{"_id": "573a1398f29313caabcea5e7", "awards": {"nominations": 7, "text": "Nominated for 2 Oscars. Another 16 wins & 7 nominations.", "wins": 18}, "cast": ["Anjelica Huston", "Donal McCann", "Dan O'Herlihy", "Donal Donnelly"], "countries": ["UK", "Ireland", "USA"], "directors": ["John Huston"], "fullplot": "John Huston's last film is a labor of love at several levels: an adaptation of perhaps one of the greatest pieces of English-language literature by one of Huston's favorite authors, James Joyce; a love letter to the land of his ancestors and the country where his children grew up; and the chance to work with his screenwriter son Tony and his actress daughter Anjelica. The film is delicate and unhurried, detailing an early January dinner at the house of two spinster musician sisters and their niece in turn-of-the-century Ireland, attended by friends and family. Among the visiting attendees are the sisters' nephew Gabriel Conroy and his wife Gretta. The evening's reminiscences bring up melancholy memories for Gretta concerning her first, long-lost love when she was a girl in rural Galway. Her recounting of this tragic love to Gabriel brings him to an epiphany: he learns the difference between mere existence and living. The all-Irish cast and careful period detail give the piece richness and gravity, and Donal McCann and Anjelica Huston are unforgettable as the Conroys.", "genres": ["Drama"], "imdb": {"id": 92843, "rating": 7.4, "votes": 5145}, "languages": ["English"], "lastupdated": "2015-08-09 01:38:08.097000000", "num_mflix_comments": 3, "plot": "Gabriel Conroy and wife Greta attend an early January dinner with friends at the home of his spinster aunts, an evening which results in an epiphany for both of them.", "poster": "https://m.media-amazon.com/images/M/MV5BNGNkM2QxMzEtMzE4My00MDI3LWJhNTQtNzZjMjYwYTc0OTg0XkEyXkFqcGdeQXVyMTAwMzUyOTc@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 566697600000, "runtime": 83, "title": "The Dead", "tomatoes": {"critic": {"meter": 92, "numReviews": 26, "rating": 7.8}, "dvd": 1144627200000, "fresh": 24, "lastUpdated": 1442336826000, "production": "Vestron UK Ltd.", "rotten": 2, "viewer": {"meter": 79, "numReviews": 2754, "rating": 3.9}}, "type": "movie", "writers": ["Tony Huston (screenplay)", "James Joyce (story)"], "year": 1987}