{"_id": "573a1397f29313caabce5dd4", "awards": {"nominations": 2, "text": "11 wins & 2 nominations.", "wins": 11}, "cast": ["Eva Kotamanidou", "Aliki Georgouli", "Vangelis Kazan", "Stratos Pahis"], "countries": ["Greece"], "directors": ["Theodoros Angelopoulos"], "fullplot": "A group of traveling players peregrinates through Greece attempting to perform the popular erotic drama Golfo The Shepherdess. In a first level the film focuses on the historical events between 1939 and 1952 as they are experienced by the traveling players and as they affect the villages which they visit: The last year of Metaxas' fascist dictatorship, the war against the Italians, the Nazi occupation, the liberation, the civil war between left and right wingers, the British and American interventionism in the Greek politics. In a second level the characters live their own drama of jealousy and betrayal, with its roots in the ancient myth of the House of Atreus. Agamemnon, a Greek refugee from Minor Asia, goes to war against the Italians in 1940, joins the resistance against the Germans, and is executed by them after being betrayed by Clytemnestra and Aegisthos. Aegisthos, Clytemnestra's lover, is an informer and collaborator working with the German occupiers. Orestes, son of Agamemnon and Clytemnestra, fights on the side of the leftists, avenges his father's death by killing his mother and Aegisthos. He is arrested in 1949 for his guerrilla activities and is executed in prison in 1951. Electra, his sister, helps the leftists and aids her brother in avenging the treachery of their mother and Aegisthos. After the death of Orestes she continues the work of the troupe and her relationship with Pylades. Chrysotheme, Electra's younger sister, collaborates with the Germans, prostitutes herself during the occupation, sides with the British during liberation, and later marries an American. Pylades, close friend of Orestes, is a Communist who is exiled by the Metaxas regime, joins the guerrillas and is arrested and exiled again. Finally he is forced to sign a written denunciation of the left after torture by the right wing and he is released from prison in 1950.", "genres": ["Drama", "History", "War"], "imdb": {"id": 73800, "rating": 8, "votes": 2158}, "languages": ["Greek"], "lastupdated": "2015-08-07 00:28:25.523000000", "plot": "Greece 1939 - 1952 Fascist, Nazi, Communist conflict as seen through a family of travelling provincial players", "poster": "https://m.media-amazon.com/images/M/MV5BYmY5MGZjNGUtMjUzYy00NzcyLTk1MGYtODgyOTk3OTM5MjI3XkEyXkFqcGdeQXVyMzIwNDY4NDI@._V1_SY1000_SX677_AL_.jpg", "released": 210816000000, "runtime": 230, "title": "The Travelling Players", "tomatoes": {"critic": {"meter": 86, "numReviews": 14, "rating": 7.7}, "dvd": 931824000000, "fresh": 12, "lastUpdated": 1442336765000, "rotten": 2, "viewer": {"meter": 83, "numReviews": 459, "rating": 4.2}}, "type": "movie", "writers": ["Theodoros Angelopoulos"], "year": 1975}