{"_id": "573a1396f29313caabce4bbb", "awards": {"nominations": 1, "text": "8 wins & 1 nomination.", "wins": 8}, "cast": ["Giancarlo Giannini", "Mariangela Melato", "Turi Ferro", "Agostina Belli"], "countries": ["Italy"], "directors": ["Lina Wertmèller"], "fullplot": "In Sicily, the mine worker Carmelo \"Mimè\" Mardocheo votes in the Communist Party candidate instead of in the Mafia's one believing that the suffrage is secret. After the elections, he loses his job and cannot find any other job in his village that is controlled by the mobster Don Calogero. He leaves his wife Rosalia with his family and travels to Turin expecting to find a job. He finds an illegal position in the civil construction that is also explored by the Mafia and when a coworker dies in an accident, he finds that the mobsters have dumped his body on the road. However, he does not report the crime to the police and lies to the mobster Salvatore Tricarico telling that he belongs to the family of a powerful mobster. Mimi gets a metallurgic position and joins the Communist Party. Then he fall in love with the virgin Trotskyite street vendor Fiorella Meneghini and they have a boy. When Mimi witness the mobster Vico Tricarico executing several men in a hotel, he survives but he does not report to the police. Mimi is transferred to Catania in a supervisory position against his will. He brings Fiore and their son to Sicily, but he is still married with Rosalia but he claims that he is ill and does not have sex with her. When Mimi learns that Rosalia is pregnant, he finds that he is a cuckold and plots a scheme to seduce and knock up Amalia Finocchiaro, who is the wife of Rosalia's lover. But his revenge does not work as planned.", "genres": ["Comedy"], "imdb": {"id": 68950, "rating": 7.5, "votes": 1026}, "languages": ["English", "Italian"], "lastupdated": "2015-09-15 04:11:46.457000000", "num_mflix_comments": 3, "plot": "In Sicily, the mine worker Carmelo \"Mimè\" Mardocheo votes in the Communist Party candidate instead of in the Mafia's one believing that the suffrage is secret. After the elections, he loses...", "poster": "https://m.media-amazon.com/images/M/MV5BN2EwNjI1NjgtZGM0MS00ZTVjLWIxMzQtYzI3NjJmYTk2ODMzXkEyXkFqcGdeQXVyMTMxMTY0OTQ@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 67305600000, "runtime": 108, "title": "The Seduction of Mimi", "tomatoes": {"dvd": 891302400000, "lastUpdated": 1441304195000, "production": "New Line Cinema", "viewer": {"meter": 74, "numReviews": 788, "rating": 3.5}}, "type": "movie", "writers": ["Lina Wertmèller (screenplay)", "Lina Wertmèller (story)"], "year": 1972}