{"_id": "573a13bdf29313caabd5a72b", "awards": {"nominations": 2, "text": "2 nominations.", "wins": 0}, "cast": ["Gael Garcèa Bernal", "Michelle Williams", "Marife Necesito", "Sophie Nyweide"], "countries": ["Sweden", "Denmark", "Germany"], "directors": ["Lukas Moodysson"], "fullplot": "n New York, the immature family man Leo Vidales is a successful businessman, owner of the Underlandish, a successful website of digital games and married to Dr. Ellen Vidales, a dedicated surgeon of the emergency room of a hospital. They have a daughter, Jackie, who is an intelligent girl that is raised by her nanny, the Filipino Gloria that spends more time with her than Ellen. Gloria has two sons in Philippine that miss her. When Leo need to travel to Singapore with his partner Bob (Tom McCarthy) to sign a millionaire contract with investors, Ellen operates on a boy stabbed in the stomach by his own mother and she feels connected to the boy and rethinks her relationship with Jackie. Meanwhile Leo is bored waiting for the negotiation of Bob with the investors and he decides to travel to Bangkok and lodges in a rustic cottage on the seashore. Leo meets the young prostitute and mother Cookie and he has one night stand with her. Meanwhile, Gloria's ten year-old boy Salvador misses her mother and decides to find a job. His innocence leads him to a tragedy.", "genres": ["Drama"], "imdb": {"id": 1038043, "rating": 6.9, "votes": 8052}, "languages": ["English", "Tagalog", "Thai"], "lastupdated": "2015-09-07 00:34:03.913000000", "metacritic": 51, "num_mflix_comments": 1, "plot": "While on a trip to Thailand, a successful American businessman tries to radically change his life. Back in New York, his wife and daughter find their relationship with their live-in Filipino maid changing around them. At the same time, in the Philippines, the maid's family struggles to deal with her absence.", "poster": "https://m.media-amazon.com/images/M/MV5BMTYzNzU3OTU2NV5BMl5BanBnXkFtZTcwMDc1NzQ5Mg@@._V1_SY1000_SX677_AL_.jpg", "released": 1232668800000, "runtime": 125, "title": "Mammoth", "tomatoes": {"critic": {"meter": 48, "numReviews": 40, "rating": 5.2}, "dvd": 1271721600000, "fresh": 19, "lastUpdated": 1439493202000, "production": "IFC Films", "rotten": 21, "viewer": {"meter": 63, "numReviews": 6961, "rating": 3.4}, "website": "http://www.trustnordisk.com/#/228716/?movieId=ZZ12"}, "type": "movie", "writers": ["Lukas Moodysson"], "year": 2009}