{"_id": "573a13a9f29313caabd204a7", "awards": {"nominations": 10, "text": "12 wins & 10 nominations.", "wins": 12}, "cast": ["Daniel Hendler", "Gustavo Garzèn", "Dolores Fonzi", "Ramiro Agèero"], "countries": ["Argentina"], "directors": ["Damièn Szifrèn"], "fullplot": "Toledo, 25 years old, future architect, suffers from an acute jealousy. He cannot concentrate on his job nor on his studies, being continuously mindful of his girlfriend and concubine Ana's whereabouts and activities. Toledo arrives home and has a long conversation with Ana, who constantly manifests a ridiculous desire of 'going out for a drink'. They lie in bed but all his advances are instantly rejected by a progressively more nervous Ana. He cannot explain her intermittent crying and disturbed reactions. Until she leaves to the kitchen and he finds out that under the bed a male shoe that does not belong to him is carefully hidden by a male hand, under his own eyes. Paralyzed by the discovery he is only capable of leaving with a stupid excuse, trying to hide from Ana the anguish that barely lets him breath. Toledo awaits on the street for the exit of Ana's lover and begins a one-of-a-kind persecution-investigation that will last the whole night, to find out, before confronting him, who is that man and where did he meet Ana.", "genres": ["Drama", "Thriller"], "imdb": {"id": 322298, "rating": 6.8, "votes": 799}, "languages": ["Spanish"], "lastupdated": "2015-09-01 00:56:25.630000000", "num_mflix_comments": 1, "plot": "Toledo, 25 years old, future architect, suffers from an acute jealousy. He cannot concentrate on his job nor on his studies, being continuously mindful of his girlfriend and concubine Ana's...", "poster": "https://m.media-amazon.com/images/M/MV5BMTI5MTg4OTI4NF5BMl5BanBnXkFtZTcwODIxNDAzMQ@@._V1_SY1000_SX677_AL_.jpg", "released": 1062028800000, "runtime": 92, "title": "The Bottom of the Sea", "tomatoes": {"dvd": 1123545600000, "lastUpdated": 1438628247000, "viewer": {"meter": 74, "numReviews": 168, "rating": 3.6}}, "type": "movie", "writers": ["Damièn Szifrèn"], "year": 2003}