{"_id": "573a13dcf29313caabdb1144", "awards": {"nominations": 18, "text": "2 wins & 18 nominations.", "wins": 2}, "cast": ["Arjun Kapoor", "Alia Bhatt", "Amrita Singh", "Revathy"], "countries": ["India"], "directors": ["Abhishek Varman"], "fullplot": "A story about a romantic journey of a culturally opposite couple - Krish Malhotra and Ananya Swaminathan. They meet at the IIM-Ahmedabad College and during the program they fall in love. Complications arise after the program comes to an end and they decide to get married. Krish and Ananya belong to two different states of India. Krish, a North Indian Punjabi boy from Delhi, and Ananya, a Tamilian Brahmin from Chennai. They take a conscious decision; they won't get married until their parents agree. Everything goes downhill when the parents meet. There is a cultural clash and the parents oppose the wedding. To convert their love story into a love marriage, the couple faces a tough battle in front of them. For it is easy to fight and rebel, but much harder to convince. Will Krish and Ananya's love for each other sustain the battles? Will they manage to convince their parents and make it to their wedding?", "genres": ["Comedy", "Drama", "Romance"], "imdb": {"id": 2372678, "rating": 7.1, "votes": 12581}, "languages": ["Hindi"], "lastupdated": "2015-08-11 00:21:28.187000000", "num_mflix_comments": 1, "plot": "How Chetan met his wife and the difficulties they faced in getting married due to their cultural differences.", "poster": "https://m.media-amazon.com/images/M/MV5BMTUwNjQ3Nzk5N15BMl5BanBnXkFtZTgwMjI4MTgzMTE@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 1397779200000, "runtime": 149, "title": "2 States", "tomatoes": {"boxOffice": "$2.2M", "lastUpdated": 1440356683000, "production": "UTV Motion Pictures", "viewer": {"meter": 65, "numReviews": 1428, "rating": 3.6}, "website": "http://www.2states.net/"}, "type": "movie", "writers": ["Chetan Bhagat (story)", "Abhishek Varman (screenplay)", "Hussain Dalal (dialogue)"], "year": 2014}