{"_id": "573a1395f29313caabce201c", "awards": {"nominations": 0, "text": "2 wins.", "wins": 2}, "cast": ["John Wayne", "Maureen O'Hara", "Patrick Wayne", "Stefanie Powers"], "countries": ["USA"], "directors": ["Andrew V. McLaglen"], "fullplot": "George Washington McLintock, \"GW\" to friends and foes alike, is a cattle baron and the richest man in the territory. He anxiously awaits the return of his daughter Becky who has been away at school for the last two years. He's also surprised to see that his wife Katherine has also returned. She had left him some years before without really explaining what he done but she does make the point of saying that she's returned to take their daughter back to the State Capitol with her. GW is highly respected by everyone around him including the farmers who are pouring into the territories with free grants of land and the Indians who are under threat of being relocated to another reservation. Between his wife, his headstrong daughter, the crooked land agent and the thieving government Indian agent, GW tries to keep the peace and do what is best for everyone.", "genres": ["Comedy", "Romance", "Western"], "imdb": {"id": 57298, "rating": 7.3, "votes": 8473}, "languages": ["English"], "lastupdated": "2015-09-16 11:50:02.897000000", "num_mflix_comments": 1, "plot": "George Washington McLintock, \"GW\" to friends and foes alike, is a cattle baron and the richest man in the territory. He anxiously awaits the return of his daughter Becky who has been away ...", "poster": "https://m.media-amazon.com/images/M/MV5BNjAwOTc4ODA2MV5BMl5BanBnXkFtZTcwMjk3NTM1NQ@@._V1._CR47,48,252,390_SX89_AL_.jpg", "rated": "APPROVED", "released": -193622400000, "runtime": 127, "title": "McLintock!", "tomatoes": {"critic": {"meter": 60, "numReviews": 5, "rating": 5.1}, "dvd": 868320000000, "fresh": 3, "lastUpdated": 1442425871000, "production": "United Artists", "rotten": 2, "viewer": {"meter": 85, "numReviews": 16535, "rating": 3.9}}, "type": "movie", "writers": ["James Edward Grant (original screenplay)"], "year": 1963}