{"_id": "573a13a3f29313caabd0e88d", "awards": {"nominations": 7, "text": "14 wins & 7 nominations.", "wins": 14}, "cast": ["Martina Gedeck", "Maxime Foerste", "Sergio Castellitto", "August Zirner"], "countries": ["Germany", "Italy", "Austria", "Switzerland"], "directors": ["Sandra Nettelbeck"], "fullplot": "In a German restaurant, Chef Martha Klein is the undisputed supreme ruler of the kitchen staff and woe to any customer who would dare criticize her cooking. Her life is firmly centered around cooking which takes on a obsessive level with stubborn single mindedness. Even when she is ordered to take therapy, she still constantly talks about her work and the iron clad control she relishes in her task. All that changes when her sister dies in a car accident, leaving her 8 year old daughter, Lina. Martha takes her niece in and while making enquiries for her estranged father, she struggles to care for this stubbornly headstrong child. Meanwhile at work, a new chef named Mario is hired on and Martha feels threatened by this unorthodox intruder. The pressures of both her private and work life combine to create a situation that will fundamentally call her attitudes and life choices into question while these interlopers into her life begin to profoundly change it.", "genres": ["Comedy", "Romance", "Drama"], "imdb": {"id": 246772, "rating": 7.4, "votes": 6493}, "languages": ["German", "Italian"], "lastupdated": "2015-09-04 00:03:56.227000000", "metacritic": 72, "num_mflix_comments": 2, "plot": "When a headstrong chef takes charge of her equally stubborn 8-year-old niece, the tensions between them mount... until an Italian sous-chef arrives to lighten the mood.", "poster": "https://m.media-amazon.com/images/M/MV5BNTYyNzIxMTAyNl5BMl5BanBnXkFtZTYwNzQzMjg2._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 1033084800000, "runtime": 109, "title": "Mostly Martha", "tomatoes": {"boxOffice": "$4.0M", "consensus": "Mostly Martha may have a predictable plot, but it still feels charming and fresh, and the food will make you hungry.", "critic": {"meter": 92, "numReviews": 85, "rating": 7.2}, "dvd": 1045526400000, "fresh": 78, "lastUpdated": 1441220263000, "production": "Paramount Classics", "rotten": 7, "viewer": {"meter": 89, "numReviews": 7876, "rating": 4}, "website": "http://www.paramountclassics.com/martha/"}, "type": "movie", "writers": ["Sandra Nettelbeck"], "year": 2001}