{"_id": "573a1398f29313caabce8fcd", "awards": {"nominations": 1, "text": "3 wins & 1 nomination.", "wins": 3}, "cast": ["Matthew Modine", "Nicolas Cage", "John Harkins", "Sandy Baron"], "countries": ["USA"], "directors": ["Alan Parker"], "fullplot": "Philly boys Al and Birdy became friends in high school despite the extreme difference in their personalities, Al being the popular and athletic extrovert, Birdy the antisocial \"weird\" introvert. Al gave Birdy his nickname because of his fascination - obsession really - with birds, especially with flight. Al and Birdy have just completed their service of duty in the Vietnam War and have returned to the States. Al sustained some serious physical injuries, which required major reconstructive surgery to his face. Birdy, however, returned from Vietnam seemingly emotionally scarred. He was missing in action for one month. He has not spoken since he was found. Despite his own medical issues, Al travels to the institution where Birdy is being kept to see if he can assist in getting Birdy out of his near comatose state. Having always had issues with authority, Al is less than forthright with the doctors about Birdy's mental state prior to the war. As Al tries whatever he can to help Birdy using tools from their shared history prior to the war, he deals with his own post-war mental state.", "genres": ["Drama", "War"], "imdb": {"id": 86969, "rating": 7.3, "votes": 16392}, "languages": ["English"], "lastupdated": "2015-08-22 00:42:17.720000000", "num_mflix_comments": 1, "plot": "After two friends return home from the Vietnam War one becomes mentally unstable and obsesses with becoming a bird.", "poster": "https://m.media-amazon.com/images/M/MV5BZTJkZmVkNjUtODUyZi00NjZhLTk0NmUtNGJhMjRlYWQxMTlmL2ltYWdlXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 472435200000, "runtime": 120, "title": "Birdy", "type": "movie", "writers": ["William Wharton (based on the novel by)", "Sandy Kroopf (screenplay)", "Jack Behr (screenplay)"], "year": 1984}