{"_id": "573a139af29313caabcf0058", "awards": {"nominations": 1, "text": "5 wins & 1 nomination.", "wins": 5}, "cast": ["Nana Patekar", "Salman Khan", "Manisha Koirala", "Seema Biswas"], "countries": ["India"], "directors": ["Sanjay Leela Bhansali"], "fullplot": "Goa based Joseph Braganza and his wife Flavy, devout Catholics, are both deaf and mute. He makes a living selling soap bars door to door. Flavy gets pregnant and gives birth to a daughter who they name Annie, who can speak and hear much to their delight. Flavy soon gives birth to a son, Sam, who can also hear and speak. A few years later, Sam accidentally passes away, making Joseph lose faith. Joseph, unable to make a living selling soap, opens a toy making factory and the family prospers. Annie grows up, takes to music and singing in a great way, meets with a young man named Raj and both fall in love. Joseph dislikes Raj, mainly because he is Hindu, is able to speak and hear, not a resident of Goa, and the fear of losing Annie forever and thus their contact with the world. When Annie gets pregnant, Joseph is enraged, he asks her to abort, when she refuses, he asks her to leave his house. What will Annie do next? Will Joseph, Flavy and Annie ever re-unite.", "genres": ["Drama", "Musical", "Romance"], "imdb": {"id": 116763, "rating": 7.5, "votes": 1551}, "languages": ["Hindi"], "lastupdated": "2015-08-21 00:59:25.877000000", "plot": "Goa based Joseph Braganza and his wife Flavy, devout Catholics, are both deaf and mute. He makes a living selling soap bars door to door. Flavy gets pregnant and gives birth to a daughter ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTY5MzIyNTE5MF5BMl5BanBnXkFtZTgwMjY4ODk1MDE@._V1_SY1000_SX677_AL_.jpg", "released": 839548800000, "runtime": 159, "title": "Khamoshi: The Musical", "tomatoes": {"dvd": 1172620800000, "lastUpdated": 1438022508000, "viewer": {"meter": 77, "numReviews": 550, "rating": 3.7}}, "type": "movie", "writers": ["Sanjay Leela Bhansali", "Sutapa Sikdar (dialogue)"], "year": 1996}