{"_id": "573a13ccf29313caabd81c71", "awards": {"nominations": 9, "text": "17 wins & 9 nominations.", "wins": 17}, "cast": ["Rafael Morais", "Rita Blanco", "Anabela Moreira", "Cleia Almeida"], "countries": ["Portugal"], "directors": ["Joèo Canijo"], "fullplot": "The realities of life are harsh in Padre Cruz, a slum on the edge of Lisbon, and its inhabitants struggle with violence and poverty. Joèo Canijo's latest feature portrays life in this decrepit Portuguese suburb through the story of a family attempting to transcend its hardships. Mèrcia (Rita Blanco) shares cramped quarters with her two young-adult children and her sister Ivete. Her daughter Clèudia shows promise in her nursing studies, but her son Joca (Rafael Morais) is a delinquent with a suspicious supply of cash. Mèrcia's hopes for her daughter's future are thrown into turmoil, however, when Clèudia announces she's having a relationship with a married professor, an admission that brings out the specter of Mèrcia's own past. Mèrcia is determined to bring the affair to an end, even if it means compromising her cherished relationship with Clèudia. In her late thirties and yearning for companionship, Ivete loves her family and has a soft spot for her nephew Joca, despite his frequent brushes with the law. When a notorious drug dealer discovers Joca has tried to cheat him, the latter turns to Ivete, the only person who will bail him out. The fallout from the incident has perilous consequences for them both. Canijo spent over two years rehearsing with the actors, and the result is a masterful piece that speaks deeply about unconditional love. Despite the difficulties against which the characters struggle for the benefit of their loved ones, Canijo's skillful cinematic treatment brings a message of hope and renewal as well as sacrifice.", "genres": ["Drama", "Thriller"], "imdb": {"id": 1625155, "rating": 7.5, "votes": 1298}, "languages": ["Portuguese"], "lastupdated": "2015-08-12 00:01:34.953000000", "num_mflix_comments": 2, "plot": "A regular family living in the outskirts of Lisbon sees the serenity of their lives shaken beyond any remedy within a week.", "poster": "https://m.media-amazon.com/images/M/MV5BNTExMjU5NTAwMF5BMl5BanBnXkFtZTcwNTEwODYzNw@@._V1_SY1000_SX677_AL_.jpg", "released": 1317772800000, "runtime": 131, "title": "Blood of My Blood", "type": "movie", "writers": ["Joèo Canijo"], "year": 2011}