{"_id": "573a13bff29313caabd5efc0", "awards": {"nominations": 45, "text": "Nominated for 1 Oscar. Another 7 wins & 45 nominations.", "wins": 8}, "cast": ["Ryan Gosling", "Michelle Williams", "Faith Wladyka", "John Doman"], "countries": ["USA"], "directors": ["Derek Cianfrance"], "fullplot": "Dean Pereira and Cindy Heller Pereira are a young, working class married couple - Dean currently working as a painter, and Cindy working as a nurse in a medical clinic - with a young daughter named Frankie. Despite their relatively tender ages, they are both ravaged by the life they've eked out together and by the experiences they've had leading into their marriage. Dean, a high school drop out, comes from a broken home, where he never really had a mother figure. He never saw himself getting married or having a family despite falling in love at first sight with Cindy. He doesn't have any professional ambition beyond his current work - which he enjoys since he feels he can knock off a beer at 8 o'clock in the morning without it affecting his work - although Cindy believes he has so much more potential in life. Cindy also comes from a dysfunctional family, with her own mother and father not setting an example of a harmonious married or family life. One of her previous serious relationships was with Bobby Ontario, that relationship which has a profound affect on many aspects of her marriage to Dean. Dean and Cindy head off on an overnight getaway together without Frankie, the getaway which may provide a clearer picture if their marriage can survive its many issues.", "genres": ["Drama", "Romance"], "imdb": {"id": 1120985, "rating": 7.4, "votes": 130620}, "languages": ["English"], "lastupdated": "2015-09-12 00:39:21.773000000", "metacritic": 81, "plot": "The relationship of a contemporary married couple, charting their evolution over a span of years by cross-cutting between time periods.", "poster": "https://m.media-amazon.com/images/M/MV5BMTU4MTQ2MzA1Ml5BMl5BanBnXkFtZTcwODE3NTgwNA@@._V1_SY1000_SX677_AL_.jpg", "rated": "NC-17", "released": 1296172800000, "runtime": 112, "title": "Blue Valentine", "tomatoes": {"boxOffice": "$9.7M", "consensus": "This emotionally gripping examination of a marriage on the rocks isn't always easy to watch, but Michelle Williams and Ryan Gosling give performances of unusual depth and power.", "critic": {"meter": 88, "numReviews": 193, "rating": 7.8}, "dvd": 1304985600000, "fresh": 169, "lastUpdated": 1442164995000, "production": "Weinstein Company", "rotten": 24, "viewer": {"meter": 76, "numReviews": 57410, "rating": 3.7}, "website": "http://bluevalentinemovie.com/"}, "type": "movie", "writers": ["Derek Cianfrance", "Joey Curtis", "Cami Delavigne"], "year": 2010}