{"_id": "573a13b0f29313caabd34419", "awards": {"nominations": 57, "text": "Won 1 Oscar. Another 35 wins & 57 nominations.", "wins": 36}, "cast": ["Johnny Depp", "Helena Bonham Carter", "Alan Rickman", "Timothy Spall"], "countries": ["USA", "UK"], "directors": ["Tim Burton"], "fullplot": "In the Victorian London, the barber Benjamin Barker is married to the gorgeous Lucy and they have a lovely child, Johanna. The beauty of Lucy attracts the attention of the corrupt Judge Turpin, who falsely accuses the barber of a crime that he did not commit and abuses Lucy later after gaining custody of her. After fifteen years in exile, Benjamin returns to London under the new identity of Sweeney Todd, seeking revenge against Turpin. He meets the widow Mrs. Lovett who is the owner of a meat pie shop who tells him that Lucy swallowed arsenic many years ago, and Turpin assigned himself tutor of Johanna. He opens a barber shop above her store, initiating a crime rampage against those who made him suffer and lose his beloved family.", "genres": ["Drama", "Horror", "Musical"], "imdb": {"id": 408236, "rating": 7.5, "votes": 260495}, "languages": ["English", "Italian"], "lastupdated": "2015-09-06 00:00:34.573000000", "metacritic": 83, "num_mflix_comments": 379, "plot": "The infamous story of Benjamin Barker, AKA Sweeney Todd, who sets up a barber shop down in London which is the basis for a sinister partnership with his fellow tenant, Mrs. Lovett. Based on the hit Broadway musical.", "poster": "https://m.media-amazon.com/images/M/MV5BMTg3NjUxMzM5NV5BMl5BanBnXkFtZTcwMzQ1NjQzMw@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1198195200000, "runtime": 116, "title": "Sweeney Todd: The Demon Barber of Fleet Street", "tomatoes": {"boxOffice": "$52.8M", "consensus": "Full of pith and Grand Guignol grossness, this macabre musical is perfectly helmed and highly entertaining. Tim Burton masterfully stages the musical in a way that will make you think he has done this many times before.", "critic": {"meter": 86, "numReviews": 220, "rating": 7.7}, "dvd": 1207008000000, "fresh": 189, "lastUpdated": 1442164248000, "production": "DreamWorks/Paramount Studios", "rotten": 31, "viewer": {"meter": 81, "numReviews": 1694022, "rating": 3.9}, "website": "http://www.SweeneyToddMovie.com/"}, "type": "movie", "writers": ["John Logan (screenplay)", "Hugh Wheeler (musical)", "Christopher Bond (musical adaptation)"], "year": 2007}