{"_id": "573a13bdf29313caabd57f6e", "awards": {"nominations": 0, "text": "4 wins.", "wins": 4}, "cast": ["Scoot McNairy", "Sara Simmonds", "Brian McGuire", "Kathleen Luong"], "countries": ["USA"], "directors": ["Alex Holdridge"], "fullplot": "On New Year's Eve, Wilson, a twenty-nine-year old guy has just had the worst year of his life. He emigrated to Los Angeles, has no date, no concrete plans and every intention of locking the doors and forgetting the last year ever happened. That is until his best friend, Jacob, browbeats him into posting a personal ad on Craig's List. When Vivian, a strong-willed woman hell bent on being with the right guy at the stroke of midnight responds, a chaotic, sometimes hilarious, sometimes touching journey through the black and white streets of L.A. begins. In the waning hours of the year, emotional vulnerability and bitterly honest humor seem to be waiting around every corner.", "genres": ["Comedy", "Romance"], "imdb": {"id": 989000, "rating": 7.3, "votes": 6901}, "languages": ["English"], "lastupdated": "2015-08-27 00:39:30.947000000", "metacritic": 64, "num_mflix_comments": 1, "plot": "Broke and alone on New Year's Eve, Wilson just wants to spend the rest of a very bad year in bed. But, when his best friend convinces him to post a personal ad, he meets a woman bent on finding the right guy to be with at midnight.", "poster": "https://m.media-amazon.com/images/M/MV5BMTQyMzMyMTY2M15BMl5BanBnXkFtZTcwNzQ1Mzc3MQ@@._V1_SY1000_SX677_AL_.jpg", "released": 1217548800000, "runtime": 90, "title": "In Search of a Midnight Kiss", "tomatoes": {"consensus": "Funny, quirky, and bittersweet, In Search of a Midnight Kiss is a romantic comedy with a heart and a brain -- and stands as a sharp debut for director Alex Holdridge.", "critic": {"meter": 86, "numReviews": 63, "rating": 7}, "dvd": 1230595200000, "fresh": 54, "lastUpdated": 1440614062000, "production": "IFC First Take", "rotten": 9, "viewer": {"meter": 79, "numReviews": 4106, "rating": 3.8}, "website": "http://www.midnightkissmovie.com/"}, "type": "movie", "writers": ["Alex Holdridge"], "year": 2007}