{"_id": "573a13c0f29313caabd612ec", "awards": {"nominations": 2, "text": "4 wins & 2 nominations.", "wins": 4}, "cast": ["Franz Dinda", "Niklas Kohrt", "Janusz Kocaj", "Michael Ginsburg"], "countries": ["Germany"], "directors": ["Thomas Stuber"], "fullplot": "At an elite private boarding school, four students form a clique to sneak out of school after hours, to meet, drink and play. Trying to escape the golden cage, which their wealthy parents have stuck them in, they search for the extreme. Over time, their excessive games grow more and more violent, eventually turning against the weakest of their group: Leibnitz. As Dyrbusch (leader of the pack) and Bogatsch (the executive power) continue torturing Leibnitz, he voluntarily endures because he's unable to dispose of his tormentors, on one hand being afraid to lose their \"friendship,\" and on the other hand, due to potential consequences which may arise from his parents. Konstantin, the opportunist, is the only one who sees through the immorality of their games, but he hesitates too long, not wishing to endanger the alleged common destiny that the boys in this school appear to have: their clique. They are swept deeper and deeper into the downward spiral of their own violence and peer pressure, until the unavoidable happens...", "genres": ["Drama", "Thriller"], "imdb": {"id": 1159705, "rating": 5.5, "votes": 305}, "languages": ["German"], "lastupdated": "2015-08-14 00:28:20.333000000", "num_mflix_comments": 4, "plot": "At an elite private boarding school, four students form a clique to sneak out of school after hours, to meet, drink and play. Trying to escape the golden cage, which their wealthy parents ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTIzOTU2NjcyM15BMl5BanBnXkFtZTcwMjA1NzY5MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 1233187200000, "runtime": 64, "title": "Teenage Angst", "tomatoes": {"dvd": 1228780800000, "lastUpdated": 1441905954000, "production": "Filmakademie Baden-Wurttemberg", "viewer": {"meter": 27, "numReviews": 88, "rating": 2.8}}, "type": "movie", "writers": ["Holger Jèckle", "Andrea Kuhn (storyline consultant)"], "year": 2008}