{"_id": "573a13d2f29313caabd91d33", "awards": {"nominations": 46, "text": "Nominated for 1 Oscar. Another 5 wins & 46 nominations.", "wins": 6}, "cast": ["Chris Evans", "Samuel L. Jackson", "Scarlett Johansson", "Robert Redford"], "countries": ["USA"], "directors": ["Anthony Russo", "Joe Russo"], "fullplot": "For Steve Rogers, awakening after decades of suspended animation involves more than catching up on pop culture; it also means that this old school idealist must face a world of subtler threats and difficult moral complexities. That becomes clear when Director Nick Fury is killed by the mysterious assassin, the Winter Soldier, but not before warning Rogers that SHIELD has been subverted by its enemies. When Rogers acts on Fury's warning to trust no one there, he is branded as a traitor by the organization. Now a fugitive, Captain America must get to the bottom of this deadly mystery with the help of the Black Widow and his new friend, The Falcon. However, the battle will be costly for the Sentinel of Liberty, with Rogers finding enemies where he least expects them while learning that the Winter Soldier looks disturbingly familiar.", "genres": ["Action", "Adventure", "Sci-Fi"], "imdb": {"id": 1843866, "rating": 7.8, "votes": 398260}, "languages": ["English"], "lastupdated": "2015-08-22 00:03:41.077000000", "metacritic": 70, "num_mflix_comments": 2, "plot": "As Steve Rogers struggles to embrace his role in the modern world, he teams up with another super soldier, the black widow, to battle a new threat from old history: an assassin known as the Winter Soldier.", "poster": "https://m.media-amazon.com/images/M/MV5BMzA2NDkwODAwM15BMl5BanBnXkFtZTgwODk5MTgzMTE@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1396569600000, "runtime": 136, "title": "Captain America: The Winter Soldier", "tomatoes": {"boxOffice": "$259.7M", "consensus": "Suspenseful and politically astute, Captain America: The Winter Soldier is a superior entry in the Avengers canon and is sure to thrill Marvel diehards.", "critic": {"meter": 89, "numReviews": 253, "rating": 7.5}, "dvd": 1410220800000, "fresh": 224, "lastUpdated": 1441905530000, "production": "Walt Disney Pictures", "rotten": 29, "viewer": {"meter": 92, "numReviews": 271294, "rating": 4.3}, "website": "http://marvel.com/captainamerica"}, "type": "movie", "writers": ["Christopher Markus (screenplay)", "Stephen McFeely (screenplay)", "Joe Simon (based on the Marvel comic by)", "Jack Kirby (based on the Marvel comic by)"], "year": 2014}