{"_id": "573a1396f29313caabce338f", "awards": {"nominations": 3, "text": "Nominated for 1 Oscar. Another 1 win & 3 nominations.", "wins": 2}, "cast": ["Audrey Hepburn", "Alan Arkin", "Richard Crenna", "Efrem Zimbalist Jr."], "countries": ["USA"], "directors": ["Terence Young"], "fullplot": "Susy was recently blinded and recently married. Susy's husband, Sam, is asked to hold a doll for a woman he doesn't know as they get off an airplane. The woman disappears. Later, she's found dead by her former associates, Mike and Carlino, small-time hoods, in Susy's basement apartment. (Both occupants of the apartment are then absent.) The doll woman's newer partner in crime, Harry Rote, who murdered her for self-dealing, presses Mike and Carlino into a scheme to recover the doll, which contains a fortune in smuggled heroin. After disposing of the body, the thugs return while Susy is present to continue their search. They assume Susy's blindness will enable them to search her apartment under her very nose for the doll, which contains a fortune in smuggled heroin. In Sam's absence, Mike pretends to be an old friend of Sam's, while the three together spin for Susy a story of a murder investigation of her husband from which only the finding of the missing doll can save him. Rote is a predator, and his stalking of Susy becomes ever more obvious as the blind woman's predicament becomes ever more desperate.", "genres": ["Crime", "Drama", "Thriller"], "imdb": {"id": 62467, "rating": 7.9, "votes": 18993}, "languages": ["English"], "lastupdated": "2015-08-16 00:16:21.290000000", "num_mflix_comments": 1, "plot": "A recently blinded woman is terrorized by a trio of thugs while they search for a heroin stuffed doll they believe is in her apartment.", "poster": "https://m.media-amazon.com/images/M/MV5BMTQyNTAzOTI3NF5BMl5BanBnXkFtZTcwNTM0Mjg0Mg@@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": -68947200000, "runtime": 108, "title": "Wait Until Dark", "tomatoes": {"critic": {"meter": 94, "numReviews": 18, "rating": 7.9}, "dvd": 1060041600000, "fresh": 17, "lastUpdated": 1441906609000, "production": "Warner Home Video", "rotten": 1, "viewer": {"meter": 91, "numReviews": 16714, "rating": 4}}, "type": "movie", "writers": ["Frederick Knott (play)", "Robert Carrington (screenplay)", "Jane-Howard Carrington (screenplay)"], "year": 1967}