{"_id": "573a13a0f29313caabd0654b", "awards": {"nominations": 60, "text": "Nominated for 5 Oscars. Another 58 wins & 60 nominations.", "wins": 63}, "cast": ["Audrey Tautou", "Mathieu Kassovitz", "Rufus", "Lorella Cravotta"], "countries": ["France", "Germany"], "directors": ["Jean-Pierre Jeunet"], "fullplot": "Amèlie is a story about a girl named Amèlie whose childhood was suppressed by her Father's mistaken concerns of a heart defect. With these concerns Amèlie gets hardly any real life contact with other people. This leads Amèlie to resort to her own fantastical world and dreams of love and beauty. She later on becomes a young woman and moves to the central part of Paris as a waitress. After finding a lost treasure belonging to the former occupant of her apartment, she decides to return it to him. After seeing his reaction and his new found perspective - she decides to devote her life to the people around her. Such as, her father who is obsessed with his garden-gnome, a failed writer, a hypochondriac, a man who stalks his ex girlfriends, the \"ghost\", a suppressed young soul, the love of her life and a man whose bones are as brittle as glass. But after consuming herself with these escapades - she finds out that she is disregarding her own life and damaging her quest for love. Amèlie then discovers she must become more aggressive and take a hold of her life and capture the beauty of love she has always dreamed of.", "genres": ["Comedy", "Romance"], "imdb": {"id": 211915, "rating": 8.4, "votes": 481311}, "languages": ["French", "Russian"], "lastupdated": "2015-09-15 02:11:17.437000000", "metacritic": 69, "num_mflix_comments": 3, "plot": "Amelie is an innocent and naive girl in Paris with her own sense of justice. She decides to help those around her and, along the way, discovers love.", "poster": "https://m.media-amazon.com/images/M/MV5BNDg4NjM1YjMtYmNhZC00MjM0LWFiZmYtNGY1YjA3MzZmODc5XkEyXkFqcGdeQXVyNDk3NzU2MTQ@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1013126400000, "runtime": 122, "title": "Amèlie", "tomatoes": {"consensus": "The feel-good Amelie is a lively, fanciful charmer, showcasing Audrey Tautou as its delightful heroine.", "critic": {"meter": 89, "numReviews": 176, "rating": 8.1}, "dvd": 1026777600000, "fresh": 156, "lastUpdated": 1441909384000, "production": "Miramax Films", "rotten": 20, "viewer": {"meter": 95, "numReviews": 465959, "rating": 4.2}, "website": "http://www.miramax.com/movie/amelie"}, "type": "movie", "writers": ["Guillaume Laurant (scenario)", "Jean-Pierre Jeunet (scenario)", "Guillaume Laurant (dialogue)"], "year": 2001}