{"_id": "573a13d4f29313caabd97620", "awards": {"nominations": 6, "text": "6 wins & 6 nominations.", "wins": 6}, "cast": ["Julianne Moore", "Chloè Grace Moretz", "Gabriella Wilde", "Portia Doubleday"], "countries": ["USA"], "directors": ["Kimberly Peirce"], "fullplot": "The outcast teenager Carrie White is bullied by her classmates at high-school. Her mother Margaret White is a pious and paranoid woman that sees sin everywhere and the need of self-inflicting punishment. When Carrie has her first period, she does not understand what is happening to her and her classmates humiliate her in the changing room. The spiteful Chris Hargensen videotapes Carrie with her cell phone and posts in Internet. Their teacher Ms. Desjardin punishes the students, but when Chris challenges her, she is suspended and consequently she can not go to the prom. Meanwhile Carrie discovers that she has telekinesis and learns how to control her ability. The popular Sue Snell feels bad with her attitude towards Carrie and asks her boyfriend Tommy Ross to invite Carrie to go with him to the prom to make up for what she did to Carrie. But Chris and her boyfriend Billy Nolan plot an evil prank with her friends to seek vengeance for Carrie with tragic consequences.", "genres": ["Drama", "Horror"], "imdb": {"id": 1939659, "rating": 6, "votes": 98171}, "languages": ["English"], "lastupdated": "2015-09-04 00:20:33.633000000", "metacritic": 53, "num_mflix_comments": 2, "plot": "A reimagining of the classic horror tale about Carrie White, a shy girl outcast by her peers and sheltered by her deeply religious mother, who unleashes telekinetic terror on her small town after being pushed too far at her senior prom.", "poster": "https://m.media-amazon.com/images/M/MV5BODg2MDU2MjYxNl5BMl5BanBnXkFtZTcwMDQ5MzU0OQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1382054400000, "runtime": 100, "title": "Carrie", "tomatoes": {"boxOffice": "$35.3M", "consensus": "It boasts a talented cast, but Kimberly Peirce's \"reimagining\" of Brian De Palma's horror classic finds little new in the Stephen King novel -- and feels woefully unnecessary.", "critic": {"meter": 48, "numReviews": 161, "rating": 5.4}, "dvd": 1389657600000, "fresh": 78, "lastUpdated": 1441905401000, "production": "Sony Pictures", "rotten": 83, "viewer": {"meter": 45, "numReviews": 81239, "rating": 3.2}, "website": "http://www.carrie-movie.com/"}, "type": "movie", "writers": ["Lawrence D. Cohen (screenplay)", "Roberto Aguirre-Sacasa (screenplay)", "Stephen King (novel)"], "year": 2013}