{"_id": "573a13c1f29313caabd65230", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Uma Thurman", "Anthony Edwards", "David Schallipp", "Matthew Schallipp"], "countries": ["USA"], "directors": ["Katherine Dieckmann"], "fullplot": "Eliza Kendall Welch (Uma Thurman), mother of, Clara, and Lucas, lives with her spouse, Avery McKendrik (Anthony Edwards), in an Manhattan apartment. Today is May 25th, Clara's 6th birthday, and she has to make arrangements for a party, as well as attend to day-to-day chores, including Blogging, and entering an online contest 'Motherhood', and looking after her invalid elderly neighbor and a dog. Things will slowly get out of hand after her car gets towed due to a film shooting; the tire on her bike gets punctured; she alienates herself from her friend, Sheila (Minnie Driver); Clara's name is misspelled on the cake; while Avery refuses to answer his cell-phone. After being assisted by a delivery man, Nikesh (Arjun Gupta), who finds her attractive, she concludes she has had enough, and decides not to return home.", "genres": ["Comedy", "Drama"], "imdb": {"id": 1220220, "rating": 4.6, "votes": 3500}, "languages": ["English"], "lastupdated": "2015-08-24 01:05:03.057000000", "metacritic": 34, "num_mflix_comments": 2, "plot": "In Manhattan, a mother of two preparing for her daughter's sixth birthday party has no idea of the challenges she's about to face in order to pull off the event.", "poster": "https://m.media-amazon.com/images/M/MV5BMTk0OTYwOTA2Ml5BMl5BanBnXkFtZTcwNDgxOTg3Mg@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1251417600000, "runtime": 90, "title": "Motherhood", "tomatoes": {"boxOffice": "$50.1k", "consensus": "Despite Uma Thurman's comic skills, Motherhood's contrived set-ups and cliched jokes keep this comedy from delivering laughs -- or insights into modern parenting.", "critic": {"meter": 20, "numReviews": 51, "rating": 3.9}, "dvd": 1266883200000, "fresh": 10, "lastUpdated": 1440529871000, "production": "Freestyle Releasing", "rotten": 41, "viewer": {"meter": 17, "numReviews": 3381, "rating": 2.3}, "website": "http://www.motherhoodthefilm.com"}, "type": "movie", "writers": ["Katherine Dieckmann"], "year": 2009}