{"_id": "573a139af29313caabcf02b9", "awards": {"nominations": 10, "text": "Nominated for 2 Oscars. Another 8 wins & 10 nominations.", "wins": 10}, "cast": ["Nicole Kidman", "John Malkovich", "Barbara Hershey", "Mary-Louise Parker"], "countries": ["UK", "USA"], "directors": ["Jane Campion"], "fullplot": "Isabel Archer, an American heiress and free thinker travels to Europe to find herself. She tactfully rebuffs the advances of Caspar Goodwood, another American who has followed her to England. Her cousin, Ralph Touchett, wise but sickly becomes a soulmate of sorts for her. She makes an unfortunate alliance with the creepy Madame Merle who leads her to make an even more unfortunate alliance with Gilbert Osmond, a smooth but cold collector of Objets' de art who seduces her with an intense but unattainable sexuality. Isabel marries Osmond only to realize she's just another piece of art for his collection and that Madame Merle and Osmond are lovers who had hatched a diabolical scheme to take Isabel's fortune. Isabel's only comfort is the innocent daughter of Osmond, Pansy, but even that friendship is spoiled when Countess Gemini, Osmond's sister, reveals the child's true parentage. Isabel finally breaks free of Osmond and returns to Ralph's bedside, where, while breathing his last, they both realize how truly connected they are, physically, emotionally, and spiritually.", "genres": ["Drama", "Romance"], "imdb": {"id": 117364, "rating": 6.2, "votes": 8414}, "languages": ["English", "Italian"], "lastupdated": "2015-09-04 00:38:18.740000000", "metacritic": 61, "num_mflix_comments": 1, "plot": "An American girl inherits a fortune and falls into a misguided relationship with a gentleman confidence artist whose true nature, including a barbed and covetous disposition, turns her life into a nightmare.", "poster": "https://m.media-amazon.com/images/M/MV5BMWU4ZTgwYmYtZDMwNS00M2YyLTg4NTMtOGIxNWQyMmNiNDUzXkEyXkFqcGdeQXVyMTAwMzUyOTc@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 853459200000, "runtime": 144, "title": "The Portrait of a Lady", "tomatoes": {"critic": {"meter": 43, "numReviews": 28, "rating": 5.5}, "dvd": 937267200000, "fresh": 12, "lastUpdated": 1442263643000, "production": "PolyGram Video", "rotten": 16, "viewer": {"meter": 52, "numReviews": 7126, "rating": 3.2}}, "type": "movie", "writers": ["Henry James (novel)", "Laura Jones (screenplay)"], "year": 1996}