{"_id": "573a13bdf29313caabd59ef2", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Rupert Evans", "Richard Brake", "Dave Legeno", "Anna Skellern"], "countries": ["USA", "France", "Belgium"], "directors": ["Alexandre Courtès"], "fullplot": "In 1989, in Washington, the friends George, Max and Ricky are aspirant musicians that play in a band in their leisure time. They work as cooks in the Sans Asylum to earn money to pay their bills, including renting a studio to record their songs. The asylum is located in an isolated area and is monitored by a team led by the security guard J.B. The deranged inmates are criminals and they take pills to stay calm. One day, George has a concert during the night but J.B. asks him to arrive early in the morning to receive the supplies for the kitchen. George leaves his girlfriend Lynn without sleeping and heads to the asylum. While he is preparing the meals for the insane inmates with his colleagues, there is a storm and a power outage in the area and the monitoring system fails. With the mental hospital in the darkness, the inmates led by the cruel Harry Green attack the guards and staff. George and the other kitchen workers hide from the horde of violent madmen. Will they survive?", "genres": ["Horror", "Thriller"], "imdb": {"id": 1027820, "rating": 5.5, "votes": 2835}, "languages": ["English"], "lastupdated": "2015-09-17 04:42:26.770000000", "num_mflix_comments": 1, "plot": "A group of cooks at an asylum for the criminally insane get locked in with the inmates during a massive thunderstorm.", "poster": "https://m.media-amazon.com/images/M/MV5BMjMxNDEyMzU2M15BMl5BanBnXkFtZTcwNTg4ODQ3Nw@@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 1336089600000, "runtime": 85, "title": "Asylum Blackout", "tomatoes": {"dvd": 1191974400000, "lastUpdated": 1432751224000, "viewer": {"meter": 88, "numReviews": 178, "rating": 4.2}}, "type": "movie", "writers": ["S. Craig Zahler", "Jèrème Fansten (additional dialogue and material)"], "year": 2011}