{"_id": "573a13bbf29313caabd52571", "awards": {"nominations": 12, "text": "25 wins & 12 nominations.", "wins": 25}, "cast": ["Hanyu Zhang", "Chao Deng", "Wenkang Yuan", "Yan Tang"], "countries": ["China", "Hong Kong"], "directors": ["Xiaogang Feng"], "fullplot": "War feasts upon death. Its greedy appetite carries away many a life on the battlefield, and soldiers must be ready to die at any time. Yet all these sacrifices can be given meaning and reason with honor. A weathered witness of war's insatiable appetite, Guzidi, Captain of the Ninth Company, will struggle his entire life to return honor to his forty six men and their self-sacrifice. The year 1948 witnessed the launching of the Huaihai Campaign during the Chinese Civil War. In one of Chinese history's deadliest battles, thousands from the People's Liberation Army (PLA) and the Nationalist Army (KMT) fell in the battle that took place between Xuzhou and Bengdu. It was amid this bloody fight that Captain Guzidi led the Ninth Company infantry unit on a sniper mission. His orders were to fight the KMT Army until the retreat assembly call was sounded. Yet, after many long hours of painstaking resistance, Gu watched powerless as the ammunition ran out and the scant ranks of the Ninth Company grew sparser still. The men were falling one by one. On the brink of death, Lieutenant Jiao Dapeng, Gu's best partner, announced that he heard the call and asked Gu to retreat with the remaining soldiers. The dying man's words spread doubt within the remainder of the company, but Gu insisted that the bugle had not sounded and that they were to continue fighting at all costs. Not until later did Gu realize that all the neighboring troops had already left the field, and that his entire company had maybe died in vain because of his stubborn obedience. Blinded by anger and guilt, Gu marched straight into the enemy's trench. But his life was spared, and he had no choice but to shoulder the gargantuan weight of guilt and mystery that would burden the remainder of his life. A few days later, Gu woke up in a hospital. While among the KMT ranks, he had been wounded and captured by the PLA. He had lost his identity, and quickly learnt that without a survivor to vouch for them, the forty six men who had bravely sacrificed their lives under him had simply gone missing. Gu joined the infantry of the Liberation Army and painstakingly climbed up the lower rungs of the military ladder. Determined to prove the glorious death of his forty-six men, Gu embarks on a journey in search of those who hold the key to the mystery of the bugle call.", "genres": ["Action", "Biography", "Drama"], "imdb": {"id": 881200, "rating": 7.3, "votes": 5229}, "languages": ["Mandarin"], "lastupdated": "2015-08-27 00:23:49.417000000", "num_mflix_comments": 2, "plot": "A soldier fights to gain recognition for comrades who died during the Chinese Civil War.", "poster": "https://m.media-amazon.com/images/M/MV5BYjYxNWFiZWItMWYyYi00ZWZmLTg0YmMtYTk3MWY4MjFhZTMyXkEyXkFqcGdeQXVyMjA0MzYwMDY@._V1_SY1000_SX677_AL_.jpg", "released": 1198108800000, "runtime": 124, "title": "Assembly", "tomatoes": {"dvd": 1243296000000, "lastUpdated": 1439146611000, "production": "Metrodome Distribution", "viewer": {"meter": 86, "numReviews": 2913, "rating": 3.9}}, "type": "movie", "writers": ["Yang Jingyuan (original novel)", "Heng Liu"], "year": 2007}