{"_id": "573a1397f29313caabce7b29", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Woody Allen", "Charlotte Rampling", "Jessica Harper", "Marie-Christine Barrault"], "countries": ["USA"], "directors": ["Woody Allen"], "fullplot": "Renowned filmmaker Sandy Bates is in a professional transition, directing largely comedies early in his career now wanting to direct more serious movies so that he can explore the meaning of life, most specifically his own. Most are fighting him all along the way, including the movie going public, who continually tell him that they love his movies especially the earlier funny ones, to studio executives who are trying to insert comic elements wherever possible into his current movie in production. He reluctantly agrees to attend a weekend long film festival of his movies. Despite the throng of requests for his time, he is further able to reflect on his life as he addresses the questions at the post screening Q&A sessions. He also reflects specifically on his love life as his current girlfriend, married Isobel, shows up unexpectedly, and as he starts to fall for festival attendee Daisy - at the festival with her Columbia professor boyfriend, Jack Abel - who reminds him of Dorrie, a neurotic former girlfriend who he probably considers the one that unfortunately got away.", "genres": ["Comedy", "Drama"], "imdb": {"id": 81554, "rating": 7.5, "votes": 15145}, "languages": ["English", "French", "Persian"], "lastupdated": "2015-09-03 01:09:13.023000000", "num_mflix_comments": 1, "plot": "While attending a retrospect of his work, a filmmaker recalls his life and his loves: the inspirations for his films.", "poster": "https://m.media-amazon.com/images/M/MV5BNDIzYzhhYjUtOGZkOS00NjM4LWFjOGYtYTUxOTIwNzgxNjNjXkEyXkFqcGdeQXVyMjI4MjA5MzA@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 338774400000, "runtime": 89, "title": "Stardust Memories", "tomatoes": {"critic": {"meter": 72, "numReviews": 25, "rating": 6.6}, "dvd": 962755200000, "fresh": 18, "lastUpdated": 1440439452000, "production": "United Artists", "rotten": 7, "viewer": {"meter": 79, "numReviews": 8863, "rating": 3.8}}, "type": "movie", "writers": ["Woody Allen"], "year": 1980}