{"_id": "573a1394f29313caabce0b13", "awards": {"nominations": 1, "text": "4 wins & 1 nomination.", "wins": 4}, "cast": ["Toshirè Mifune", "Minoru Chiaki", "Kamatari Fujiwara", "Susumu Fujita"], "countries": ["Japan"], "directors": ["Akira Kurosawa"], "fullplot": "The story follows two greedy peasants in feudal Japan, Tahei and Matashichi, who are returning home from a failed attempt to profit from a war between neighboring clans. En Route they encounter the remnants of the defeated tribe that consists, most notably, of a famous General and a Princess who are hiding out in a fortress in the mountains. General Rokurota Makabe and Princess Yuki need to escape into allied territory with their large supply of gold so that they can rebuild their shattered clan. To do this the Peasants are tricked into helping them, with the promise that they will receive a large share of the gold when the destination is reached. Along the way, the General's prowess is put to the test as he must guide the 4, and later 5 with the inclusion of a freed slave, through close encounters with the pursuing enemy, and out of difficult situations the bumbling peasants manage to get them into.", "genres": ["Adventure", "Drama"], "imdb": {"id": 51808, "rating": 8.1, "votes": 21998}, "languages": ["Japanese"], "lastupdated": "2015-09-01 00:15:31.130000000", "plot": "Lured by gold, two greedy peasants escort a man and woman across enemy lines. However, they do not realize that their companions are actually a princess and her general.", "poster": "https://m.media-amazon.com/images/M/MV5BYjJkN2Y5MTktZDRhOS00NTUwLWFiMzEtMTVlNWU4ODM0Y2E5XkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": -291513600000, "runtime": 126, "title": "The Hidden Fortress", "tomatoes": {"critic": {"meter": 100, "numReviews": 28, "rating": 8.6}, "dvd": 1277683200000, "fresh": 28, "lastUpdated": 1442078238000, "production": "Media Home Entertainment", "rotten": 0, "viewer": {"meter": 93, "numReviews": 17067, "rating": 4.1}}, "type": "movie", "writers": ["Ryèzè Kikushima", "Hideo Oguni", "Shinobu Hashimoto", "Akira Kurosawa"], "year": 1958}