{"_id": "573a13bdf29313caabd586c6", "awards": {"nominations": 0, "text": "4 wins.", "wins": 4}, "cast": ["Edda Arnljètsdèttir", "Reine Brynolfsson", "Nèna Dègg Filippusdèttir", "Brian Fitzgibbon"], "countries": ["Iceland"], "directors": ["Ragnar Bragason"], "fullplot": "The dentist Oscar has been married for five years and lives with his wife and adopted children. On the surface everything seems to be fine but Oscar is not a happy man. His wants a baby of his own flesh and blood but it's not working out. When he finds out that his wife has been deceiving him all these years he decides it's time for a change. Einar is a stockbroker who is very successful at work but not in his personal life. For the last couple of months Einar has been living at a hotel waiting for his wife to realize the terrible mistake she made by throwing him out. Katrin Rose returns from Sweden where she has lived for eight years. In Iceland Katrin has an eleven-year-old son, brought up by his grandmother and now Katrin wants him back. Katrin gets a job as a dentist's assistant intending to make a fresh start but her troubled past catches up with her. PARENTS is the independent second part of twin features by Ragnar Bragason and Vesturport exploring the roles of children and parents. The first part, CHILDREN was released in 2006.", "genres": ["Drama"], "imdb": {"id": 997062, "rating": 7.2, "votes": 256}, "languages": ["Icelandic"], "lastupdated": "2015-08-16 00:50:20.057000000", "num_mflix_comments": 2, "plot": "The dentist Oscar has been married for five years and lives with his wife and adopted children. On the surface everything seems to be fine but Oscar is not a happy man. His wants a baby of ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTMyMDY2NjkxOF5BMl5BanBnXkFtZTcwNzI3OTc0MQ@@._V1_SY1000_SX677_AL_.jpg", "released": 1169164800000, "runtime": 87, "title": "Parents", "tomatoes": {"lastUpdated": 1436898712000, "production": "Sam-felagid", "viewer": {"meter": 71, "numReviews": 145, "rating": 3.8}}, "type": "movie", "writers": ["Ragnar Bragason", "Vèkingur Kristjènsson", "Nanna Kristèn Magnèsdèttir", "Ingvar Eggert Sigurèsson"], "year": 2007}