{"_id": "573a13bef29313caabd5bca4", "awards": {"nominations": 5, "text": "7 wins & 5 nominations.", "wins": 7}, "cast": ["Unax Ugalde", "Bèrbara Goenaga", "Gorka Aguinagalde", "Guillermo Toledo"], "countries": ["Spain"], "directors": ["Helena Taberna"], "fullplot": "A young priest arrives in his first assignment to a small parish serving a working-class village in the north of Spain in 1936. He is a witness of the military uprising that precipitates the Spanish Civil War and, moved by his faith, he stands up to defend his people. From the beginning of the war, the village where the young protagonist arrives remains within the area of the Francoist military insubordinates. It soon becomes a top target of repression for being considered as a \"red village\". Based on a real story, the film portrays how the young priest commits himself to stand by his parishioners and how he denounces from the pulpit and before the Catholic Hierarchy the atrocities being committed on behalf of the Gospel (written of as a Holy Crusade) to the extent that he will risk his own life in the name of Christ. The loneliness haunting him brings Miguel close to Margari, a young schoolteacher, whose husband was killed by the fascists. Margari becomes the only shelter in the path of Miguel's helpless fight, as well as the only aid to offset his deep disappointment.", "genres": ["Drama"], "imdb": {"id": 1060243, "rating": 6.1, "votes": 194}, "languages": ["Spanish"], "lastupdated": "2015-08-19 00:37:28.797000000", "num_mflix_comments": 3, "plot": "A young priest arrives in his first assignment to a small parish serving a working-class village in the north of Spain in 1936. He is a witness of the military uprising that precipitates ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTU5MjQwODA2N15BMl5BanBnXkFtZTcwOTA5Mzg5MQ@@._V1_SY1000_SX677_AL_.jpg", "released": 1226620800000, "runtime": 108, "title": "La buena nueva", "tomatoes": {"lastUpdated": 1437505778000, "viewer": {"meter": 71, "numReviews": 25, "rating": 3.4}}, "type": "movie", "writers": ["Andrès Martorell", "Helena Taberna"], "year": 2008}