{"_id": "573a13abf29313caabd249b6", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["David Birkin", "Alison Bruce", "Amira Casar", "Daniel Craig"], "countries": ["UK"], "directors": ["Christine Jeffs"], "fullplot": "In 1956, aspiring American poet Sylvia Plath meets fellow poet Edward Ted Hughes at Cambridge, where she is studying. Enthralled with the genius of his writing, Sylvia falls in love with him even before meeting him, and he quickly falls in love with her. They eventually marry. Sylvia quickly learns that others are also enthralled with her husband, for a combination of his good looks, charisma, fame and success. Sylvia lives in her husband's professional shadow as she tries to eke out her own writing career, which doesn't come as naturally to her as it does to Ted. She also suspects him of chronic infidelity. Both issues affect Sylvia's already fragile emotional state, she who once tried to commit suicide earlier in her life. Through her pain and her anger, she does gain minor success as a writer, with a completed semi-autobiographical novel and a few well received collection of poems. Following, she tries to regain some happiness in her life with Ted, but has an alternate plan if that does not work out as she wants.", "genres": ["Biography", "Drama", "Romance"], "imdb": {"id": 325055, "rating": 6.3, "votes": 8581}, "languages": ["English"], "lastupdated": "2015-08-31 05:41:27.890000000", "metacritic": 56, "num_mflix_comments": 1, "plot": "Story of the relationship between the poets Ted Hughes and Sylvia Plath.", "poster": "https://m.media-amazon.com/images/M/MV5BODY2ZDNiODktYWU2Yy00OTdmLWI3YmUtMTllODY4NTlhMzNkXkEyXkFqcGdeQXVyMTMxMTY0OTQ@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1067558400000, "runtime": 100, "title": "Sylvia", "tomatoes": {"boxOffice": "$1.2M", "consensus": "This biopic about Sylvia Plath doesn't rise above the level of highbrow melodrama.", "critic": {"meter": 37, "numReviews": 129, "rating": 5.4}, "dvd": 1076371200000, "fresh": 48, "lastUpdated": 1438886587000, "production": "Focus Features", "rotten": 81, "viewer": {"meter": 56, "numReviews": 8355, "rating": 3.3}, "website": "http://www.sylviamovie.com/"}, "type": "movie", "writers": ["John Brownlow (screenplay)"], "year": 2003}