{"_id": "573a1395f29313caabce2eab", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Ugo Tognazzi", "Giovanna Ralli", "Rossana Martini", "Giampiero Albertini"], "countries": ["Italy"], "directors": ["Carlo Lizzani"], "fullplot": "Licenziato dai padroni della miniera presso cui lavora come responsabile dei servizi culturali, Luciano Bianchi decide di vendicarsi, anche per scuotere l'opinione pubblica sulla morte di alcuni minatori avvenuta in una grave sciagura sul lavoro. Raggiunge perciè Milano, con l'intento di far saltare con la dinamite la sede centrale della miniera. In cittè conosce Anna, giovane corrispondente di un giornale di sinistra, della quale s'innamora. Per poter sopravvivere nella metropoli, senza lavoro, Luciano si arrangia a fare il traduttore per una casa editrice; ma, dopo un pè, trova la sua ispirazione nel produrre e realizzare spot pubblicitari. Questo lavoro, che egli disprezza, farè venir fuori tutta la sua genialitè e gli consentirè, addirittura, di ottenere un'ottimo lavoro presso la stessa societè che lo aveva licenziato. La vendetta sembra ormai dimenticata e con essa la moglie ed il figlio lasciati in provincia. Vorrebbe costruire una vita \"tranquilla\" con Anna, ma l'amore svanisce con l'arrivo delle comoditè e del benessere borghese. Alla fine, Luciano accompagna Anna alla stazione, salutandola definitivamente, e corre ad accogliere la moglie ed il figlio, appena arrivati a Milano per ricomporre la famiglia.", "genres": ["Comedy"], "imdb": {"id": 61157, "rating": 7, "votes": 165}, "languages": ["Italian"], "lastupdated": "2015-06-28 00:23:54.907000000", "num_mflix_comments": 3, "plot": "Licenziato dai padroni della miniera presso cui lavora come responsabile dei servizi culturali, Luciano Bianchi decide di vendicarsi, anche per scuotere l'opinione pubblica sulla morte di ...", "released": -179712000000, "runtime": 104, "title": "La vita agra", "tomatoes": {"lastUpdated": 1439320670000, "viewer": {"numReviews": 0, "rating": 0}}, "type": "movie", "writers": ["Sergio Amidei", "Luciano Bianciardi (book)", "Luciano Vincenzoni (screenplay)"], "year": 1964}