{"_id": "573a13b8f29313caabd4bc9c", "awards": {"nominations": 3, "text": "1 win & 3 nominations.", "wins": 1}, "cast": ["Danny DeVito", "Matthew Broderick", "Kristin Davis", "Kristin Chenoweth"], "countries": ["USA"], "directors": ["John Whitesell"], "fullplot": "Optometrist Steve Finch loves those Christmas traditions he has set up with his family and his town. As such, he has a schedule of activities for his family starting on December 1st, and is the official unofficial consultant for anything Christmas related in his town of Cloverdale, Massachusetts. During the Christmas season, the Halls move in to the house across the street from the Finch's. The Halls in general are different in outlook and temperament than the Finches. Unlike Steve, Buddy Hall scams his way through life and never follows through with anything he starts. While Kelly Finch and Tia Hall - Steve's wife and Buddy's wife respectively - and their children begin friendships based largely on those differences, Steve and Buddy butt heads based on those differences. It begins with Buddy striving to have his house seen from outer space by decorating it as lavishly and brightly as possible. One of the results of Buddy's task his that he becomes the new go to guy for anything Christmas related in Cloverdale, usurping Steve's coveted position. As Steve and Buddy's open animosity grows, they may threaten the joy of Christmas for all, most specifically their families who have their own ideas of what they would like to do over the Christmas season.", "genres": ["Comedy", "Family"], "imdb": {"id": 790604, "rating": 4.9, "votes": 14445}, "languages": ["English"], "lastupdated": "2015-09-03 01:10:15.507000000", "metacritic": 28, "plot": "Two neighbors have it out after one of them decorates his house for the holidays so brightly that it can be seen from space.", "poster": "https://m.media-amazon.com/images/M/MV5BMTIzNjA4OTM0OV5BMl5BanBnXkFtZTcwMDgwODkzMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 1164153600000, "runtime": 93, "title": "Deck the Halls", "tomatoes": {"boxOffice": "$35.1M", "consensus": "Relying on flat humor and a preposterous plot, Deck the Halls is an unnecessarily mean-spirited holiday movie that does little to put viewers in a holiday mood.", "critic": {"meter": 6, "numReviews": 82, "rating": 2.9}, "dvd": 1194307200000, "fresh": 5, "lastUpdated": 1439921113000, "production": "20th Century Fox", "rotten": 77, "viewer": {"meter": 30, "numReviews": 55527, "rating": 2.8}, "website": "http://www.deckthehallsmovie.com/"}, "type": "movie", "writers": ["Matt Corman", "Chris Ord", "Don Rhymer"], "year": 2006}