{"_id": "573a1398f29313caabcea5c3", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Domenick John", "Tom Savini", "George Kennedy", "Philip Dore"], "countries": ["USA"], "directors": ["Michael Gornick"], "fullplot": "\"Creepshow 2\" is divided into three stories, conducted by a leading segment where a boy that loves the horror comic book Creepshow buys seeds of carnivorous plant and is bullied by four teenagers. Meanwhile the Creep tells the tales of Creepshow: (1) \"Old Chief Wood'nhead\" - The elders Ray (George Kennedy) and Martha Spruce (Dorothy Lamour) have lived their whole life and raised their family with their small store in an Arizona town. Now the town is economically decadent and Ray gives credit to his costumers including the Indians of Ben Whitemoon's tribe. When Ray is repairing the wooden statue of an old chief in the front door, Ben (Frank Salsedo) arrives and asks him to keep the jewels of his tribe as a guarantee for their debts. However, Ben's nephew Sam (Holt McCallany) unexpectedly arrives with two other punks to steal Ray, and he kills the elders. They expect to travel to Hollywood, but the Old Chief Wood'nhead will not let them go. (2) \"The Raft\" - The teenagers Deke (Paul Satterfield) and Randy (Daniel Beer) travel with Laverne (Jeremy Green) and Rachel (Page Hannah) to a lake expecting to smoke weed, swim and get laid. They swim to a raft that is floating in the middle of the lake, but they discover a carnivorous blob in the lake that is hungry. (3) \"The Hitchhiker\" - In Maine, the unfaithful Annie Lansing (Lois Chiles) stays too long having sex with her escort and is late to meet her husband in the airport. She drives her Mercedes Bens in a hurry and loses control on the road. Annie runs over a hitchhiker, but she does not help the man and hit-and-run, questioning whether she can live with the situation. She discovers that the hitchhiker will not leave her.", "genres": ["Comedy", "Horror", "Thriller"], "imdb": {"id": 92796, "rating": 5.9, "votes": 14573}, "languages": ["English"], "lastupdated": "2015-09-01 00:57:17.397000000", "num_mflix_comments": 1, "plot": "Three more bone-chilling tales that include a vengeful wooden Native American, a monstrous blob in a lake, and a hitchhiker who wants revenge and will not die.", "poster": "https://m.media-amazon.com/images/M/MV5BN2QwZTMzODktNzRiYS00Y2JiLTk5ZmMtOGIwYTE1YTIyOTQ4XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 546825600000, "runtime": 92, "title": "Creepshow 2", "tomatoes": {"critic": {"meter": 30, "numReviews": 20, "rating": 3.9}, "dvd": 985564800000, "fresh": 6, "lastUpdated": 1439925611000, "production": "New World Video", "rotten": 14, "viewer": {"meter": 39, "numReviews": 19173, "rating": 3}}, "type": "movie", "writers": ["Stephen King (stories)", "George A. Romero (screenplay)"], "year": 1987}