{"_id": "573a1397f29313caabce706a", "awards": {"nominations": 11, "text": "Nominated for 2 Oscars. Another 9 nominations.", "wins": 0}, "cast": ["Dudley Moore", "Julie Andrews", "Bo Derek", "Robert Webber"], "countries": ["USA"], "directors": ["Blake Edwards"], "fullplot": "Forty-two year old famed composer/playwright George Webber is going through a midlife crisis. He is seriously dating thirty-eight year old actress/singer Samantha Taylor, who he loves, although he admits their connection is more intellectual than it is emotional. She, in turn, loves him, despite barely tolerating his often infantile behavior. This behavior includes spying on a neighbor's sexual encounters with a wide array of women, this spying about which the neighbor knows, as he does it himself. Driving one day, George spots a young woman who he believes is the most beautiful creature he's ever seen - an \"eleven\" on a scale of ten, tens which he didn't believe existed before her. Beyond the fact that she is probably half his age, a problem with George's infatuation is that she is just off to her own wedding. George and Sam's relationship takes a hit with an argument which is further exacerbated by a series of misunderstandings. As such, George decides to pursue the woman of his dreams with all his energy. He learns her name is Jenny Miles, now married Jenny Hanley, and he is able to follow her to a Mexican resort where she and her husband David Hanley are honeymooning. In his pursuit of Jenny, his encounter with a lonely woman named Mary Lewis who is vacationing at the resort, and his discussions with his gay lyricist Hugh concerning his relationship with his much younger trophy husband Larry, George may come to a clearer picture of what he is doing in Mexico, and how he truly feels about Sam.", "genres": ["Comedy", "Romance"], "imdb": {"id": 78721, "rating": 6, "votes": 11518}, "languages": ["English"], "lastupdated": "2015-09-02 00:03:46.693000000", "plot": "A Hollywood lyricist goes through a mid-life crisis and becomes infatuated with a sexy, newly married woman.", "poster": "https://m.media-amazon.com/images/M/MV5BYWFjMTkwYzAtZWE4OC00OGIwLTgwOTUtY2IwNTgwZTkxMzM0L2ltYWdlXkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 307929600000, "runtime": 122, "title": 10, "tomatoes": {"critic": {"meter": 71, "numReviews": 21, "rating": 6.4}, "dvd": 872640000000, "fresh": 15, "lastUpdated": 1440965394000, "production": "Waner Bros.", "rotten": 6, "viewer": {"meter": 54, "numReviews": 14570, "rating": 2.9}}, "type": "movie", "writers": ["Blake Edwards"], "year": 1979}