{"_id": "573a13a4f29313caabd12ac5", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Robert Englund", "Lin Shaye", "Giuseppe Andrews", "Jay Gillespie"], "countries": ["USA"], "directors": ["Tim Sullivan"], "fullplot": "While traveling on vacation to Florida, the college friends Anderson Lee, Cory Jones and Nelson Elliot meet the gorgeous Joey and Kat in a gas station traveling with their gay friend Ricky to the same location. Anderson gives his phone number to Joey in Florida. The teenagers decide to take a shortcut and they find a detour through an old road leading to the Southern town of Pleasant Valley. They are welcomed by the local Mayor Buckman as guests of honor together with Joey, Kat, Ricky and the Afro-American biker Malcolm and his Chinese girlfriend Leah and invited to stay for their Guts and Glory Jubilee with free lodging, meals and booze at Granny Boone's hotel, and dancing, games and a mouth-watering barbecue in the climax of the jubilee. The group accepts the invitation but sooner they find who will supply the meat for the feast.", "genres": ["Comedy", "Horror"], "imdb": {"id": 264323, "rating": 5.4, "votes": 9974}, "languages": ["English"], "lastupdated": "2015-09-06 00:58:02.540000000", "num_mflix_comments": 1, "plot": "Eight college students traveling to Florida for Spring Break stumble into a remote town in Georgia where they are set upon by the residents who are out to avenge their deaths by Union troops over 100 years earlier during the Civil War.", "poster": "https://m.media-amazon.com/images/M/MV5BYmQ2YTQ5OWYtODY4YS00MGEyLTkzNWUtYmE0OWI1ODQ5NDFiXkEyXkFqcGdeQXVyNjE5MjUyOTM@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1152748800000, "runtime": 87, "title": "2001 Maniacs", "tomatoes": {"critic": {"meter": 40, "numReviews": 5, "rating": 4.9}, "fresh": 2, "lastUpdated": 1441997314000, "rotten": 3, "viewer": {"meter": 76, "numReviews": 1014, "rating": 3.7}}, "type": "movie", "writers": ["Chris Kobin", "Tim Sullivan"], "year": 2005}