{"_id": "573a13c5f29313caabd6f469", "awards": {"nominations": 3, "text": "7 wins & 3 nominations.", "wins": 7}, "cast": ["Youdon Aukatsang", "Bhusang", "Tenzin Choeying", "Tenzin Chogkyi"], "countries": ["USA"], "directors": ["Dirk Simon"], "fullplot": "Unfortunately, the 14th Dalai Lama and the Tibetan people receive little political support in their drive to put an end to the Chinese brutal regime, as international governments are seemingly motivated by economic interests in China. The lack of progress toward a free, or even a truly autonomous Tibet, urges more and more young Tibetans to consider alternatives to the Dalai Lama's Middle Way Policy, a compromise on Tibet's Independence. The controversial discussion about the right strategy for achieving a free Tibet - non-violent or violent, autonomy or complete independence - is becoming more emotionally charged day by day. Monks have been leading Tibet and Tibetans for generations, not only in religious, but also in worldly matters. But monks have vows that bind them. And often those vows conflict with the needs of politics. The Tibetan movement today is divided and weakened by an ongoing argument whether the Dalai Lama\"s Middle Way Policy is the right strategy or not. Tibetans are torn between their religious beliefs and their desire to free their homeland. In November 2008, the Dalai Lama acknowledged for the first time the failure of his policy and that the situation for Tibetans in Tibet has worsened. His unprecedented call for a special meeting upon 500 Tibetan leaders from all over the world led to a discussion about the future of the movement and a way to re-unite all Tibetans behind one goal.", "genres": ["Documentary"], "imdb": {"id": 1379210, "rating": 7.4, "votes": 85}, "languages": ["English", "Tibetan"], "lastupdated": "2015-08-18 00:30:25.813000000", "num_mflix_comments": 2, "plot": "Unfortunately, the 14th Dalai Lama and the Tibetan people receive little political support in their drive to put an end to the Chinese brutal regime, as international governments are ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTQwNDQyNjQ1OV5BMl5BanBnXkFtZTcwMjE0NjUxMw@@._V1_SY1000_SX677_AL_.jpg", "released": 1339113600000, "runtime": 115, "title": "When the Dragon Swallowed the Sun", "tomatoes": {"critic": {"meter": 50, "numReviews": 8, "rating": 5}, "fresh": 4, "lastUpdated": 1439664945000, "production": "Digital Studios", "rotten": 4, "viewer": {"meter": 80, "numReviews": 56, "rating": 3.2}, "website": "http://www.facebook.com/pages/When-The-Dragon-Swallowed-The-Sun/136562052869"}, "type": "movie", "writers": ["Dirk Simon"], "year": 2010}