{"_id": "573a13b0f29313caabd35456", "awards": {"nominations": 10, "text": "10 nominations.", "wins": 0}, "cast": ["Matthew Goode", "Thomas Morrison", "David Barrass", "Anna Madeley"], "countries": ["UK", "Italy", "Morocco"], "directors": ["Julian Jarrold"], "fullplot": "WWII. Charles Ryder, in his civilian life, rose out of his middle class London background, which includes being an atheist and having a distant relationship with his eccentric father, to become an up and coming artist. He is currently an army officer, who is stationed at a makeshift camp set up at Brideshead estate before imminently getting shipped into battle. The locale, which is not unfamiliar to him, makes him reminisce about what ended up being his doomed relationship with Brideshead's owners, the Flytes, an ostentatiously wealthy family. Charles first met Sebastian Flyte when they both were students at Oxford, where Sebastian surprisingly welcomed Charles into his circle of equally wealthy, somewhat stuck up and flamboyant friends. Charles ended up getting caught up in Sebastian's family struggles, where Sebastian used excessive alcohol to deal with the pain resulting from his family relationships. Although Charles and Sebastian were more than just friends, Charles ultimately fell in love with Sebastian's sister, Julia Flyte. But the biggest obstacle to Charles being intimately involved with anyone in the Flyte family was the family matriarch, Lady Marchmain, a strict and devout Catholic who ruled the family with that adherence to a strict Catholic lifestyle. That was despite her and Lord Marchmain's own marriage being in name only, as he lived in Venice with his mistress, Cara.", "genres": ["Drama", "Romance"], "imdb": {"id": 412536, "rating": 6.7, "votes": 9391}, "languages": ["English", "Italian", "Arabic", "Latin", "French"], "lastupdated": "2015-09-04 00:17:38.537000000", "metacritic": 64, "num_mflix_comments": 1, "plot": "A poignant story of forbidden love and the loss of innocence set in England prior to the Second World War.", "poster": "https://m.media-amazon.com/images/M/MV5BMTQ4MTU5MjAyN15BMl5BanBnXkFtZTcwOTcxMzE3MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1218758400000, "runtime": 133, "title": "Brideshead Revisited", "tomatoes": {"boxOffice": "$6.4M", "consensus": "Suspenseful and beautifully mounted, Brideshead Revisited does an able job condensing Evelyn Waugh's novel.", "critic": {"meter": 63, "numReviews": 127, "rating": 6.2}, "dvd": 1231804800000, "fresh": 80, "lastUpdated": 1440439648000, "production": "Miramax Films", "rotten": 47, "viewer": {"meter": 52, "numReviews": 21756, "rating": 3.2}, "website": "http://www.bridesheadrevisited-themovie.com/"}, "type": "movie", "writers": ["Andrew Davies", "Jeremy Brock", "Evelyn Waugh (novel)"], "year": 2008}