{"_id": "573a13b1f29313caabd36fdb", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Ron Livingston", "Chris Penn", "Udo Kier", "Virginie Ledoyen"], "countries": ["USA", "France", "Israel", "Cambodia"], "directors": ["Guy Moshe"], "fullplot": "Shot on location in Cambodia, including many scenes in actual brothels in the notorious red light district of Phnom Penh, HOLLY is a captivating, touching and emotional experience. Patrick, an American card shark and dealer of stolen artifacts, has been 'comfortably numb' in Cambodia for years, when he encounters Holly, a 12-year-old Vietnamese girl, in the K11 red light village. The girl has been sold by her impoverished family and smuggled across the border to work as a prostitute. Holly's virginity makes her a lucrative prize, and when she is sold to a child trafficker, Patrick embarks on a frantic search through both the beautiful and sordid faces of the country, in an attempt to bring her to safety. Harsh, yet poetic, this feature forms part of the 'K-11' Project, dedicated to raising awareness of the epidemic of child trafficking and the sex slavery trade through several film projects. The film's producers endured substantial hardships in order to be able to shoot in Cambodia and have also founded the RedLight Children Campaign, which is a worldwide grassroots initiative generating conscious concern and inspiring immediate action against child sexploitation.", "genres": ["Drama"], "imdb": {"id": 419815, "rating": 7, "votes": 698}, "languages": ["English", "Khmer", "Vietnamese"], "lastupdated": "2015-08-29 00:15:34.717000000", "metacritic": 51, "num_mflix_comments": 1, "plot": "In Cambodia, Holly, a 12 year old Vietnamese girl, encounters Patrick, an American stolen artifacts dealer. The story follows their strong connection and her unrelenting efforts to escape her fate.", "poster": "https://m.media-amazon.com/images/M/MV5BMTUyMDQ2NzkxM15BMl5BanBnXkFtZTcwNDY0MTA4OQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1262822400000, "runtime": 114, "title": "Holly", "tomatoes": {"consensus": "Despite some execution problems, Holly remains a realistic and gritty look at child sex slavery.", "critic": {"meter": 65, "numReviews": 23, "rating": 6.2}, "dvd": 1233014400000, "fresh": 15, "lastUpdated": 1440182788000, "production": "Priority Films/Slowhand Cinema Releasing", "rotten": 8, "viewer": {"meter": 63, "numReviews": 438, "rating": 3.5}, "website": "http://www.priorityfilms.com/k11.html#holly"}, "type": "movie", "writers": ["Guy Jacobson", "Guy Moshe"], "year": 2006}