{"_id": "573a13a7f29313caabd1a65b", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Bill Paxton", "John Broadwater", "Lori Johnston", "Charles Pellegrino"], "countries": ["USA"], "directors": ["James Cameron"], "fullplot": "Academy Awardè winning director and master storyteller James Cameron journeys back to the site of his greatest inspiration # the legendary wreck of the Titanic. With a team of the world's foremost historic and marine experts and friend Bill Paxton, he embarks on an unscripted adventure back to the final grave where nearly 1,500 souls lost their lives almost a century ago. Using state-of-the-art technology developed expressly for this expedition, Cameron and his crew are able to explore virtually all of the wreckage, inside and out, as never before. With the most advanced 3D photography, moviegoers will experience the ship as if they are part of the crew, right inside the dive subs. In this unprecedented motion picture event, made especially for IMAX 3D Theatres and specially outfitted 35mm 3D theaters across the country, Cameron and his team bring audiences to sights not seen since the sinking 90 years ago and explore why the landmark vessel # more than any shipwreck # continues to intrigue and fascinate the public.", "genres": ["Documentary", "Family"], "imdb": {"id": 297144, "rating": 6.9, "votes": 3860}, "languages": ["English"], "lastupdated": "2015-08-18 00:06:35.250000000", "metacritic": 67, "num_mflix_comments": 3, "plot": "James Cameron and Bill Paxton, director and actor of the 1997 film Titanic, travel to the final undersea resting place of the fated ship of dreams.", "poster": "https://m.media-amazon.com/images/M/MV5BNDM5MzY0MjY2MF5BMl5BanBnXkFtZTYwOTc5ODU3._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 1050624000000, "runtime": 59, "title": "Ghosts of the Abyss", "tomatoes": {"boxOffice": "$16.3M", "consensus": "The underwater footage is both beautiful and awe-inspiring.", "critic": {"meter": 80, "numReviews": 100, "rating": 7.1}, "dvd": 1083024000000, "fresh": 80, "lastUpdated": 1440525681000, "production": "Buena Vista Distribution", "rotten": 20, "viewer": {"meter": 66, "numReviews": 6415, "rating": 3.3}, "website": "http://disney.go.com/disneypictures/ghosts/index.html"}, "type": "movie", "year": 2003}