{"_id": "573a1396f29313caabce5511", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Beppe Wolgers", "Jens Wolgers", "Halvar Bjèrk", "Hèkan Serner"], "countries": ["Sweden"], "directors": ["Per èhlin"], "fullplot": "On an evening in northern Sweden, during one night when the sun only partially sets, the animated character Dunderklumpen comes from the woods to seek some friends to keep him company. In one man's house, he finds toys belonging to a girl named Camilla and a boy named Jens, and brings them to life, whisking them away to the woods where he lives. This adorable and amusing crew includes a little scaredy-cat lion named Lionel, the demanding Doll, the cute harmonica-playing bear Pellegnillot and the ridiculous Dummy the bunny. Jens, Camilla's brother, sees the kidnapping after hearing the toys' cries for help and follows Dunderklumpen, who is not so quick to surrender his new-found company. They are also followed by Beppe, Jens' father, who is worried for his son traveling alone and is at first unaware of why Jens has run off. He is accompanied by a dutiful bumblebee. As a side plot, Dunderklumpen also has a small locked chest with him that contains a great treasure, and he is pursued by an old nemesis, One-Eye, who seeks the treasure for himself. No one knows what the contents are, but Dunderklumpen and One-Eye are both sure it's priceless.", "genres": ["Animation", "Adventure", "Family"], "imdb": {"id": 71448, "rating": 6.9, "votes": 1185}, "languages": ["Swedish"], "lastupdated": "2015-09-12 00:39:45.197000000", "num_mflix_comments": 3, "plot": "On an evening in northern Sweden, during one night when the sun only partially sets, the animated character Dunderklumpen comes from the woods to seek some friends to keep him company. In ...", "poster": "https://m.media-amazon.com/images/M/MV5BZWY3MzI4Y2UtNTRhNS00NzNjLWE3MzMtZTMwZWVjODZiODY5XkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_SY1000_SX677_AL_.jpg", "rated": "G", "released": 220924800000, "runtime": 97, "title": "Dunderklumpen!", "tomatoes": {"lastUpdated": 1437415602000, "viewer": {"meter": 90, "numReviews": 549, "rating": 4.3}}, "type": "movie", "writers": ["Beppe Wolgers"], "year": 1974}