{"_id": "573a13bef29313caabd5ce0c", "awards": {"nominations": 0, "text": "3 wins.", "wins": 3}, "cast": ["Joni Barth", "Kirsten Berman", "Mark Boone Junior", "Joseph Castanon"], "countries": ["USA"], "directors": ["Adam Sherman"], "fullplot": "A young man named Victor realizes the shortcomings of the Utopian ideals on the hippie commune where he was raised. Victor's mother is funding the commune where the guru Insley hypnotizes and seduces women with a technique he calls \"running.\" Insley manipulates the minds of these women so that they give him their bodies and all their worldly possessions. Victor's childhood love, Becky, returns to take care of her deathly ill father. Victor, haunted by visions of Becky's death, is desperate to save her and himself by escaping from the polygamous cult. Preoccupied with Insley's free love philosophy, the adults of the community overlook the painful reality that the self destructive behavior of their children is most certainly due to early exposure to sex and drugs. To afford an escape, Victor tries to sell weed but is cut out by rivals competing for Becky's affection. Finally, Victor is torn between getting money from his mother who is entirely under Insley's influence, dealing with the violent drama of his drug-addled friends, and staying to save Becky as she spins out of control.", "genres": ["Drama"], "imdb": {"id": 1079964, "rating": 4.9, "votes": 499}, "languages": ["English"], "lastupdated": "2015-09-15 06:14:00.527000000", "metacritic": 24, "num_mflix_comments": 1, "plot": "A young man named Victor realizes the shortcomings of the Utopian ideals on the hippie commune where he was raised. Victor's mother is funding the commune where the guru Insley hypnotizes ...", "poster": "https://m.media-amazon.com/images/M/MV5BMjE0NTIwNTg2M15BMl5BanBnXkFtZTcwMjMxMjI0Mw@@._V1._SX581_SX89_AL_.jpg", "released": 1273190400000, "runtime": 88, "title": "Happiness Runs", "tomatoes": {"critic": {"meter": 9, "numReviews": 11, "rating": 3.2}, "dvd": 1280793600000, "fresh": 1, "lastUpdated": 1439837643000, "production": "Strand Releasing", "rotten": 10, "viewer": {"meter": 38, "numReviews": 347, "rating": 2.8}}, "type": "movie", "writers": ["Adam Sherman"], "year": 2010}