{"_id": "573a13bcf29313caabd573be", "awards": {"nominations": 7, "text": "1 win & 7 nominations.", "wins": 1}, "cast": ["Amitabh Bachchan", "Tabu", "Paresh Rawal", "Zohra Segal"], "countries": ["India", "UK"], "directors": ["R. Balki"], "fullplot": "Grouchy, uptight 64-year-old Buddhadev Gupta lives a fairly wealthy lifestyle in London, England, along with his widowed TV and wrestling-addicted mom. He is the owner of Spice 6, one of London's top restaurants that specializes in Indian dishes. One day a customer, Nina Verma, complains about the zafrani pulao, and Buddhadev does not take it well, only to subsequently find out that the pulao was indeed imperfect. He decides to make amends to Nina and lends her his umbrella during a rainy day. Both subsequently become friends, fall in love, and decide to get married. She is introduced to Buddhadev's mom, who instantly approves of her. Nina, who lives in Delhi with her widower dad, cuts short her visit when her dad gets sick. Buddhadev and his mom also travel to India so that Buddhadev can ask for Nina's hand from her now-fully recovered dad. Buddhadev does meet with Nina's dad and, after considerable hesitation, does manage to ask for Nina's hand and is abruptly refused--for Nina is only 34 years of age, and Buddhadev is six years older than Nina's dad. When Nina and Buddhadev insist on getting married, her Gandhian dad decides to undertake a fast unto death (satyagraha). The question remains, will Buddhadev and Nina continue their relationship, and how will this satyagraha impact Mr. Verma's life?", "genres": ["Comedy", "Romance"], "imdb": {"id": 976026, "rating": 6.8, "votes": 3584}, "languages": ["Hindi", "English", "German"], "lastupdated": "2015-08-22 01:03:51.407000000", "num_mflix_comments": 1, "plot": "An egotistical 64-year-old chef and confirmed bachelor falls for a woman 30 years his junior.", "poster": "https://m.media-amazon.com/images/M/MV5BYmQzNWMyZDAtMmUxYi00NzY5LWE1ZWYtYTRhZTkwN2U4M2FkXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY1000_SX677_AL_.jpg", "released": 1180051200000, "runtime": 140, "title": "Cheeni Kum", "tomatoes": {"boxOffice": "$0.7M", "dvd": 1194912000000, "lastUpdated": 1438366656000, "production": "Eros Entertainment", "viewer": {"meter": 68, "numReviews": 5677, "rating": 3.5}, "website": "http://www.cheenikum.com/"}, "type": "movie", "writers": ["R. Balki", "Manoj Tapadia"], "year": 2007}