{"_id": "573a13ecf29313caabdd22b0", "awards": {"nominations": 2, "text": "2 wins & 2 nominations.", "wins": 2}, "cast": ["Jinson Aèazco", "Pere Celma", "Alberto Condèn", "Michal Lagosz"], "countries": ["Spain"], "directors": ["Sergio Caballero"], "fullplot": "Vasiliy Lèbedev was a young peasant from Crimea who decided to go to Siberia to work in a coal mine. With his sense of opportunity, his lack of scruples and taking advantage of the end of Perestroika, he quickly landed a position at the helm of one of the most important Power Plants in Siberia. After the fall of the old USSR-and thanks to his own cunning-he became the sole owner of the Power Plant and of one of the largest coal deposits in Russia, amassing an immense fortune. An introverted character and lover of the paranormal sciences, he travelled constantly, obsessed with finding clues about the existence of \"UFOs\" and portals to the \"beyond\". On one of his last trips to the US, he bought a performance by a German artist, the artist himself and his coyote (an indispensible part of the piece), only to then transport them secretly and illegally to Russia and lock them up in a warehouse outside his now defunct Power Plant in Siberia. After the death of Vasiliy, the artist is still confined in the Power Plant and watched over by a strange Guard. Years go by and the two wives and 7 daughters are still battling in court, incapable of divying up the inheritance and determining the fate of the Power Plant. Taking advantage of this situation, the artist contacts three dwarves with supernatural powers that he hires to plan the robbery of something called \"The Distance.", "genres": ["Mystery", "Sci-Fi"], "imdb": {"id": 3474462, "rating": 5.8, "votes": 221}, "languages": ["Russian", "Japanese", "German"], "lastupdated": "2015-08-14 00:13:09.660000000", "num_mflix_comments": 2, "plot": "A robbery takes place.", "poster": "https://m.media-amazon.com/images/M/MV5BMjM0MjE5NTI0MF5BMl5BanBnXkFtZTgwMDk3MzM3MjE@._V1_SY1000_SX677_AL_.jpg", "released": 1420675200000, "runtime": 80, "title": "The Distance", "type": "movie", "writers": ["Sergio Caballero"], "year": 2014}