{"_id": "573a13bff29313caabd5fb77", "awards": {"nominations": 2, "text": "2 nominations.", "wins": 0}, "cast": ["Alan Van Sprang", "Joshua Peace", "Hardee T. Lineham", "Dru Viergever"], "countries": ["USA", "Canada"], "directors": ["George A. Romero"], "fullplot": "In the Plum Island, off the coast of Delaware, the long feud between the families of the patriarchs Captain Patrick O'Flynn (Kenneth Welsh) that intends to eliminate the zombies and Seamus Muldoon (Richard Fitzpatrick) that intends to keep his undead relatives waiting for a cure culminates with O'Flynn expelled from Plum. Meanwhile in the continent Sarge \"Nicotine\" Crocket (Alan Van Sprang), Chuck (Joris Jarsky), Cisco (Stefano DiMatteo) and Tomboy (Athena Karkanis) are plundering and seeking a safe place to stay. When they rescue the young Boy (Devon Bostick) from group of sadistic hunters, Boy decides to join the group and suggests them to head to Plum Island since he had heard a O'Flynn's broadcast inviting people to move to the island. When Sarge and his team arrive in the island, they are attacked by Muldoon's men and they see that the place is crowded of undead. Sarge's friend Chuck is killed and they decide to fight against Muldoon.", "genres": ["Horror"], "imdb": {"id": 1134854, "rating": 5, "votes": 16731}, "languages": ["English"], "lastupdated": "2015-09-07 00:08:56.940000000", "metacritic": 43, "num_mflix_comments": 1, "plot": "On an island off the coast of North America, local residents simultaneously fight a zombie epidemic while hoping for a cure to return their un-dead relatives back to their human state.", "poster": "https://m.media-amazon.com/images/M/MV5BNzE1NDMxMDAzOF5BMl5BanBnXkFtZTcwMjgzNDcyMw@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1273104000000, "runtime": 90, "title": "Survival of the Dead", "tomatoes": {"consensus": "Survival of the Dead offers glimmers of Romero's savage wit, but not nearly enough to make up for his unusually uninspired directing and a lack of new ideas", "critic": {"meter": 30, "numReviews": 84, "rating": 4.9}, "dvd": 1272585600000, "fresh": 25, "lastUpdated": 1440099092000, "production": "Magnolia Pictures", "rotten": 59, "viewer": {"meter": 20, "numReviews": 7830, "rating": 2.4}, "website": "http://magnetreleasing.com/survivalofthedead/"}, "type": "movie", "writers": ["George A. Romero"], "year": 2009}