{"_id": "573a13a6f29313caabd1705d", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Om Puri", "Aasif Mandvi", "Ayesha Dharker", "Jimi Mistry"], "countries": ["UK", "India", "USA"], "directors": ["Ismail Merchant"], "fullplot": "Circa 1940 in Trinidad, still a British Colony, lives Ganesh Ramseyor, of East Indian origin, along with his wife, Leela. He longs to reach out to people, especially to Hindus, in order to promote the Hindu Faith, and be known as a writer. He does get considerable success, so much so that he becomes famous as a miracle worker, having cured a man of sharing intimacy with his bicycle; prevented a man from believing that he can fly; and convincing a young woman to end her fast. His fame spreads all over the island and thousands throng to seek his blessings, which he does dole out quite benevolently, without charging any fees from the poor and the needy. He then decides to spread his wings by challenging the local politician Pandit Narayan Chandrashekhar alias Cyrus T., and takes over The Hindu Organization, thence opening his way to a seat in the prestigious Member of the Legislative Assembly. Now literally the sky is the limit for Ganesh, and he knows that he can achieve any position - and it is then that he realizes that he cannot attain anything much without the support of the grassroots people - the very ordinary folks who had supported him. The question remains with his high position, will his contact with his people be limited, or will he forsake all power and ceremonial positions to be near his devotees?", "genres": ["Comedy", "Drama"], "imdb": {"id": 282771, "rating": 5.9, "votes": 423}, "languages": ["English"], "lastupdated": "2015-07-30 00:00:21.363000000", "metacritic": 64, "num_mflix_comments": 1, "plot": "In 1950s Trinidad, a frustrated writer supports himself as a masseur--and soon becomes a revered mystic and politico.", "poster": "https://m.media-amazon.com/images/M/MV5BMjEzNDIyMjc2N15BMl5BanBnXkFtZTcwNTYwOTQyMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 1017360000000, "runtime": 117, "title": "The Mystic Masseur", "tomatoes": {"boxOffice": "$0.3M", "consensus": "Though pretty to look at, The Mystic Masseur is too slow-paced and lacks narrative tension.", "critic": {"meter": 52, "numReviews": 64, "rating": 5.8}, "dvd": 1046131200000, "fresh": 33, "lastUpdated": 1440011011000, "production": "ThinkFilm", "rotten": 31, "viewer": {"meter": 26, "numReviews": 112, "rating": 2.8}, "website": "http://www.merchantivory.com/mysticmasseur.html"}, "type": "movie", "writers": ["V.S. Naipaul (novel)", "Caryl Phillips (screenplay)"], "year": 2001}