{"_id": "573a13bdf29313caabd5934f", "awards": {"nominations": 8, "text": "4 wins & 8 nominations.", "wins": 4}, "cast": ["Connie Nielsen", "Aidan Quinn", "John Bell", "Jack Gleeson"], "countries": ["Canada", "Ireland"], "directors": ["Vic Sarin"], "fullplot": "Maire O'Donnell is a loving woman as rare as a double rainbow. Joyful, warm and caring, she adopts a young orphan named Tomas and whisks him off to a new home on remote Corrie Island, off the coast of Ireland. Maire shares with Tomas the joys of her island home and introduces him to the whimsical local folklore, including the secret of the seals, and teaches him that everything you need is inside of you- if you really look. But Maire's stern husband Alec silently disapproves of Tomas' timidity and halting speech. He can't hide his disappointment that Tomas isn't the kind of child he was hoping for and his reluctance to get to know the boy makes Tomas unsure of whether he really belongs. Soon though, Tomas too falls in love with his home, befriending local children, descending into a secret bat-filled cave, and saving a stranded baby seal. When tragedy strikes however, Tomas is faced with his greatest challenge yet. He'll lose everything unless he can find- and share- the unique gifts inside of him. Risking all, Tomas embarks on a perilous journey where he will need to call on his ability to see joy and color even when in the darkest place, in order to triumph and come home. A Shine Of Rainbows is a story about the transformational power of love, about finding acceptance, discovering ourselves, and realizing that rainbows are all around us- and within us too.", "genres": ["Drama", "Family"], "imdb": {"id": 1014774, "rating": 7.2, "votes": 1500}, "languages": ["English"], "lastupdated": "2015-08-27 00:03:30.070000000", "metacritic": 52, "num_mflix_comments": 1, "plot": "A lonely orphan's life is transformed by an extraordinary woman who teaches him to conquer grief and discover the magic in nature and himself.", "poster": "https://m.media-amazon.com/images/M/MV5BMjE4ODc3MDQ0NV5BMl5BanBnXkFtZTcwMjI3NTkyMw@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 1266019200000, "runtime": 101, "title": "A Shine of Rainbows", "tomatoes": {"critic": {"meter": 44, "numReviews": 9, "rating": 5.3}, "dvd": 1300147200000, "fresh": 4, "lastUpdated": 1442137908000, "production": "Freestyle Releasing", "rotten": 5, "viewer": {"meter": 69, "numReviews": 648, "rating": 3.7}, "website": "http://sepiafilms.com/a-shine-fo-rainbows.html"}, "type": "movie", "writers": ["Vic Sarin", "Catherine Spear", "Dennis Foon", "Lillian Beckwith (novel)"], "year": 2009}