{"_id": "573a13b0f29313caabd33839", "awards": {"nominations": 27, "text": "Won 1 Oscar. Another 79 wins & 27 nominations.", "wins": 80}, "cast": ["Martina Gedeck", "Ulrich Mèhe", "Sebastian Koch", "Ulrich Tukur"], "countries": ["Germany"], "directors": ["Florian Henckel von Donnersmarck"], "fullplot": "Gerd Wiesler is an officer with the Stasi, the East German secret police. The film begins in 1984 when Wiesler attends a play written by Georg Dreyman, who is considered by many to be the ultimate example of the loyal citizen. Wiesler has a gut feeling that Dreyman can't be as ideal as he seems and believes surveillance is called for. The Minister of Culture agrees but only later does Wiesler learn that the Minister sees Dreyman as a rival and lusts after his partner Christa-Maria. The more time he spends listening in on them, the more he comes to care about them. The once rigid Stasi officer begins to intervene in their lives, in a positive way, protecting them whenever possible. Eventually, Wiesler activities catch up to him and while there is no proof of wrongdoing, he finds himself in menial jobs - until the unbelievable happens.", "genres": ["Drama", "Thriller"], "imdb": {"id": 405094, "rating": 8.5, "votes": 231904}, "languages": ["German"], "lastupdated": "2015-09-02 00:23:42.490000000", "metacritic": 89, "num_mflix_comments": 1, "plot": "In 1984 East Berlin, an agent of the secret police, conducting surveillance on a writer and his lover, finds himself becoming increasingly absorbed by their lives.", "poster": "https://m.media-amazon.com/images/M/MV5BNDUzNjYwNDYyNl5BMl5BanBnXkFtZTcwNjU3ODQ0MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1175212800000, "runtime": 137, "title": "The Lives of Others", "tomatoes": {"boxOffice": "$11.2M", "consensus": "Unlike more traditional spy films, The Lives of Others doesn't sacrifice character for cloak and dagger chases, and the performances (notably that by the late Ulrich Muhe) stay with you.", "critic": {"meter": 93, "numReviews": 152, "rating": 8.3}, "dvd": 1187654400000, "fresh": 142, "lastUpdated": 1442163848000, "production": "Sony Pictures Classics", "rotten": 10, "viewer": {"meter": 96, "numReviews": 120137, "rating": 4.4}, "website": "http://www.thelivesofothers.com/"}, "type": "movie", "writers": ["Florian Henckel von Donnersmarck"], "year": 2006}