{"_id": "573a13caf29313caabd7be0a", "awards": {"nominations": 13, "text": "7 wins & 13 nominations.", "wins": 7}, "cast": ["William Mapother", "Brit Marling", "Matthew-Lee Erlbach", "DJ Flava"], "countries": ["USA"], "directors": ["Mike Cahill"], "fullplot": "Seventeen year-old Rhoda Williams receives an acceptance letter from MIT and she celebrates with her friends. On the same night, a planet similar and close to Earth is discovered and called Earth 2. Rhoda drives her car looking at Earth 2 and crashes with composer John Burroughs, killing his pregnant wife and his baby son. Rhoda goes to prison and four years later she is released and moves to her parents' house. She finds a job as high-school janitor, but tries to commit suicide. She survives, however, and submits an essay to a contest where the prize is a ticket to travel to Earth 2. Meanwhile the scientists discover that Earth 2 is a mirror of Earth and the synchronicity between the dwellers was interrupted when the planets were seen by each other. One day, Rhoda decides to visit John Burroughs, whose life was destroyed after the death of his family, to admit to him that she had killed his family. However she does not have the nerve to tell him the truth. So she lies and tells him he has won a free cleaning service of his home. Rhoda wins the writing contest, but meanwhile John and she have fallen in love with each other. Rhoda has to take a decision whether she goes or stays, but she wants to tell John the truth first.", "genres": ["Drama", "Romance", "Sci-Fi"], "imdb": {"id": 1549572, "rating": 7, "votes": 63440}, "languages": ["English"], "lastupdated": "2015-09-04 00:19:45.663000000", "metacritic": 66, "plot": "On the night of the discovery of a duplicate Earth in the Solar system, an ambitious young student and an accomplished composer cross paths in a tragic accident.", "poster": "https://m.media-amazon.com/images/M/MV5BMTAzNTIzMjkxNjJeQTJeQWpwZ15BbWU3MDEwNDQ2OTU@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1318377600000, "runtime": 92, "title": "Another Earth", "tomatoes": {"boxOffice": "$1.3M", "critic": {"meter": 63, "numReviews": 123, "rating": 6.2}, "dvd": 1322524800000, "fresh": 78, "lastUpdated": 1442423051000, "production": "Fox Searchlight", "rotten": 45, "viewer": {"meter": 66, "numReviews": 18294, "rating": 3.5}, "website": "http://www.foxsearchlight.com/anotherearth/"}, "type": "movie", "writers": ["Mike Cahill", "Brit Marling"], "year": 2011}