{"_id": "573a1394f29313caabce0a6b", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["David Hedison", "Patricia Owens", "Vincent Price", "Herbert Marshall"], "countries": ["USA"], "directors": ["Kurt Neumann"], "fullplot": "After her husband Andre Delambre is crushed to death in a mechanical press, his wife recounts to his brother Francois Delambre and police Inspector Charas the events of the previous few months. They were very much in love and with their little boy, a very happy family. Andre was experimenting with teleportation - transporting objects from one point to another by breaking the object down to the atomic level and then reassembling it in a receiver a distance away. The system had some glitches - it seemed to work with inanimate object but his cat disappeared when he tried teleporting it. He thinks he's solved all of the problems with his invention and decides to try and teleport himself. When a fly enters the teleportation device with him, disaster strikes.", "genres": ["Horror", "Sci-Fi"], "imdb": {"id": 51622, "rating": 7.1, "votes": 13987}, "languages": ["English", "French"], "lastupdated": "2015-08-21 00:17:38.687000000", "plot": "A scientist has a horrific accident when he tries to use his newly invented teleportation device.", "poster": "https://m.media-amazon.com/images/M/MV5BMWRhMTY4NTgtYTljZi00ZGQzLWE3NWMtMmNjNzRkZmUyZjIyXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_SY1000_SX677_AL_.jpg", "rated": "APPROVED", "runtime": 94, "title": "The Fly", "tomatoes": {"consensus": "Deliciouly funny to some and eerily presicient to others, The Fly walks a fine line between shlocky fun and unnerving nature parable.", "critic": {"meter": 95, "numReviews": 38, "rating": 7.1}, "dvd": 1189468800000, "fresh": 36, "lastUpdated": 1442256473000, "production": "Fox", "rotten": 2, "viewer": {"meter": 70, "numReviews": 10792, "rating": 3.4}}, "type": "movie", "writers": ["James Clavell (screenplay)", "George Langelaan (based on a story by)"], "year": 1958}