{"_id": "573a1394f29313caabce0031", "awards": {"nominations": 2, "text": "Nominated for 1 BAFTA Film Award. Another 1 nomination.", "wins": 0}, "cast": ["Ava Gardner", "Stewart Granger", "Bill Travers", "Abraham Sofaer"], "countries": ["USA", "UK"], "directors": ["George Cukor"], "fullplot": "The year is 1947, the British are on the verge of finally leaving India. Amongst the few who are sorry to see the British leave are the Anglo-Indians, half British and half Indian, for they are going to miss the patronage of their white cousins, the job reservations, and the important status and positions they currently hold. The British, quite frankly, do not think well of Anglo-Indians, nor do the Indians. Victoria Jones is one such Anglo-Indian, a WAC in the British Army, her father a railway engine driver, and her mom a housewife. She is close to another Anglo-Indian, Patrick Taylor, but changes her mind about him as he harbors deep hatred for the Indians. She witnesses Col. Rodney Savage instruct his soldiers to pour filthy water and garbage at the hands of untouchables on high-caste men and women who are protesting by laying down on the railway tracks to prevent trains from moving. Repulsed and shocked at this, she turns to Ranjit Singh Kassi, a Sikh, and longs to be Indian. She even accompanies him to the Gurudwara in order to change her faith. Then circumstances make her change her mind in favor of Rodney Savage. What Rodney does not know is that Victoria harbors a deep dark secret - a murder of a white British Officer named Graham McDaniels, on one hand, and of her knowledge of a terrorist named Ghanshyam - the one who was responsible for stealing explosives from a stranded train - and who may use these to bring the railways to a halt by planting them on the tracks, his motive to disrupt the railways, and to kill the passengers of a train. And amongst the passengers is none other than Mohandas Karamchand Gandhi - more popularly known as Mahatma Gandhi.", "genres": ["Adventure", "Drama", "History"], "imdb": {"id": 49007, "rating": 6.4, "votes": 1196}, "languages": ["English"], "lastupdated": "2015-08-27 00:13:53.400000000", "num_mflix_comments": 1, "plot": "Anglo-Indian Victoria Jones seeks her true identity amid the chaos of the British withdrawal from India.", "poster": "https://m.media-amazon.com/images/M/MV5BOWI0OWYzNmEtOTZkZi00NzA4LWE1MjEtNTRiMmUxYzRlN2U1XkEyXkFqcGdeQXVyMjA0MzYwMDY@._V1_SY1000_SX677_AL_.jpg", "rated": "APPROVED", "released": -431395200000, "runtime": 110, "title": "Bhowani Junction", "tomatoes": {"critic": {"meter": 100, "numReviews": 5, "rating": 7}, "dvd": 688176000000, "fresh": 5, "lastUpdated": 1437762340000, "production": "MGM", "rotten": 0, "viewer": {"meter": 61, "numReviews": 702, "rating": 3.2}}, "type": "movie", "writers": ["Sonya Levien (screenplay)", "Ivan Moffat (screenplay)", "John Masters (novel)"], "year": 1956}