{"_id": "573a13b8f29313caabd4b3cc", "awards": {"nominations": 43, "text": "Nominated for 1 Oscar. Another 21 wins & 43 nominations.", "wins": 22}, "cast": ["Elizabeth Berrington", "Rudy Blomme", "Olivier Bonjour", "Mark Donovan"], "countries": ["UK", "USA"], "directors": ["Martin McDonagh"], "fullplot": "London based hit men Ray and Ken are told by their boss Harry Waters to lie low in Bruges, Belgium for up to two weeks following their latest hit, which resulted in the death of an innocent bystander. Harry will be in touch with further instructions. While they wait for Harry's call, Ken, following Harry's advice, takes in the sights of the medieval city with great appreciation. But the charms of Bruges are lost on the simpler Ray, who is already despondent over the innocent death, especially as it was his first job. Things change for Ray when he meets Chloe, part of a film crew shooting a movie starring an American dwarf named Jimmy. When Harry's instructions arrive, Ken, for whom the job is directed, isn't sure if he can carry out the new job, especially as he has gained a new appreciation of life from his stay in the fairytale Bruges. While Ken waits for the inevitable arrival into Bruges of an angry Harry, who feels he must clean up matters on his own, Ray is dealing with his own problems, not only with Harry, but with a Canadian couple and a half-blind thief named Eirik. Ray hopes he can count on both Chloe and Ken to help him carve out a new life for himself. In the end, Harry, involved in an incident with Jimmy, may have to keep to his own principles.", "genres": ["Comedy", "Crime", "Drama"], "imdb": {"id": 780536, "rating": 8, "votes": 283821}, "languages": ["English"], "lastupdated": "2015-09-01 00:04:57.257000000", "metacritic": 67, "plot": "Guilt-stricken after a job gone wrong, hitman Ray and his partner await orders from their ruthless boss in Bruges, Belgium, the last place in the world Ray wants to be.", "poster": "https://m.media-amazon.com/images/M/MV5BMTUwOGFiM2QtOWMxYS00MjU2LThmZDMtZDM2MWMzNzllNjdhXkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1204243200000, "runtime": 107, "title": "In Bruges", "tomatoes": {"boxOffice": "$7.6M", "consensus": "Featuring witty dialogue and deft performances, In Bruges is an effective mix of dark comedy and crime thriller elements.", "critic": {"meter": 84, "numReviews": 184, "rating": 7.3}, "dvd": 1214265600000, "fresh": 154, "lastUpdated": 1442082199000, "production": "Focus Features", "rotten": 30, "viewer": {"meter": 86, "numReviews": 109952, "rating": 3.9}, "website": "http://www.filminfocus.com/inbruges"}, "type": "movie", "writers": ["Martin McDonagh"], "year": 2008}