{"_id": "573a1396f29313caabce5049", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Keith Michell", "Donald Pleasence", "Charlotte Rampling", "Jane Asher"], "countries": ["UK"], "directors": ["Waris Hussein"], "fullplot": "On his deathbed Tudor-king Henry VIII remembers his long reign and especially the crucial part his six marriages played in it, without producing the male heir he desired most to prevent civil wars for the succession as England suffered before his father's ascent. His first queen, Spanish princess Kathryn of Aragon, had one fatal flaw: her children died, except daughter Mary, so he pressed Rome for an annulment, and when that failed out went cardinal Wolsey as chief minister and Henry made himself head of the Church of England instead of the papacy and married Anne Boleyn. When she too failed to produce a male heir, just princess Elisabeth, he had her head roll for 'infidelity'. The third queen, gentle Jane Seymour, died giving birth to sickly prince Edward. For diplomatic reasons Henry married minor princess Anne of Cleves, whose utter lack of female charms causes another annulment and the fall of Thomas Cromwell, who recommended her. Fifth is the lovely Catherine Howard, cousin of Anne Boleyn, but again childless and found to have been carnal with servants before and after her royal marriage, so also decapitated. Finally Catherine Parr, a young widow, stands at his deathbed.", "genres": ["Drama"], "imdb": {"id": 70170, "rating": 6.9, "votes": 464}, "languages": ["English"], "lastupdated": "2015-08-12 00:04:01.657000000", "plot": "On his deathbed, King Henry VIII looks back over his eventful life and his six marriages.", "poster": "https://m.media-amazon.com/images/M/MV5BMTMwNzA5MTY4OF5BMl5BanBnXkFtZTcwNDQ2OTcyMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 97372800000, "runtime": 125, "title": "Henry VIII and His Six Wives", "tomatoes": {"lastUpdated": 1440613412000, "viewer": {"numReviews": 90, "rating": 3.8}}, "type": "movie", "writers": ["Ian Thorne (original screenplay)"], "year": 1972}