{"_id": "573a13a1f29313caabd06940", "awards": {"nominations": 14, "text": "7 wins & 14 nominations.", "wins": 7}, "cast": ["Anthony Hopkins", "Julianne Moore", "Gary Oldman", "Ray Liotta"], "countries": ["USA", "UK"], "directors": ["Ridley Scott"], "fullplot": "The continuing saga of Hannibal Lecter, the murdering cannibal. He is presently in Italy and works as a curator at a museum. Clarice Starling, the FBI agent whom he aided to apprehend a serial killer, was placed in charge of an operation but when one of her men botches it, she's called to the mat by the Bureau. One high ranking official, Paul Krendler has it in for her. But she gets a reprieve because Mason Verger, one of Lecter's victims who is looking to get back at Lecter for what Lecter did to him, wants to use Starling to lure him out. When Lecter sends her a note she learns that he's in Italy so she asks the police to keep an eye out for him. But a corrupt policeman who wants to get the reward that Verger placed on him, tells Verger where he is. But they fail to get him. Later Verger decides to frame Starling which makes Lecter return to the States. And the race to get Lecter begins.", "genres": ["Crime", "Drama", "Thriller"], "imdb": {"id": 212985, "rating": 6.7, "votes": 195182}, "languages": ["English", "Italian", "Japanese"], "lastupdated": "2015-08-22 00:00:35.423000000", "metacritic": 57, "num_mflix_comments": 1, "plot": "Living in exile, Hannibal Lecter tries to reconnect with now disgraced FBI agent Clarice Starling and finds himself a target for revenge from a powerful victim.", "poster": "https://m.media-amazon.com/images/M/MV5BZDMxMjhiZmItNWMxMC00NzYyLWJiOTYtNGYwOTAyYjU5OWY4XkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 981676800000, "runtime": 131, "title": "Hannibal", "tomatoes": {"boxOffice": "$163.9M", "consensus": "While superbly acted and stylishly filmed, Hannibal lacks the character interaction between the two leads which made the first movie so engrossing.", "critic": {"meter": 39, "numReviews": 164, "rating": 5.1}, "dvd": 998352000000, "fresh": 64, "lastUpdated": 1442077589000, "production": "MGM", "rotten": 100, "viewer": {"meter": 63, "numReviews": 402186, "rating": 3.4}, "website": "http://www.mgm.com/hannibal"}, "type": "movie", "writers": ["Thomas Harris (novel)", "David Mamet (screenplay)", "Steven Zaillian (screenplay)"], "year": 2001}