{"_id": "573a1392f29313caabcda391", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Marie Bell", "Pierre Richard-Willm", "Charles Vanel", "Georges Pitoèff"], "countries": ["France"], "directors": ["Jacques Feyder"], "fullplot": "Pierre (Pierre Richard-Willm), a young lawyer, has enormous debts due to his mistress Florence (Marie Bell), and her whims of luxury life. Pierre has gone too far and put the family firm in jeopardy. They ask him to expatriate. To avoid scandal, Pierre joins the Foreign Legion. In Morocco, near the desert, Pierre goes with his comrades of the Legion to a bar-restaurant-brothel, owned by a shady character, Mr. Clement (Charles Vanel). Clement lives more or less with Ms.Blanche (Franèoise Rosay) who is a fortune teller with cards, as a hobby. But Clement is also after his girls now and then. Pierre is still obsessed with Florence but he meets Irma (Marie Bell), one of Clement's girls, who is the double of Florence except for hair color. Irma has had an accident and has lost part of her memory at a certain point of her recent past, and Pierre slowly persuades himself she is Florence, but cannot remember it. Advised by Ms.Blanche, Irma finally accepts to act as if she was Florence because she is falling in love with Pierre. Near the end of his contract with the Legion, Pierre receives news from France. He has inherited a fortune. He asks Irma to come to France with him, and they make plans. But Clement tries to rape Irma and Pierre has to kill him.", "genres": ["Drama", "Romance"], "imdb": {"id": 25198, "rating": 7.3, "votes": 244}, "languages": ["French"], "lastupdated": "2015-06-29 00:32:34.333000000", "num_mflix_comments": 2, "plot": "Pierre (Pierre Richard-Willm), a young lawyer, has enormous debts due to his mistress Florence (Marie Bell), and her whims of luxury life. Pierre has gone too far and put the family firm in...", "poster": "https://m.media-amazon.com/images/M/MV5BMjM0OTQyOTkxMV5BMl5BanBnXkFtZTgwMDQ1NTA0MzE@._V1_SY1000_SX677_AL_.jpg", "runtime": 120, "title": "Le grand jeu", "tomatoes": {"lastUpdated": 1436641376000, "viewer": {"meter": 60, "numReviews": 11, "rating": 3.5}}, "type": "movie", "writers": ["Jacques Feyder (screenplay)", "Charles Spaak (screenplay)"], "year": 1934}