{"_id": "573a1397f29313caabce76ff", "awards": {"nominations": 5, "text": "Nominated for 1 Oscar. Another 1 win & 5 nominations.", "wins": 2}, "cast": ["Brooke Shields", "Christopher Atkins", "Leo McKern", "William Daniels"], "countries": ["USA"], "directors": ["Randal Kleiser"], "fullplot": "On a journey to San Francisco, Richard, his father and cousin Emmeline find themselves on a ship about to explode. Rushed to a lifeboat with Paddy Button, the two children escape while their father (and uncle) are on another lifeboat. In the chaos following, the lifeboats are separated. Paddy, Richard and Emmeline find themselves with no food and no water stuck in the middle of nowhere. After some time, the three come across an uncharted paradise, where Paddy quickly teaches the children fishing, hunting and building. After maybe a month or two, Paddy gets very drunk off a barrel of rum found on the island when they first arrive, and drowns in the middle of the night. Emmeline and Richard, now alone and very scared, move location and rebuild their island home. Many years later, the two young teenagers have developed a very real home, but hormones and feelings between the two strain their friendship, until Richard, who is still very determined to reach San Francisco, is let down by Emmeline when a ship passes by the island and she does not light the signal fire. Throwing her out of the home they had built together, Emmeline attempts to survive on her own but is hurt. After Richard finds her dying, he realizes how he really feels for her and manages to save her. Nature runs its course and their friendship turns into love as the couple learn about the facts of life, when Emmeline has a baby and does not understand why.", "genres": ["Adventure", "Drama", "Romance"], "imdb": {"id": 80453, "rating": 5.7, "votes": 47088}, "languages": ["English"], "lastupdated": "2015-08-29 00:17:32.233000000", "num_mflix_comments": 1, "plot": "In the Victorian period, two children are shipwrecked on a tropical island in the South Pacific. With no adults to guide them, the two make a simple life together, unaware that sexual maturity will eventually intervene.", "poster": "https://m.media-amazon.com/images/M/MV5BOWU2ZDIxY2UtNzM5NS00MWUwLTkxN2QtMmI3NDZkNTA2OTYxXkEyXkFqcGdeQXVyMTA0MjU0Ng@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 331344000000, "runtime": 104, "title": "The Blue Lagoon", "tomatoes": {"critic": {"meter": 11, "numReviews": 18, "rating": 2.7}, "dvd": 939081600000, "fresh": 2, "lastUpdated": 1439921394000, "production": "Sony Pictures Entertainment", "rotten": 16, "viewer": {"meter": 54, "numReviews": 55399, "rating": 2.9}}, "type": "movie", "writers": ["Henry De Vere Stacpoole (novel)", "Douglas Day Stewart"], "year": 1980}