{"_id": "573a13b5f29313caabd4393b", "awards": {"nominations": 14, "text": "Nominated for 1 Golden Globe. Another 4 wins & 14 nominations.", "wins": 5}, "cast": ["Matthew Perry", "Judith Buchan", "Griffin Cork", "Jerry Callaghan"], "countries": ["USA", "Canada"], "directors": ["Randa Haines"], "fullplot": "1998. Ron Clark, still relatively early in his career, leaves his stable life teaching at an elementary school in his suburban North Carolina hometown, the school where he is appreciated by both his fellow teachers and his students for his innovative teaching methods which results in raising test scores. Instead, he decides to look for a teaching job at a tough New York inner city school where he feels he can be more useful. He eventually finds a job at Inner Harlem Elementary School, where the students are segregated according to their potential. As Clark is white and \"nice\" looking, Principal Turner wants to assign him to the honors class, especially as Turner's job security depends on good test scores. Clark, however, wants to take the most disadvantaged class. He quickly learns that it will be a battle of wills between himself and his disruptive students to see who can outlast the other. But he also learns that he has to understand them, both individually and collectively, on their level to be able to get through to them before he can teach them the standardized materials. But even the best laid plans can be turned askew by unforeseen events, such as illness and the behavior of others outside of his control. And he has to overcome the self-fulfilling prophecy of failure to instill a sense of worth within the students. Through it all, he is supported by Marissa Vega, the beautiful waitress at the restaurant where he works part-time.", "genres": ["Biography", "Drama"], "imdb": {"id": 473389, "rating": 7.7, "votes": 7112}, "languages": ["English"], "lastupdated": "2015-09-05 00:55:49.697000000", "num_mflix_comments": 1, "plot": "A small-town teacher relocates to one of the toughest classrooms in the country.", "poster": "https://m.media-amazon.com/images/M/MV5BMjE3NDY4NzM1NF5BMl5BanBnXkFtZTYwOTQ1MTk2._V1_SY1000_SX677_AL_.jpg", "rated": "TV-PG", "released": 1155427200000, "runtime": 90, "title": "The Ron Clark Story", "tomatoes": {"dvd": 1165276800000, "lastUpdated": 1437761952000, "production": "Echo Bridge Home Entertainment", "viewer": {"meter": 85, "numReviews": 6256, "rating": 3.9}}, "type": "movie", "writers": ["Annie DeYoung", "Max Enscoe"], "year": 2006}