{"_id": "573a1392f29313caabcdb18f", "awards": {"nominations": 1, "text": "1 win & 1 nomination.", "wins": 1}, "cast": ["John Laurie", "Belle Chrystall", "Eric Berry", "Kitty Kirwan"], "countries": ["UK"], "directors": ["Michael Powell"], "fullplot": "A trio wanders the cliffs of an Outer Hebridean island and encounters a gravestone at the edge of a precipice; it reads, \"Peter Manson ... gone over.\" One man in the trio knows the story of the gravestone and tells it to the others... It is ten years earlier, and the way of life on the island is dying; steam trawlers from the mainland threaten its survival as a fishing port. Peter Manson, one of the community's leaders, resists evacuating to the mainland, though his son Robbie is about to leave the island himself. Meanwhile, Robbie's twin sister plans to marry his best friend, Andrew Gray. Andrew and Robbie argue over evacuation and decide to settle the matter by racing to the top of a cliff. Ruth is terrified: she may lose them both. The race ends in tragedy, which tears apart the families of Manson and Gray. Times passes and Ruth reveals she is pregnant with an illegitimate child. This promises to bring the two families back together, but not before desperation hits the islanders. Evacuation is inevitable. And so is one last tragedy.", "genres": ["Drama", "History", "Romance"], "imdb": {"id": 28818, "rating": 7.4, "votes": 1225}, "languages": ["English"], "lastupdated": "2015-07-26 00:41:02.490000000", "num_mflix_comments": 1, "plot": "A way of life is dying on an Outer Hebridean island fishing port, but some of the inhabitants resist evacuating to the mainland.", "poster": "https://m.media-amazon.com/images/M/MV5BMTU1MDc4MzI2OF5BMl5BanBnXkFtZTYwNjgxNTg5._V1_SY1000_SX677_AL_.jpg", "rated": "PASSED", "released": -988156800000, "runtime": 74, "title": "The Edge of the World", "tomatoes": {"critic": {"meter": 100, "numReviews": 10, "rating": 7.8}, "dvd": 1070928000000, "fresh": 10, "lastUpdated": 1435088602000, "production": "British Film Institute", "rotten": 0, "viewer": {"meter": 78, "numReviews": 792, "rating": 3.6}}, "type": "movie", "writers": ["Michael Powell (story)"], "year": 1937}