{"_id": "573a13cef29313caabd883f3", "awards": {"nominations": 3, "text": "2 wins & 3 nominations.", "wins": 2}, "cast": ["Ellen Barkin", "Ezra Miller", "Ellen Burstyn", "Demi Moore"], "countries": ["USA"], "directors": ["Sam Levinson"], "fullplot": "A family weekend is fraught with emotional landmines for mercurial and sensitive Lynn (Barkin) as she arrives at her parents' Annapolis estate for the marriage of her estranged eldest son Dylan (Michael Nardelli), accompanied by her three younger children (Ezra Miller, Kate Bosworth, Daniel Yelsky). Lynn's hopes for a joyful reunion are crushed as her wry but troubled middle son Elliot (Ezra Miller) lobs verbal grenades at his mother and her relatives while daughter Alice (Kate Bosworth), a fights valiantly to keep her longtime demons under control. The weekend quickly unravels as Lynn demands to be heard by her aloof, disdainful mother (Ellen Burstyn), ailing, distant father (George Kennedy) and ever-judgmental sisters (Siobhan Fallon, Diana Scarwid), but most especially by her ex-husband Paul (Thomas Hayden Church) and his hot-tempered second wife Patty (Demi Moore). Confronted with the deeply painful, half-buried truths that have given rise to the family's primal web ofresentments and recriminations, Lynn struggles to maintain her equilibrium as her best attempts at reconciliation veer quickly off-course.", "genres": ["Comedy", "Drama"], "imdb": {"id": 1719071, "rating": 6, "votes": 3058}, "languages": ["English"], "lastupdated": "2015-09-10 17:53:50.810000000", "metacritic": 46, "num_mflix_comments": 1, "plot": "A wedding at her parents' Annapolis estate hurls high-strung Lynn into the center of touchy family dynamics.", "poster": "https://m.media-amazon.com/images/M/MV5BMTczODU4MDg2OV5BMl5BanBnXkFtZTcwMDE3MzU5Ng@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1323302400000, "runtime": 119, "title": "Another Happy Day", "tomatoes": {"boxOffice": "$8.5k", "consensus": "Another Happy Day features outstanding performances (Ellen Barkin's especially) but the characters are too unpleasant to endure.", "critic": {"meter": 45, "numReviews": 33, "rating": 5.2}, "dvd": 1327363200000, "fresh": 15, "lastUpdated": 1441135136000, "production": "Phase 4 Films", "rotten": 18, "viewer": {"meter": 44, "numReviews": 1230, "rating": 3.1}, "website": "http://anotherhappydaymovie.com/"}, "type": "movie", "writers": ["Sam Levinson"], "year": 2011}