{"_id": "573a13d0f29313caabd8be62", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Judy Findlay", "Carlos Lopez", "Derek Erdman", "Ronald McGill"], "countries": ["USA"], "directors": ["Todd Rohal"], "fullplot": "Thirty-something Billy Smoortser is a junior parish priest. He exasperates the senior parish priest, Father O'Herlihy, as Billy often does not display a true understanding of his job, telling stories to the parishioners that have nothing to do with religion or that have no moral teaching. It is almost like Billy is stuck mentally in his teens, displaying infantile behavior typical of a teen. When Father O'Herlihy forces Billy to take a vacation in order to focus more clearly on his mission as a priest, Billy decides to take a several hour river canoe trip with Robbie Shoemaker, who he recently reconnected with via email. Robbie was Billy's older sister Janice's boyfriend in high school, and Billy's idol at the time. In high school, Robbie was in a death metal band and a writer, the latter which not many knew about except perhaps Billy. To the best of Billy's knowledge, Robbie still plays in a death metal band and still writes. It is Robbie's stories which Billy often tells to his parishioners. Billy wants this canoe trip to recreate the memories of their teen years, Robbie the cool kid who Billy, the dork, wanted to be more like. As Billy and Robbie truly reconnect, they take divergent paths to what they need out of the trip, especially as revelations come to light. But they end up getting lost, which makes their time together life altering, that time which includes an encounter with a group of three calling themselves Huck Finn, Tom Sawyer and Jim, who Huck and Tom are taking to freedom.", "genres": ["Comedy"], "imdb": {"id": 1772371, "rating": 5.5, "votes": 548}, "languages": ["English"], "lastupdated": "2015-08-18 00:09:36.970000000", "metacritic": 47, "plot": "Father William Smoortser drops his bible into a toilet at a rest stop just before embarking on a day-long canoe trip, breaking loose all glorious hell.", "poster": "https://m.media-amazon.com/images/M/MV5BMjE4MTI2OTk3NV5BMl5BanBnXkFtZTcwNDg3OTY4Ng@@._V1_SY1000_SX677_AL_.jpg", "released": 1318982400000, "runtime": 75, "title": "The Catechism Cataclysm", "tomatoes": {"boxOffice": "$1.9k", "critic": {"meter": 41, "numReviews": 17, "rating": 5.4}, "dvd": 1330300800000, "fresh": 7, "lastUpdated": 1438625108000, "production": "IFC Films", "rotten": 10, "viewer": {"meter": 45, "numReviews": 183, "rating": 2.9}, "website": "http://www.catechismcataclysm.com/"}, "type": "movie", "writers": ["Todd Rohal (screenplay)"], "year": 2011}