{"_id": "573a13adf29313caabd2ae83", "awards": {"nominations": 2, "text": "2 nominations.", "wins": 0}, "cast": ["Andy Garcia", "Elsa Zylberstein", "Omid Djalili", "Hippolyte Girardot"], "countries": ["UK", "Germany", "Romania", "France", "Italy"], "directors": ["Mick Davis"], "fullplot": "Set in Paris in 1919, biopic centers on the life of late Italian artist Amedeo Modigliani, focusing on his last days as well as his rivalry with Pablo Picasso. Modigliani, a Jew, has fallen in love with Jeanne, a young and beautiful Catholic girl. The couple has an illegitimate child, and Jeanne's bigoted parents send the baby to a faraway convent to be raised by nuns. Modigliani is distraught and needs money to rescue and raise his child. The answer arrives in the shape of Paris' annual art competition. Prize money and a guaranteed career await the winner. Neither Modigliani, nor his dearest friend and rival Picasso have ever entered the competition, believing that it is beneath true artists like themselves. But push comes to shove with the welfare of his child on the line, and Modigliani signs up for the competition in a drunken and drug-induced tirade. Picasso follows suit and all of Paris is aflutter with excitement at who will win. With the balance of his relationship with Jeanne on the line, Modigliani tackles this work with the hopes of creating a masterpiece, and knows that all the artists of Paris are doing the same.", "genres": ["Biography", "Drama"], "imdb": {"id": 367188, "rating": 7.4, "votes": 7639}, "languages": ["English"], "lastupdated": "2015-08-07 00:11:29.240000000", "metacritic": 25, "num_mflix_comments": 1, "plot": "The story of Amedeo Modigliani's bitter rivalry with Pablo Picasso, and his tragic romance with Jeanne Hebuterne.", "poster": "https://m.media-amazon.com/images/M/MV5BMTA1MDY5MjU1MjJeQTJeQWpwZ15BbWU2MDEyMTg3Ng@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1096416000000, "runtime": 128, "title": "Modigliani", "type": "movie", "writers": ["Mick Davis"], "year": 2004}