{"_id": "573a1395f29313caabce1f3f", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Chuck Connors", "Luke Halpin", "Connie Scott", "Jane Rose"], "countries": ["USA"], "directors": ["James B. Clark"], "fullplot": "The Florida Keys have been hit by hard times of late. First, a red plague kills off much of the fish in the area. And second, Hurricane Hazel unexpectedly changes course to hit the Keys. Regardless, the Ricks family - fisherman father Po (short for Porter), wife Martha, their preteen son Sandy, and Sandy's pet pelican Pete - live in all its aspects by the sea, even during these hard times. When Sandy witnesses the accidental spearing of a dolphin, he, on his own, decides to find the dolphin to put it out of its misery. Upon finding the injured dolphin, Sandy, not having the heart to shoot him, decides instead to tow the dolphin home. With some care and love, Sandy and Martha nurse the dolphin back to health. Sandy wants to keep the dolphin, who he's named Flipper, but Po ultimately releases Flipper, who he sees as \"the enemy\": a creature who is on the hunt for whatever short supply of fish there are around the Keys. But Po learns that friends - what Flipper and Sandy are to each other - help each other unconditionally.", "genres": ["Adventure", "Family", "Drama"], "imdb": {"id": 57063, "rating": 6, "votes": 1161}, "languages": ["English"], "lastupdated": "2015-08-02 00:27:11.263000000", "plot": "Sandy is distraught when, having saved Flipper by pulling out a spear, his father insists the dolphin be released. A grateful Flipper, however, returns the favor when Sandy is threatened by Sharks.", "poster": "https://m.media-amazon.com/images/M/MV5BMTRmNjQ1NTctNWMwMi00YTZlLWIyNmQtNzcyYTgwZTU0MTIyXkEyXkFqcGdeQXVyMTE2NzA0Ng@@._V1_SY1000_SX677_AL_.jpg", "rated": "G", "released": -201484800000, "runtime": 87, "title": "Flipper", "tomatoes": {"critic": {"meter": 40, "numReviews": 5, "rating": 4.7}, "dvd": 1093305600000, "fresh": 2, "lastUpdated": 1437849342000, "production": "MGM Home Entertainment", "rotten": 3, "viewer": {"meter": 50, "numReviews": 26339, "rating": 2.7}}, "type": "movie", "writers": ["Ricou Browning (story)", "Jack Cowden (story)", "Arthur Weiss"], "year": 1963}