{"_id": "573a1398f29313caabce9b6f", "awards": {"nominations": 1, "text": "1 win & 1 nomination.", "wins": 1}, "cast": ["Emilio Estevez", "Rob Lowe", "Andrew McCarthy", "Demi Moore"], "countries": ["USA"], "directors": ["Joel Schumacher"], "fullplot": "Seven friends - Alec, Billy, Jules, Kevin, Kirby, Leslie and Wendy - are trying to navigate through life and their friendships following college graduation. Alec, who aspires to political life, has just shown his true colors by changing his allegiance from Democrat to Republican, which freaks out girlfriend Leslie, who he wants to marry. Budding architect Leslie, on the other hand, has an independent streak. She believes she has to make a name for herself to find out who she is before she can truly commit to another person in marriage. But Leslie and Alec have decided to live together. Because Leslie refuses to marry Alec, he believes that justifies certain behavior. Kirby, who wants to become a lawyer and who pays for his schooling by working as a waiter at their local hangout called St. Elmo's Bar, and struggling writer Kevin are currently roommates. They are on opposite extremes of the romance spectrum. Kirby has just reconnected with Dale Biberman, a slightly older woman he knew in college who is now a doctor. He is madly in love with her and will do *anything* to impress her. Kevin, on the other hand, doesn't date and states he doesn't believe in love, making his friends speculate that he's a closet homosexual who is secretly in love with Alec. Kevin will eventually open himself up to the one friend who matters the most. Billy, married with a child, is the irresponsible one of the group who would rather sleep around and play the saxophone than face the realities of being an adult with family commitments. He still lives for the memory of his fraternity glory days. Virginal and sheltered Wendy, who comes from a wealthy family, works in a low paying social services job. Her family provides for all her financial needs. She is in love with Billy, who in turn takes advantage of her adoration of him. And most are concerned about Jules, who works in a bank, lives a life of excess in all facets and doesn't have the financial means to live that lifestyle. The question for all seven becomes whether their friendship can survive adult real life.", "genres": ["Drama", "Romance"], "imdb": {"id": 90060, "rating": 6.3, "votes": 25722}, "languages": ["English"], "lastupdated": "2015-08-19 00:32:17.017000000", "num_mflix_comments": 1, "plot": "A group of friends, just out of college, struggle with adulthood.", "poster": "https://m.media-amazon.com/images/M/MV5BZjdlMTJkNDQtMmI5ZS00OTA1LWI2YTYtN2I5MGQwODhjOTQwXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 488764800000, "runtime": 110, "title": "St. Elmo's Fire", "type": "movie", "writers": ["Joel Schumacher", "Carl Kurlander"], "year": 1985}