{"_id": "573a13acf29313caabd26ad8", "awards": {"nominations": 3, "text": "3 nominations.", "wins": 0}, "cast": ["Samuel L. Jackson", "Juliette Binoche", "Brendan Gleeson", "Menzi Ngubane"], "countries": ["UK", "Ireland", "South Africa"], "directors": ["John Boorman"], "fullplot": "Langston Whitfield is a Washington Post journalist. His editor provocatively sends him to South Africa to cover the Truth and Reconciliation Commission hearings, in which the perpetrators of murder and torture on both sides during Apartheid are invited to come forward and confront their victims. By telling the unvarnished truth and expressing contrition, they may be granted amnesty. Can the deep wounds of Apartheid be healed through reconciliation? Langston is deeply skeptical. He tracks down Col. De Jager, the most notorious torturer in the SA Police and tries to penetrate the mind of a monster, an experience that obliges him to confront his own demons. Anna Malan is an Afrikaans poet who is covering the hearings for radio. As a white South African she is shattered by the accounts of the cruelty and depravity committed by her fellow countrymen. Anna and Langston must both question their sense of identity. Where do they each belong? How responsible are they for what is done in the name of their respective countries? The moving testimony of the victims affects them deeply. In different ways they are both estranged from their families, and their shared experience draws them ever closer to each other. It is a story charting the unfathomable depths of human cruelty and the redeeming power of forgiveness and love.", "genres": ["Drama", "Romance"], "imdb": {"id": 349260, "rating": 6, "votes": 2134}, "languages": ["English", "Afrikaans"], "lastupdated": "2015-09-14 23:36:27.617000000", "metacritic": 44, "num_mflix_comments": 1, "plot": "Langston Whitfield is a Washington Post journalist. His editor provocatively sends him to South Africa to cover the Truth and Reconciliation Commission hearings, in which the perpetrators ...", "poster": "https://m.media-amazon.com/images/M/MV5BNzM5MDg1NjIxMl5BMl5BanBnXkFtZTgwODkyNDM2MTI@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1083888000000, "runtime": 105, "title": "In My Country", "tomatoes": {"consensus": "A well-intentioned but melodramatic look at post-Apartheid South Africa.", "critic": {"meter": 22, "numReviews": 81, "rating": 4.8}, "dvd": 1120521600000, "fresh": 18, "lastUpdated": 1441134946000, "production": "Sony Pictures Classics", "rotten": 63, "viewer": {"meter": 57, "numReviews": 3260, "rating": 3.3}, "website": "http://www.sonyclassics.com/comingsoon.php?filmid=85&page=1"}, "type": "movie", "writers": ["Antjie Krog (book)", "Ann Peacock (screenplay)"], "year": 2004}