{"_id": "573a13c3f29313caabd6948d", "awards": {"nominations": 17, "text": "Nominated for 1 Oscar. Another 6 wins & 17 nominations.", "wins": 7}, "cast": ["Joel Edgerton", "Tom Hardy", "Nick Nolte", "Jennifer Morrison"], "countries": ["USA"], "directors": ["Gavin O'Connor"], "fullplot": "Two brothers face the fight of a lifetime - and the wreckage of their broken family - within the brutal, high-stakes world of Mixed Martial Arts (MMA) fighting in Lionsgate's action/drama, WARRIOR. An ex-Marine haunted by a tragic past, Tommy Riordan returns to his hometown of Pittsburgh and enlists his father, a recovered alcoholic and his former coach, to train him for an MMA tournament awarding the biggest purse in the history of the sport. As Tommy blazes a violent path towards the title prize, his brother, Brendan, a former MMA fighter unable to make ends meet as a public school teacher, returns to the amateur ring to provide for his family. Even though years have passed, recriminations and past betrayals keep Brendan bitterly estranged from both Tommy and his father. But when Brendan's unlikely rise as an underdog sets him on a collision course with Tommy, the two brothers must finally confront the forces that tore them apart, all the while waging the most intense, winner-takes-all battle of their lives.", "genres": ["Drama", "Sport"], "imdb": {"id": 1291584, "rating": 8.2, "votes": 292471}, "languages": ["English", "Spanish"], "lastupdated": "2015-09-04 00:23:45.413000000", "metacritic": 71, "num_mflix_comments": 1, "plot": "The youngest son of an alcoholic former boxer returns home, where he's trained by his father for competition in a mixed martial arts tournament - a path that puts the fighter on a collision course with his estranged, older brother.", "poster": "https://m.media-amazon.com/images/M/MV5BMTk4ODk5MTMyNV5BMl5BanBnXkFtZTcwMDMyNTg0Ng@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1315526400000, "runtime": 140, "title": "Warrior", "tomatoes": {"boxOffice": "$13.7M", "consensus": "Warrior relies on many of the clichès that critics of the genre love to mock -- and it transcends them with gripping action, powerful acting, and heart.", "critic": {"meter": 83, "numReviews": 175, "rating": 7.3}, "dvd": 1324339200000, "fresh": 145, "lastUpdated": 1442077347000, "production": "Lionsgate", "rotten": 30, "viewer": {"meter": 92, "numReviews": 56523, "rating": 4.3}, "website": "http://www.WarriorFilm.com"}, "type": "movie", "writers": ["Gavin O'Connor (screenplay)", "Anthony Tambakis (screenplay)", "Cliff Dorfman (screenplay)", "Gavin O'Connor (story)", "Cliff Dorfman (story)"], "year": 2011}