{"_id": "573a13c4f29313caabd6bd82", "awards": {"nominations": 9, "text": "1 win & 9 nominations.", "wins": 1}, "cast": ["Julianne Hough", "Dakota Sage Grant", "Matthew Rush Sullivan", "Diego Boneta"], "countries": ["USA"], "directors": ["Adam Shankman"], "fullplot": "1987. Naive Sherrie Christian has just arrived in Hollywood from Tulsa looking to become a rock star. She is just like Drew Boley was when he first arrived in Hollywood, he, now the Hollywood veteran, who works as a bar back at the Bourbon Club, known as the center of the rock scene in town and the place where many of the biggest acts in rock got their big break. The two meet as Drew helps Sherrie with a situation when she first arrives in town. Despite Dennis Dupree, the Bourbon's owner/manager, not liking to hire people like Drew or Sherrie - someone who has musical aspirations - as service staff, Drew is able to convince Dennis and his assistant Lonny to hire Sherrie as a server, Drew and Sherrie who have a blossoming mutual attraction. Dennis and Lonny, who are having financial difficulties, are able to convince rock star Stacee Jaxx, the perpetually stoned front man for the band Arsenal who got his first break performing at the Bourbon, to perform for free at a benefit concert at the club. Rumors are that Stacee is leaving Arsenal after their next gig to go solo, Rolling Stones reporter Constance Sack who wants to get the true story as to the reason. Another problem for the Bourbon is that Mayor Mike Whitmore is taking a tough stance on what he sees as bad societal influences like rock music. His Christian fundamentalist wife Patricia Whitmore is leading the on the ground campaign in this area, she who is determined to shut down the Bourbon. But Patricia is hiding a secret from her past as to the reason for her extreme fervor in getting rid of the Bourbon. As Drew and Sherrie's romance blossoms, other romances around them blossom as well. But their romance and their musical aspirations are threatened by trying to stay true to their musical visions, changing musical tastes, and by Stacee himself.", "genres": ["Comedy", "Drama", "Musical"], "imdb": {"id": 1336608, "rating": 5.9, "votes": 58484}, "languages": ["English"], "lastupdated": "2015-09-12 00:01:36.613000000", "metacritic": 47, "num_mflix_comments": 4, "plot": "A small town girl and a city boy meet on the Sunset Strip, while pursuing their Hollywood dreams.", "poster": "https://m.media-amazon.com/images/M/MV5BMTg2NDQyODAzNF5BMl5BanBnXkFtZTcwMTg5MDA3Nw@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1339718400000, "runtime": 123, "title": "Rock of Ages", "tomatoes": {"boxOffice": "$38.5M", "consensus": "Its exuberant silliness is almost enough to make up for its utter inconsequentiality, but Rock of Ages is ultimately too bland and overlong to justify its trip to the big screen.", "critic": {"meter": 41, "numReviews": 215, "rating": 5}, "dvd": 1349740800000, "fresh": 88, "lastUpdated": 1442252900000, "production": "New Line Cinema", "rotten": 127, "viewer": {"meter": 54, "numReviews": 207493, "rating": 3.3}, "website": "http://rockofagesmovie.warnerbros.com/"}, "type": "movie", "writers": ["Justin Theroux (screenplay)", "Chris D'Arienzo (screenplay)", "Allan Loeb (screenplay)", "Chris D'Arienzo (musical book)"], "year": 2012}