{"_id": "573a13b8f29313caabd4c80f", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Ad van Kempen", "Geert de Jong", "Yes-R", "Tjitske Reidinga"], "countries": ["Netherlands"], "directors": ["Martin Koolhoven"], "fullplot": "Thijs is a ripe-age Dutch tomato grower. His adult daughters plan to have him move in a skyscraper-flat, leaving home and professional life, but he takes his adolescent (half-)Moroccon grandson Omar's advice to refuse and keep living. Thijs even lets the cheerful rascal coach his love-life, which lands him on a blind date with Jacky, an energetic Flemish woman, who won't take no for an answer but turns up at his door-step till he consents, and soon drags him into evening life, preparing for a dance contest. Soon after Omar turns up, listless and lazier then ever, runaway from school and home. The obvious reason for the horny hound's hanging head is a girl: Mergal is foxy, Turkish and as smitten as he, but her burly big brother Erhan will only allow a boy to go steady with her who has proven himself his better on the field in the traditional manly sport of oil-wrestling. Now Thijs, in his day a 'dry' wrestler, resolves to return the kid's favor by coaching down-beaten Omar back to life to the full, although the decisive match is in a few days, like the contest, and the unathletic novice pupil still has nothing to show for his cockiness...", "genres": ["Comedy", "Romance"], "imdb": {"id": 800164, "rating": 5.3, "votes": 387}, "languages": ["Dutch"], "lastupdated": "2015-08-22 01:05:22.250000000", "num_mflix_comments": 1, "plot": "Thijs is a ripe-age Dutch tomato grower. His adult daughters plan to have him move in a skyscraper-flat, leaving home and professional life, but he takes his adolescent (half-)Moroccon ...", "poster": "https://m.media-amazon.com/images/M/MV5BMjA0MzU5OTg0Ml5BMl5BanBnXkFtZTcwMTE3Mzc0MQ@@._V1_SY1000_SX677_AL_.jpg", "released": 1166054400000, "runtime": 82, "title": "Happy Family", "tomatoes": {"lastUpdated": 1441218707000, "viewer": {"numReviews": 1058, "rating": 3.2}}, "type": "movie", "writers": ["Maarten Lebens"], "year": 2006}