{"_id": "573a13b8f29313caabd4c8c2", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Nadia Farès", "Robert Taylor", "David Lyons", "Mathew Wilkinson"], "countries": ["Australia"], "directors": ["Jamie Blanks"], "fullplot": "On a weekend boating excursion, husband and wife, Rob and Pia become lost and end up in the most unlikely place, a thick brush filled marsh, on an island in the middle of nowhere. With their boat in disarray, darkness coming on, and a heavy thunderstorm starting up, their only solution is to look for help or seek shelter of some kind. They finally come across a decrepit house and barn with no one home. However, there are definite signs of the house being inhabited, and the enormous crop of marijuana in the barn suggests the homeowners may not welcome their presence. Even worse, there is no telephone or means of communication to the outside world. But when the deranged, redneck owners, Brett, Jimmy and their even more sadistic father Poppy return, Rob and Pia realize a fear far beyond anything they have ever known. Furious with the unwanted intrusion of the affluent, snooping intruders, the monstrously sadistic farmers imprison and torture the couple, who fearing for their lives, submit to appalling degradation and humiliation. When Rob and Pia learn their kidnappers have no intention of ever letting them go alive, they finally understand they must do whatever it takes just to survive, and whatever it takes means going to a limit they could never have imagined...", "genres": ["Horror"], "imdb": {"id": 800367, "rating": 5.9, "votes": 4969}, "languages": ["English"], "lastupdated": "2015-09-17 04:51:39.510000000", "num_mflix_comments": 1, "plot": "A yuppie couple lost in a thick brush filled marsh seek refuge at an isolated farmhouse only to discover they've jumped out of the frying pan into the fire.", "poster": "https://m.media-amazon.com/images/M/MV5BNDQwMTdhMTUtMjhiNC00MDg0LWFiODAtNTJjNmE0OWMxODZiXkEyXkFqcGdeQXVyMzU0MTk1Nzc@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1200528000000, "runtime": 86, "title": "Storm Warning", "tomatoes": {"dvd": 1202169600000, "lastUpdated": 1442084120000, "production": "Film Victoria", "viewer": {"meter": 36, "numReviews": 2209, "rating": 2.9}, "website": "http://stormwarningmovie.com/"}, "type": "movie", "writers": ["Everett De Roche"], "year": 2007}