{"_id": "573a13b3f29313caabd3b4e1", "awards": {"nominations": 15, "text": "6 wins & 15 nominations.", "wins": 6}, "cast": ["Ray Romano", "John Leguizamo", "Denis Leary", "Seann William Scott"], "countries": ["USA"], "directors": ["Carlos Saldanha"], "fullplot": "Manny the woolly mammoth, Sid the sloth, Diego the saber-toothed tiger, and the hapless prehistoric squirrel/rat known as Scrat are still together and enjoying the perks of their now melting world. Manny may be ready to start a family, but nobody has seen another mammoth for a long time; Manny thinks he may be the last one. That is, until he miraculously finds Ellie, the only female mammoth left in the world. Their only problems: They can't stand each other--and Ellie somehow thinks she's a possum! Ellie comes with some excess baggage in the form of her two possum \"brothers\"-- Crash and Eddie, a couple of daredevil pranksters and cocky, loud-mouthed troublemakers. Manny, Sid and Diego quickly learn that the warming climate has one major drawback: A huge glacial dam holding off oceans of water is about to break, threatening the entire valley. The only chance of survival lies at the other end of the valley. So our three heroes, along with Ellie, Crash and Eddie, form the most unlikely family--in any \"Age\"-- as they embark on a mission across an ever-changing, increasingly dangerous landscape towards their salvation.", "genres": ["Animation", "Action", "Adventure"], "imdb": {"id": 438097, "rating": 6.9, "votes": 171595}, "languages": ["English"], "lastupdated": "2015-09-06 00:07:04.760000000", "metacritic": 58, "num_mflix_comments": 392, "plot": "Manny, Sid, and Diego discover that the Ice Age is coming to an end, and join everybody for a journey to higher ground. On the trip, they discover that Manny, in fact, is not the last of the wooly mammoths.", "poster": "https://m.media-amazon.com/images/M/MV5BMjAwODg3OTAxMl5BMl5BanBnXkFtZTcwMjg2NjYyMw@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 1143763200000, "runtime": 91, "title": "Ice Age: The Meltdown", "tomatoes": {"boxOffice": "$195.3M", "consensus": "Despite its impressive animation and the hilarious antics of the saber-toothed squirrel Scrat, Ice Age 2: The Meltdown comes up short on the storytelling front.", "critic": {"meter": 57, "numReviews": 143, "rating": 6.1}, "dvd": 1164067200000, "fresh": 82, "lastUpdated": 1442081930000, "production": "20th Century Fox", "rotten": 61, "viewer": {"meter": 71, "numReviews": 853236, "rating": 3.6}, "website": "http://www.iceagemovie.com/"}, "type": "movie", "writers": ["Peter Gaulke (screenplay)", "Gerry Swallow (screenplay)", "Jim Hecht (screenplay)", "Peter Gaulke (story)", "Gerry Swallow (story)"], "year": 2006}