{"_id": "573a1392f29313caabcdaf8c", "awards": {"nominations": 2, "text": "Won 3 Oscars. Another 2 wins & 2 nominations.", "wins": 5}, "cast": ["Paul Muni", "Josephine Hutchinson", "Anita Louise", "Donald Woods"], "countries": ["USA"], "directors": ["William Dieterle"], "fullplot": "In 1860 Paris, chemist Louis Pasteur is considered a quack within the medical community for advocating that doctors and surgeons wash their hands and boil their instruments to destroy microbes that can kill their patients. He came across this belief when discovering microscopic organisms in sour wine, the organisms which could be killed if heated sufficiently. The belief among the scientific community at large is that the organisms are the result of disease and not the cause. This belief is despite the fact that thirty percent of women die in childbirth due to child bed disease, accounting for twenty thousand annual deaths in Paris alone. The debate takes Pasteur all the way to a meeting with Emperor Napoleon III and his physician, Dr. Charbonnet, who is one of the leading opponents of Pasteur. Several years later - France now a republic - much of Pasteur's reputation changes as a government sanctioned experiment with anthrax and sheep shows that a vaccine created by Pasteur proves effective. As Pasteur begins work on finding the cause and a cure for rabies, which proves a more difficult challenge, he still has his detractors, including Dr. Charbonnet. This continuing debate brings about his biggest challenge: proving that microbes are the cause of all disease. Through it all, he is supported not only by his family, but Dr. Jean Martel, who was once a junior physician in the emperor's court and a physician within the republic's government, but who now works with Pasteur and is his son-in-law. But an act of bravado by Charbonnet may ultimately prove to be the breakthrough for which Pasteur is looking. Moving the experimental treatments from animals to humans proves a bigger obstacle, as is Charbonnet's need to win at all cost in the court of public opinion.", "genres": ["Biography", "Drama", "History"], "imdb": {"id": 28313, "rating": 7.4, "votes": 1425}, "languages": ["English", "French", "Russian"], "lastupdated": "2015-06-17 19:13:08.717000000", "num_mflix_comments": 3, "plot": "The biography of the pioneering French microbiologist who helped revolutionize agriculture and medicine.", "poster": "https://m.media-amazon.com/images/M/MV5BNzE5YjRjOTItZGFkYS00NzE5LTkzZGUtZmRhMzY5M2I2MTU3XkEyXkFqcGdeQXVyNjE5MjUyOTM@._V1_SY1000_SX677_AL_.jpg", "rated": "UNRATED", "released": -1070323200000, "runtime": 86, "title": "The Story of Louis Pasteur", "tomatoes": {"critic": {"meter": 100, "numReviews": 5, "rating": 8.3}, "fresh": 5, "lastUpdated": 1442346492000, "production": "MGM Home Entertainment", "rotten": 0, "viewer": {"meter": 79, "numReviews": 373, "rating": 3.7}}, "type": "movie", "writers": ["Sheridan Gibney (story)", "Pierre Collings (story)"], "year": 1936}