{"_id": "573a139bf29313caabcf3f93", "awards": {"nominations": 8, "text": "8 nominations.", "wins": 0}, "cast": ["Jordana Brewster", "Clea DuVall", "Laura Harris", "Josh Hartnett"], "countries": ["USA"], "directors": ["Robert Rodriguez"], "fullplot": "On the Harrington High School in Ohio, the newcomer Marybeth Louise Hutchinson tries to befriend the outcast Stokely 'Stokes' Mitchell. The quarterback Stan Rosado quits the football team and breaks off with his girlfriend Delilah Profitt, who is the editor of the school newspaper and head cheerleader. Zeke Tyler, who is repeating the senior year and sells drugs to the other students, has an argument with his teacher Elizabeth Burke. When the bullied Casey Connor finds a weird being on the football field, he brings it to his Professor Edward Furlong that finds that the unknown specimen lives in the water and has the ability of replicating. Later, Delilah brings Casey, who is the photographer of the newspaper and has a crush on her, to the faculty room to snoop around and find any evidence for a story, they need to hide in a closet when Coach Joe Willis and the teacher Karen Olson arrive. Delilah and Casey witness the coach and the teacher attacking Nurse Rosa Harper and they stumble with the corpse of Mrs. Jessica Brummel, who has recently died, in the closet. They call the police but are discredited by Principal Valerie Drake. On the next morning, Casey discloses to Delilah, Stokely and Stan that he believes are taking over the planet through their high school. Zeke and Marybeth overhear the conversation and join the group. Further they discover that the aliens need water to survive and Zeke's drug is diuretic and kills them. But the problem is who can be trusted in the group?", "genres": ["Horror", "Mystery", "Sci-Fi"], "imdb": {"id": 133751, "rating": 6.4, "votes": 86591}, "languages": ["English"], "lastupdated": "2015-09-07 00:06:18.803000000", "metacritic": 61, "num_mflix_comments": 2, "plot": "Students suspect that their teachers are aliens after bizarre occurrences.", "poster": "https://m.media-amazon.com/images/M/MV5BZTcwZGNiMWYtMTYwNC00MGVjLWI5OTQtODhkZTU4ZDZjOGNkXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 914544000000, "runtime": 104, "title": "The Faculty", "tomatoes": {"consensus": "Rip-off of other sci-fi thrillers.", "critic": {"meter": 54, "numReviews": 50, "rating": 5.6}, "dvd": 929404800000, "fresh": 27, "lastUpdated": 1442079850000, "production": "Miramax", "rotten": 23, "viewer": {"meter": 55, "numReviews": 186212, "rating": 2.9}, "website": "http://www.miramax.com/movie/the-faculty/"}, "type": "movie", "writers": ["David Wechter (story)", "Bruce Kimmel (story)", "Kevin Williamson (screenplay)"], "year": 1998}