{"_id": "573a13a4f29313caabd11e02", "awards": {"nominations": 2, "text": "Nominated for 1 Primetime Emmy. Another 1 nomination.", "wins": 0}, "cast": ["Wood Harris", "Billy Zane", "Dorian Harewood", "Christian Potenza"], "countries": ["USA"], "directors": ["Leon Ichaso"], "fullplot": "Biography of rock star Jimi Hendrix chronicles his early career, including a stint with Little Richard who fired him for getting too flamboyant, to his tragic failure. Struggling to find a niche, he moves to England where he becomes friends with musician and producer Chas Chandler (Christian Portenza). Chas then teams him with Mitch Mitchell and Noel Redding (Krit Holdenreid, Christopher Ralph) to form the Experience. As Hendrix gets public attention, Chas then introduces him to a major record producer (Billy Zane) who takes over his career. While this gets Hendrix international exposure, it also places him in the hands of people interested only in the money aspects that his career offers them. One of the early disasters foisted on him by the record company is an opening bill for \"The Monkees\" on an American tour. His then unknown act is booed by teens just wanting to see their idols. A genius and a perfectionist, Hendrix drives everyone crazy as he starts making albums himself without producers or the Experience. Pushed by the record executives beyond his limits, he turns to drugs and wild parties for release which ultimately leads to his demise.", "genres": ["Biography", "Drama", "Music"], "imdb": {"id": 260949, "rating": 5.5, "votes": 773}, "languages": ["English"], "lastupdated": "2015-08-09 00:16:27.727000000", "plot": "Biography of rock star Jimi Hendrix chronicles his early career, including a stint with Little Richard who fired him for getting too flamboyant, to his tragic failure. Struggling to find a ...", "poster": "https://m.media-amazon.com/images/M/MV5BMjAxNjYzMjU0OV5BMl5BanBnXkFtZTcwNTQ1MTMyMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 969148800000, "runtime": 100, "title": "Hendrix", "tomatoes": {"dvd": 985651200000, "lastUpdated": 1439749477000, "production": "MGM", "viewer": {"meter": 43, "numReviews": 258, "rating": 3.2}}, "type": "movie", "writers": ["Rob Weiss", "Butch Stein", "Art Washington", "Bruce Rubenstein"], "year": 2000}