{"_id": "573a13e7f29313caabdc8ee0", "awards": {"nominations": 14, "text": "14 nominations.", "wins": 0}, "cast": ["Aariyan Gupta", "Adah Sharma", "Amita Udgata", "Anshikaa Shrivastava"], "countries": ["India"], "directors": ["Vinil Matthew"], "fullplot": "Spread across Mumbai over a decade, the film is about the relationship between the quirky, rebellious Meeta (Parineeti Chopra) and the mischievous Nikhil (Sidharth Malhotra) struggling with their respective families to fit in. Nikhil bumps into Meeta on the occasion of her sister Deeksha's wedding while Meeta is on the run. He falls in love with Meeta's sister Karishma on the same day. The film jumps to the eve of Nikhil and Karishma's engagement. Karishma's wealthy father, Devesh Solanki, does not approve of Nikhil as he finds him to be a lackadaisical young man. On the day of his engagement, Nikhil promises Karishma that he will prove himself to be worthy of her within the next seven days. Nikhil is re-introduced to Meeta by Karishma and is instructed to put her up in a hotel. Nikhil recognizes Meeta. In an attempt to please Karishma he decides to keep Meeta in the flat above his own house, with his crazy extended family. During the course of Meeta's stay at Nikhil's house, they come close to each other and open up to each other. In the midst of this confusion, the truth of relationships is unfolded; the strength of unions is tested and love triumphs.", "genres": ["Comedy", "Romance"], "imdb": {"id": 3173910, "rating": 7, "votes": 8590}, "languages": ["Hindi", "English", "Chinese", "Spanish"], "lastupdated": "2015-08-24 01:15:12.807000000", "num_mflix_comments": 3, "plot": "Nikhil is re-introduced to Meeta nearly ten years after their first meeting. Now, as Nikhil has one week to prove himself worth enough to marry Meeta's sister Karishma, the old acquaintances become quite close to each other.", "poster": "https://m.media-amazon.com/images/M/MV5BNWNhYzljYmMtMGFmYS00YjYzLTk2NDAtYTNjMzI4NDkzYTk3XkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 1391731200000, "runtime": 141, "title": "Hasee Toh Phasee", "type": "movie", "writers": ["Harshavardhan Kulkarni (story)", "Anurag Kashyap (dialogue)", "Harshavardhan Kulkarni (dialogue)", "Purva Naresh (dialogue)", "Vinil Matthew (dialogue)"], "year": 2014}