{"_id": "573a13b6f29313caabd46e3d", "awards": {"nominations": 6, "text": "6 nominations.", "wins": 0}, "cast": ["Catherine Frot", "Dèborah Franèois", "Pascal Greggory", "Clotilde Mollet"], "countries": ["France"], "directors": ["Denis Dercourt"], "fullplot": "The girl Mèlanie Prouvost is the beloved daughter of the butchers Mrs. Prouvost and Mr. Prouvost. She is an aspirant pianist and her parents make her application to the Conservatory. During the entrance exam, she begins with a great performance but she is distracted by one member of the admittance board, Ariane, and she fails. Years later, Mèlanie is a teenager that has just finished high-school and she is accepted as intern of the law firm owned by the prominent lawyer Mr. Fouchècourt. Mèlanie overhears that he needs someone to take care of his son Tristan and she offers to the position. She needs to travel to another town and when she arrives at the manor, she is welcomed by Ariane, who is the wife of Mr. Fouchècourt. She does not recognize Mèlanie and soon she becomes Ariane's page turner, in the beginning of her carefully planned revenge against the woman that destroyed her dreams.", "genres": ["Drama", "Music", "Thriller"], "imdb": {"id": 487503, "rating": 7.1, "votes": 5874}, "languages": ["French"], "lastupdated": "2015-08-18 00:59:02.720000000", "metacritic": 67, "num_mflix_comments": 1, "plot": "The girl Mèlanie Prouvost is the beloved daughter of the butchers Mrs. Prouvost and Mr. Prouvost. She is an aspirant pianist and her parents make her application to the Conservatory. During...", "poster": "https://m.media-amazon.com/images/M/MV5BOWIyMDhkYWYtMzZmOC00NGEwLWI1ZmUtMTdjODg1NGE1M2M5XkEyXkFqcGdeQXVyMTA0MjU0Ng@@._V1_SY1000_SX677_AL_.jpg", "released": 1155081600000, "runtime": 85, "title": "The Page Turner", "tomatoes": {"consensus": "Reminiscent of Hitchcock and Chabrol, The Page Turner is elegant yet suspenseful, a revenge potboiler of a high degree.", "critic": {"meter": 78, "numReviews": 64, "rating": 6.9}, "dvd": 1184025600000, "fresh": 50, "lastUpdated": 1439146510000, "production": "Tartan Films", "rotten": 14, "viewer": {"meter": 67, "numReviews": 6367, "rating": 3.5}}, "type": "movie", "writers": ["Denis Dercourt (scenario and dialogue)", "Jacques Sotty (collaboration)"], "year": 2006}