{"_id": "573a13aff29313caabd2f40a", "awards": {"nominations": 0, "text": "3 wins.", "wins": 3}, "cast": ["Seth MacFarlane", "Alex Borstein", "Seth Green", "Mila Kunis"], "countries": ["USA"], "directors": ["Pete Michels", "Peter Shin"], "fullplot": "The major sub-plot circles around the youngest Griffin, Stewie, who has a near-death experience at a pool when a lifeguard chair falls on him, but he survives. After having a vision of being in Hell, he decides to change his ways, but this doesn't last long. While watching television, he and Brian spot a man that looks like Stewie. Brian is convinced that he is Stewie's real father, until Stewie learns that the man is actually himself as an adult, taking a vacation from his own time period. Baby Stewie visits thirty years later to discover that his adult self, going by the name Stu, is a single blue-collar middle-aged virgin working at a Circuit City-type store. Meanwhile, Peter and Lois are trying to teach their two older kids, Meg and Chris, to date. In the future, Chris, who hasn't changed much, is working as a cop and is married to a foul-mouthed hustler named Vanessa. Meg is now called Ron, since she had a sex-change after college.", "genres": ["Animation", "Adventure", "Comedy"], "imdb": {"id": 385690, "rating": 7.7, "votes": 29760}, "languages": ["English"], "lastupdated": "2015-08-26 00:19:36.557000000", "num_mflix_comments": 1, "plot": "The maniacal baby of the Griffin family, Stewie, meets his future self. In doing this he discovers that his future image is not what he has anticipated because of a near death experience.", "poster": "https://m.media-amazon.com/images/M/MV5BMGZmMGIyMWItNGU0YS00Njc2LWI4ZjctNDU1ZjZjNTdhNDdjXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 1127779200000, "runtime": 88, "title": "Family Guy Presents Stewie Griffin: The Untold Story", "type": "movie", "writers": ["Seth MacFarlane (creator)", "Seth MacFarlane (developer)", "David Zuckerman (developer)", "Gary Janetti", "Chris Sheridan", "Alex Borstein", "Steve Callaghan", "Tom Devanney (staff writer)", "Kirker Butler (staff writer)", "Patrick Meighan (staff writer)", "John Viener (staff writer)", "Cherry Chevapravatdumrong (staff writer)"], "year": 2005}