{"_id": "573a13d1f29313caabd90449", "awards": {"nominations": 1, "text": "1 win & 1 nomination.", "wins": 1}, "cast": ["Simon Helberg", "Jason Ritter", "Kevin Tighe", "Jocelyn Towne"], "countries": ["USA"], "directors": ["Jocelyn Towne"], "fullplot": "I AM I is the story of a young woman, Rachael, who meets the father she never knew, Gene, at her mother's funeral. She discovers that her father is completely delusional and believes her to be her dead mother. After Rachael visits Gene in an assisted living home, she learns that he suffers from a disease called Korsakov's Syndrome, a form of retrograde amnesia and that her mother had placed him in this facility for treatment a year earlier. He does not remember anything past the age of thirty-three, and believes that he is still a young man. Unable to convince him of who she really is, Rachael decides to go along with her father's delusions by pretending to be her mother and discovers that under this guise, she and Gene can have \"normal\" conversations. Before long, Rachael is visiting Gene everyday, finding new ways to bring elements from his past into their present relationship. What began as a search for understanding has become romantic and joyful, but it can't go on forever. As Rachael pieces together the past and plays out memories for Gene, her need to be seen by her father, for who she truly is, grows strong.", "genres": ["Drama"], "imdb": {"id": 1825806, "rating": 5.5, "votes": 137}, "languages": ["English"], "lastupdated": "2015-09-01 00:25:13.613000000", "metacritic": 44, "num_mflix_comments": 1, "plot": "I AM I is the story of a young woman, Rachael, who meets the father she never knew, Gene, at her mother's funeral. She discovers that her father is completely delusional and believes her to...", "poster": "https://m.media-amazon.com/images/M/MV5BMTUwNDE5ODQxMl5BMl5BanBnXkFtZTcwMTI0MDk3OA@@._V1_SY1000_SX677_AL_.jpg", "released": 1402617600000, "runtime": 87, "title": "I Am I", "tomatoes": {"critic": {"meter": 30, "numReviews": 10, "rating": 5.1}, "fresh": 3, "lastUpdated": 1438454389000, "production": "Gravitas Entertainment", "rotten": 7, "viewer": {"meter": 56, "numReviews": 75, "rating": 3.4}, "website": "http://iamithefilm.com/"}, "type": "movie", "writers": ["Jocelyn Towne"], "year": 2013}