{"_id": "573a1397f29313caabce612d", "awards": {"nominations": 0, "text": "2 wins.", "wins": 2}, "cast": ["James Coburn", "Maximilian Schell", "James Mason", "David Warner"], "countries": ["UK", "West Germany"], "directors": ["Sam Peckinpah"], "fullplot": "In 1943, in the Russian front, the decorated leader Rolf Steiner is promoted to Sergeant after another successful mission. Meanwhile the upper-class and arrogant Prussian Captain Hauptmann Stransky is assigned as the new commander of his squad. After a bloody battle of Steiner's squad against the Russian troops led by the brave Lieutenant Meyer, who dies in the combat, the coward Stransky claims that he led his squad against the Russian and requests to be awarded with the Iron Cross to satisfy his personal ambition together with that of his aristocratic family. Stransky gives the names of Steiner and of the homosexual Lieutenant Triebig as witnesses of his accomplishment, but Steiner, who has problems with the chain of command in the army and with the arrogance of Stransky, refuses to participate in the fraud. When Colonel Brandt gives the order to leave the position in the front, Stransky does not retransmit the order to Steiner's squad, and they are left alone surrounded by the enemy and have to fight to survive.", "genres": ["Drama", "War"], "imdb": {"id": 74695, "rating": 7.5, "votes": 19328}, "languages": ["English", "Russian", "French", "German"], "lastupdated": "2015-08-21 00:02:40.157000000", "plot": "In 1943, in the Russian front, the decorated leader Rolf Steiner is promoted to Sergeant after another successful mission. Meanwhile the upper-class and arrogant Prussian Captain Hauptmann ...", "poster": "https://m.media-amazon.com/images/M/MV5BZGM3MWJjZTUtZmYyYi00NWVkLTgzN2ItM2U4ZmExZjIzYjVmXkEyXkFqcGdeQXVyMjI4MjA5MzA@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 226627200000, "runtime": 119, "title": "The Cross of Iron", "tomatoes": {"critic": {"meter": 80, "numReviews": 15, "rating": 6.3}, "dvd": 949363200000, "fresh": 12, "lastUpdated": 1441309845000, "production": "AVCO Embassy Pictures", "rotten": 3, "viewer": {"meter": 87, "numReviews": 7415, "rating": 3.9}}, "type": "movie", "writers": ["Julius J. Epstein (screenplay)", "Walter Kelley (screenplay)", "James Hamilton (screenplay)", "Willi Heinrich (based on the book by)"], "year": 1977}