{"_id": "573a13a8f29313caabd1e13a", "awards": {"nominations": 1, "text": "17 wins & 1 nomination.", "wins": 17}, "cast": ["Madhavan", "Simran", "Prakash Raj", "Nandita Das"], "countries": ["India"], "directors": ["Mani Ratnam"], "fullplot": "Dhileepan and Shyama are Tamil-speaking residents of Mankulam, Sri Lanka, who get married with the blessings of their respective families. After the marriage, Shyama confides that she would like to be a mother of eight children, but she is stunned when her husband tells her that he cannot father any children until there is peace between the mainstream and the Tamils in this country. Nevertheless, they do get intimate, which results in Shyama getting pregnant. Dhileepan goes into hiding because of his connections with the Tamil Tigers, while Shyama returns to her father's house. A storm threatens their village, and they are forced to flee to a Refugee Camp in Rameswaram, India. Alone, without any support, Shyama gives birth to a girl, leaves her, and returns to Sri Lanka to be with her husband. The child gets noticed by noted Tamil author Thiruchelvan, who lives with his sister, her husband, and their son and writes books under the pen-name of Indra, who is actually an attractive TV newswoman who lives next door. When he comes forward to adopt her, he is initially refused, as he must be married in order to adopt any child. He accordingly gets married to Indra, and they adopt the child and name her Amudha. Subsequently, they become parents of two sons, Vinayan and Akhilan. After Amudha completes her ninth year, she is told that she has been adopted, which compels her to start searching for her biological mother. Amudha initially runs aways to Rameswaram, but she is unable to locate her and continues to be distraught until Thiruchelvan promises to take her to Mankulam. They do come across a woman named Shyama, but she denies having any children, and it is then that they find out that there is another Mankulam in the north of Sri Lanka. They travel there, among almost war-like conditions, and it is here that Thiruchelvan and his guide, Dr. Herold Vikramsinghe, will be abducted by Tamil Tigers, who, in turn, will arrange for a meeting with Shyama. Watch what happens when Amudha finally gets to meet her birth mother--who may outrightly disown her or induct her as one of the many child warriors among the Tamil Tigers.", "genres": ["Drama", "War"], "imdb": {"id": 312859, "rating": 8.5, "votes": 3342}, "languages": ["Tamil", "Sinhalese", "English"], "lastupdated": "2015-06-29 00:37:59.987000000", "num_mflix_comments": 1, "plot": "A little girl is told by her parents that she is adopted. Determined to find her birth mother, her family eventually agrees to take her to Sri Lanka, where they are abducted by the terrorist group known as the Tamil Tigers.", "poster": "https://m.media-amazon.com/images/M/MV5BZmE2N2YyODYtNjk3MC00NTU1LTgwOTUtZmRmN2JkMWFlZTZjXkEyXkFqcGdeQXVyOTA0NTIzNzU@._V1_SY1000_SX677_AL_.jpg", "released": 1013644800000, "runtime": 123, "title": "A Peck on the Cheek", "tomatoes": {"critic": {"meter": 83, "numReviews": 6, "rating": 7.2}, "dvd": 1154995200000, "fresh": 5, "lastUpdated": 1441136378000, "rotten": 1, "viewer": {"meter": 93, "numReviews": 1358, "rating": 4.3}, "website": "http://kannathil.com"}, "type": "movie", "writers": ["Mani Ratnam (screenplay)", "Mani Ratnam (story)", "Sujatha (dialogue)"], "year": 2002}