{"_id": "573a1397f29313caabce844d", "awards": {"nominations": 8, "text": "Won 4 Oscars. Another 21 wins & 8 nominations.", "wins": 25}, "cast": ["Kristina Adolphson", "Bèrje Ahlstedt", "Pernilla Allwin", "Kristian Almgren"], "countries": ["Sweden", "France", "West Germany"], "directors": ["Ingmar Bergman"], "fullplot": "It's the early twentieth century Sweden. Adolescent siblings Alexander and Fanny Ekdahl lead a relatively joyous and exuberant life with their well-off extended paternal family, led by the family matriarch, their grandmother, Helena Ekdahl. The openness of the family culture is exemplified by Helena's now deceased husband ending up becoming best friends with one of her lovers, a Jewish puppet maker named Isak Jacobi, and their Uncle Gustav Adolf's open liaison with one of the family maids, Maj, who everyone in the family adores, even Gustav Adolf's wife, Alma. Between the siblings, Alexander in particular has inherited the family's love of storytelling, his parents and his grandmother who are actors and who manage their own theater. Things change for Alexander and Fanny when their father, Oscar, dies shortly after Christmas 1907. Although she truly does believe she loves him, the children's mother, Emilie, decides to marry Bishop Edvard Vergèrus, who she first met as the officiate at Oscar's funeral. She also wants a father figure for the children. Going into the marriage, Emilie has inclinations that it will be a much different life than she had with the Ekdahls, but is not prepared for the harsh, austere and strict life Edvard rules with an iron fist. Emilie, Alexander and Fanny end up being prisoners in the bishop's stark and humorless house. As Alexander butts head with his stepfather and tries to learn how to keep to his own principles while obeying Edvard, Emilie tries to figure out a way to regain her and her children's own destiny, as Edvard will not consent to divorce, and her \"desertion\" in the eyes of the law means that Alexander and Fanny would become his wards.", "genres": ["Drama"], "imdb": {"id": 83922, "rating": 8.1, "votes": 38461}, "languages": ["Swedish", "German", "Yiddish", "English"], "lastupdated": "2015-09-01 00:24:03.630000000", "metacritic": 100, "num_mflix_comments": 4, "plot": "Two young Swedish children experience the many comedies and tragedies of their family, the Ekdahls.", "poster": "https://m.media-amazon.com/images/M/MV5BZmQzMDE5ZWQtOTU3ZS00ZjdhLWI0OTctZDNkODk4YThmOTRhL2ltYWdlXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 408931200000, "runtime": 188, "title": "Fanny and Alexander", "tomatoes": {"critic": {"meter": 100, "numReviews": 33, "rating": 8.9}, "dvd": 1100563200000, "fresh": 33, "lastUpdated": 1439837810000, "production": "Embassy Pictures Corporation", "rotten": 0, "viewer": {"meter": 94, "numReviews": 20884, "rating": 4.3}}, "type": "movie", "writers": ["Ingmar Bergman"], "year": 1982}