{"_id": "573a1396f29313caabce3a40", "awards": {"nominations": 1, "text": "1 win & 1 nomination.", "wins": 1}, "cast": ["Maurècio do Valle", "Odete Lara", "Othon Bastos", "Hugo Carvana"], "countries": ["France", "Brazil", "West Germany"], "directors": ["Glauber Rocha"], "fullplot": "Period piece about a Brazil that is no more. This movie is the sequel to \"God and the Devil in the Land of the Sun\" (Deus e o diabo na terra do sol), and takes place 29 years after Antonio das Mortes killed Corisco (the \"Blond Devil\"), last of the Cangaceiros. In \"the old days\", Antonio's function in life was exterminate these bandits, on account of his personal grudges against them. His life had been meaningless for the last 29 years, but now, a new challenge awaits him. When a Cangaceiro appears in Jardim Das Piranhas, the local Land Baron (Jofre Soares), an old man, does what seems obvious to him: he calls Antonio das Mortes, killer of Cangaceiros. At first, Antonio is ecstatic. His life has gained new meaning. But soon it becomes obvious that this new Cangaceiro (named Coirana) is no Corisco, but an idealist. An idealist of the sixties in the garb of the forties. A leader to the hopeless and the hungry. Antonio das Mortes begins to reconsider his feelings towards Coirana and his followers...", "genres": ["Action", "Crime", "Drama"], "imdb": {"id": 64256, "rating": 7.2, "votes": 997}, "languages": ["Portuguese"], "lastupdated": "2015-08-25 01:11:02.820000000", "num_mflix_comments": 1, "plot": "Period piece about a Brazil that is no more. This movie is the sequel to \"God and the Devil in the Land of the Sun\" (Deus e o diabo na terra do sol), and takes place 29 years after Antonio ...", "poster": "https://m.media-amazon.com/images/M/MV5BYjI1MjBmY2UtZWUyOC00NWZmLWE5NjYtNGVlYWVmZWQ1NjRlXkEyXkFqcGdeQXVyNzQzNzQxNzI@._V1_SY1000_SX677_AL_.jpg", "released": -17366400000, "runtime": 100, "title": "Antonio das Mortes", "tomatoes": {"lastUpdated": 1440181388000, "viewer": {"meter": 75, "numReviews": 378, "rating": 3.9}}, "type": "movie", "writers": ["Glauber Rocha"], "year": 1969}