{"_id": "573a1394f29313caabce03e4", "awards": {"nominations": 4, "text": "Won 1 Oscar. Another 3 nominations.", "wins": 0}, "cast": ["Rock Hudson", "Lauren Bacall", "Robert Stack", "Dorothy Malone"], "countries": ["USA"], "directors": ["Douglas Sirk"], "fullplot": "On 24 October 1955, the hard-work geologist of the Hadley Oil Company Mitch Wayne meets the executive secretary Lucy Moore in the office of her boss Bill Ryan in New York and invites her to go to a conference with the alcoholic playboy and son of a tycoon Kyle Hadley. On the way of the meeting, he confesses that they had traveled from Houston to New York to satisfy the wish of the reckless Kyle, who is his best friend since their childhood, of eating a sandwich from club 21 and the meeting was just a pretext to Kyle's father Jasper Hadley. Mitch and Kyle immediately fall in love for Lucy, and Kyle unsuccessfully uses his money to impress Lucy; then he opens his heart and proposes Lucy. They get married and travel to Acapulco and the insecure Kyle stops drinking. Meanwhile, Kyle's sister Marylee is an easy woman and has a non-corresponded crush on Mitch that sees her as a sister. One year later, Kyle discovers that he has a problem and might be sterile and starts drinking again. The jealous Marylee poisons Kyle telling that his wife and Mitch are having a love affair. When Lucy finds that she is pregnant, Kyle believes that the baby belongs to Mitch and his mistrust leads to a tragedy.", "genres": ["Drama"], "imdb": {"id": 49966, "rating": 7.5, "votes": 6973}, "languages": ["English"], "lastupdated": "2015-08-07 00:00:41.333000000", "num_mflix_comments": 1, "plot": "Alcoholic playboy Kyle Hadley marries the woman secretly loved by his poor but hard-working best friend, who in turn is pursued by Kyle's nymphomaniac sister.", "poster": "https://m.media-amazon.com/images/M/MV5BNGJmMGU0NTUtYzUyYi00Njk0LWEzMTEtNTc3YmY4YjVmZWZhXkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": -412905600000, "runtime": 99, "title": "Written on the Wind", "tomatoes": {"critic": {"meter": 81, "numReviews": 21, "rating": 7.4}, "dvd": 998352000000, "fresh": 17, "lastUpdated": 1441044366000, "production": "Universal International Pictur", "rotten": 4, "viewer": {"meter": 76, "numReviews": 3284, "rating": 3.8}}, "type": "movie", "writers": ["George Zuckerman (screenplay)", "Robert Wilder (based on the novel by)"], "year": 1956}