{"_id": "573a13d2f29313caabd922de", "awards": {"nominations": 22, "text": "18 wins & 22 nominations.", "wins": 18}, "cast": ["èlex Brendemèhl", "Natalia Oreiro", "Diego Peretti", "Elena Roger"], "countries": ["Argentina", "Spain", "Norway", "France"], "directors": ["Lucèa Puenzo"], "fullplot": "Patagonia, 1960. A German doctor (Alex Brendemèhl) meets an Argentinean family and follows them on a long desert road to a small town where the family will be starting a new life. Eva (Natalia Oreiro), Enzo (Diego Peretti) and their three children welcome the doctor into their home and entrust their young daughter, Lilith (Florencia Bado), to his care, not knowing that they are harboring one of the most dangerous criminals in the world. At the same time, Israeli agents are desperately looking to bring THE GERMAN DOCTOR to justice. Based on filmmaker Lucèa Puenzo's (XXY) fifth novel, the story follows Josef Mengele, the \"Angel of Death,\" a German SS officer and a physician at the Auschwitz concentration camp, in the years he spent \"hiding\", along with many other Nazi's, in South America following his escape from Germany. Mengele was considered to be one of WWII's most heinous Nazi war criminals.", "genres": ["Drama", "History", "Thriller"], "imdb": {"id": 1847746, "rating": 6.8, "votes": 3625}, "languages": ["Spanish", "German", "Hebrew"], "lastupdated": "2015-09-04 00:15:09.023000000", "metacritic": 62, "plot": "The true story of an Argentine family who lived with Josef Mengele without knowing his true identity, and of a girl who fell in love with one of the biggest criminals of all time.", "poster": "https://m.media-amazon.com/images/M/MV5BMTY1NDQ2NzMyMF5BMl5BanBnXkFtZTgwODI5ODUwMTE@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1398384000000, "runtime": 93, "title": "The German Doctor", "tomatoes": {"boxOffice": "$0.4M", "consensus": "The German Doctor applies a refreshing level of restraint to its intriguing premise, and boasts solid performances from a talented cast.", "critic": {"meter": 73, "numReviews": 59, "rating": 6.5}, "dvd": 1410825600000, "fresh": 43, "lastUpdated": 1440615654000, "production": "Samuel Goldwyn Films", "rotten": 16, "viewer": {"meter": 62, "numReviews": 2558, "rating": 3.5}, "website": "http://thegermandoctorfilm.com/"}, "type": "movie", "writers": ["Lucèa Puenzo"], "year": 2013}