{"_id": "573a13bbf29313caabd53d0b", "awards": {"nominations": 3, "text": "2 wins & 3 nominations.", "wins": 2}, "cast": ["Tom Cavanagh", "Ben Shenkman", "Noah Bernett", "Benz Antoine"], "countries": ["Canada"], "directors": ["Laurie Lynd"], "fullplot": "The hockey career of former Toronto Maple Leaf Eric McNally, who was known as a tough enforcer, came to an end with a shoulder injury. He is now a sportscaster. Except to his assistant Nula, what he hasn't told his work colleagues is that he is gay and that he is in a long term relationship with a sports lawyer named Sam. Eric feels that he can't be openly gay as an ex-hockey player or as a public figure still associated with professional hockey. Eric and Sam's life is turned upside down when they take temporary custody of Scot Latour, whose drug addict mother, Julie, recently passed away from a drug overdose. Julie assigned custody of Scot to her ex-boyfriend, Billy, who is Sam's deadbeat brother. Sam is certain that Billy will eventually come for Scot when he learns that Julie's insurance money also comes with custody. Having only had Julie's influence in his life, Scot is a flamboyant adolescent, who wears make-up, a feather boa and his mother's charm bracelet, and who loves musicals and singing Christmas carols. As they all wait for Billy's arrival, Eric, despite not being Scot's father, and Scot have to figure out how to come to terms with each other - Scot being a boy who expresses himself freely whatever the consequences, and Eric always being concerned about maintaining a macho exterior - within their temporary guardian/charge relationship.", "genres": ["Comedy", "Drama", "Music"], "imdb": {"id": 910847, "rating": 6.8, "votes": 2312}, "languages": ["English"], "lastupdated": "2015-08-26 00:08:42.510000000", "metacritic": 51, "num_mflix_comments": 1, "plot": "The hockey career of former Toronto Maple Leaf Eric McNally, who was known as a tough enforcer, came to an end with a shoulder injury. He is now a sportscaster. Except to his assistant Nula...", "poster": "https://m.media-amazon.com/images/M/MV5BMjE0ODAxOTEyMl5BMl5BanBnXkFtZTcwMTU1NjM5MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1195171200000, "runtime": 95, "title": "Breakfast with Scot", "tomatoes": {"consensus": "Though Breakfast with Scot is a well-intentioned movie with some charming performances, it suffers from sitcom humor and predictable setups.", "critic": {"meter": 52, "numReviews": 27, "rating": 5.4}, "dvd": 1210032000000, "fresh": 14, "lastUpdated": 1439057408000, "production": "Regent Releasing/here! Films", "rotten": 13, "viewer": {"meter": 64, "numReviews": 2007, "rating": 3.6}, "website": "http://www.breakfastwithscotmovie.com/"}, "type": "movie", "writers": ["Michael Downing (based upon the novel by)", "Sean Reycraft"], "year": 2007}