{"_id": "573a13d9f29313caabda9522", "awards": {"nominations": 6, "text": "1 win & 6 nominations.", "wins": 1}, "cast": ["Tahar Rahim", "Simon Abkarian", "Makram Khoury", "Hindi Zahra"], "countries": ["Germany", "France", "Italy", "Russia", "Poland", "Canada", "Turkey", "Jordan"], "directors": ["Fatih Akin"], "fullplot": "This film is based on the Armenian Genocide in the Ottoman Empire 1915, which resulted in the forced migration and diaspora of the Armenian minority. One day a young family man, Nazaret Manoogian, gets deported by the Turkish authorities together with all the other Armenian men from his native village of Mardin. He becomes a forced laborer and only survives the mass murder by chance and an act of kindness, but loses his family, speech and faith. One night the devastated Nazaret learns that his daughters may still be alive and didn't die like his wife from starvation, violence or rape on death marches. Nazaret goes on a quest to find them and travels from his small village through the Mesopotamian deserts to the sea, always looking for clues that might lead him to his children. Nazaret's epic journey will take him from Asia to America, from the end to a new beginning...", "genres": ["Drama", "History"], "imdb": {"id": 2245171, "rating": 6, "votes": 1749}, "languages": ["Armenian", "Arabic", "Turkish", "Kurdish", "Spanish", "English"], "lastupdated": "2015-08-28 01:04:39.393000000", "metacritic": 43, "plot": "In 1915 a man survives the Armenian genocide in the Ottoman Empire, but loses his family, speech and faith. One night he learns that his twin daughters may be alive, and goes on a quest to find them.", "poster": "https://m.media-amazon.com/images/M/MV5BMTk5MDExMDg3N15BMl5BanBnXkFtZTgwODkzMTk1NjE@._V1_SY1000_SX677_AL_.jpg", "released": 1413417600000, "runtime": 138, "title": "The Cut", "tomatoes": {"lastUpdated": 1440268580000, "production": "Strand Releasing", "viewer": {"numReviews": 96, "rating": 3.6}}, "type": "movie", "writers": ["Fatih Akin (screenplay)", "Mardik Martin"], "year": 2014}