{"_id": "573a1398f29313caabceb821", "awards": {"nominations": 0, "text": "Nominated for 1 Oscar. Another 1 win.", "wins": 2}, "cast": ["Mel Gibson", "Danny Glover", "Joe Pesci", "Joss Ackland"], "countries": ["USA"], "directors": ["Richard Donner"], "fullplot": "Riggs and Murtaugh are trying to take down some drug dealers but the they turn out to be not run of the mill drug dealers; they have automatic weapons and helicopters. Eventually they grab one of their vehicles and find a million dollars worth of gold coins or Krudderands in the trunk. Later Murtaugh is threatened by the men they're pursuing. That's when the Captain reassigns them to protect a man named Leo Getz who is suppose to testify in a big case. When they get to where Leo is, someone tries to kill him and that's when they learn he laundered half a billion dollars worth of drug money. He then takes them to a place he once went to and that's when the people there start shooting at them. Later when they come back with back up they learn that the men work for the South African consulate and have diplomatic immunity. They deduce that they are the ones they were looking for, but because of they have diplomatic immunity they can't do anything.", "genres": ["Action", "Crime", "Thriller"], "imdb": {"id": 97733, "rating": 7.2, "votes": 117551}, "languages": ["English", "Afrikaans"], "lastupdated": "2015-09-04 00:03:33.477000000", "metacritic": 70, "num_mflix_comments": 1, "plot": "Riggs and Murtaugh are on the trail of South African diplomats who are using their immunity to engage in criminal activities.", "poster": "https://m.media-amazon.com/images/M/MV5BYTg0YmE1M2ItNGM2OC00MmZjLTgwMTMtZjlmOGE4N2EyNTVhXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 615772800000, "runtime": 114, "title": "Lethal Weapon 2", "tomatoes": {"consensus": "Lethal Weapon 2 may sport a thin plot typical of action fare, but its combination of humor and adrenaline, along with the chemistry between its leads, make this a playful, entertaining sequel.", "critic": {"meter": 83, "numReviews": 36, "rating": 6.6}, "dvd": 872640000000, "fresh": 30, "lastUpdated": 1442427077000, "production": "Warner Bros. Pictures", "rotten": 6, "viewer": {"meter": 77, "numReviews": 249901, "rating": 3.3}}, "type": "movie", "writers": ["Jeffrey Boam (screenplay)", "Shane Black (story)", "Warren Murphy (story)", "Shane Black (characters)"], "year": 1989}