{"_id": "573a139df29313caabcfae51", "awards": {"nominations": 9, "text": "6 wins & 9 nominations.", "wins": 6}, "cast": ["Julia Roberts", "Richard Gere", "Joan Cusack", "Hector Elizondo"], "countries": ["USA"], "directors": ["Garry Marshall"], "fullplot": "Ike Graham has his own by-lined column in USA Today, which he usually uses as a forum to rail against the opposite sex. For his latest column which he writes at the last minute as usual, he, based on some information from a stranger in a bar about a woman he knows of back home, includes the story of still single Hale, Maryland residing Maggie Carpenter, who is known as the \"Runaway Bride\" since she has been engaged multiple times, but always leaves her betrothed standing at the altar. Because an incensed Maggie complains to the newspaper for factual inaccuracies in her story, Ike is fired, but he realizes that the story still has some life in it and thus decides to go to Hale to do further investigation. He finds that Maggie is again engaged, now for the fourth time, this time to high school football coach and adventurist Bob Kelly, who is confident enough in himself to know he will be different than the previous three grooms. When Maggie finds out that her arch enemy Ike is in town, Maggie and Ike begin a battle of outdoing the other, Maggie in an effort to get back at the man who ruined her reputation nationally, and Ike to expose Maggie for the self-absorbed man-hater he believes she is. The problem for Maggie is that many in Hale, including her family and Bob, actually seem to like Ike. So Maggie ends up taking a different approach in giving Ike the full story for a price. In doing so, Maggie comes to an understanding of who she is as a person. Both Ike and Maggie also begin to understand why Maggie has left her previous grooms at the altar - Ike's understanding with a little help from his ex-wife with who he has a complex relationship - and what each is looking for in a loving relationship. But are Maggie's understanding and wants and Ike's understanding and wants the same?", "genres": ["Comedy", "Romance"], "imdb": {"id": 163187, "rating": 5.4, "votes": 68811}, "languages": ["English"], "lastupdated": "2015-09-15 04:11:57.983000000", "metacritic": 39, "num_mflix_comments": 1, "plot": "A reporter is assigned to write a story about a woman who has left a string of fiances at the altar.", "poster": "https://m.media-amazon.com/images/M/MV5BYjg3MGIwYTctMDllOC00ZmQ5LThiNmYtYjYxNzEyNTA3ZjdlL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 933292800000, "runtime": 116, "title": "Runaway Bride", "tomatoes": {"consensus": "Cliche story with lack of chemistry between Richard Gere and Julia Roberts.", "critic": {"meter": 46, "numReviews": 84, "rating": 5.3}, "dvd": 948758400000, "fresh": 39, "lastUpdated": 1439920975000, "production": "Paramount Pictures", "rotten": 45, "viewer": {"meter": 53, "numReviews": 437625, "rating": 3}, "website": "http://www.runawaybride.com"}, "type": "movie", "writers": ["Josann McGibbon", "Sara Parriott"], "year": 1999}