{"_id": "573a13a0f29313caabd0287a", "awards": {"nominations": 50, "text": "Won 1 Oscar. Another 36 wins & 50 nominations.", "wins": 37}, "cast": ["Julia Roberts", "David Brisbin", "Dawn Didawick", "Albert Finney"], "countries": ["USA"], "directors": ["Steven Soderbergh"], "fullplot": "Erin Brockovich is an unemployed single mother, desperate to find a job, but is having no luck. This losing streak even extends to a failed lawsuit against a doctor in a car accident she was in. With no alternative, she successfully browbeats her lawyer to give her a job in compensation for the loss. While no one takes her seriously, with her trashy clothes and earthy manners, that soon changes when she begins to investigate a suspicious real estate case involving the Pacific Gas & Electric Company. What she discovers is that the company is trying quietly to buy land that was contaminated by hexavalent chromium, a deadly toxic waste that the company is improperly and illegally dumping and, in turn, poisoning the residents in the area. As she digs deeper, Erin finds herself leading point in a series of events that would involve her lawfirm in one of the biggest class action lawsuits in American history against a multi-billion dollar corporation.", "genres": ["Biography", "Drama"], "imdb": {"id": 195685, "rating": 7.3, "votes": 125456}, "languages": ["English"], "lastupdated": "2015-09-13 00:43:03.200000000", "metacritic": 73, "num_mflix_comments": 3, "plot": "An unemployed single mother becomes a legal assistant and almost single-handedly brings down a California power company accused of polluting a city's water supply.", "poster": "https://m.media-amazon.com/images/M/MV5BYTA1NWRkNTktNDMxNS00NjE4LWEzMDAtNzA3YzlhYzRhNDA4L2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 953251200000, "runtime": 131, "title": "Erin Brockovich", "tomatoes": {"consensus": "Taking full advantage of Julia Roberts's considerable talent and appeal, Erin Brockovich overcomes a few character and plot issues to deliver a smart, thoughtful, and funny legal drama.", "critic": {"meter": 84, "numReviews": 143, "rating": 7.4}, "dvd": 966297600000, "fresh": 120, "lastUpdated": 1442137912000, "production": "Universal Pictures", "rotten": 23, "viewer": {"meter": 80, "numReviews": 417577, "rating": 3.5}, "website": "http://www.erinbrockovich.com/globalnav/gnf.pl?url=http://www.erinbrockovich.com"}, "type": "movie", "writers": ["Susannah Grant"], "year": 2000}