{"_id": "573a13dbf29313caabdaf9be", "awards": {"nominations": 1, "text": "1 win & 1 nomination.", "wins": 1}, "cast": ["Adrian Grenier", "Scott Mescudi", "Mckenna Grace", "Kerry Bishè"], "countries": ["USA"], "directors": ["Denis Hennelly"], "fullplot": "James and Lily, estranged from society, live off the grid, raising their young daughter in a cocoon of comfort and sustainability. When a mysterious mass text ripples its way across the country, triggering a crippling, apocalyptic cyber attack, their home transitions from sheltered modern oasis to a fortress for the estranged old friends that show up at their door for protection and community. The unexpected reunion--abundant with revelry and remembrances, generously enhanced by organic wine and weed--is quickly undermined by the slights of the past, the spark of lingering flirtations and the threat of a locally grown new world order. Balancing tense confrontations with slivers of levity, director Denis Henry Hennelly pinpoints a future where ideology explodes into action in every area.", "genres": ["Comedy", "Drama"], "imdb": {"id": 2352802, "rating": 5.5, "votes": 4832}, "languages": ["English"], "lastupdated": "2015-09-05 00:42:58.527000000", "metacritic": 36, "plot": "When a mysterious terrorist attack causes chaos in the cities, a group of friends take refuge in their countryside cabin. But the challenges of living in a post-apocalyptic world soon take their toll on relationships within the group.", "poster": "https://m.media-amazon.com/images/M/MV5BMjE2MTQ4NDUzNF5BMl5BanBnXkFtZTgwNTQ1NDQxMTE@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 1396569600000, "runtime": 99, "title": "Goodbye World", "tomatoes": {"critic": {"meter": 24, "numReviews": 25, "rating": 4.4}, "dvd": 1401753600000, "fresh": 6, "lastUpdated": 1441911213000, "production": "IDP/Samuel goldwyn Films", "rotten": 19, "viewer": {"meter": 32, "numReviews": 2910, "rating": 2.8}}, "type": "movie", "writers": ["Denis Hennelly", "Sarah Adina Smith"], "year": 2013}