{"_id": "573a1399f29313caabcedac1", "awards": {"nominations": 2, "text": "1 win & 2 nominations.", "wins": 1}, "cast": ["Michael Douglas", "Robert Duvall", "Barbara Hershey", "Rachel Ticotin"], "countries": ["France", "USA", "UK"], "directors": ["Joel Schumacher"], "fullplot": "On the day of his daughter's birthday, William \"D-Fens\" Foster is trying to get home of his estranged ex-wife to see her daughter. He has a breakdown and leaves his car in a traffic jam in Los Angeles and decides to walk. Then he goes to a convenience store and tries to get some changes for a phone call but the Korean owner does not change his money. The unstable William breaks apart the shop with a baseball bat and goes to an isolated place to drink a coke. Two gangsters threaten him and he reacts hitting them with the bat. William continues walking and stops at a phone booth. The gangsters hunt him down with their gang and shoot him but crash their car. William goes nuts and takes their gym bag with weapons proceeding in his journey of rage against injustice. Meanwhile Sergeant Martin Prendergast that is working on his last day before retirement is following the wave of crimes and believes that the responsible is the same man but the other detectives do not pay attention to him.", "genres": ["Drama", "Thriller"], "imdb": {"id": 106856, "rating": 7.6, "votes": 126877}, "languages": ["English", "Spanish", "Korean"], "lastupdated": "2015-08-19 00:22:29.470000000", "metacritic": 56, "num_mflix_comments": 1, "plot": "An unemployed defense worker frustrated with the various flaws he sees in society, begins to psychotically and violently lash out against them.", "poster": "https://m.media-amazon.com/images/M/MV5BYjcxMzM3OWMtNmM3Yy00YzBkLTkxMmQtMDk4MmM3Y2Y4MDliL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 730684800000, "runtime": 113, "title": "Falling Down", "tomatoes": {"critic": {"meter": 73, "numReviews": 49, "rating": 6.7}, "dvd": 1243296000000, "fresh": 36, "lastUpdated": 1442431452000, "production": "Warner Bros. Pictures", "rotten": 13, "viewer": {"meter": 84, "numReviews": 91492, "rating": 3.5}}, "type": "movie", "writers": ["Ebbe Roe Smith"], "year": 1993}