{"_id": "573a13d6f29313caabd9f1ec", "awards": {"nominations": 10, "text": "5 wins & 10 nominations.", "wins": 5}, "cast": ["James Cromwell", "Chuck Shamata", "Geneviève Bujold", "Ronan Rees"], "countries": ["Canada"], "directors": ["Michael McGowan"], "fullplot": "After years of stability, the lives of octogenarian couple, Craig and Irene Morrison, are slowly beginning to change. Because of changing times and regulations, they are no longer able to make a living from their small coastal New Brunswick farm. And Irene has begun to show signs of early dementia. Against the wishes of their two offspring who still reside in the area and who would like to see more standard care provided for Irene, Craig, the son of a master shipbuilder who inherited his father's building abilities, decides to mill lumber from trees on their property and with it build a more suitable, small one story house on the property in which he and Irene can live. Beginning this project with only a design in his mind, he is encouraged by friends at least to go through the regulatory process of building permits and the like. Despite being able to complete this project to more than exacting centuries old standards, Craig ends up hitting one roadblock after another in this regulatory process, which could kibosh this project, and his want for what he sees as a comfortable life with Irene in their final years.", "genres": ["Drama"], "imdb": {"id": 2073086, "rating": 7.4, "votes": 2677}, "languages": ["English"], "lastupdated": "2015-09-06 00:09:54.587000000", "metacritic": 72, "plot": "An elderly couple fight against local authorities in rural New Brunswick to build their final home.", "poster": "https://m.media-amazon.com/images/M/MV5BMjA3NjA5OTM4MF5BMl5BanBnXkFtZTcwMjQ0MTA3OQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1370476800000, "runtime": 102, "title": "Still Mine", "tomatoes": {"boxOffice": "$1.2M", "consensus": "James Cromwell and Geneviève Bujold are outstanding in this tender, affecting, insightful drama about the bonds and sacrifices of marriage.", "critic": {"meter": 93, "numReviews": 58, "rating": 7.3}, "dvd": 1399334400000, "fresh": 54, "lastUpdated": 1440008257000, "production": "Samuel Goldwyn Films", "rotten": 4, "viewer": {"meter": 81, "numReviews": 7932, "rating": 4}, "website": "http://www.stillmine-film.com"}, "type": "movie", "writers": ["Michael McGowan"], "year": 2012}