{"_id": "573a1398f29313caabceb34e", "awards": {"nominations": 9, "text": "Nominated for 2 Oscars. Another 1 win & 9 nominations.", "wins": 3}, "cast": ["Val Kilmer", "Joanne Whalley", "Warwick Davis", "Jean Marsh"], "countries": ["USA", "New Zealand"], "directors": ["Ron Howard"], "fullplot": "A baby girl is discovered in a river by Ranon and Mims, the children of Willow Ufgood, a dwarf farmer and magician and the baby girl is taken into the care of Willow's family. But when a terrifying dog-like creature attacks Willow's village, whilst tracking down the baby. Willow consults the village council and the wizard The High Aldwin. The High Aldwin gives Willow a task and Willow leaves the village and embarks on the task to give the baby girl to a responsible person. But Willow soon learns the baby is Elora Danan, the baby girl destined to bring about the downfall of the evil sorceress Queen Bavmorda. Joined by his allies: swordsman Madmartigan, sorceress Fin Raziel and the Brownies Franjean and Rool, Willow takes it upon himself to protect Elora from Queen Bavmorda, who intends to kill Elora and prevent Elora from fulfilling her destiny. And Willow and his allies are pursued by Queen Bavmorda's daughter Sorsha and the evil commander of Queen Bavmorda's army General Kael, whom are searching for Elora and bring her back to Queen Bavmorda's castle, where Queen Bavmorda bids to kill Elora in a ritual and prevent the prophecy of her downfall.", "genres": ["Action", "Adventure", "Drama"], "imdb": {"id": 96446, "rating": 7.2, "votes": 76250}, "languages": ["English"], "lastupdated": "2015-08-31 00:03:35.200000000", "num_mflix_comments": 1, "plot": "A reluctant dwarf must play a critical role in protecting a special baby from an evil queen.", "poster": "https://m.media-amazon.com/images/M/MV5BZWIyMTA2M2ItOGI5MC00OTY0LWFmZTItN2NkOWQ0MGQ5NDkyL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 580089600000, "runtime": 126, "title": "Willow", "tomatoes": {"consensus": "Good production value and decent special effects, but the story is too insipid and slowly paced.", "critic": {"meter": 48, "numReviews": 29, "rating": 5.6}, "dvd": 1006819200000, "fresh": 14, "lastUpdated": 1442168250000, "production": "MGM Home Entertainment", "rotten": 15, "viewer": {"meter": 80, "numReviews": 240147, "rating": 3.4}}, "type": "movie", "writers": ["George Lucas (story)", "Bob Dolman (screenplay)"], "year": 1988}