{"_id": "573a13a9f29313caabd1fce6", "awards": {"nominations": 3, "text": "3 nominations.", "wins": 0}, "cast": ["Seth Green", "Macaulay Culkin", "Diana Scarwid", "Chloè Sevigny"], "countries": ["USA", "Netherlands"], "directors": ["Fenton Bailey", "Randy Barbato"], "fullplot": "Set in the New York club scene of the late 1980's thru the 1990's, a tale which chronicles the rise and fall of club-kid promoter Michael Alig, a party organizer, whose extravagant life was sent spiralling downward when he boasted on television that he had killed his friend, roommate, and drug dealer, Angel Melendez. Originally from Indiana, Alig moved to New York, and came to be an underground legend, known for his excessive drug use and outrageous behavior in the club world. At his peak, he had his own record label, and magazine, and hosted Disco 2000, one of the biggest club nights in New York in the '90s. He was doing a lot of drugs, and as his addiction got worse, his party themes became darker and more twisted. Alig's saga reached its tragic crescendo when he viciously murdered his drug dealer, Angel, by injecting him with Drano and throwing him in the East River. The power he wielded on the club scene made him feel untouchable, so he didn't hestitate to boast of the murder. The press thought it was a publicity stunt--until Angel's body washed ashore.", "genres": ["Biography", "Crime", "Drama"], "imdb": {"id": 320244, "rating": 6.3, "votes": 12070}, "languages": ["English"], "lastupdated": "2015-09-04 00:03:57.147000000", "metacritic": 36, "num_mflix_comments": 1, "plot": "This is the true story of Michael Alig, a Club Kid party organizer whose life was sent spiraling down when he bragged on television about killing his drug dealer and roommate.", "poster": "https://m.media-amazon.com/images/M/MV5BYjZlMWM1MGEtY2M5OS00MWZhLWI1OGUtYTAwY2JlM2U1ZTgwXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1066348800000, "runtime": 98, "title": "Party Monster", "tomatoes": {"boxOffice": "$0.3M", "consensus": "The lurid display of camp soon turns tedious.", "critic": {"meter": 29, "numReviews": 77, "rating": 4.4}, "dvd": 1076371200000, "fresh": 22, "lastUpdated": 1441135699000, "production": "Strand Releasing", "rotten": 55, "viewer": {"meter": 75, "numReviews": 36706, "rating": 3.4}, "website": "http://www.partymonster.com/"}, "type": "movie", "writers": ["Fenton Bailey", "Randy Barbato", "James St. James (book)"], "year": 2003}