{"_id": "573a13dff29313caabdb9130", "awards": {"nominations": 9, "text": "3 wins & 9 nominations.", "wins": 3}, "cast": ["Thierry Lhermitte", "Raphaèl Personnaz", "Niels Arestrup", "Bruno Raffaelli"], "countries": ["France"], "directors": ["Bertrand Tavernier"], "fullplot": "Alexandre Taillard de Vorms is tall and impressive, a man with style, attractive to women. He also happens to be the Minister of Foreign Affairs for the land of enlightenment: France. With his silver mane and tanned, athletic body, he stalks the world stage, from the floor of the United Nations in New York to the powder keg of Oubanga. There, he calls on the powerful and invokes the mighty to bring peace, to calm the trigger-happy, and to cement his aura of Nobel Peace Prize winner-in-waiting. Alexandre Taillard de Vorms is a force to be reckoned with, waging his own war backed up by the holy trinity of diplomatic concepts: legitimacy, lucidity and efficacy. He takes on American neo-cons, corrupt Russians and money-grabbing Chinese. Perhaps the world doesn't deserve France's magnanimousness, but his art would be wasted if just restricted to home turf. Enter the young Arthur Vlaminck, graduate of the elite National School of Administration, who is hired as head of \"language\" at the foreign ministry. In other words, he is to write the minister's speeches. But he also has to learn to deal with the sensibilities of the boss and his entourage, and find his way between the private secretary and the special advisers who stalk the corridors of the Quai d'Orsay - the ministry's home - where stress, ambition and dirty dealing are the daily currency. But just as he thinks he can influence the fate of the world, everything seems threatened by the inertia of the technocrats.", "genres": ["Comedy"], "imdb": {"id": 2609222, "rating": 6.3, "votes": 1982}, "languages": ["French"], "lastupdated": "2015-08-21 00:21:47.233000000", "metacritic": 65, "num_mflix_comments": 2, "plot": "Alexandre Taillard de Vorms is tall and impressive, a man with style, attractive to women. He also happens to be the Minister of Foreign Affairs for the land of enlightenment: France. With ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTUyNzc0NzY3M15BMl5BanBnXkFtZTgwODYzNDI0MTE@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 1383696000000, "runtime": 113, "title": "The French Minister", "tomatoes": {"boxOffice": "$3.8k", "critic": {"meter": 65, "numReviews": 20, "rating": 6.6}, "dvd": 1406505600000, "fresh": 13, "lastUpdated": 1437848300000, "production": "Sundance Selects", "rotten": 7, "viewer": {"meter": 56, "numReviews": 387, "rating": 3.3}, "website": "http://www.ifccenter.com/films/the-french-minister/"}, "type": "movie", "writers": ["Christophe Blain", "Abel Lanzac", "Bertrand Tavernier"], "year": 2013}