{"_id": "573a13c1f29313caabd65e09", "awards": {"nominations": 9, "text": "7 wins & 9 nominations.", "wins": 7}, "cast": ["Thora Birch", "William Black", "Jimmy Carter", "Elijah Cummings"], "countries": ["USA"], "directors": ["Michael Moore"], "fullplot": "Capitalism: A Love Story examines the impact of corporate dominance on the everyday lives of Americans (and by default, the rest of the world). The film moves from Middle America, to the halls of power in Washington, to the global financial epicenter in Manhattan. With both humor and outrage, the film explores the question: What is the price that America pays for its love of capitalism? Families pay the price with their jobs, their homes and their savings. Moore goes into the homes of ordinary people whose lives have been turned upside down; and he goes looking for explanations in Washington, DC and elsewhere. What he finds are the all-too-familiar symptoms of a love affair gone astray: lies, abuse, betrayal...and 14,000 jobs being lost every day. Capitalism: A Love Story also presents what a more hopeful future could look like. Who are we and why do we behave the way that we do?", "genres": ["Documentary"], "imdb": {"id": 1232207, "rating": 7.4, "votes": 32630}, "languages": ["English", "Russian", "Spanish"], "lastupdated": "2015-09-07 00:44:47.640000000", "metacritic": 61, "plot": "An examination of the social costs of corporate interests pursuing profits at the expense of the public good.", "poster": "https://m.media-amazon.com/images/M/MV5BMTYyMTA2MTE4NF5BMl5BanBnXkFtZTcwNTgwMDE4Mg@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1254441600000, "runtime": 127, "title": "Capitalism: A Love Story", "tomatoes": {"boxOffice": "$14.3M", "consensus": "Love him or hate him, Capitalism captures Michael Moore in his muckraking element -- with all the Moore-centric showmanship that entails.", "critic": {"meter": 75, "numReviews": 178, "rating": 6.7}, "dvd": 1268092800000, "fresh": 133, "lastUpdated": 1440181882000, "production": "Overture Films", "rotten": 45, "viewer": {"meter": 73, "numReviews": 70389, "rating": 3.6}, "website": "http://www.capitalismalovestory.com/"}, "type": "movie", "writers": ["Michael Moore"], "year": 2009}