{"_id": "573a1399f29313caabcec5ac", "awards": {"nominations": 5, "text": "Nominated for 1 BAFTA Film Award. Another 4 wins & 5 nominations.", "wins": 5}, "cast": ["Juliette Binoche", "Denis Lavant", "Daniel Buain", "Klaus-Michael Grèber"], "countries": ["France"], "directors": ["Leos Carax"], "fullplot": "Set against Paris' oldest bridge, the Pont Neuf, while it was closed for repairs, this film is a love story between two young vagrants: Alex, a would be circus performer addicted to alcohol and sedatives and Michele, a painter driven to a life on the streets because of a failed relationship and an affliction which is slowly turning her blind. The film portrays the harsh existence of the homeless as Alex, Michele and Hans, an older vagrant survive on the streets with their wits. As they both slowly get their lives back together, Michele becomes increasingly dependent on Alex as her vision deteriorates further. Fearing that Michele will leave him if she receives a new medical treatment Alex attempts to keep Michele practically a prisoner. The streets, skies and waterways of Paris are used as a backdrop to the story in a series of stunning visuals which dominate the film.", "genres": ["Drama", "Romance"], "imdb": {"id": 101318, "rating": 7.5, "votes": 8070}, "languages": ["French"], "lastupdated": "2015-09-14 08:37:47.610000000", "num_mflix_comments": 1, "plot": "Alex, who's homeless and addicted to alcohol, and Michèle, who's losing her sight, form a relationship while sleeping rough on Paris's Pont-Neuf bridge.", "poster": "https://m.media-amazon.com/images/M/MV5BZmRlMzg3NjAtNzQzYi00ZTRlLTk0YzctNjVhMjM5MjA0NWRlXkEyXkFqcGdeQXVyMjIyNzU0OA@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 930873600000, "runtime": 125, "title": "The Lovers on the Bridge", "tomatoes": {"critic": {"meter": 83, "numReviews": 18, "rating": 7.2}, "dvd": 1073952000000, "fresh": 15, "lastUpdated": 1440443903000, "production": "Miramax Films", "rotten": 3, "viewer": {"meter": 89, "numReviews": 5523, "rating": 4}}, "type": "movie", "writers": ["Leos Carax"], "year": 1991}