{"_id": "573a1399f29313caabcec72a", "awards": {"nominations": 10, "text": "Nominated for 1 BAFTA Film Award. Another 13 wins & 10 nominations.", "wins": 14}, "cast": ["Pascal Benezech", "Dominique Pinon", "Marie-Laure Dougnac", "Jean-Claude Dreyfus"], "countries": ["France"], "directors": ["Marc Caro", "Jean-Pierre Jeunet"], "fullplot": "The story is centered on a microcosm of a post-apocalyptic society where food is so rare it's invaluable and is used as currency. The story centers on an apartment building with a delicatessen on the ground floor. The owner of the eatery also owns the apartment building and he is in need of a new maintenance man since the original \"mysteriously\" disappeared. A former clown applies for the job and the butcher's intent is to have him work for a little while and then serve him to quirky tenants who pay the butcher in, of course, grain. The clown and butcher's daughter fall in love and she tries to foil her father's plans by contacting the \"troglodytes\", a grain eating sub-group of society who live entirely underground. The \"trogs\" are possibly the most sensible of the lot, as they see food as food and not money.", "genres": ["Comedy", "Crime"], "imdb": {"id": 101700, "rating": 7.7, "votes": 62463}, "languages": ["French"], "lastupdated": "2015-09-16 03:41:59.530000000", "metacritic": 66, "plot": "Post-apocalyptic surrealist black comedy about the landlord of an apartment building who occasionally prepares a delicacy for his odd tenants.", "poster": "https://m.media-amazon.com/images/M/MV5BNjg5ZDM0MTEtYTZmNC00NDJiLWI5MTktYzk4N2QxY2IxZTc2L2ltYWdlXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 702259200000, "runtime": 99, "title": "Delicatessen", "tomatoes": {"consensus": "Director Jean-Pierre Jeunet deftly combines horror, sci-fi, and humor in Delicatessen, a morbid comedy set in a visually ravishing futuristic dystopia.", "critic": {"meter": 88, "numReviews": 52, "rating": 7.7}, "dvd": 1146528000000, "fresh": 46, "lastUpdated": 1441908479000, "production": "Lionsgate", "rotten": 6, "viewer": {"meter": 91, "numReviews": 46648, "rating": 4.1}}, "type": "movie", "writers": ["Gilles Adrien (dialogue)", "Gilles Adrien (screenplay)", "Marc Caro (screenplay)", "Jean-Pierre Jeunet (screenplay)"], "year": 1991}