{"_id": "573a1395f29313caabce26d2", "awards": {"nominations": 1, "text": "2 wins & 1 nomination.", "wins": 2}, "cast": ["Catherine Allègret", "Jacques Perrin", "Simone Signoret", "Michel Piccoli"], "countries": ["France"], "directors": ["Costa-Gavras"], "fullplot": "Sei persone viaggiano in un vagone-letto da Marsiglia a Parigi. All'arrivo, un donna viene trovata morta nella sua cuccetta. La polizia si mette alla ricerca delle altre persone, sospettando possa essere stato uno degli altri cinque passeggeri a commettere l'omicidio, ma questi sono uccisi uno ad uno. Gli ultimi due (una coppia di ragazzi conosciutisi per caso nella carrozza) decidono di cercare di risolvere il caso, per non essere uccisi a loro volta, rischiando comunque di esserlo. Con il loro aiuto il caso viene risolto: un giovane e squattrinato studente, amante di una ricca ed attempata attrice (una delle vittime) ha organizzato gli omicidi con il suo amante, un giovane poliziotto nevrotico, per derubare la donna e fuggire insieme in Africa; per cui bisognava uccidere tutti i componenti del vagone-letto per non destare sospetti. Alla fine, dopo un inseguimento notturno per le vie di Parigi, lo studente viene arrestato ed il complice si suicida per non essere catturato.", "genres": ["Mystery", "Thriller"], "imdb": {"id": 59050, "rating": 7.4, "votes": 536}, "languages": ["French"], "lastupdated": "2015-09-17 02:39:04.310000000", "plot": "Sei persone viaggiano in un vagone-letto da Marsiglia a Parigi. All'arrivo, un donna viene trovata morta nella sua cuccetta. La polizia si mette alla ricerca delle altre persone, ...", "poster": "https://m.media-amazon.com/images/M/MV5BMDllNmI3OTEtODIwZi00MmExLWFiZDctYzIwZGRlZjY1YzBmXkEyXkFqcGdeQXVyMjUyNDk2ODc@._V1_SY1000_SX677_AL_.jpg", "released": -130118400000, "runtime": 95, "title": "Compartiment tueurs", "tomatoes": {"lastUpdated": 1439316954000, "viewer": {"meter": 77, "numReviews": 197, "rating": 4.1}}, "type": "movie", "writers": ["Costa-Gavras", "Sèbastien Japrisot (novel)"], "year": 1965}