{"_id": "573a13a6f29313caabd194df", "awards": {"nominations": 2, "text": "2 nominations.", "wins": 0}, "cast": ["Al Pacino", "Colin Farrell", "Bridget Moynahan", "Gabriel Macht"], "countries": ["USA"], "directors": ["Roger Donaldson"], "fullplot": "In an era when the country's first line of defense, intelligence, is more important than ever, this story opens the CIA's infamous closed doors and gives an insider's view into the Agency: how trainees are recruited, how they are prepared for the spy game, and what they learn to survive. James Clayton might not have the attitude of a typical recruit, but he is one of the smartest graduating seniors in the country - and he's just the person that Walter Burke wants in the Agency. James regards the CIA's mission as an intriguing alternative to an ordinary life, but before he becomes an Ops Officer, James has to survive the Agency's secret training ground, where green recruits are molded into seasoned veterans. As Burke teaches him the ropes and the rules of the game, James quickly rises through the ranks and falls for Layla, one of his fellow recruits. But just when James starts to question his role and his cat-and-mouse relationship with his mentor, Burke taps him for a special assignment to root out a mole. As the suspense builds toward a gripping climax, it soon becomes clear that the CIA's old maxims are true: \"trust no one\" and \"nothing is what it seems.\"", "genres": ["Action", "Crime", "Drama"], "imdb": {"id": 292506, "rating": 6.6, "votes": 106733}, "languages": ["English", "Persian", "Russian"], "lastupdated": "2015-09-05 00:52:20.680000000", "metacritic": 56, "num_mflix_comments": 1, "plot": "A brilliant young CIA trainee is asked by his mentor to help find a mole in the Agency.", "poster": "https://m.media-amazon.com/images/M/MV5BMjE5MDMzOTk3MV5BMl5BanBnXkFtZTYwNTE0NTg2._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1043971200000, "runtime": 115, "title": "The Recruit", "tomatoes": {"boxOffice": "$52.7M", "consensus": "This polished thriller is engaging until it takes one twist too many into the predictable.", "critic": {"meter": 43, "numReviews": 165, "rating": 5.6}, "dvd": 1053993600000, "fresh": 71, "lastUpdated": 1442255121000, "production": "Touchstone Pictures", "rotten": 94, "viewer": {"meter": 58, "numReviews": 109916, "rating": 3.2}, "website": "http://touchstonepictures.go.com/recruit"}, "type": "movie", "writers": ["Roger Towne", "Kurt Wimmer", "Mitch Glazer"], "year": 2003}