{"_id": "573a139ff29313caabd01d74", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Joseph Ashton", "Dave Matthews", "Renee Faia", "Mac Davis"], "countries": ["USA"], "directors": ["Lyman Dayton", "Sam Pillsbury"], "fullplot": "Where the Red Fern Grows is the heartwarming and adventurous tale for all ages about a young boy and his quest for his own red-bone hound hunting dogs. Set in the Ozark Mountains during the Great Depression, Billy Coleman works hard and saves his earnings for 2 years to achieve his dream of buying two coonhound pups. He develops a new trust in God as he faces overwhelming challenges in adventure and tragedy roaming the river bottoms of Cherokee country with \"Old Dan\" and \"Little Ann.\" The movie follows the inseparable trio as they romp relentlessly through the Ozarks, trying to tree the elusive \"Ghost\" raccoon. Their efforts prove victorious as they win the coveted gold cup in the annual coon-hunt contest, capture wily ghost coons and bravely fight a mountain lion. Through these adventures Billy realizes the meaning of true friendship, loyalty, integrity and heroics, in this timeless and poignant coming of age story.", "genres": ["Drama"], "imdb": {"id": 192788, "rating": 6.5, "votes": 762}, "languages": ["English"], "lastupdated": "2015-09-17 04:13:23.870000000", "num_mflix_comments": 2, "plot": "Where the Red Fern Grows is the heartwarming and adventurous tale for all ages about a young boy and his quest for his own red-bone hound hunting dogs.", "poster": "https://m.media-amazon.com/images/M/MV5BMTI2NTgzOTc5NF5BMl5BanBnXkFtZTcwMDY3MTcyMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 1051920000000, "runtime": 86, "title": "Where the Red Fern Grows", "tomatoes": {"dvd": 1103587200000, "lastUpdated": 1440527140000, "production": "Walt Disney Pictures", "viewer": {"meter": 68, "numReviews": 748, "rating": 3.8}, "website": "http://www.elixirfilms.com/redfern.html"}, "type": "movie", "writers": ["Wilson Rawls (novel)", "Douglas C. Stewart (screenplay)", "Eleanor Lamb (screenplay)", "Lyman Dayton (screenplay)", "Sam Pillsbury (screenplay)"], "year": 2003}