{"_id": "573a13d4f29313caabd989f2", "awards": {"nominations": 7, "text": "1 win & 7 nominations.", "wins": 1}, "cast": ["Birgitte Hjort Sèrensen", "Sèren Sètter-Lassen", "Sverrir Gudnason", "Lene Maria Christensen"], "countries": ["Denmark", "Sweden"], "directors": ["Bille August"], "fullplot": "At the beginning of the 20th century, Marie is married to Denmark's world famous painter P.S. Krèyer. They are among the country's most admired and famous couples. All the great men of the time - politicians, businessmen, noblemen, scientists, writers and royalty - wish to be depicted by Krèyer, and he can ask any price he wants. To be painted by him is a great honour and comes with great prestige. Marie, who adorns several of Krèyer's paintings, is considered to be \"the most beautiful woman in Europe\". Together with their daughter Vibeke they experience all the best life has to offer: parties, champagne and luxury. However, this is only the polished surface. Beneath it is living hell. Krèyer suffers from manic depression and syphilis. He can change from being cheerful and upbeat, to a foaming crazy monster without any boundaries, also within his relationship to Marie and Vibeke. Marie has struggled to keep up appearances for a long time, but the situation is wearing her down. She is caught in an impossible situation between maintaining the bright social life and the hell unfolding behind closed doors. She feels that she is being suffocated and that she is disappearing. After another of Krèyer's violent fits of insanity and rage, Marie decides to leave for Italy with their daughter; to go away for a while and recuperate. In Italy she meets the younger Swedish composer Hugo Alfvèn. He falls head over heels in love with her and she finally yields to his unreserved and unrestrained emotions. However, their union is not a happy one. Marie is caught between a new life on one side and her love for Vibeke and Krèyer on the other. In the first place, she was not even searching for love, she was searching for herself. It is this painful road, the road towards your own true self, which Marie is following in The Passion of Marie. And she succeeds - but it all comes at a cost.", "genres": ["Biography", "Drama"], "imdb": {"id": 1961192, "rating": 6.3, "votes": 902}, "languages": ["Danish"], "lastupdated": "2015-08-30 00:29:31.820000000", "plot": "The story of the marriage between the painters Marie and P.S. Krèyer.", "poster": "https://m.media-amazon.com/images/M/MV5BMjEzMTU3ODQ4MV5BMl5BanBnXkFtZTcwMTk1NjM1Nw@@._V1_SY1000_SX677_AL_.jpg", "released": 1348704000000, "runtime": 102, "title": "Marie Krèyer", "tomatoes": {"lastUpdated": 1437760924000, "viewer": {"numReviews": 38, "rating": 3.2}}, "type": "movie", "writers": ["Anastassia Arnold (book)", "Peter Asmussen (screenplay)"], "year": 2012}