{"_id": "573a13a7f29313caabd1c099", "awards": {"nominations": 39, "text": "Nominated for 2 Oscars. Another 14 wins & 39 nominations.", "wins": 16}, "cast": ["Daniel Radcliffe", "Richard Griffiths", "Pam Ferris", "Fiona Shaw"], "countries": ["UK", "USA"], "directors": ["Alfonso Cuarèn"], "fullplot": "Harry Potter is having a tough time with his relatives (yet again). He runs away after using magic to inflate Uncle Vernon's sister Marge who was being offensive towards Harry's parents. Initially scared for using magic outside the school, he is pleasantly surprised that he won't be penalized after all. However, he soon learns that a dangerous criminal and Voldemort's trusted aide Sirius Black has escaped from the Azkaban prison and wants to kill Harry to avenge the Dark Lord. To worsen the conditions for Harry, vile creatures called Dementors are appointed to guard the school gates and inexplicably happen to have the most horrible effect on him. Little does Harry know that by the end of this year, many holes in his past (whatever he knows of it) will be filled up and he will have a clearer vision of what the future has in store...", "genres": ["Adventure", "Family", "Fantasy"], "imdb": {"id": 304141, "rating": 7.8, "votes": 341206}, "languages": ["English"], "lastupdated": "2015-09-11 00:00:46.420000000", "metacritic": 82, "num_mflix_comments": 406, "plot": "It's Harry's third year at Hogwarts; not only does he have a new \"Defense Against the Dark Arts\" teacher, but there is also trouble brewing. Convicted murderer Sirius Black has escaped the Wizards' Prison and is coming after Harry.", "poster": "https://m.media-amazon.com/images/M/MV5BMTY4NTIwODg0N15BMl5BanBnXkFtZTcwOTc0MjEzMw@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 1086307200000, "runtime": 142, "title": "Harry Potter and the Prisoner of Azkaban", "tomatoes": {"boxOffice": "$249.4M", "consensus": "Under the assured direction of Alfonso Cuaron, Harry Potter and the Prisoner of Azkaban triumphantly strikes a delicate balance between technical wizardry and complex storytelling.", "critic": {"meter": 91, "numReviews": 249, "rating": 7.9}, "dvd": 1101081600000, "fresh": 226, "lastUpdated": 1442078802000, "production": "Warner Bros. Pictures", "rotten": 23, "viewer": {"meter": 86, "numReviews": 1163226, "rating": 3.8}, "website": "http://azkaban.warnerbros.com/"}, "type": "movie", "writers": ["J.K. Rowling (novel)", "Steve Kloves (screenplay)"], "year": 2004}