{"_id": "573a1396f29313caabce52bf", "awards": {"nominations": 9, "text": "Won 1 Oscar. Another 11 wins & 9 nominations.", "wins": 12}, "cast": ["George Segal", "Glenda Jackson", "Paul Sorvino", "K Callan"], "countries": ["UK"], "directors": ["Melvin Frank"], "fullplot": "American Steve Blackburn, in the insurance business, is married with two kids. Vickie Allessio, a self described design \"stealer\" for a knockoff fashion house, is a recent divorcèe with two kids. Steve and Vickie are running into each other more and more in their day to day lives in London before even knowing who the other is, which suits them both fine, as when they do finally officially meet, Steve is up front that he wants to have an affair with her, Steve who has had affairs in the past whenever his wife Gloria, who is from old money, isn't around which is currently the case as she is in the States visiting her parents. Vickie, in turn, is up front that she is amenable to a no-strings affair with him under specific circumstances, namely that it be at least a classy short term affair, meaning no cheap motels, and preferably a weekend away somewhere warm. Able to arrange a business trip to Mèlaga, Spain, for a week, Steve convinces Vickie to change their agreed weekend to a week and spend it in the nearby resort of Marbella. However, one issue after another has the potential to derail the Marbella vacation and thus their affair, unless they can overcome all of the obstacles. If they can, they will have to decide if there is any sort of future for them in their real lives.", "genres": ["Comedy", "Romance"], "imdb": {"id": 70819, "rating": 6.5, "votes": 1842}, "languages": ["English", "Spanish"], "lastupdated": "2015-08-24 00:18:57.243000000", "num_mflix_comments": 2, "plot": "Romantic comedy about a pair of clandestine lovers in a London-Spain tryst.", "poster": "https://m.media-amazon.com/images/M/MV5BNTlhZThiNzAtNzVlNC00ODhjLThhOWQtMWM5NGVlYzg3OGI4XkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 113702400000, "runtime": 106, "title": "A Touch of Class", "tomatoes": {"critic": {"meter": 90, "numReviews": 10, "rating": 6.8}, "dvd": 1012867200000, "fresh": 9, "lastUpdated": 1441912541000, "production": "Media Home Entertainment", "rotten": 1, "viewer": {"meter": 65, "numReviews": 2003, "rating": 3.1}}, "type": "movie", "writers": ["Melvin Frank", "Jack Rose", "Marvin Frank (story)"], "year": 1973}