{"_id": "573a13b0f29313caabd34e9b", "awards": {"nominations": 2, "text": "2 nominations.", "wins": 0}, "cast": ["Aaron Ashmore", "Jean Pierre Bergeron", "Marie Tifo", "Mac Fyfe"], "countries": ["Canada"], "directors": ["John L'Ecuyer"], "fullplot": "In the small, predominantly working class town of Inniston, Ontario, Marc Hall is a high school senior with a promising future in his chosen career as lawyer. He is bright, well liked by his classmates and teachers, and quietly supported by his hard working parents, Audy and Emily Hall. He is also openly gay and attends St. Jude, a Catholic school. His cordial relationship with those in authority in his sphere of life is put to the test when he requests that his boyfriend Jason be his date to the graduation prom. That request is flatly denied by the school's hard nosed principal, Mr. Warrick. Despite seeing his prom as an important rite of passage, Marc refuses to go if he is denied this request. He is supported by his best friend Carly, who also refuses to go if Marc doesn't go. As such, Carly's boyfriend, Beau, mounts an online \"support Marc\" campaign with the help of the school's computer geeks. The online campaign and Marc's appeal to the Catholic School Board catches the attention of gay rights lawyer, Lonnie Winn, who takes Marc's case pro bono. The resulting media maelstrom causes further problems, for Marc's devoutly religious parents, within their relationships at work and more specifically at their church, and for Marc himself. Although Marc willingly signs on to the legal case in order to get what he wants, Jason may have a different view, he who was in the closet. And Marc himself may only be able to take so much - partly as lack of support from the school may jeopardize getting a scholarship, which he needs to attend university - as he just quietly wanted to attend the prom with his boyfriend with no muss or fuss.", "genres": ["Comedy", "Drama"], "imdb": {"id": 410953, "rating": 6.7, "votes": 768}, "languages": ["English", "French"], "lastupdated": "2015-08-04 00:08:11.163000000", "plot": "In the small, predominantly working class town of Inniston, Ontario, Marc Hall is a high school senior with a promising future in his chosen career as lawyer. He is bright, well liked by ...", "poster": "https://m.media-amazon.com/images/M/MV5BMjA4MDA2OTc4N15BMl5BanBnXkFtZTcwOTk0NjgyMQ@@._V1_SY1000_SX677_AL_.jpg", "released": 1086048000000, "runtime": 92, "title": "Prom Queen: The Marc Hall Story", "tomatoes": {"dvd": 1115078400000, "lastUpdated": 1440613173000, "production": "Shout! Factory", "viewer": {"meter": 68, "numReviews": 2667, "rating": 3.4}}, "type": "movie", "writers": ["Michael MacLennan (story)", "Kent Staines (story)", "Kent Staines (teleplay)"], "year": 2004}