{"_id": "573a1395f29313caabce2e46", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Cantinflas", "Sonia Infante", "Guillermo Zetina", "Tito Junco"], "countries": ["Mexico"], "directors": ["Miguel M. Delgado"], "fullplot": "Lopez, treated derisively by all as Lopitos, is a humble but loyal citizen of Los Cocos Republic, working as an assistant at the chancellery, helping to process visas. Through a sudden series of events, namely the fear of the number 13 by the Los Cocos Ambassador, a strict protocol, three military coups and a revolution, all successful in the same day, with as much changes in governments, and ambassadors, Lopitos becomes the ambassador. Just when a powerful international struggle is taking place, and the Red and Green factions are vying to attract all the yet undecided votes amongst the nations of the world, to convene soon in an international conference to decide who will govern the world. It happens all nations have either lined up behind the \"Green\" banner, led by the money oriented Dolaronia, or the \"Red\" ideology, whose figurehead is the prime minister of socialist Pepeslavia; except, of course, the recently appointed civil government of Los Cocos. With the votes divided fifty-fifty between the Red and Green factions, diplomacy, bribery, and personal corruption fall heavily on the shoulders of His Excellency Lopitos, to gain his vote. His speech will be the last at the large assembly, after long tirades from adepts of both factions, and it is a speech to end all speeches.", "genres": ["Comedy", "Drama"], "imdb": {"id": 61038, "rating": 7.3, "votes": 375}, "languages": ["Spanish"], "lastupdated": "2015-08-24 00:19:01.650000000", "plot": "Lopez, treated derisively by all as Lopitos, is a humble but loyal citizen of Los Cocos Republic, working as an assistant at the chancellery, helping to process visas. Through a sudden ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTY0MjYzMDc5MF5BMl5BanBnXkFtZTcwMTI2NDQyMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "UNRATED", "released": -84153600000, "runtime": 133, "title": "Su excelencia", "tomatoes": {"dvd": 1065484800000, "lastUpdated": 1441995049000, "viewer": {"meter": 79, "numReviews": 267, "rating": 4}}, "type": "movie", "writers": ["Marco A. Almazèn (story)", "Cantinflas (story)", "Carlos Leèn (dialogue)"], "year": 1967}