{"_id": "573a1396f29313caabce49b4", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["James Mason", "Robert Preston", "Beau Bridges", "Ron Weyand"], "countries": ["USA"], "directors": ["Sidney Lumet"], "fullplot": "Paul Reis returns to the exclusive Catholic prep school he graduated from nine years earlier as a gym teacher. He is reunited with his former mentor and English teacher, the affable and gregarious Joseph Dobbs, the most popular member of the faculty and advisor to the junior class, and Jerome Malley, a strict disciplinarian and teacher of classical languages, whose old-fashioned methods make him heartily disliked by his pupils. Reis finds himself caught in between the two men in a struggle for the hearts, minds, and souls of the boys. Malley, nicknamed \"Lash\" by his students has ruled out retirement, and Dobbs, who feels that Malley has lost touch with the students, hopes to inherit the senior class. Even though Malley's mother is dying an agonizing death from cancer, the Latin and Greek teacher refuses to surrender his position as head of the senior class to a man whose motives he questions. The tensions on the faculty are mirrored in the student body, which has endured a rash of malicious hazing and ritualistic violence that no one on the staff seemingly understands.", "genres": ["Drama", "Horror", "Mystery"], "imdb": {"id": 68369, "rating": 6.1, "votes": 561}, "languages": ["English"], "lastupdated": "2015-09-17 04:47:54.323000000", "plot": "At an exclusive boys' school, a new gym teacher is drawn into a feud between two older instructors, and he discovers that everything at the school is not quite as staid, tranquil and harmless as it seems.", "poster": "https://m.media-amazon.com/images/M/MV5BZGRhMDNlN2ItNDdlMi00ZTc0LTlkZjQtODhjNzI3OTY3MDllXkEyXkFqcGdeQXVyMjI4MjA5MzA@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 107740800000, "runtime": 100, "title": "Child's Play", "tomatoes": {"dvd": 1346716800000, "lastUpdated": 1440186008000, "production": "Paramount Pictures", "viewer": {"meter": 65, "numReviews": 25, "rating": 3.5}}, "type": "movie", "writers": ["Robert Marasco (play)", "Leon Prochnik (screenplay)"], "year": 1972}