{"_id": "573a139af29313caabcef7f2", "awards": {"nominations": 1, "text": "4 wins & 1 nomination.", "wins": 4}, "cast": ["Guillermo Dèaz", "Frederick Weller", "Brendan Corbalis", "Duane Boutte"], "countries": ["UK", "USA"], "directors": ["Nigel Finch"], "fullplot": "Who could have guessed that a bunch of men in dresses would breath life into the movement to win equal rights for gay men and lesbians? Certainly not the police who raided the Stonewall Inn, a popular \"drag\" bar in Greenwich Village. After a long history of police raids, extortion, and brutality, a gaggle of drag queens at the Stonewall decide they have had enough and begin to riot when the police try to load them into a paddy wagon. Told by \"La Miranda\" (Hector), a regular customer at the Stonewall Inn, the film is a recounting of events that led up to that fateful day in 1969. \"Matty Dean\" is the handsome angry young man that La Miranda meets at the Stonewall one day and with whom she/he quickly falls in love. \"Bostonia\" is the self-styled Queen Mother of the drag queens and guides each initiate gently \"into the life.\" Her lover, Vinnie, is the closeted proprietor of the Stonewall. His tragic response to the suffocation he feels bearing down on him from a homophobic world -- perhaps as much as anything else -- sparks the riots. This is the Stonewall Riots \"As Told By La Miranda\".", "genres": ["Comedy", "Drama", "History"], "imdb": {"id": 114550, "rating": 7.2, "votes": 1085}, "languages": ["English"], "lastupdated": "2015-08-30 00:27:52.353000000", "plot": "A group of homosexual people try to live with dignity and self-respect while events build to the opening battle in the major gay rights movement.", "poster": "https://m.media-amazon.com/images/M/MV5BMTUxMDk3NDU3N15BMl5BanBnXkFtZTcwNzc3OTIyMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 841708800000, "runtime": 99, "title": "Stonewall", "tomatoes": {"critic": {"meter": 63, "numReviews": 8, "rating": 6.5}, "dvd": 982022400000, "fresh": 5, "lastUpdated": 1440099471000, "production": "BMG", "rotten": 3, "viewer": {"meter": 69, "numReviews": 966, "rating": 3.5}}, "type": "movie", "writers": ["Rikki Beadle Blair", "Martin Duberman (novel)"], "year": 1995}