{"_id": "573a1399f29313caabcec43b", "awards": {"nominations": 0, "text": "2 wins.", "wins": 2}, "cast": ["Dabney Coleman", "Uma Thurman", "Joanna Cassidy", "Crispin Glover"], "countries": ["USA"], "directors": ["John Boorman"], "fullplot": "Stewart McBain (Coleman) is a real-estate mogul who spends his living blowing up old buildings to make room to erect new buildings. All goes as planned for a new subdivision, until a group of protesters object to the destruction of one lonely, ugly building, called the Dutch House. Typically, the media is sent to the scene of the protest, and McBain appears on TV in a bad way. His children - Daphne (Thurman), Chloe (Amis), and Jimmy (Hewlett) - ridicule him for appearing on TV, and as a reward for their remarks, he drops them off at the Dutch House with $750 apiece, and tells them they're on their own. They must find jobs if they expect to make money to stay warm. McBain and his wife, Jean watch from afar as their children adapt to their new lifestyle, meeting new friends, and inviting others into their new home, including a decrepit bum.", "genres": ["Comedy", "Drama"], "imdb": {"id": 100924, "rating": 6.1, "votes": 1237}, "languages": ["English"], "lastupdated": "2015-08-15 00:35:20.567000000", "num_mflix_comments": 2, "plot": "Stewart McBain (Coleman) is a real-estate mogul who spends his living blowing up old buildings to make room to erect new buildings. All goes as planned for a new subdivision, until a group ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTU3MGZjODYtMmVkNS00OGEzLTg1NjYtNzc0MDA5NzI2N2ViXkEyXkFqcGdeQXVyMjUyNDk2ODc@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 635731200000, "runtime": 107, "title": "Where the Heart Is", "tomatoes": {"critic": {"meter": 11, "numReviews": 9, "rating": 3.8}, "dvd": 1054598400000, "fresh": 1, "lastUpdated": 1441911668000, "production": "Touchstone Pictures", "rotten": 8, "viewer": {"meter": 59, "numReviews": 1974, "rating": 3.2}}, "type": "movie", "writers": ["John Boorman", "Telsche Boorman"], "year": 1990}