{"_id": "573a13a1f29313caabd07bd2", "awards": {"nominations": 2, "text": "3 wins & 2 nominations.", "wins": 3}, "cast": ["Barry W. Blaustein", "Vince McMahon", "Jim Ross", "Jim Bell"], "countries": ["USA"], "directors": ["Barry W. Blaustein"], "fullplot": "This documentary focuses on the lives of professional wrestlers Terry Funk, Mick Foley (Mankind), Jake Roberts (Jake the Snake) and Darren Drozdov (Droz). As the film progresses, the story of their lives unfolds, as we also learn how the wrestling industry is not the plastic-weapons fake-slap sideshow that many have perceived it as. We are shown how moves, although not actually injuring anyone, are not fake, and extreme training is required to be able to perform the stunts without being harmed. We are also treated to interviews with the family of Mick Foley and what it is like for them to know their father literally puts his life on the line every week and how it feels to have other children call their father a \"fake\". Vince McMahon, owner of World Wrestling Entertainment, also makes a few appearances, responding to criticism on various wrestling situations, including, once again, his real athletes, very real organization being called fake by sources such as USA Today and various news programs.", "genres": ["Documentary", "Biography", "Sport"], "imdb": {"id": 218043, "rating": 7.6, "votes": 6445}, "languages": ["English"], "lastupdated": "2015-08-30 01:00:30.597000000", "metacritic": 73, "plot": "A heartfelt documentary focusing on the lives of professional wrestlers and how their sport is not fake.", "poster": "https://m.media-amazon.com/images/M/MV5BMTQ5NDUzODkyOF5BMl5BanBnXkFtZTcwNjY3OTIyMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 953251200000, "runtime": 102, "title": "Beyond the Mat", "tomatoes": {"consensus": "Even if you aren't a fan, Beyond the Mat provides a riveting, perceptive look into the world of professional wrestling by taking a closer look at the people beneath the personas.", "critic": {"meter": 82, "numReviews": 66, "rating": 6.7}, "dvd": 966902400000, "fresh": 54, "lastUpdated": 1439493658000, "production": "Lions Gate Films", "rotten": 12, "viewer": {"meter": 83, "numReviews": 8432, "rating": 3.7}, "website": "http://www.beyondthemat.net"}, "type": "movie", "writers": ["Barry W. Blaustein (narrative written by)"], "year": 1999}