{"_id": "573a13def29313caabdb6dbb", "awards": {"nominations": 5, "text": "1 win & 5 nominations.", "wins": 1}, "cast": ["Per Bak Jensen", "Jonas Bergsèe", "Bo Elberling", "Jens Fog Jensen"], "countries": ["Denmark", "Sweden", "Greenland"], "directors": ["Daniel Dencik"], "fullplot": "A real adventure film - but in a very modern sense. On a three-mast schooner aboard with artists, scientists and ambitions worthy of Noah or Columbus, we set off towards the end of the world: in this case, the rapidly melting ice massifs in North-East Greenland. An epic journey where the brave sailors get acquainted with imaginary tent pitches, polar bear nightmares and entirely new species. But in their encounter with the new, unknown parts of our world, the crew - which ranges from the artists Tal R and Daniel Richter to the geologist Minik Rosing - addresses a number of questions of a fundamental, existential nature. Curiosity, great pathos and a liberating splash of humor come together in a film that is superbly orchestrated by the cinematic talent Daniel Dencik, who in one iconic image after another seduces us both far beyond and deep into the historical footnote that is humanity. A film that is both conceived and brought into life on a large scale, just like an old childhood dream realized in adult company.", "genres": ["Documentary", "Adventure", "Comedy"], "imdb": {"id": 2530936, "rating": 7, "votes": 375}, "languages": ["English", "Danish"], "lastupdated": "2015-08-06 00:57:08.193000000", "metacritic": 77, "num_mflix_comments": 2, "plot": "A grand and adventurous journey of discovery to the last white areas of the world map. But no matter how far we go and how hard we try to find answers, we ultimately meet ourselves and our own transience.", "poster": "https://m.media-amazon.com/images/M/MV5BMTQ0ODI0NjI1NF5BMl5BanBnXkFtZTgwMDgxOTc0MjE@._V1_SY1000_SX677_AL_.jpg", "released": 1360108800000, "runtime": 90, "title": "The Expedition to the End of the World", "tomatoes": {"boxOffice": "$33.4k", "critic": {"meter": 82, "numReviews": 17, "rating": 7}, "dvd": 1421020800000, "fresh": 14, "lastUpdated": 1438453265000, "production": "Argot Pictures", "rotten": 3, "viewer": {"meter": 52, "numReviews": 309, "rating": 3.1}, "website": "http://expeditionthemovie.dk/"}, "type": "movie", "writers": ["Daniel Dencik", "Michael Haslund-Christensen", "Janus Metz Pedersen"], "year": 2013}