{"_id": "573a139af29313caabcefcf6", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Chris O'Donnell", "Gene Hackman", "Faye Dunaway", "Robert Prosky"], "countries": ["USA"], "directors": ["James Foley"], "fullplot": "Having survived the hatred and bigotry that was his Klansman grandfather's only legacy, young attorney Adam Hall seeks at the last minute to appeal the old man's death sentence for the murder of two small Jewish boys 30 years before. Only four weeks before Sam Cayhall is to be executed, Adam meets his grandfather for the first time in the Mississippi prison which has held him since the crime. The meeting is predictably tense when the educated, young Mr. \"Hall\" confronts his venom-spewing elder, Mr. \"Cayhall,\" about the murders. The next day, headlines run proclaiming Adam the grandson who has come to the state to save his grandfather, the infamous Ku Klux Klan bomber. While the old man's life lies in the balance, Adam's motivation in fighting this battle becomes clear as the story unfolds. Not only does he fight for his grandfather, but perhaps for himself as well. He has come to heal the wounds of his own father's suicide, to mitigate the secret shame he has always felt for the genetic fluke which made this man his grandfather, and to bring closure -- one way or another -- to the suffering the old man seems to have brought to everyone he has ever known. But, would mercy soften his grandfather's heart?", "genres": ["Drama", "Thriller"], "imdb": {"id": 115862, "rating": 5.9, "votes": 9931}, "languages": ["English"], "lastupdated": "2015-09-14 00:00:54.033000000", "metacritic": 45, "num_mflix_comments": 3, "plot": "A young man fresh out of law school tries to win a reprieve for his racist grandfather who is on death row.", "poster": "https://m.media-amazon.com/images/M/MV5BN2E2ODZjODctZmQ0Mi00YjRkLThjMDEtMGUyYmE1ZDI5MzU3XkEyXkFqcGdeQXVyMTMxMTY0OTQ@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 844992000000, "runtime": 113, "title": "The Chamber", "tomatoes": {"critic": {"meter": 12, "numReviews": 25, "rating": 4.4}, "dvd": 896140800000, "fresh": 3, "lastUpdated": 1442337486000, "production": "MCA Universal Home Video", "rotten": 22, "viewer": {"meter": 39, "numReviews": 7305, "rating": 3}}, "type": "movie", "writers": ["John Grisham (novel)", "William Goldman (screenplay)", "Chris Reese (screenplay)"], "year": 1996}