{"_id": "573a13b4f29313caabd41bdf", "awards": {"nominations": 52, "text": "Nominated for 4 Oscars. Another 18 wins & 52 nominations.", "wins": 22}, "cast": ["Judi Dench", "Cate Blanchett", "Tom Georgeson", "Michael Maloney"], "countries": ["UK"], "directors": ["Richard Eyre"], "fullplot": "The bitter, cynical and lonely Barbara Covett is a tough and conservative teacher, near to retirement, who is loathed by her colleagues and students. In the loneliness of her apartment, she spends her spare time writing her journal, taking care of her old cat Portia and missing her special friend Jennifer Dodd. When Sheba Hart joins the high-school as the new art teacher, Barbara dedicates her attention to the newcomer, writing sharp and unpleasant comments about her behavior and clothes. When Barbara helps Sheba in a difficult situation with two students, the grateful Sheba invites her to have lunch with her family. Sheba introduces her husband and former professor Richard Hart, who is about twenty years older than she; her rebellious teenager daughter Polly; and her son Ben that has Down's Syndrome. Barbara becomes close to Sheba, but when she accidentally discovers that Sheba is having an affair with the fifteen year-old student Steven Connolly, Barbara sees the chance to manipulate and get closer to Sheba, hiding the secret from the school headmaster. When Portia dies and Sheba does not stay with Barbara in the veterinary office to see Ben in a theater play, Barbara plots a Machiavellian revenge against Sheba, creating a scandal and consequent turmoil in their lives.", "genres": ["Drama", "Thriller"], "imdb": {"id": 465551, "rating": 7.4, "votes": 61842}, "languages": ["English", "French"], "lastupdated": "2015-08-22 01:04:28.017000000", "metacritic": 73, "num_mflix_comments": 2, "plot": "A veteran high school teacher befriends a younger art teacher, who is having an affair with one of her 15-year-old students. However, her intentions with this new \"friend\" also go well beyond platonic friendship.", "poster": "https://m.media-amazon.com/images/M/MV5BMTI2NTcyMjE3NF5BMl5BanBnXkFtZTcwNDAyNzkzMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1169769600000, "runtime": 92, "title": "Notes on a Scandal", "tomatoes": {"boxOffice": "$17.4M", "consensus": "In this sharp psychological thriller, Judi Dench and Cate Blanchett give fierce, memorable performances as two schoolteachers locked in a battle of wits.", "critic": {"meter": 87, "numReviews": 170, "rating": 7.5}, "dvd": 1176768000000, "fresh": 148, "lastUpdated": 1440182445000, "production": "Fox Searchlight Pictures", "rotten": 22, "viewer": {"meter": 83, "numReviews": 77271, "rating": 3.7}, "website": "http://www.foxsearchlight.com/NOAS/"}, "type": "movie", "writers": ["Patrick Marber (screenplay)", "Zoe Heller (novel)"], "year": 2006}