{"_id": "573a139cf29313caabcf6ec5", "awards": {"nominations": 12, "text": "3 wins & 12 nominations.", "wins": 3}, "cast": ["Angelina Jolie", "Jon Voight", "Iain Glen", "Noah Taylor"], "countries": ["USA", "UK", "Japan", "Germany"], "directors": ["Simon West"], "fullplot": "A member of a rich British aristocratic family, Lara Croft is a \"tomb raider\" who enjoys collecting ancient artifacts from ruins of temples, cities, etc. worldwide, and doesn't mind going through death-defying dangers to get them. She is skilled in hand-to-hand combat, weapons training, and foreign languages - and does them all in tight outfits. Well, the planets of the solar system are going into planetary alignment (Which occurs every 5,000 years), and a secret society called the Illuminati is seeking an ancient talisman that gives its possessor the ability to control time. However, they need a certain clock/key to help them in their search, and they have to find the talisman in one week or wait until the next planetary alignment to find it again. Lara happens to find that key hidden in a wall of her mansion. The Illuminati steal it, and Lara gets an old letter from her deceased father telling her about the society's agenda (Her father was also the one who hid the key). Now, she must retrieve the key and find and destroy the talisman before the Illuminati can get their hands on it.", "genres": ["Action", "Adventure", "Fantasy"], "imdb": {"id": 146316, "rating": 5.7, "votes": 145822}, "languages": ["English"], "lastupdated": "2015-09-13 00:23:16.693000000", "metacritic": 33, "plot": "Video game adventuress Lara Croft comes to life in a movie where she races against time and villains to recover powerful ancient artifacts.", "poster": "https://m.media-amazon.com/images/M/MV5BNzMzODVjMWUtYmIxZS00NDlkLTlmNTktNjI5NTdhZjUzYzY1XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 992563200000, "runtime": 100, "title": "Lara Croft: Tomb Raider", "tomatoes": {"boxOffice": "$129.5M", "consensus": "Angelina Jolie is perfect for the role of Lara Croft, but even she can't save the movie from a senseless plot and action sequences with no emotional impact.", "critic": {"meter": 19, "numReviews": 155, "rating": 3.9}, "dvd": 1005609600000, "fresh": 29, "lastUpdated": 1442256971000, "production": "Paramount Pictures", "rotten": 126, "viewer": {"meter": 48, "numReviews": 555402, "rating": 3.1}, "website": "http://www.tombraidermovie.com"}, "type": "movie", "writers": ["Sara B. Cooper (story)", "Mike Werb (story)", "Michael Colleary (story)", "Simon West (adaptation)", "Patrick Massett (screenplay)", "John Zinman (screenplay)"], "year": 2001}