{"_id": "573a139af29313caabcefe80", "awards": {"nominations": 9, "text": "9 nominations.", "wins": 0}, "cast": ["Leslie Cheung", "Li Gong", "Kevin Lin", "Saifei He"], "countries": ["China", "Hong Kong"], "directors": ["Kaige Chen"], "fullplot": "Not far from Shanghai, in a country twon stands the palatial home of the Pang family. Old Master Pang is an addict who brings up his beautiful daughter Ruyi on opium smoke. Her older brother, Zhengda, is addicted as well, and then paralysed and effectively brain-dead. Zhongliang, Zhengda's brother-in-law, is a successful gigolo in Shanghai who seduces married older women and then blackmails them. When Older Master Pang dies, the clan elders makes Ruyi to take over the role as the head of the household. Zhongliang returns to the Pang family on the death of Old Master Pang, re-encounters Ruyi, and they are secretly attracted to each other. Wanting to seem sophisticated, she succumbs to Zhongliang's attempts to seduce her. But in the emotional maelstrom that follows - for the angry, jealous and sexually frustrated sister (Zhengda's wife) is also part of the picture...", "genres": ["Drama", "Romance"], "imdb": {"id": 116295, "rating": 6.9, "votes": 1488}, "languages": ["Mandarin"], "lastupdated": "2015-08-30 00:57:23.303000000", "num_mflix_comments": 6, "plot": "Not far from Shanghai, in a country twon stands the palatial home of the Pang family. Old Master Pang is an addict who brings up his beautiful daughter Ruyi on opium smoke. Her older ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTQ4MjE5MTA0N15BMl5BanBnXkFtZTcwNzczMzIyMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 866160000000, "runtime": 130, "title": "Temptress Moon", "tomatoes": {"critic": {"meter": 62, "numReviews": 13, "rating": 6.4}, "dvd": 1025568000000, "fresh": 8, "lastUpdated": 1440615189000, "rotten": 5, "viewer": {"meter": 73, "numReviews": 1634, "rating": 3.5}}, "type": "movie", "writers": ["Kaige Chen (story)", "Kei Shu", "Anyi Wang (story)"], "year": 1996}