{"_id": "573a1396f29313caabce516f", "awards": {"nominations": 1, "text": "Nominated for 1 Golden Globe. Another 3 wins & 1 nomination.", "wins": 4}, "cast": ["Malcolm McDowell", "Ralph Richardson", "Rachel Roberts", "Arthur Lowe"], "countries": ["UK", "USA"], "directors": ["Lindsay Anderson"], "fullplot": "Follows the literal and associated life journey of middle class Brit, Mick Travis, representing the \"everyman\", as he tries to make his mark in his so far young life. He is able to make great strides in his traditional view of success by being what those in authority want him to be. As such, he achieves in a few weeks what it usually take years for others, namely having his own sales territory - the northeast and ultimately Scotland - for Imperial Coffee. He is also able to garner a plethora of fringe benefits from this job, including women throwing themselves at his feet. But he will ultimately face a struggle in class and authority warfare, which culminates with his encounter with the Burgess family - wealthy Industrialist Sir James Burgess and his daughter Patricia, who Mick wants to marry - the former who is contemplating investing in the shady dealings in Zingara. Mick will also find that the class struggle not only applies in his case in an upward direction, but also in a downward direction with the working class and the truly down and out. Through it all, Alan Price and his small combo act as a Greek chorus of sorts providing commentary of Mick's travails through song.", "genres": ["Comedy", "Drama", "Fantasy"], "imdb": {"id": 70464, "rating": 7.9, "votes": 5838}, "languages": ["English"], "lastupdated": "2015-08-21 00:28:17.390000000", "num_mflix_comments": 2, "plot": "This sprawling, surrealist musical serves as an allegory for the pitfalls of capitalism, as it follows the adventures of a young coffee salesman in Europe. Many actors play multiple roles, giving the film a stagy tone.", "poster": "https://m.media-amazon.com/images/M/MV5BOGFmNmFmMWMtNzRjOC00ZjlmLTliODUtZjNlNjhjOTY2N2Q5XkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 109382400000, "runtime": 178, "title": "O Lucky Man!", "tomatoes": {"critic": {"meter": 82, "numReviews": 17, "rating": 7.6}, "dvd": 1193097600000, "fresh": 14, "lastUpdated": 1439924365000, "production": "WARNER BROTHERS PICTURES", "rotten": 3, "viewer": {"meter": 87, "numReviews": 4220, "rating": 4.1}}, "type": "movie", "writers": ["David Sherwin (screenplay)", "Malcolm McDowell (based on an original idea by)"], "year": 1973}