{"_id": "573a13b3f29313caabd3de34", "awards": {"nominations": 2, "text": "1 win & 2 nominations.", "wins": 1}, "cast": ["Robin Williams", "Cheryl Hines", "Joanna 'JoJo' Levesque", "Josh Hutcherson"], "countries": ["UK", "Germany", "USA"], "directors": ["Barry Sonnenfeld"], "fullplot": "The executive Bob Munro is stressed, feeling threatened of losing his job and his lifestyle, since his abusive boss Todd Mallory hired the Stanford's geek Laird to work in their soda's company. Bob has promised his wife Jamie Munro, his teenage daughter Cassie Munro and his young son Carl Munro to spend vacations in Hawaii, but Todd demands him to prepare a presentation and attend a business meeting with the owners of a family company in a merging operation scheduled in the same period. Bob hides the truth to his family, rents a recreational vehicle and tries to convince his dysfunctional family that a road trip to the Colorado Rocky Mountains would be good to bring old values back to their family. After many incidents and while in the trailers parking area, the rookie Bob is helped by the bizarre but friendly Gornicke family. They escape from the Gornickes and initiate a journey of difficulties and leaning, retrieving their forgotten family bonds.", "genres": ["Adventure", "Comedy", "Family"], "imdb": {"id": 449089, "rating": 5.5, "votes": 43457}, "languages": ["English"], "lastupdated": "2015-09-02 00:04:12.537000000", "metacritic": 33, "num_mflix_comments": 1, "plot": "Bob Munro and his dysfunctional family rent an RV for a road trip to the Colorado Rockies, where they ultimately have to contend with a bizarre community of campers.", "poster": "https://m.media-amazon.com/images/M/MV5BNDgxNDE2NDU3MV5BMl5BanBnXkFtZTcwMzA2ODQzMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 1146182400000, "runtime": 99, "title": "RV", "tomatoes": {"boxOffice": "$71.4M", "consensus": "An unoriginal and only occasionally funny family road-trip movie, RV is a mediocre effort that not even the charisma of Robin Williams can save.", "critic": {"meter": 23, "numReviews": 121, "rating": 4.2}, "dvd": 1155600000000, "fresh": 28, "lastUpdated": 1442337160000, "production": "Columbia Pictures", "rotten": 93, "viewer": {"meter": 46, "numReviews": 305633, "rating": 3}, "website": "http://www.sonypictures.com/movies/rv/"}, "type": "movie", "writers": ["Geoff Rodkey"], "year": 2006}