{"_id": "573a1390f29313caabcd680a", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Lillian Gish", "Richard Barthelmess", "Donald Crisp", "Arthur Howard"], "countries": ["USA"], "directors": ["D.W. Griffith"], "fullplot": "Cheng Huan is a missionary whose goal is to bring the teachings of peace by Buddha to the civilized Anglo-Saxons. Upon landing in England, he is quickly disillusioned by the intolerance and apathy of the country. He becomes a storekeeper of a small shop. Out his window, he sees the young Lucy Burrows. She is regularly beaten by her prizefighter father, underfed and wears ragged clothes. Even in this deplorable condition, Cheng can see that she is a priceless beauty and he falls in love with her from afar. On the day that she passes out in front of his store, he takes her in and cares for her. With nothing but love in his heart, he dresses her in silks and provides food for her. Still weak, she stays in his shop that night and all that Cheng does is watch over her. The peace and happiness that he sees last only until Battling Burrows finds out that his daughter is with a foreigner.", "genres": ["Drama", "Romance"], "imdb": {"id": 9968, "rating": 7.7, "votes": 6610}, "lastupdated": "2015-08-21 00:06:48.907000000", "num_mflix_comments": 4, "plot": "A frail waif, abused by her brutal boxer father in London's seedy Limehouse District, is befriended by a sensitive Chinese immigrant with tragic consequences.", "poster": "https://m.media-amazon.com/images/M/MV5BNTY0ODRmZDktMzM2MC00NThmLWEyMDMtODQzNWEyMjMxYTYzXkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": -1584230400000, "runtime": 90, "title": "Broken Blossoms or The Yellow Man and the Girl", "tomatoes": {"consensus": "Thought-provoking and beautifully filmed, D.W. Griffith's Broken Blossoms presents a master at the top of his form.", "critic": {"meter": 95, "numReviews": 21, "rating": 8.2}, "dvd": 926380800000, "fresh": 20, "lastUpdated": 1440181826000, "production": "Kino on Video", "rotten": 1, "viewer": {"meter": 72, "numReviews": 3717, "rating": 3.7}}, "type": "movie", "writers": ["Thomas Burke (adapted from a story by)", "D.W. Griffith"], "year": 1919}