{"_id": "573a139af29313caabcefea9", "awards": {"nominations": 7, "text": "2 wins & 7 nominations.", "wins": 2}, "cast": ["Ben Stiller", "Patricia Arquette", "Tèa Leoni", "Mary Tyler Moore"], "countries": ["USA"], "directors": ["David O. Russell"], "fullplot": "Mel Coplin departs on a mission of discovery dragging his wife and 4 month old son behind. He and wife, Nancy, won't agree on a name for their son until adopted Mel gets in touch with his roots. He assures her that once he knows who he really is, the right name for their boy will be a snap. Enlisting the aid of student-psychologist and part-time adoption agent, Tina Kalb, they embark on a journey across the United States to find Mel's \"birth\" mother. \"The best part,\" Mel tells Nancy, \"is it's all free.\" Tina is finishing her dissertation and will film the happy reunion of mother and child as part of her research. For this privilege, she's footing the bill. His adoptive parents are left behind feeling abandoned by an ungrateful son. Clerical errors, mistaken identities, Nancy's misplaced high school friend and his gay lover, and a super-charged libido here and there are thrown into the mix along the way until -- at last -- Mel's real parents, the Schlictings (mispronounced as \"Shit-kings\" by Mrs. Coplin), are discovered in remote New Mexico. There, Mel begins to wonder if he would have been better off not knowing these people, after all.", "genres": ["Comedy"], "imdb": {"id": 116324, "rating": 6.8, "votes": 14289}, "languages": ["English"], "lastupdated": "2015-09-15 03:22:09.043000000", "metacritic": 81, "num_mflix_comments": 3, "plot": "A young man, his wife, and his incompetent case worker travel across country to find his birth parents.", "poster": "https://m.media-amazon.com/images/M/MV5BZWU5ZmIwMzktZjNmMy00Y2U3LTg4ZDctMjI4OWVlM2UwYjE0XkEyXkFqcGdeQXVyMTMxMTY0OTQ@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 829267200000, "runtime": 92, "title": "Flirting with Disaster", "tomatoes": {"consensus": "Darkly funny, solidly cast, and surprisingly thoughtful, Flirting with Disaster proved David O. Russell's Spanking the Monkey was no fluke.", "critic": {"meter": 86, "numReviews": 51, "rating": 7.5}, "dvd": 1088640000000, "fresh": 44, "lastUpdated": 1439926018000, "production": "Miramax Films", "rotten": 7, "viewer": {"meter": 69, "numReviews": 9309, "rating": 3.4}, "website": "http://www.miramax.com/movie/flirting-with-disaster/"}, "type": "movie", "writers": ["David O. Russell"], "year": 1996}