{"_id": "573a13b0f29313caabd347b0", "awards": {"nominations": 6, "text": "Nominated for 1 Oscar. Another 5 nominations.", "wins": 0}, "cast": ["Josh Lucas", "Kurt Russell", "Jacinda Barrett", "Richard Dreyfuss"], "countries": ["USA"], "directors": ["Wolfgang Petersen"], "fullplot": "It is New Year's Eve, and over 2,000 passengers & crew are ringing in the New Year aboard the huge cruise ship 'Poseidon' when it capsizes on the open sea in the middle of the North Atlantic Ocean! A small group of survivors find themselves unlikely allies in a battle for their lives. Preferring to test the odds alone, career gambler Dylan Johns ignores captain's orders to wait below for possible rescue and sets out to find his own way to safety. What begins as a solo mission soon draws others, as Dylan is followed by a desperate father searching for his daughter and her fiancèe--a young couple who hours before couldn't summon the courage to tell him they were engaged and now face much graver challenges. Along the way they are joined by a single mother and her wise-beyond-his-years son, an anxious stowaway and a despondent fellow passenger who boarded the ship not sure he wanted to live but now knows he doesn't want to die. Determined to fight their way to the surface, the group sets off through the disorienting maze of twisted steel in the upside-down wreckage. As the unstable vessel rapidly fills with water each must draw on skills and strengths they didn't even know they possessed, fighting against time for their own survival and for each other.", "genres": ["Action", "Adventure", "Drama"], "imdb": {"id": 409182, "rating": 5.6, "votes": 78201}, "languages": ["English", "Spanish"], "lastupdated": "2015-09-07 00:02:20.133000000", "metacritic": 50, "num_mflix_comments": 3, "plot": "On New Year's Eve, the luxury ocean liner Poseidon capsizes after being swamped by a rogue wave. The survivors are left to fight for their lives as they attempt to escape the sinking ship.", "poster": "https://m.media-amazon.com/images/M/MV5BMTIwOTMwODM2Nl5BMl5BanBnXkFtZTYwMDY5NjU3._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1147392000000, "runtime": 98, "title": "Poseidon", "tomatoes": {"boxOffice": "$60.7M", "consensus": "This remake of The Poseidon Adventure delivers dazzling special effects. Unfortunately, it doesn't seem that any of the budget was left over to devote to the script.", "critic": {"meter": 33, "numReviews": 199, "rating": 4.9}, "dvd": 1156204800000, "fresh": 65, "lastUpdated": 1442254651000, "production": "Warner Bros. Pictures", "rotten": 134, "viewer": {"meter": 43, "numReviews": 341721, "rating": 2.9}, "website": "http://poseidonmovie.warnerbros.com/"}, "type": "movie", "writers": ["Mark Protosevich (screenplay)", "Paul Gallico (novel)"], "year": 2006}