{"_id": "573a1395f29313caabce1e81", "awards": {"nominations": 4, "text": "Nominated for 1 Oscar. Another 3 wins & 4 nominations.", "wins": 4}, "cast": ["Tippi Hedren", "Suzanne Pleshette", "Rod Taylor", "Jessica Tandy"], "countries": ["USA"], "directors": ["Alfred Hitchcock"], "fullplot": "Melanie Daniels is the modern rich socialite, part of the jet-set who always gets what she wants. When lawyer Mitch Brenner sees her in a pet shop, he plays something of a practical joke on her, and she decides to return the favor. She drives about an hour north of San Francisco to Bodega Bay, where Mitch spends the weekends with his mother Lydia and younger sister Cathy. Soon after her arrival, however, the birds in the area begin to act strangely. A seagull attacks Melanie as she is crossing the bay in a small boat, and then, Lydia finds her neighbor dead, obviously the victim of a bird attack. Soon, birds in the hundreds and thousands are attacking anyone they find out of doors. There is no explanation as to why this might be happening, and as the birds continue their vicious attacks, survival becomes the priority.", "genres": ["Horror"], "imdb": {"id": 56869, "rating": 7.8, "votes": 117977}, "languages": ["English"], "lastupdated": "2015-09-11 00:02:32.373000000", "num_mflix_comments": 2, "plot": "A wealthy San Francisco socialite pursues a potential boyfriend to a small Northern California town that slowly takes a turn for the bizarre when birds of all kinds suddenly begin to attack people there in increasing numbers and with increasing viciousness.", "poster": "https://m.media-amazon.com/images/M/MV5BMTAxNDA1ODc5MDleQTJeQWpwZ15BbWU4MDg2MDA4OTEx._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": -213408000000, "runtime": 119, "title": "The Birds", "tomatoes": {"consensus": "Proving once again that build-up is the key to suspense, Alfred Hitchcock successfully turned birds into some of the most terrifying villains in horror history.", "critic": {"meter": 96, "numReviews": 50, "rating": 8.1}, "dvd": 954201600000, "fresh": 48, "lastUpdated": 1442428191000, "production": "Universal Pictures", "rotten": 2, "viewer": {"meter": 83, "numReviews": 174897, "rating": 3.6}}, "type": "movie", "writers": ["Daphne Du Maurier (from the story by)", "Evan Hunter (screenplay)"], "year": 1963}