{"_id": "573a13b2f29313caabd390c1", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Jay Z", "Fonzworth Bentley", "Memphis Bleek", "Mary J. Blige"], "countries": ["USA"], "directors": ["Patrick Paulson", "Michael John Warren"], "fullplot": "An intimate look at hip-hop artist Shawn Carter, Jay-Z, revealing the multiple Grammy Award winning artist as never before, from his background and rise to fame to the recording of his last album. The film chronicles the legendary concert of Jay-Z's performance at Madison Square Garden in November 2003. In an unprecedented event, a hip-hop artist sold out an arena in only two hours. Nearly one year later, fans and artists alike still reflect on this monumental musical night. The event was a spectacular culmination of Jay-Z's recording career prior to his self-proclaimed retirement from solo performing. Yet this one night also defined a musical generation, showcasing the evolution and reach of the world's most popular music genre. Guest performers included Jay-Z's closest friends and music industry colleagues: Beyoncè, Mary J. Blige, Missy Elliott, R. Kelly, Foxy Brown, Pharrell, and Questlove and The Illadelphonics along with appearances by hip hop icons Damon Dash, Rick Rubin, Slick Rick, P. Diddy and many others. Viewers get the rare glimpse of Jay-Z's creative process as he searches for inspiration, poetry, and perfection in his songs. Narrated by Jay-Z, his account of the night takes on reflections of his entire musical career and his journey that led to this one astounding, fabled evening--rightfully called \"Fade To Black.\"", "genres": ["Documentary"], "imdb": {"id": 428518, "rating": 6.9, "votes": 847}, "languages": ["English"], "lastupdated": "2015-09-16 12:11:32.550000000", "metacritic": 59, "num_mflix_comments": 1, "plot": "Filmed during his \"Black Album\" era, Jay-Z looks back on his career as one of rap music's most successful emcees and entrepreneurs.", "poster": "https://m.media-amazon.com/images/M/MV5BMjAwMDI4NDkwN15BMl5BanBnXkFtZTcwMTQyMzcyMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1099612800000, "runtime": 109, "title": "Fade to Black", "tomatoes": {"boxOffice": "$1.0M", "critic": {"meter": 58, "numReviews": 12, "rating": 6.3}, "dvd": 1112659200000, "fresh": 7, "lastUpdated": 1441134685000, "production": "Paramount Classics", "rotten": 5, "viewer": {"meter": 90, "numReviews": 5611, "rating": 4}, "website": "http://www.jayzmovie.com/index2.html"}, "type": "movie", "year": 2004}