{"_id": "573a13d5f29313caabd9a396", "awards": {"nominations": 5, "text": "2 wins & 5 nominations.", "wins": 2}, "cast": ["Akshay Kumar", "John Abraham", "Chitrangda Singh", "Sanjay Dutt"], "countries": ["India"], "directors": ["Rohit Dhawan"], "fullplot": "Based in England, Nikhil Mathur is employed as an Investment Banker and has a idealist girlfriend in Radhika Awasthi. His friend, Jignesh Patel, works as a Security Guard in a mall and is the guardian of Veer, his late sister's son, and under close scrutiny of the Social Services Department. Global recession takes a toll on Nikhil - he not only loses his job but also his investments, while Jignesh gets fired for failing to prevent theft by a minor. Nikhil is unable to find employment and after Jignesh gets fired from yet another job, the duo end up working as male escorts with 'Desi Boyz' as Rocco and Hunter, and bring in enough income to keep them going. Radhika soon finds out and dumps Nikhil, while a Social Worker, Vikrant Mehra, takes custody of Veer and has him placed in a foster home. With their lives turned upside down, the duo blame each other and part company. Unable to even speak with Radhika, Nikhil is dismayed when he finds her in the company of a new boyfriend, Ajay Bapat. With the adverse publicity generated by their involvement as male escorts - and the recession holding strong - what will the duo do in a country where people, including educationists, racially profile ethnic minorities with impunity.", "genres": ["Comedy", "Drama"], "imdb": {"id": 1985981, "rating": 5.6, "votes": 6478}, "languages": ["Hindi", "Gujarati", "Panjabi", "English"], "lastupdated": "2015-08-26 00:32:33.103000000", "plot": "Two friends lose their jobs, then part bitterly after they get exposed as male escorts.", "poster": "https://m.media-amazon.com/images/M/MV5BOWQzYWExZGEtYzZmZS00ZWZlLWEwYWUtZTk1M2I3ZjViNDJlXkEyXkFqcGdeQXVyNjQ2MjQ5NzM@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 1322179200000, "title": "Desi Boyz", "tomatoes": {"boxOffice": "$1.1M", "lastUpdated": 1442082632000, "production": "Eros Entertainment", "viewer": {"meter": 42, "numReviews": 920, "rating": 3}, "website": "http://www.desiboyzthefilm.com/"}, "type": "movie", "writers": ["Rohit Dhawan (screenplay)", "Rohit Dhawan (story)", "Renuka Kunzru (dialogue)", "Milap Zaveri (additional screenplay)"], "year": 2011}