{"_id": "573a13a3f29313caabd0edd6", "awards": {"nominations": 4, "text": "4 nominations.", "wins": 0}, "cast": ["Margrèt èkadèttir", "Julie Anderson", "Anna Kristèn Arngrèmsdèttir", "Ilene Bergelson"], "countries": ["USA", "Iceland"], "directors": ["Hal Hartley"], "fullplot": "Beatrice works as a researcher at a sensationalist New York based media organization, although she is more often than not tasked with making coffee than anything else. Unlike her colleagues, she is shy, soft spoken and a Plain Jane of a woman. She convinces her cutthroat boss to send her on assignment to Iceland, where one of their camera crews, led by Beatrice's fiancè Jim, has gone missing, they who were investigating eyewitness accounts of what was largely seen as a long held urban myth of a medieval monster. En route to Iceland, Anna becomes the sole survivor of the plane crashing, her survival considered a miracle. She is quickly abandoned in Iceland by her boss, as she will not consent to become the media darling to tell the story of the crash, leaving her alone in her long physical and emotional recovery. Beatrice believes her emotional recovery can only be fulfilled by still finding out what happened to Jim, the camera crew who were last known to be in a remote and isolated community in northern Iceland. In the process, Beatrice gets embroiled in the story of the immortal monster, specifically in helping him locate a Dr. Artaud, who can help the monster fulfill what he believes is his true destiny. However, Beatrice's boss, who senses a sensational story, may thwart Beatrice and the monster's plans.", "genres": ["Comedy", "Drama", "Fantasy"], "imdb": {"id": 248190, "rating": 6.2, "votes": 3318}, "languages": ["English", "Icelandic"], "lastupdated": "2015-09-02 00:41:40.333000000", "metacritic": 36, "num_mflix_comments": 2, "plot": "\"No Such Thing\" tells the story of a young journalist who journeys to Iceland to find her missing fiancèe only to encounter a mythical creature. She eventually forges a relationship with the being.", "poster": "https://m.media-amazon.com/images/M/MV5BMTkxNTUzNzM0Nl5BMl5BanBnXkFtZTYwODY1NTc3._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1037318400000, "runtime": 102, "title": "No Such Thing", "tomatoes": {"critic": {"meter": 29, "numReviews": 42, "rating": 5}, "dvd": 1026172800000, "fresh": 12, "lastUpdated": 1440698871000, "production": "United Artists Films/ MGM", "rotten": 30, "viewer": {"meter": 59, "numReviews": 3476, "rating": 3.2}, "website": "http://www.mgm.com/nosuchthing"}, "type": "movie", "writers": ["Hal Hartley"], "year": 2001}