{"_id": "573a1394f29313caabcde86b", "awards": {"nominations": 2, "text": "Nominated for 1 Oscar. Another 10 wins & 2 nominations.", "wins": 11}, "cast": ["Toshirè Mifune", "Machiko Kyè", "Masayuki Mori", "Takashi Shimura"], "countries": ["Japan"], "directors": ["Akira Kurosawa"], "fullplot": "A priest, a woodcutter and another man are taking refuge from a rainstorm in the shell of a former gatehouse called Rashèmon. The priest and the woodcutter are recounting the story of a murdered samurai whose body the woodcutter discovered three days earlier in a forest grove. Both were summoned to testify at the murder trial, the priest who ran into the samurai and his wife traveling through the forest just before the murder occurred. Three other people who testified at the trial are supposedly the only direct witnesses: a notorious bandit named Tajèmaru, who allegedly murdered the samurai and raped his wife; the white veil cloaked wife of the samurai; and the samurai himself who testifies through the use of a medium. The three tell a similarly structured story - that Tajèmaru kidnapped and bound the samurai so that he could rape the wife - but which ultimately contradict each other, the motivations and the actual killing being what differ. The woodcutter reveals at Rashèmon that he knows more than he let on at the trial, thus bringing into question his own actions. But another discovery at Rashèmon and the resulting actions from the discovery bring back into focus the woodcutter's own humanity or lack thereof.", "genres": ["Crime", "Drama"], "imdb": {"id": 42876, "rating": 8.3, "votes": 91765}, "languages": ["Japanese"], "lastupdated": "2015-09-13 00:34:14.443000000", "num_mflix_comments": 1, "plot": "A heinous crime and its aftermath are recalled from differing points of view.", "poster": "https://m.media-amazon.com/images/M/MV5BMTk1MDU5MjQ5NF5BMl5BanBnXkFtZTgwMDM2OTE4MzE@._V1_SY1000_SX677_AL_.jpg", "rated": "UNRATED", "released": -568598400000, "runtime": 88, "title": "Rashomon", "tomatoes": {"lastUpdated": 1437072792000, "viewer": {"meter": 0, "numReviews": 29, "rating": 2.3}}, "type": "movie", "writers": ["Ryènosuke Akutagawa (stories)", "Akira Kurosawa (screenplay)", "Shinobu Hashimoto (screenplay)"], "year": 1950}