{"_id": "573a1399f29313caabcecf9f", "awards": {"nominations": 2, "text": "11 wins & 2 nominations.", "wins": 11}, "cast": ["Delbert Ward", "Roscoe Ward", "Lyman Ward", "Walt Geisler"], "countries": ["USA"], "directors": ["Joe Berlinger", "Bruce Sinofsky"], "fullplot": "This documentary by Joe Berlinger and Bruce Sinofsky details the murder trial of Delbert Ward. Delbert was a member of a family of four elderly brothers, working as semi-literate farmers and living together in isolation from the rest of society until William's death. A police investigation and Medical Examiner's autopsy suggested that Bill may not have died from natural causes and Delbert was arrested on charges of Second-Degree Murder. Under questioning by police, Delbert appears to have waived his rights and signed a confession, but this film suggests that he may not have been competent to do so. The film explores possible motives for the crime, from 'mercy-killing' (Bill was ill at the time) to progressively more bizarre hypotheses. It also shows how residents of the rural community of Munnsville, NY rallied to the support of one of their own residents (previously considered a social outcast), against what they felt were intrusive 'big-city' police and District Attorney tactics.", "genres": ["Documentary", "Crime", "Mystery"], "imdb": {"id": 103888, "rating": 7.7, "votes": 2785}, "languages": ["English"], "lastupdated": "2015-08-31 00:35:13.560000000", "num_mflix_comments": 1, "plot": "This documentary by Joe Berlinger and Bruce Sinofsky details the murder trial of Delbert Ward. Delbert was a member of a family of four elderly brothers, working as semi-literate farmers ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTU4ODU1NDQyNl5BMl5BanBnXkFtZTcwOTg3NzUxMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 715996800000, "runtime": 104, "title": "Brother's Keeper", "tomatoes": {"critic": {"meter": 100, "numReviews": 17, "rating": 8.5}, "dvd": 1059436800000, "fresh": 17, "lastUpdated": 1440008157000, "production": "American Playhouse", "rotten": 0, "viewer": {"meter": 89, "numReviews": 1984, "rating": 4.1}}, "type": "movie", "year": 1992}