{"_id": "573a13b8f29313caabd4c1d0", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Lei Hao", "Xiaodong Guo", "Xueyun Bai", "Lin Cui"], "countries": ["China", "France"], "directors": ["Ye Lou"], "fullplot": "Country girl Yu Hong leaves her village, her family and her lover to study in Beijing. At university, she discovers an intense world of sexual freedom and forbidden pleasure. Enraptured, compulsive, she falls madly in love with fellow student Zhou Wei. Driven by obsessive passions they can neither understand nor control, their relationship becomes one of dangerous games - betrayals, recriminations, provocations - as all around them, their fellow students begin to demonstrate, demanding democracy and freedom. Protests collapse, and Yu and Zhou lose each other amidst the social chaos and panicked crowds. Zhou Wei is sent to a summer military camp, and on his release moves to Berlin, fleeing both his country and memories of Yu. She finds a job, a lover, but can not forget Zhou. In Germany, social unrest is mounting: calls for freedom, demonstrations for democracy. A familiar story for Zhou. Weary, still haunted by Yu, he returns to China as the Berlin Wall crashes down. He finds her at last, in a small town. From evening to dawn, their future stretches before them, two changed souls in a changed world.", "genres": ["Drama", "Romance"], "imdb": {"id": 794374, "rating": 7, "votes": 1859}, "languages": ["Mandarin", "German"], "lastupdated": "2015-08-29 00:38:37.187000000", "metacritic": 79, "num_mflix_comments": 1, "plot": "Country girl Yu Hong leaves her village, her family and her lover to study in Beijing. At university, she discovers an intense world of sexual freedom and forbidden pleasure. Enraptured, ...", "poster": "https://m.media-amazon.com/images/M/MV5BODE0MjI5MGMtZjg0Yi00MzI5LWExNzMtZGNlNWI3ZjhiMDRhXkEyXkFqcGdeQXVyMjQ2MTk1OTE@._V1_SY1000_SX677_AL_.jpg", "released": 1176854400000, "runtime": 158, "title": "Summer Palace", "tomatoes": {"consensus": "Though it suffers from excessive length and inconsistent pacing, Summer Palace is held aloft by Hao Lei's riveting performance.", "critic": {"meter": 74, "numReviews": 31, "rating": 6.2}, "dvd": 1205193600000, "fresh": 23, "lastUpdated": 1437934290000, "production": "Palm Pictures", "rotten": 8, "viewer": {"meter": 58, "numReviews": 1705, "rating": 3.4}, "website": "http://www.ocean-films.com/unejeunessechinoise/"}, "type": "movie", "writers": ["Ye Lou", "Yingli Ma", "Feng Mei"], "year": 2006}