{"_id": "573a1394f29313caabcdf069", "awards": {"nominations": 0, "text": "Nominated for 1 Oscar. Another 1 win.", "wins": 2}, "cast": ["Helen Hayes", "Van Heflin", "Dean Jagger", "Robert Walker"], "countries": ["USA"], "directors": ["Leo McCarey"], "fullplot": "John Jefferson comes home from a trip overseas a strangely changed man. His already nervous wreck of a mother is distraught by the way he seems to be feigning feelings for her and his father that he no longer has. Plus, his odd refusal to accompany the family to church on Sunday not only disturbs her but their priest as well. He also seems to be making fun of and smirking at his father's jubilant expressions of patriotism. His poor mother cannot imagine what could have caused such a change in her favorite son, who used to be loving and church-going and now seems remote from both. He also gets strange calls and goes off to strange \"meetings\" with no explanation. He is also being watched by an FBI agent who comes to the home and greatly disturbs John's mother with his odd questions about him. Eventually the horrible truth comes out: John is a Communist spy! No wonder he has no real feelings for his family and shuns the church he once loved!During a high-speed chase, John is killed, but he had previously recorded an address to the graduating class of his alma mater, warning them of the temptations of Communist recruiters, which his mother and father listen to fondly as the leave the graduation, hoping that the students he posthumously addressed will take heed of his warning.", "genres": ["Drama"], "imdb": {"id": 44941, "rating": 5.6, "votes": 391}, "languages": ["English"], "lastupdated": "2015-04-21 00:33:40.103000000", "plot": "The Jeffersons are the ideal picture-perfect all-American family of the McCarthy era, except that \"son John\" is gay, an atheist, and a liberal. The parents obviously suspect he's a Communist spy.", "poster": "https://m.media-amazon.com/images/M/MV5BMjIxNTk4NzQ0NV5BMl5BanBnXkFtZTcwNTcxNzQyMg@@._V1_SY1000_SX677_AL_.jpg", "released": -559612800000, "runtime": 122, "title": "My Son John", "tomatoes": {"critic": {"meter": 60, "numReviews": 5, "rating": 5.6}, "fresh": 3, "lastUpdated": 1434916738000, "rotten": 2, "viewer": {"meter": 10, "numReviews": 73, "rating": 2.9}}, "type": "movie", "writers": ["Myles Connolly", "John Lee Mahin (adaptation)", "Leo McCarey (screenplay)", "Leo McCarey (story)"], "year": 1952}