{"_id": "573a1395f29313caabce11ef", "awards": {"nominations": 0, "text": "3 wins.", "wins": 3}, "cast": ["Setsuko Hara", "Yèko Tsukasa", "Mariko Okada", "Keiji Sada"], "countries": ["Japan"], "directors": ["Yasujirè Ozu"], "fullplot": "Family and friends of the late Shuzo Miwa have gathered for his annual memorial service, this one marking the seventh anniversary of his passing. Three of his long time friends - married Shuzo Taguchi, married Soichi Mamiya, and widowed Seiichiro Hirayama - have long known and admitted to each other that they have always been attracted to his widow, Akiko Miwa, who they believe has gotten even more beautiful as she has matured. The three friends take it upon themselves to find a husband for the Miwa's now twenty-four year old daughter, Ayako Miwa, who they believe as beautiful as her mother, and who, as a pure innocent, deserves a good husband. Their self-appointed task is despite them knowing that Ayako does not want them to do so. She doesn't want to get married, at least not yet, as she struggles with her traditional sensibilities in post-war modern Japan. Her first priority as she sees it is to take care of her widowed mother, who would be alone if she were to get married. The differing wants between Akiko, Ayako and the three men are ultimately at odds with each other, and places their relationships on tenterhooks. Ayako's best friend and work colleague Yukiko Sasaki, seeing what is happening, takes it upon herself to ensure that her friend and her friend's mother get what they want from their life following Shuzo's death.", "genres": ["Comedy", "Drama"], "imdb": {"id": 53579, "rating": 8.3, "votes": 2342}, "languages": ["Japanese"], "lastupdated": "2015-08-24 01:13:36.103000000", "num_mflix_comments": 1, "plot": "A widow tries to marry off her daughter with the help of her late husband's three friends.", "poster": "https://m.media-amazon.com/images/M/MV5BOTRkODlmOTAtYzRmNC00MWE5LThhNTUtM2JmMDk0ZGQ3YTYxXkEyXkFqcGdeQXVyMTIyNzY1NzM@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 120960000000, "runtime": 128, "title": "Late Autumn", "tomatoes": {"critic": {"meter": 100, "numReviews": 15, "rating": 8.3}, "dvd": 1181606400000, "fresh": 15, "lastUpdated": 1441047301000, "production": "CJ Entertainment", "rotten": 0, "viewer": {"meter": 87, "numReviews": 770, "rating": 4.1}}, "type": "movie", "writers": ["Ton Satomi (novel)", "Kègo Noda (screenplay)", "Yasujirè Ozu (screenplay)"], "year": 1960}