{"_id": "573a13b5f29313caabd45108", "awards": {"nominations": 3, "text": "11 wins & 3 nominations.", "wins": 11}, "cast": ["Rajinikanth", "Shriya Saran", "Suman", "Vivek"], "countries": ["India"], "directors": ["S. Shankar"], "fullplot": "Held in a cell, Sivaji reflects how he came to be under police scrutiny and his subsequent arrest for a variety of economic offenses. He had returned to Chennai from the U.S. to live with his parents and maternal uncle, and had hoped to invest money in colleges and hospitals so that people who are not privileged can benefit - much to the chagrin of a sophisticated goon, Adisheshan, who threatens him, and asks him not to tread on his territory. Disregarding this and hoping to get his projects going, Sivaji runs into bureaucratic corruption and red-tape - so much so that he gives in and bribes an official Rs.4 Crores to complete his Rs.200 Crore project. An enraged Adisheshan has the local politician stop the work, but Sivaji bribes the latter Rs.50 Crores, after liquefying most of his assets. While he is busy wooing and attempting to marry Tamizhselvi/Vidyabharti Ramlingam, a new politician takes over, stops his project, and demands another Rs.50 Crores. Unable to come up with the money, Sivaji takes the matter to Court but loses, and is rendered penniless. To make matters even worse, Tamizhselvi refuses to marry him as astrologically they are not compatible. While recalling these incidents, betrayed by the person he trusted, there is very little he can do but accept the fate that his opponents have decided for him.", "genres": ["Action", "Adventure", "Drama"], "imdb": {"id": 479751, "rating": 7.4, "votes": 7920}, "languages": ["Tamil", "Hindi", "English"], "lastupdated": "2015-09-02 00:04:59.773000000", "num_mflix_comments": 1, "plot": "Corrupt police and politicians target a computer engineer for trying to better the lives of less privileged citizens.", "poster": "https://m.media-amazon.com/images/M/MV5BYzdhMDM0NzItY2EyOC00YWMyLTgxNmMtODNhNjI1NDEzNGRkXkEyXkFqcGdeQXVyOTk3NTc2MzE@._V1_SY1000_SX677_AL_.jpg", "released": 1181865600000, "runtime": 188, "title": "Sivaji", "tomatoes": {"lastUpdated": 1441050881000, "production": "A.V.M. Productions", "viewer": {"meter": 81, "numReviews": 4430, "rating": 4.1}}, "type": "movie", "writers": ["S. Shankar (story)", "Sujatha (dialogue)"], "year": 2007}