{"_id": "573a1399f29313caabcec031", "awards": {"nominations": 2, "text": "Nominated for 1 Golden Globe. Another 1 nomination.", "wins": 0}, "cast": ["Michael Caine", "Cheryl Ladd", "Joss Ackland", "Ronald Pickup"], "countries": ["UK", "USA"], "directors": ["David Wickes"], "fullplot": "Henry Jekyll is a troubled man. His wife died of pneumonia. He wants his sister-in-law, but her father forbids any contact. And his experiments into the dual nature of man have yielded a personality-splitting drug that he has tested on himself, changing him into an uninhibited brute who seeks violent and undignified pleasures. Jekyll quickly becomes addicted to the sordid freedom induced by the drug. He can commit the most enjoyably revolting deeds, then return to his laboratory and use an antidote to change back to his original form, so that his lofty persona remains untarnished. But Jekyll's forbidden affair with his sister-in-law becomes a scandal, and with the growing rage within him, his other self no longer needs the drug for release. As Jekyll loses control of his transformations and his antidote becomes less effective, the police begin to suspect his part in his alter-ego's increasing violence.", "genres": ["Horror", "Thriller"], "imdb": {"id": 99875, "rating": 6.2, "votes": 715}, "languages": ["English"], "lastupdated": "2015-08-03 00:12:37.460000000", "num_mflix_comments": 2, "plot": "Henry Jekyll is a troubled man. His wife died of pneumonia. He wants his sister-in-law, but her father forbids any contact. And his experiments into the dual nature of man have yielded a ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTQ4OTI3MjYzOF5BMl5BanBnXkFtZTcwODg0MzMzMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 632880000000, "runtime": 96, "title": "Jekyll & Hyde", "tomatoes": {"dvd": 1023667200000, "lastUpdated": 1439232191000, "production": "Trimark", "viewer": {"meter": 52, "numReviews": 297, "rating": 3.4}}, "type": "movie", "writers": ["Robert Louis Stevenson (novel)", "David Wickes"], "year": 1990}