{"_id": "573a13b1f29313caabd37f06", "awards": {"nominations": 8, "text": "14 wins & 8 nominations.", "wins": 14}, "cast": ["Seung-yeon Lee", "Hyun-kyoon Lee", "Hyuk-ho Kwon", "Jeong-ho Choi"], "countries": ["South Korea", "Japan"], "directors": ["Ki-duk Kim"], "fullplot": "The lonely and silent rider Tae-suk breaks in empty houses and lives a normal life while the owners are traveling. He does not steal anything and moves from house to house without any loss other than food, and he cleans the houses, provides small repairs or washes some clothes to pay for the hospitality. When he enters in the house of Sun-hwa, he does not see the woman that is wounded in her room after being beaten up on by her abusive husband Min-gyu Lee. Tae-suk helps the hurt woman and when Min-gyu returns, he hits the husband with golf balls and Sun-hwa leaves her husband with Tae-suk on his motorcycle. When they break in the house of an old man, they find that the man is dead and Tae-suk provides funeral service for him. However, his son returns and Tae-suk and Sun-hwa are arrested by two abusive police detectives. He is sent to prison and Sun-hwa is forced to return home. But she never forgets him.", "genres": ["Crime", "Drama", "Romance"], "imdb": {"id": 423866, "rating": 8.1, "votes": 36056}, "languages": ["Korean"], "lastupdated": "2015-09-01 00:19:47.443000000", "metacritic": 72, "plot": "A transient young man breaks into empty homes to partake of the vacationing residents' lives for a few days.", "poster": "https://m.media-amazon.com/images/M/MV5BMTM1ODIwNzM5OV5BMl5BanBnXkFtZTcwNjk5MDkyMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1097798400000, "runtime": 88, "title": "3-Iron", "tomatoes": {"boxOffice": "$0.2M", "consensus": "A tender and moving romance from Spring, Summer, Fall, Winter... And Spring's director Kim Ki-Duk.", "critic": {"meter": 87, "numReviews": 90, "rating": 7.4}, "dvd": 1125964800000, "fresh": 78, "lastUpdated": 1440096830000, "production": "Sony Pictures Classics", "rotten": 12, "viewer": {"meter": 94, "numReviews": 23430, "rating": 4.3}, "website": "http://www.sonyclassics.com/3iron/"}, "type": "movie", "writers": ["Ki-duk Kim"], "year": 2004}