{"_id": "573a13c2f29313caabd668dd", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Jamie Lee Curtis", "Bill Logan", "Vandana Shiva", "Fritjof Capra"], "countries": ["USA"], "directors": ["Bill Benenson", "Gene Rosow", "Eleonore Dailly"], "fullplot": "A look at man's relationship with Dirt. Dirt and humans couldn't be closer. We started our journey together as stardust, swirled by cosmic forces into our galaxy, solar system, and planet. We are made of the same stuff. Four billion years of evolution created dirt as the living source of all life on Earth including humans. Dirt has given us food, shelter, fuel, medicine, ceramics, flowers, cosmetics and color --everything needed for our survival. For most of the last ten thousand years we humans understood our intimate bond with dirt and the rest of nature. We took care of the soils that took care of us. But, over time, we lost that connection. Our species became greedy and careless. We still depend on dirt, but now we abuse and ignore it. We are destroying our last natural resource with our agriculture, our mining, and our paving over the planet for cities. We turned dirt into something \"dirty.\" In doing so, we transform the skin of the earth into a hellish and dangerous landscape for all life on earth. A millennial shift in consciousness about the environment offers a beacon of hope - and practical solutions. Around the globe, pioneers are coming together to save earth's last natural resource. Tiny villages rise up to battle giant corporations slaughtering their land. Scientists discover connections with soil that can balance global warming. Generation X brands organic farming as trendy and children begin to eat from edible school yards. Inmates find inner peace and job skills in a prison horticulture program. Medical researchers explore dirt's capacity to provide solutions to such devastating health crises as AIDS. Major religions are rediscovering the reverence for the natural world that unites them all. Uses animation, vignettes, personal accounts and story telling.", "genres": ["Documentary"], "imdb": {"id": 1243971, "rating": 7.2, "votes": 368}, "languages": ["English"], "lastupdated": "2015-08-07 00:06:14.007000000", "num_mflix_comments": 2, "plot": "The only remedy for disconnecting people from the natural world is connecting them to it again.", "poster": "https://m.media-amazon.com/images/M/MV5BMTgyNjg4NTQ3OF5BMl5BanBnXkFtZTcwNTc2ODk3Mg@@._V1_SY1000_SX677_AL_.jpg", "runtime": 86, "title": "Dirt! The Movie", "tomatoes": {"dvd": 1270512000000, "lastUpdated": 1441994293000, "production": "Docurama", "viewer": {"meter": 68, "numReviews": 143, "rating": 4}}, "type": "movie", "year": 2009}