{"_id": "573a1398f29313caabcead96", "awards": {"nominations": 1, "text": "2 wins & 1 nomination.", "wins": 2}, "cast": ["Lynda Barry", "Charles Burns", "Sue Coe", "Robert Crumb"], "countries": ["Canada", "USA"], "directors": ["Ron Mann"], "fullplot": "In the 20th century, no artistic medium in North America with so much potential for creative expression has had a more turbulent history plagued with less respect than comic books. Through animated montages, readings and interviews, this film guides us through the history of the medium from the late 1930s and 1940s with the first explosion of popularity with the superheroes created by great talents like Jack Kirby and hitting its first artistic zenith with Will Eisner's \"Spirit\". It then shifts to the post war comics world with the rising popularity of crime and horror comics, especially those published by EC Comics under the editorshiop of William B. Gaines until it came crashing down the rise of censorship with the imposition of the Comics Code. In its wake of the devastation of the medium's creative freedom, we also explore EC's defiant survival with the creation of the singular \"Mad Magazine\" by Harvey Kurtzman. We then move to the resurgence of the superheroes in the late 1950's and 1960's typified with the rise of the dramatically innovative Marvel Comics edited by Stan Lee. Still more important is the rise of the the gleefully uninhibited underground comics created by eccentric talents like Robert Crumb and Dan O'Neill. These leads to profiles of creaters like Harvey Pekar who take the medium into new directions of expression. In the late 1970s and '80s we see the rise of alternative comics with such bold talents like Jaime Hernèndez for \"Love and Rockets, Sue Coe for How to Commit Suicide in South Africa and especially for Art Spiegelman for his searing Pulitizer Prize winning Holocaust account, Maus. Finally, we learn of the medium's superhero mythos' revitalizing moment with the creation of Frank Miller's ferocious min-series \"Batman: The Dark Knight Returns\". Taken together, the film makes its arguement that the medium is far more than the stereotype of juvenile trash but rather it is an artform with a wild history and an exciting future.", "genres": ["Documentary", "History"], "imdb": {"id": 94897, "rating": 7, "votes": 690}, "languages": ["English"], "lastupdated": "2015-09-17 02:38:54.863000000", "num_mflix_comments": 1, "plot": "A survey of the artistic history of the comic book medium and some of the major talents associated with it.", "poster": "https://m.media-amazon.com/images/M/MV5BZTVjNzkxOWMtMTEwMy00Y2MwLWIxZjUtYzY2ODc1OGRjYTExL2ltYWdlXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "UNRATED", "released": 609638400000, "runtime": 90, "title": "Comic Book Confidential", "tomatoes": {"critic": {"meter": 75, "numReviews": 8, "rating": 7}, "dvd": 1027296000000, "fresh": 6, "lastUpdated": 1438714825000, "production": "New Video Group", "rotten": 2, "viewer": {"meter": 64, "numReviews": 433, "rating": 3.5}, "website": "http://www.strandreleasing.com"}, "type": "movie", "writers": ["Charles Lippincott", "Ron Mann"], "year": 1988}