{"_id": "573a1396f29313caabce50e8", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Elliott Gould", "Nina van Pallandt", "Sterling Hayden", "Mark Rydell"], "countries": ["USA"], "directors": ["Robert Altman"], "fullplot": "In the middle of the night, private eye Philip Marlowe drives his friend Terry Lennox to the Mexican border. When Marlowe returns home police are waiting for him and learns that Terry's wife Sylvia has been killed. He's arrested as an accessory but released after a few days and is told the case is closed since Terry Lennox has seemingly committed suicide in Mexico. Marlowe is visited by mobster Marty Augustine who wants to know what happened to the $350,000 Lennox was supposed to deliver for him. Meanwhile, Marlowe is hired by Eileen Wade to find her husband Roger who has a habit of disappearing when he wants to dry out but she can't find him in any any of his usual haunts. He finds him at Dr. Veringer's clinic and brings him. It soon becomes obvious to Marlowe that Terry's death, the Wades and Augustine are all somehow interconnected. Figuring out just what those connections are however will be anything but easy.", "genres": ["Crime", "Drama", "Thriller"], "imdb": {"id": 70334, "rating": 7.7, "votes": 16663}, "languages": ["English"], "lastupdated": "2015-08-26 01:07:32.383000000", "plot": "Detective Philip Marlowe tries to help a friend who is accused of murdering his wife.", "poster": "https://m.media-amazon.com/images/M/MV5BYzZhODNiOWYtMmNkNS00OTFhLTkzYzktYTQ4ZmNmZWMyN2ZiL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 100310400000, "runtime": 112, "title": "The Long Goodbye", "tomatoes": {"consensus": "The Long Goodbye is a cool as ice mystery that retains Robert Altman's idiosyncratic sensibilities.", "critic": {"meter": 96, "numReviews": 28, "rating": 8.2}, "dvd": 1416873600000, "fresh": 27, "lastUpdated": 1442258563000, "production": "United Artists", "rotten": 1, "viewer": {"meter": 88, "numReviews": 9826, "rating": 4}}, "type": "movie", "writers": ["Leigh Brackett (screenplay)", "Raymond Chandler (novel)"], "year": 1973}