{"_id": "573a1392f29313caabcd987c", "awards": {"nominations": 4, "text": "Won 1 Oscar. Another 3 nominations.", "wins": 0}, "cast": ["Jackie Cooper", "Robert Coogan", "Mitzi Green", "Jackie Searl"], "countries": ["USA"], "directors": ["Norman Taurog"], "fullplot": "Precocious adolescent Skippy Skinner spends most of his time trying to get around doing those things that his parents want him to do (like brush his teeth), while doing those things his parents don't want him to do. Chief among the latter is spending time across the railroad tracks in Shantytown, instead of playing with \"clean\" neighborhood kids like brother and sister Sidney and Eloise. Skippy's father, Dr. Herbert Skinner, the city's head of the health board, in particular doesn't like Skippy spending time there as Dr. Skinner is a verminophobe, and believes Shantytown is dirty and unhealthy. On Skippy's latest visit to Shantytown when he meets a new friend named Sooky Wayne, he learns that Shantytown is being torn down and its poor residents have to move. And Sooky's mongrel and unlicensed (since Mrs. Wayne can't afford the $3 license fee) dog Penny is captured by the city's dog catcher. As Skippy does whatever he can to raise the $3 to get Penny back for his new friend (which includes breaking into his piggy bank, holding a variety show for the Shantytown kids, and trying to ask his father for the money), Skippy learns that one person seems to be responsible for both these problems in his life, which makes the already tenuous relationship with this person even more tenuous.", "genres": ["Family", "Drama", "Comedy"], "imdb": {"id": 22397, "rating": 6.3, "votes": 372}, "languages": ["English"], "lastupdated": "2015-07-13 00:05:22.090000000", "num_mflix_comments": 1, "plot": "Skippy, the mischievous son of a wealthy doctor, meets Sooky in poverty-ridden Shantytown, and together they try to save Sooky's pet from a cruel dogcatcher.", "poster": "https://m.media-amazon.com/images/M/MV5BMTg0Mzc1OTg4NF5BMl5BanBnXkFtZTcwMDM1MjQxMw@@._V1_SY1000_SX677_AL_.jpg", "released": -1220918400000, "runtime": 85, "title": "Skippy", "tomatoes": {"critic": {"meter": 100, "numReviews": 6, "rating": 7}, "fresh": 6, "lastUpdated": 1441912473000, "production": "Paramount Pictures", "rotten": 0, "viewer": {"meter": 54, "numReviews": 295, "rating": 3.3}}, "type": "movie", "writers": ["Percy Crosby (comic strip)", "Joseph L. Mankiewicz", "Don Marquis (additional dialogue)", "Norman Z. McLeod", "Sam Mintz"], "year": 1931}