{"_id": "573a13c3f29313caabd6a308", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Sylvester Stallone", "Sung Kang", "Sarah Shahi", "Adewale Akinnuoye-Agbaje"], "countries": ["USA"], "directors": ["Walter Hill"], "fullplot": "In New Orleans, the hit men James Bonomo, a.k.a. Jimmy Bobo, and Louis Blanchard execute the dirty cop Hank Greely in a hotel room. But they are betrayed and Louis is stabbed in a bar by the mercenary Keegan while waiting for the payment of the contract. Meanwhile the Washington D.C. police detective Taylor Kwon comes to New Orleans to investigate the murder of Greely, who had stolen evidences from the Police Department. Soon he is shot by two dirty detectives but Jimmy saves his life. Jimmy brings Taylor to the shop of his daughter Lisa and she removes the bullet from his shoulder and nurses him. Taylor and Jimmy form the most unlikely partnership to investigate the crimes and after contacting the intermediate Ronnie Earl that had hired Jimmy and Louis, they discover a network of corruption formed by the lawyer Marcus Baptiste and the entrepreneur Robert Nkomo Morel.", "genres": ["Action", "Crime", "Thriller"], "imdb": {"id": 1308729, "rating": 5.7, "votes": 36884}, "languages": ["English"], "lastupdated": "2015-09-10 17:09:36.867000000", "metacritic": 48, "num_mflix_comments": 1, "plot": "After watching their respective partners die, a New Orleans hitman and a Washington D.C. detective form an alliance in order to bring down their common enemy.", "poster": "https://m.media-amazon.com/images/M/MV5BMTM4NzUyMjk2NV5BMl5BanBnXkFtZTcwOTUxNDc5OA@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1359676800000, "runtime": 92, "title": "Bullet to the Head", "tomatoes": {"boxOffice": "$9.5M", "consensus": "Bullet to the Head's unapologetically trashy thrills evoke memories of its star and director's proud cinematic pasts -- but sadly, those memories are just about all it has to offer.", "critic": {"meter": 46, "numReviews": 132, "rating": 5}, "dvd": 1373932800000, "fresh": 61, "lastUpdated": 1442138578000, "production": "Warner Bros. Pictures", "rotten": 71, "viewer": {"meter": 40, "numReviews": 27607, "rating": 3.1}, "website": "http://bullettothehead.warnerbros.com/index.html"}, "type": "movie", "writers": ["Alessandro Camon (screenplay)", "Alexis Nolent (based on the graphic novel \"Du plomb dans la tète\" by)", "Colin Wilson (based on the graphic novel \"Du plomb dans la tète\" illustrated by)"], "year": 2012}