{"_id": "573a13b8f29313caabd4c3c3", "awards": {"nominations": 74, "text": "Won 1 Oscar. Another 25 wins & 74 nominations.", "wins": 26}, "cast": ["Chris Pine", "Zachary Quinto", "Leonard Nimoy", "Eric Bana"], "countries": ["USA", "Germany"], "directors": ["J.J. Abrams"], "fullplot": "On the day of James Kirk's birth, his father dies on his ship in a last stand against a mysterious alien time-traveling vessel looking for Ambassador Spock, who, in this time, is also a child on Vulcan disdained by his neighbors for his half-human heritage. Twenty-five years later, Kirk has grown into a young troublemaker. Challenged by Captain Christopher Pike to realize his potential in Starfleet, he comes to annoy instructors like young Commander Spock. Suddenly, there is an emergency at Vulcan and the newly commissioned USS Enterprise is crewed with promising cadets like Nyota Uhura, Hikaru Sulu, Pavel Chekov and even Kirk himself, thanks to Leonard McCoy's medical trickery. Together, this crew will have an adventure in the final frontier where the old legend is altered forever as a new version of it begins.", "genres": ["Action", "Adventure", "Sci-Fi"], "imdb": {"id": 796366, "rating": 8, "votes": 471510}, "languages": ["English"], "lastupdated": "2015-09-04 00:41:12.133000000", "metacritic": 83, "num_mflix_comments": 411, "plot": "The brash James T. Kirk tries to live up to his father's legacy with Mr. Spock keeping him in check as a vengeful, time-traveling Romulan creates black holes to destroy the Federation one planet at a time.", "poster": "https://m.media-amazon.com/images/M/MV5BMjE5NDQ5OTE4Ml5BMl5BanBnXkFtZTcwOTE3NDIzMw@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1241740800000, "runtime": 127, "title": "Star Trek", "tomatoes": {"boxOffice": "$257.7M", "consensus": "Star Trek reignites a classic franchise with action, humor, a strong story, and brilliant visuals, and will please traditional Trekkies and new fans alike.", "critic": {"meter": 95, "numReviews": 329, "rating": 8.2}, "dvd": 1258416000000, "fresh": 312, "lastUpdated": 1441905169000, "production": "IMAX", "rotten": 17, "viewer": {"meter": 91, "numReviews": 742527, "rating": 4.1}, "website": "http://www.startrekmovie.com/"}, "type": "movie", "writers": ["Roberto Orci", "Alex Kurtzman", "Gene Roddenberry (television series \"Star Trek\")"], "year": 2009}