{"_id": "573a13adf29313caabd2a72d", "awards": {"nominations": 0, "text": "5 wins.", "wins": 5}, "cast": ["Gabriel Byrne", "Sam Keen", "Ron Leifer", "Robert Jay Lifton"], "countries": ["USA"], "directors": ["Patrick Shen"], "fullplot": "Narrated by Gabriel Byrne (Usual Suspects, Vanity Fair, Miller's Crossing), this seven-time Best Documentary award-winning film (Silver Lake Film Festival, Beverly Hills Film Festival) is the most comprehensive and mind-blowing investigation of humankind's relationship with death ever captured on film. Hailed by many viewers as a \"life-transformational film,\" Flight from Death uncovers death anxiety as a possible root cause of many of our behaviors on a psychological, spiritual, and cultural level. Following the work of the late cultural anthropologist, Ernest Becker, and his Pulitzer Prize-winning book Denial of Death, this documentary explores the ongoing research of a group of social psychologists that may forever change the way we look at ourselves and the world. Over the last twenty-five years, this team of researchers has conducted over 300 laboratory studies, which substantiate Becker's claim that death anxiety is a primary motivator of human behavior, specifically aggression and violence. Flight from Death features an all-star cast of scholars, authors, philosophers, and researchers including Sam Keen, Robert Jay Lifton, Irvin Yalom, and Sheldon Solomon culminating in a film that is \"not only thought-provoking but also entertaining and put together with a lot of class\" (Eric Campos, Film Threat). Three years in the making and beautifully photographed in eight different countries, Flight from Death is \"a stimulating, ultimately life-affirming film, filled with big ideas and revelatory footage\" (Jeff Shannon, Seattle Times).", "genres": ["Documentary"], "imdb": {"id": 365215, "rating": 7.6, "votes": 273}, "languages": ["English"], "lastupdated": "2015-03-15 01:33:43.917000000", "plot": "Flight from Death is the first film to investigate the psychological The effects of death anxiety are embedded within everything we do across Flight from Death is the culmination of many years of research and", "poster": "https://m.media-amazon.com/images/M/MV5BMTA1MDk0MjIzMjReQTJeQWpwZ15BbWU3MDEyNzMwMDE@._V1_SY1000_SX677_AL_.jpg", "runtime": 90, "title": "Flight from Death: The Quest for Immortality", "type": "movie", "writers": ["Greg Bennick", "Patrick Shen"], "year": 2003}