{"_id": "573a13bff29313caabd5e117", "awards": {"nominations": 60, "text": "Nominated for 5 Oscars. Another 14 wins & 60 nominations.", "wins": 19}, "cast": ["Steve Carell", "Channing Tatum", "Mark Ruffalo", "Sienna Miller"], "countries": ["USA"], "directors": ["Bennett Miller"], "fullplot": "Based on true events, Foxcatcher tells the dark and fascinating story of the unlikely and ultimately tragic relationship between an eccentric multi-millionaire and two champion wrestlers. When Olympic Gold Medal winning wrestler Mark Schultz (Channing Tatum) is invited by wealthy heir John du Pont (Steve Carell) to move on to the du Pont estate and help form a team to train for the 1988 Seoul Olympics at his new state-of-the-art training facility, Schultz jumps at the opportunity, hoping to focus on his training and finally step out of the shadow of his revered brother, Dave (Mark Ruffalo). Driven by hidden needs, du Pont sees backing Schultz's bid for Gold and the chance to \"coach\" a world-class wrestling team as an opportunity to gain the elusive respect of his peers and, more importantly, his disapproving mother (Vanessa Redgrave). Flattered by the attention and entranced by du Pont's majestic world, Mark comes to see his benefactor as a father figure and grows increasingly dependent on him for approval. Though initially supportive, du Pont's mercurial personality turns and he begins to lure Mark into an unhealthy lifestyle that threatens to undermine his training. Soon du Pont's erratic behavior and cruel psychological game-play begin to erode the athlete's already shaky self-esteem. Meanwhile du Pont becomes fixated on Dave, who exudes the confidence both he and Mark lack, knowing that these are things even his money cannot buy. Fueled by du Pont's increasing paranoia and alienation from the brothers, the trio is propelled towards a tragedy no one could have foreseen.", "genres": ["Biography", "Drama", "Sport"], "imdb": {"id": 1100089, "rating": 7.1, "votes": 86433}, "languages": ["English", "French"], "lastupdated": "2015-09-10 17:05:24.207000000", "metacritic": 81, "num_mflix_comments": 1, "plot": "The greatest Olympic Wrestling Champion brother team joins Team Foxcatcher led by multimillionaire sponsor John E. du Pont as they train for the 1988 games in Seoul - a union that leads to unlikely circumstances.", "poster": "https://m.media-amazon.com/images/M/MV5BMTQ2MjQxNjYxOV5BMl5BanBnXkFtZTgwMzIwODUxMzE@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1421366400000, "runtime": 134, "title": "Foxcatcher", "tomatoes": {"consensus": "A chilling true crime drama, Foxcatcher offers Steve Carell, Mark Ruffalo, and Channing Tatum a chance to shine -- and all three of them rise to the challenge.", "critic": {"meter": 88, "numReviews": 212, "rating": 7.9}, "dvd": 1425340800000, "fresh": 187, "lastUpdated": 1440871375000, "production": "Sony Pictures Classics", "rotten": 25, "viewer": {"meter": 66, "numReviews": 55261, "rating": 3.5}, "website": "http://sonyclassics.com/foxcatcher/"}, "type": "movie", "writers": ["E. Max Frye", "Dan Futterman"], "year": 2014}