{"_id": "573a1399f29313caabcee617", "awards": {"nominations": 12, "text": "Nominated for 1 Oscar. Another 11 nominations.", "wins": 0}, "cast": ["Robert De Niro", "Kenneth Branagh", "Tom Hulce", "Helena Bonham Carter"], "countries": ["USA", "Japan"], "directors": ["Kenneth Branagh"], "fullplot": "In 1794, in the Arctic Sea, Captain Robert Walton is a man obsessed to reach the North Pole, pushing his crew to exhaustion. When his ship hits an iceberg, it is stranded in the ice. Out of the blue, Captain Walton and his men overhear a dreadful cry and they see a stranger coming to the ship. He introduces himself and Victor Frankenstein and he tells to the captain the story of his life since he was a little boy in Geneva. Victor is a brilliant student and in love with his stepsister Elizabeth, an orphan that was raised by his father Baron Frankenstein. In 1793, Victor moves to Ingolstadt to study at the university and he promises to get married to Elizabeth. At the university, Victor befriends Henry Clerval who becomes his best friend. Victor gets close to Professor Waldman and decides to create life to cheat death, but Waldman advises him that he should not try this experiment since the result would be an abomination. When Waldman dies, Victor steals his notes and tries to create life. He succeeds and gives life to a strong Creature, composed of parts of deceased persons. However he realizes that his experiment is a mistake and he abandons the Creature expecting that it will die alone. However the Creature survives and learns how to read and write, but he is a monster rejected by society and his own creator. The Creature decides to seek revenge from Victor by killing everyone he loves.", "genres": ["Drama", "Horror", "Romance"], "imdb": {"id": 109836, "rating": 6.4, "votes": 40130}, "languages": ["English"], "lastupdated": "2015-08-28 00:20:30.253000000", "num_mflix_comments": 2, "plot": "When the brilliant but unorthodox scientist Victor Frankenstein rejects the artificial man that he has created, the Creature escapes and later swears revenge.", "poster": "https://m.media-amazon.com/images/M/MV5BOWNjMGQ2NTYtNWZlMS00Nzk4LWE5ZDQtNWFhZDk0ZWM3ODc4XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 783907200000, "runtime": 123, "title": "Mary Shelley's Frankenstein", "tomatoes": {"consensus": "Mary Shelley's Frankenstein is ambitious and visually striking, but the overwrought tone and lack of scares make for a tonally inconsistent experience.", "critic": {"meter": 39, "numReviews": 41, "rating": 5.5}, "dvd": 997142400000, "fresh": 16, "lastUpdated": 1442426041000, "production": "Sony Pictures Home Entertainment", "rotten": 25, "viewer": {"meter": 50, "numReviews": 53284, "rating": 3.1}}, "type": "movie", "writers": ["Mary Shelley (novel)", "Steph Lady (screenplay)", "Frank Darabont (screenplay)"], "year": 1994}