{"_id": "573a13b3f29313caabd3afac", "awards": {"nominations": 2, "text": "2 wins & 2 nominations.", "wins": 2}, "cast": ["Larry Berry", "Tommy the Clown", "Dragon", "La Nièa"], "countries": ["USA", "UK"], "directors": ["David LaChapelle"], "fullplot": "Reveals a groundbreaking dance phenomenon that's exploding on the streets of South Central, Los Angeles. Taking advantage of unprecedented access, this documentary film bring to first light a revolutionary form of artistic expression borne from oppression. The aggressive and visually stunning dance modernizes moves indigenous to African tribal rituals and features mind-blowing, athletic movement sped up to impossible speeds. We meet Tommy Johnson (Tommy the Clown), who first created the style as a response to the 1992 Rodney King riots and named it Clowning, as well as the kids who developed the movement into what they now call Krumping. The kids use dance as an alternative to gangs and hustling: they form their own troupe and paint their faces like warriors, meeting to outperform rival gangs of dancers or just to hone their skills. For the dancers, Krumping becomes a way of life--and, because it's authentic expression (in complete opposition to the bling-bling hip-hop culture), the dance becomes a vital part of who they are.", "genres": ["Documentary", "Music"], "imdb": {"id": 436724, "rating": 7.1, "votes": 2830}, "languages": ["English"], "lastupdated": "2015-09-05 00:40:47.307000000", "metacritic": 74, "num_mflix_comments": 2, "plot": "Rize chronicles a dance movement that rises out of South Central Los Angeles with roots in clowning and street youth culture.", "poster": "https://m.media-amazon.com/images/M/MV5BMTIyODcxNTA4OF5BMl5BanBnXkFtZTcwOTE1OTEzMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1119571200000, "runtime": 86, "title": "Rize", "tomatoes": {"boxOffice": "$3.3M", "consensus": "The dances in Rize are electric even if the documentary doesn't go that deeply into the performers' lives.", "critic": {"meter": 83, "numReviews": 90, "rating": 7}, "dvd": 1130198400000, "fresh": 75, "lastUpdated": 1442520361000, "production": "Lions Gate Films", "rotten": 15, "viewer": {"meter": 84, "numReviews": 8817, "rating": 4}, "website": "http://www.rizemovie.com/rize.html"}, "type": "movie", "year": 2005}