{"_id": "573a13d6f29313caabd9fe6f", "awards": {"nominations": 0, "text": "3 wins.", "wins": 3}, "cast": ["Mohan Agashe", "Vibhawari Deshpande", "Hrishikesh Joshi", "Abhijeet Khaire"], "countries": ["India"], "directors": ["Umesh Vinayak Kulkarni"], "fullplot": "In the rural areas of Maharashtra lies a peaceful village called Mangrul. One day Keshav (Girish Kulkarni), a village youth, sees lord Dattatrey (Datta) in his dreams while taking a nap under a tree. He makes a hue and cry in the village saying God made an appearance for him. Anna (Dilip Prabhavalkar), most respected figure of Mangrul, advises him against announcing such personal matter as it's a question of faith. However, it is too late as a journalist (Kishor Kadam) sensationalizes the news about Lord Dattatrey making an appearance in Mangrul. There is now a demand for a Dattatrey temple. Bhau (Nana Patekar), a political activist, doesn't approve it as he wants the funds to be used for better purposes but he seems helpless. The temple is built and the village becomes a holy place. Mangrul goes through a 360 degree change due to commercialization but nobody is complaining except Anna. Soon, blinded by the commercial progress, God is forgotten. Every village has a right to progress commercially but how ethical it is to use a temple and its God to achieve it? The question is raised by Writer Girish Kulkarni & Director Umesh Vinayak Kulkarni's latest offering 'Deool', without being judgemental. While it does this, the audience is treated to some quality cinematic experience which is enlightening.", "genres": ["Drama"], "imdb": {"id": 2085783, "rating": 8.2, "votes": 644}, "languages": ["Marathi"], "lastupdated": "2015-07-26 00:00:33.100000000", "plot": "Keshya, a simple villager believes that god has arrived in his village but everyone disbelieves him. Later when the politics plays its part things take a drastic change.", "poster": "https://m.media-amazon.com/images/M/MV5BMjI0Mzg3MTE3MV5BMl5BanBnXkFtZTcwNjc4NTU3Nw@@._V1_SY1000_SX677_AL_.jpg", "released": 1316044800000, "runtime": 135, "title": "The Temple", "tomatoes": {"lastUpdated": 1431457235000, "viewer": {"numReviews": 0, "rating": 0}}, "type": "movie", "writers": ["Girish Kulkarni (screenplay)"], "year": 2011}