{"_id": "573a13c1f29313caabd65206", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Parker Posey", "Demi Moore", "Peter Patrikios", "T. Ryder Smith"], "countries": ["USA"], "directors": ["Mitchell Lichtenstein"], "fullplot": "Jayne and Laura are about to take on the first man they just might not be able to handle: their seventy-something-year-old father Joe. Dutiful daughters returning to the house they grew up in, Jayne and Laura are forced to take a closer look at their own not-so-perfect lives while dodging childhood memories. Laura suspects that Joe needs full-time care, but Jayne hopes that their father's condition isn't that serious. Joe is still singing and playing his old guitar, and the lively widower even has a new \"ladyfriend,\" shameless and sassy Shelly. But as the visible moments of their father's impending senility increase, so do the dysfunctional family dynamics. Tensions flare as the close sisters must also juggle their own very different lives - Laura's busy schedule as an environmentalist and mother of two small children, and Jayne, desperate to finally have a baby with her workaholic art-dealing husband Jackson. Their adventures back home are not without magic, mischief and mayhem, and even a search for buried treasure in the backyard! Any tears that Jayne and Laura might shed will be happy ones.", "genres": ["Comedy", "Drama"], "imdb": {"id": 1219828, "rating": 5.3, "votes": 1103}, "languages": ["English", "French"], "lastupdated": "2015-09-15 04:48:48.057000000", "metacritic": 35, "num_mflix_comments": 1, "plot": "Two sisters, Jayne (Posey) and Laura (Moore), return home to deal with their ailing father Joe (Torn), only to face some surprising situations.", "poster": "https://m.media-amazon.com/images/M/MV5BNTk5OTcxMzI5NF5BMl5BanBnXkFtZTcwMzE3NTExMw@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1255651200000, "runtime": 92, "title": "Happy Tears", "tomatoes": {"consensus": "Replete with quirky indie cliches, Happy Tears wastes some fine performances from Demi Moore, Parker Posey, and Rip Torn on stale formula.", "critic": {"meter": 28, "numReviews": 32, "rating": 4.5}, "dvd": 1276560000000, "fresh": 9, "lastUpdated": 1441910996000, "production": "Roadside Attractions", "rotten": 23, "viewer": {"meter": 21, "numReviews": 1538, "rating": 2.4}, "website": "http://www.happytears.net/"}, "type": "movie", "writers": ["Mitchell Lichtenstein"], "year": 2009}