{"_id": "573a13a8f29313caabd1ce6e", "awards": {"nominations": 0, "text": "5 wins.", "wins": 5}, "cast": ["Luca Zingaretti", "Jèrème Anger", "Amanda Sandrelli", "Franco Castellano"], "countries": ["Italy", "France", "Sweden", "Hungary"], "directors": ["Alberto Negrin"], "fullplot": "It is the real story of Giorgio Perlasca (Luca Zingaretti). During the 1920s he was an Italian Fascist supporter, fighting in Africa an in the Spanish civil war where he deserved a safe conduct for Spanish embassies. After some years, disillusioned by fascism, he is a fresh supplier for the Italian army. In the war years he is in Budapest for his business. He lives an easy life there, well introduced into the Hungarian high society, without any problem coming from the war situation. When the Nazi occupied Hungary, in 1944, instead to leave (Italy had already surrendered to the Allies) he escaped to the Spanish embassy in Budapest using his old safe conduct and becoming a Spanish citizen, changing name into Jorge Perlasca. He starts working as a diplomat here. When Sanz Briz (Geza Tordy), the Spanish consul, is removed, Perlasca immediately substitutes him, like if he was officially appointed from Spanish authorities. All the Nazi, the Hungarian authorities believe him. In his new fake assignment, he starts immediately to hide, shield and feed a lot of Jews (thousands!) issuing Spanish (fake of course) safe conducts for the Jews of Sephardic origin. He is in contact with another Hero of that time, Raoul Wallenberg. The two, together with other volunteers, running incredible risks had saved thousands of Hungarian Jews from a tragic death. Incredibly Perlasca succeeded to save two boys directly from the hands of Adolf Eichmann at the train station. This hero, after the war, was completely forgotten, and his story comes out just in the 1980s because some of the Hungarian Jews wanted to meet him again.", "genres": ["Biography", "Drama", "History"], "imdb": {"id": 278017, "rating": 7.2, "votes": 384}, "languages": ["Italian"], "lastupdated": "2015-08-31 03:46:11.937000000", "metacritic": 56, "plot": "It is the real story of Giorgio Perlasca (Luca Zingaretti). During the 1920s he was an Italian Fascist supporter, fighting in Africa an in the Spanish civil war where he deserved a safe ...", "poster": "https://m.media-amazon.com/images/M/MV5BMjIxNzI1MzYyMl5BMl5BanBnXkFtZTgwODY4MTA2MDE@._V1_SY1000_SX677_AL_.jpg", "released": 1012176000000, "runtime": 104, "title": "Perlasca: The Courage of a Just Man", "tomatoes": {"critic": {"meter": 57, "numReviews": 7, "rating": 5.5}, "fresh": 4, "lastUpdated": 1437764366000, "production": "Castle Hill Productions", "rotten": 3, "viewer": {"meter": 62, "numReviews": 290, "rating": 3.5}}, "type": "movie", "writers": ["Enrico Deaglio (novel)", "Sandro Petraglia", "Stefano Rulli"], "year": 2002}