{"_id": "573a13cef29313caabd87469", "awards": {"nominations": 18, "text": "11 wins & 18 nominations.", "wins": 11}, "cast": ["Ricardo Darèn", "Muriel Santa Ana", "Ignacio Huang", "Enric Cambray"], "countries": ["Argentina", "Spain"], "directors": ["Sebastièn Borensztein"], "fullplot": "In Buenos Aires, the bitter and methodic Roberto is a lonely man and the owner of a hardware store. Roberto collects bizarre worldwide news in an album as a hobby and his acquaintance Mari has an unrequited love for him, but Roberto is always evasive. One day, Roberto sees a Chinese named Jun being expelled from a taxi while he is watching the landing of airplanes in the airport and he helps the man to stand up. Jun does not speak Spanish and shows a tattoo with an address on his arm. Roberto heads to the spot with Jun and discover that the place belonged to Jun's uncle that sold it three and half years ago. Roberto goes with Jun to the police station, to the China's embassy and to a Chinese neighborhood to seek out his uncle but it is a fruitless search. Roberto lodges Jun in his house and after a series of incidents, he finds a delivery boy to translate Jun and he learns the dramatic story of his life.", "genres": ["Comedy", "Drama"], "imdb": {"id": 1705786, "rating": 7.3, "votes": 10155}, "languages": ["Spanish", "Mandarin"], "lastupdated": "2015-08-23 00:05:59.030000000", "plot": "In Buenos Aires, the bitter and methodic Roberto is a lonely man and the owner of a hardware store. Roberto collects bizarre worldwide news in an album as a hobby and his acquaintance Mari ...", "poster": "https://m.media-amazon.com/images/M/MV5BNDUyODQ0MTcxNF5BMl5BanBnXkFtZTgwMDMxNjAzMTE@._V1_SY1000_SX677_AL_.jpg", "released": 1300924800000, "runtime": 93, "title": "Chinese Take-Out", "tomatoes": {"lastUpdated": 1438629203000, "production": "Aliwood Mediterraneo Producciones", "viewer": {"numReviews": 819, "rating": 3.8}, "website": "http://www.uncuentochino.com.ar/"}, "type": "movie", "writers": ["Sebastièn Borensztein"], "year": 2011}