{"_id": "573a1395f29313caabce217c", "awards": {"nominations": 2, "text": "4 wins & 2 nominations.", "wins": 4}, "cast": ["Nino Manfredi", "Emma Penella", "Josè Isbert", "Josè Luis Lèpez Vèzquez"], "countries": ["Spain", "Italy"], "directors": ["Luis Garcèa Berlanga"], "fullplot": "The history starts with the main character (an old executioner in the Spain of early 60's) approaching retirement age. As his profession is not exactly what you could call \"popular\", he (a very gentle and nice man, caring, and proud of traditions) begins to worry about who might take his place when he retires. He has a daughter, but, unfortunately, she seems doomed to perpetual \"spinsterhood\": as soon as any prospective groom learns about her dad and her dad's \"trade\", he runs away from her, scared. A sad life... However, a new character enters: the local undertaker, a handsome and young man who has exactly the same problem... No girl wants him given his profession. So, you have the woman whom almost nobody would marry and the man whom almost nobody would marry. Obviously, they are meant for each other. But here the old executioner has something to say: He does not object to her daughter marrying the young undertaker; he seems a decent man, and all that... But there is a condition: Only if the groom agrees to take the executioner's job when he will retire, will he agree to her daughter's marriage. And, anyway, as the old executioner says to the worried young man.... \"Don't worry, they sentence people, but, in the last moment, they're going to pardon them!\".", "genres": ["Drama", "Comedy"], "imdb": {"id": 57643, "rating": 8, "votes": 3084}, "languages": ["Spanish"], "lastupdated": "2015-08-25 00:21:57.353000000", "num_mflix_comments": 1, "plot": "An undertaker gets married to an old executioner's daughter and, although he doesn't like it, must continue the profession of his father-in-law after his retirement.", "poster": "https://m.media-amazon.com/images/M/MV5BNDZiZTM5ZjMtZDYzYi00MjBhLWIxMDMtYmUyMDcwZWI5Y2QxXkEyXkFqcGdeQXVyMjI4MjA5MzA@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": -185328000000, "runtime": 90, "title": "The Executioner", "tomatoes": {"lastUpdated": 1438803628000, "viewer": {"meter": 92, "numReviews": 447, "rating": 4.2}}, "type": "movie", "writers": ["Luis Garcèa Berlanga (story)", "Rafael Azcona (story)", "Luis Garcèa Berlanga (screenplay)", "Rafael Azcona (screenplay)", "Ennio Flaiano (screenplay)"], "year": 1963}