{"_id": "573a13e5f29313caabdc274c", "awards": {"nominations": 2, "text": "4 wins & 2 nominations.", "wins": 4}, "cast": ["Signe Baumane"], "countries": ["USA", "Latvia"], "directors": ["Signe Baumane"], "fullplot": "Latvia, the late 1920s. Anna, a young woman, pretty and educated, falls in love with an adventurous entrepreneur, 30 years her senior. But with marriage comes great jealousy, and the entrepreneur hides Anna away in the forest, far from other men, where she bears him eight children. The Great Depression hits them hard. Then Latvia is overrun with invasions by the Soviets, then the Nazis, then the Soviets once again. Anna is a pillar of strength, defying the hardships, raising her young, teaching them survival secrets of the forest. But something inside her is terribly wrong. Years later, Signe, a young artist, asks her father, \"how did my grandmother die?\" Her father is evasive. His seven siblings are evasive, as well. Signe strongly suspects that Anna committed suicide. Clues of mental illness had always leaked through the family stories. Signe suffers from depression herself. Her suicidal fantasies get her locked away for four months in a Soviet mental institute. Three of her cousins, all women, battle madness, as well. Could there be a link between Anna and the four granddaughters? Defying the stigma that silences so many, Signe takes us on a journey deep into her own depression where she looks to confront the family demons.", "genres": ["Animation", "Comedy", "Drama"], "imdb": {"id": 2961890, "rating": 7.5, "votes": 319}, "languages": ["English"], "lastupdated": "2015-08-18 00:30:23.797000000", "metacritic": 78, "num_mflix_comments": 2, "plot": "Signe Baumane and five women in her family battle with depression and madness.", "poster": "https://m.media-amazon.com/images/M/MV5BMTg0ODM3NDYwMF5BMl5BanBnXkFtZTgwNjAyODc3MTE@._V1_SY1000_SX677_AL_.jpg", "released": 1408665600000, "runtime": 88, "title": "Rocks in My Pockets", "tomatoes": {"boxOffice": "$22.5k", "critic": {"meter": 100, "numReviews": 19, "rating": 7.3}, "fresh": 19, "lastUpdated": 1440097321000, "production": "Zeitgeist Films", "rotten": 0, "viewer": {"meter": 74, "numReviews": 267, "rating": 3.9}, "website": "http://www.rocksinmypocketsmovie.com/"}, "type": "movie", "writers": ["Signe Baumane"], "year": 2014}