{"_id": "573a1395f29313caabce14da", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Van Heflin", "Charles Laughton", "Mylène Demongeot", "John Ericson"], "countries": ["Italy", "USA"], "directors": ["Duilio Coletti"], "fullplot": "In 1941, the British Admiralty is worried about the large number of Allied ships being destroyed in the Pacific Ocean by a mysterious enemy vessel. Initially, British Admiral Russell suspects that a German submarine is the culprit. However, the few revealed pieces of the mystery puzzle rather point to a German Navy surface warship.The British don't know it yet but the enemy ship in question is the German Navy raider Atlantis commanded by Captain Reger.His success in sneaking upon unsuspecting enemy vessels is due in large part on Atlantis' ability to disguise itself in a benign, non-combatant, neutral ship.To achieve this ruse, the Atlantis uses props, camouflage, paint, fake foreign flags and even theatrical costumes for its crew to make itself appear something it's not.When Atlantis is close to its prey, it reveals its true identity and opens fire sinking the duped victim. Finally realizing the truth, British Admiral Russell decides to set traps in order to persuade Atlantis to reveal its position to a task-force of British warships laying in ambush.But first, Admiral Russell must gain Atlantis' confidence by pretending he's sending his messages from the German Navy High Command.It won't be easy, since the German Navy uses a Flower Grid Code Map to arrange contacts between its various ships. A game of cat and mouse begins.", "genres": ["Drama", "War"], "imdb": {"id": 54328, "rating": 6.5, "votes": 315}, "languages": ["English"], "lastupdated": "2015-08-30 01:01:03.130000000", "num_mflix_comments": 1, "plot": "German raider, using various disguises, forces british ship to surrender. Story told from German point of view.", "poster": "https://m.media-amazon.com/images/M/MV5BZWZlZTNlODctZjc5MS00MTY5LWIyOTEtMDNiM2VkZDUzZmRjXkEyXkFqcGdeQXVyNjQzNDI3NzY@._V1_SY1000_SX677_AL_.jpg", "released": -293328000000, "runtime": 92, "title": "Under Ten Flags", "tomatoes": {"dvd": 1112054400000, "lastUpdated": 1441914618000, "viewer": {"meter": 7, "numReviews": 969, "rating": 2.3}}, "type": "movie", "writers": ["Bernhard Rogge (diaries)", "Vittoriano Petrilli (screenplay)", "Duilio Coletti (screenplay)", "Ulrich Mèhr (screenplay)", "William Douglas-Home (additional dialogue)", "Leonardo Bercovici (screenplay)"], "year": 1960}