{"_id": "573a1398f29313caabceb002", "awards": {"nominations": 5, "text": "Won 1 Golden Globe. Another 2 wins & 5 nominations.", "wins": 3}, "cast": ["Shirley MacLaine", "Peggy Ashcroft", "Twiggy", "Shabana Azmi"], "countries": ["UK"], "directors": ["John Schlesinger"], "fullplot": "Bengali Sushila Sen and her son, Manek, relocate from India to London after Sushila's relationship with her husband fails. Sushila struggles with everyday living. A child piano prodigy, Manek's schoolteacher refers him to a piano teacher, Irina Sousatzka, a Russian immigrant renowned for her teaching skills. Irina forms a strong bond with Manek, not only teaching him piano but also valuable life lessons. Disagreements arise, as Manek does not want anyone to run his life for him, but nevertheless the training progresses. Sushila, a baker and seller of Indian cuisine, loses an important client after her hair is found in one of her baked goods. To help his mother, Manek feels pressure to use his piano skills to earn some money. This is against Irina's wishes, however, as she is trying to protect Manek from her own negative experiences as a young concert pianist. She believes no student should perform until they are ready. But Manek, encouraged by a pushy music agent, decides to perform with the London Symphony Orchestra, ready or not.", "genres": ["Drama", "Music"], "imdb": {"id": 95564, "rating": 6.6, "votes": 1056}, "languages": ["English"], "lastupdated": "2015-08-15 00:36:40.003000000", "num_mflix_comments": 1, "plot": "Renowned Russian piano teacher Irina Sousatzka gets a new student - Bengali piano prodigy Manek. They are both immigrants in the UK and bond quickly. When Manek's single mother's business fails, he must make a career decision.", "poster": "https://m.media-amazon.com/images/M/MV5BMTUwOWIwODktZDc0OS00NDZhLThkNjAtZjE4NjgyM2IzNTlkXkEyXkFqcGdeQXVyMjA0MzYwMDY@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 592790400000, "runtime": 122, "title": "Madame Sousatzka", "tomatoes": {"critic": {"meter": 75, "numReviews": 16, "rating": 6.2}, "fresh": 12, "lastUpdated": 1440963892000, "production": "Universal Studios", "rotten": 4, "viewer": {"meter": 65, "numReviews": 329, "rating": 3.5}}, "type": "movie", "writers": ["Bernice Rubens (from the novel by)", "Ruth Prawer Jhabvala (screenplay)", "John Schlesinger (screenplay)", "Peter Morgan (additional material written by)", "Mark Wadlow (additional material written by)"], "year": 1988}