{"_id": "573a1394f29313caabce0511", "awards": {"nominations": 1, "text": "Nominated for 1 BAFTA Film Award. Another 2 wins & 1 nomination.", "wins": 3}, "cast": ["Jean Servais", "Carl Mèhner", "Grègoire Aslan", "Gert Frèbe"], "countries": ["Italy", "France"], "directors": ["Jules Dassin"], "fullplot": "Greece, in the 1920's, is occupied by the Turks. The country is in turmoil with entire villages uprooted. The site of the movie is a Greek village that conducts a passion play each year. The leading citizens of the town, under the auspices of the Patriarch, choose those that will play the parts in the Passion. A stuttering shepherd is chosen to play Jesus. The town butcher (who wanted to be Jesus) is chosen as Judas. The town prostitute is chosen as Mary Magdalene. The rest of the disciples are also chosen. As the movie unfolds, the Passion Play becomes a reality. A group of villagers, uprooted by the war and impoverished, arrive at the village led by their priest. The wealthier citizens of the town want nothing with these people and manipulate a massacre. In the context of the 1920's each of the characters plays out their biblical role in actuality.", "genres": ["Drama"], "imdb": {"id": 50237, "rating": 7.4, "votes": 454}, "languages": ["French"], "lastupdated": "2015-04-22 02:14:18.723000000", "num_mflix_comments": 1, "plot": "Greece, in the 1920's, is occupied by the Turks. The country is in turmoil with entire villages uprooted. The site of the movie is a Greek village that conducts a passion play each year. ...", "poster": "https://m.media-amazon.com/images/M/MV5BMzAzM2QxMDYtMDQyNi00NWMzLWI5MDktMTA4NmY1ZmRlYTYwXkEyXkFqcGdeQXVyMzg1ODEwNQ@@._V1_SY1000_SX677_AL_.jpg", "released": -399600000000, "runtime": 122, "title": "He Who Must Die", "tomatoes": {"lastUpdated": 1441134850000, "production": "Cinèdis", "viewer": {"meter": 78, "numReviews": 174, "rating": 3.9}}, "type": "movie", "writers": ["Ben Barzman", "Jules Dassin", "Nikos Kazantzakis (novel)", "Andrè Obey"], "year": 1957}