{"_id": "573a1399f29313caabcee805", "awards": {"nominations": 0, "text": "2 wins.", "wins": 2}, "cast": ["Travis Tedford", "Kevin Jamal Woods", "Jordan Warkol", "Zachary Mabry"], "countries": ["USA"], "directors": ["Penelope Spheeris"], "fullplot": "The story begins with Spanky, who is the president of the \"He-Man Woman Haters Club\" with many school-aged boys from around the neighborhood as members. His best friend, Alfalfa, has been chosen as the driver for the club's prize-winning go-kart, called \"The Blur\", in the annual Soap Box Derby style race. However, when the announcement is made, Alfalfa is nowhere to be found. The boys catch Alfalfa in the company of Darla -- \"a girl!\" Alfalfa isn't like his friends because he's in love with Darla, and unfortunately threatens the very existence of their \"boys only\" club. The club's members try their hardest to break the two apart, eventually causing their beloved clubhouse to burn down. Darla is mistakenly led to believe Alfalfa feels ashamed of her, so she turns her attentions to Waldo, the new rich kid whose father is an oil tycoon. Further trouble ensures when their prized go-cart \"The Blur\" is stolen by local neighborhood bullies Butch and Woim. How can they win the big race and its prize trophy?! In addition to having to rebuild the clubhouse, the boys now need a new set of wheels. They band together to build \"Blur 2: The Sequel.\" Prior to race day, Spanky and Alfalfa reconcile and decide to ride in the two-seat go-kart together.", "genres": ["Comedy", "Family", "Romance"], "imdb": {"id": 110366, "rating": 6.2, "votes": 31299}, "languages": ["English"], "lastupdated": "2015-08-27 00:02:21.383000000", "num_mflix_comments": 3, "plot": "Alfalfa is wooing Darla and his \"He-Man-Woman-Hating\" friends attempt to sabotage the relationship.", "poster": "https://m.media-amazon.com/images/M/MV5BYWE1MzdmNmMtNWQwZS00MTVkLTk3MDMtYzVkOWZlOTczMDIwXkEyXkFqcGdeQXVyNjg4NzYzMzA@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 776044800000, "runtime": 82, "title": "The Little Rascals", "tomatoes": {"critic": {"meter": 25, "numReviews": 12, "rating": 3.8}, "dvd": 919728000000, "fresh": 3, "lastUpdated": 1442080678000, "production": "MCA Universal Home Video", "rotten": 9, "viewer": {"meter": 70, "numReviews": 227745, "rating": 3.2}}, "type": "movie", "writers": ["Penelope Spheeris (story)", "Robert Wolterstorff (story)", "Mike Scott (story)", "Paul Guay (story)", "Stephen Mazur (story)", "Paul Guay (screenplay)", "Stephen Mazur (screenplay)", "Penelope Spheeris (screenplay)"], "year": 1994}