{"_id": "573a13a8f29313caabd1dde2", "awards": {"nominations": 25, "text": "Won 1 Oscar. Another 37 wins & 25 nominations.", "wins": 38}, "cast": ["Peter Sallis", "Ralph Fiennes", "Helena Bonham Carter", "Peter Kay"], "countries": ["UK", "USA"], "directors": ["Steve Box", "Nick Park"], "fullplot": "It's 'vege-mania' in Wallace and Gromit's neighborhood, and our two enterprising chums are cashing in with their humane pest-control outfit, \"Anti-Pesto.\" With only days to go before the annual Giant Vegetable Competition, business is booming, but Wallace & Gromit are finding out that running a \"humane\" pest control outfit has its drawbacks as their West Wallaby Street home fills to the brim with captive rabbits. Suddenly, a huge, mysterious, veg-ravaging \"beast\" begins attacking the town's sacred vegetable plots at night, and the competition hostess, Lady Tottington, commissions Anti-Pesto to catch it and save the day. Lying in wait, however, is Lady Tottington's snobby suitor, Victor Quartermaine, who'd rather shoot the beast and secure the position of local hero-not to mention Lady Tottingon's hand in marriage. With the fate of the competition in the balance, Lady Tottington is eventually forced to allow Victor to hunt down the vegetable chomping marauder. Little does she know that Victor's real intent could have dire consequences for her ...and our two heroes.", "genres": ["Animation", "Comedy", "Family"], "imdb": {"id": 312004, "rating": 7.5, "votes": 90150}, "languages": ["English"], "lastupdated": "2015-08-22 00:30:57.937000000", "metacritic": 87, "num_mflix_comments": 2, "plot": "Wallace and his loyal dog, Gromit, set out to discover the mystery behind the garden sabotage that plagues their village and threatens the annual giant vegetable growing contest.", "poster": "https://m.media-amazon.com/images/M/MV5BMTk1NzIwNTM1NV5BMl5BanBnXkFtZTcwMDA1NzkyMw@@._V1_SY1000_SX677_AL_.jpg", "rated": "G", "released": 1128643200000, "runtime": 85, "title": "The Curse of the Were-Rabbit", "tomatoes": {"boxOffice": "$56.1M", "consensus": "The Curse of the Were-Rabbit is a subtly touching and wonderfully eccentric adventure featuring Wallace and Gromit.", "critic": {"meter": 95, "numReviews": 176, "rating": 8.1}, "dvd": 1139270400000, "fresh": 167, "lastUpdated": 1439839491000, "production": "Dreamworks", "rotten": 9, "viewer": {"meter": 79, "numReviews": 384286, "rating": 3.4}, "website": "http://www.wandg.com/"}, "type": "movie", "writers": ["Steve Box (screenplay)", "Nick Park (screenplay)", "Mark Burton (screenplay)", "Bob Baker (screenplay)", "Nick Park (based on characters by)"], "year": 2005}