{"_id": "573a13a1f29313caabd06920", "awards": {"nominations": 2, "text": "2 nominations.", "wins": 0}, "cast": ["Chris Ferreira", "Mackenzie Firgens", "Elizabeth Sun", "Steve Van Wormer"], "countries": ["USA"], "directors": ["Greg Harrison"], "fullplot": "On Friday, a single e-mail blips through the Internet. The word spreads quickly through the city: the party is on. Saturday evening, two hundred people secretly converge at an abandoned San Francisco warehouse. As the sun sets the records start spinning, setting into motion a night that no one will forget. Meet David Turner, a Midwest transplant. He moved to the city with aspirations of starting his career as a writer but his hopes have stalled. After four years he finds himself writing instruction manuals for a computer company. Overworked and with little social life, David spends his time alone, his dream of being a novelist a distant memory. That night, his brother Colin Turner invites him to GROOVE. Colin has a surprise for his new girlfriend, young raver sprite Harmony Stitts, and he wants David there. David reluctantly agrees and is shocked when Colin proposes to Harmony at the party. In the ensuing celebration, they take Ecstasy and suddenly, David is thrust into the world of the San Francisco underground. In a chance encounter, David meets longtime New York raver Leyla Heydel and makes an unlikely connection. Through their budding relationship, they're reminded of a sense of possibility and freedom in their lives they had all but forgotten. But as the party rages on, Colin reveals a deep secret, one that threatens to destroy his relationship with Harmony. When the sun rises the party disappears, and the chaos of the last twelve hours changes the two brothers forever.", "genres": ["Drama", "Music"], "imdb": {"id": 212974, "rating": 6.5, "votes": 3441}, "languages": ["English"], "lastupdated": "2015-09-04 00:23:07.617000000", "metacritic": 54, "plot": "An inside look into one night in the San Francisco underground rave scene.", "poster": "https://m.media-amazon.com/images/M/MV5BNjk1YTlhZjYtOThjMC00NTAxLTg4MWItNjFiNTExYjdlNDcxXkEyXkFqcGdeQXVyNTM0NTU5Mg@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 971913600000, "runtime": 86, "title": "Groove", "tomatoes": {"consensus": "Though high on energy and great techno tunes, Groove's characters and plotlines are too cliched to be engaging.", "critic": {"meter": 56, "numReviews": 50, "rating": 6.1}, "dvd": 975974400000, "fresh": 28, "lastUpdated": 1441910179000, "production": "Sony Pictures Classics", "rotten": 22, "viewer": {"meter": 80, "numReviews": 5917, "rating": 3.8}}, "type": "movie", "writers": ["Greg Harrison"], "year": 2000}