{"_id": "573a13a3f29313caabd0e3fe", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Mark Ruffalo", "Maya Stange", "Kathleen Robertson", "Kel O'Neill"], "countries": ["USA"], "directors": ["Austin Chick"], "fullplot": "When two college students, Sam and Thea, meet Coles at a party, their mutual attraction is immediate, leading to a passionate and awkward night together, and the onset of an intensely charged bond. As they continue to push the sexual boundaries of their friendship, however, they are tested by Sam and Coles' incipient romance and Thea's increasing recklessness, until the relationship dissolves amid a cloud of fear, resentment and mistrust. Eight years later they reunite. An animator for a high-profile ad agency, Coles now lives with Claire, his girlfriend of five years. Thea is happily married to Miles, with whom she owns a flourishing restaurant. And Sam has just returned to Manhattan after working in London where she recently broke off her engagement. Yet upon reconnecting, the three are drawn back into the complicated dynamic that defined their relationship from the start and are forced to confront the true meaning of commitment and love.", "genres": ["Drama", "Romance"], "imdb": {"id": 245573, "rating": 6, "votes": 2726}, "languages": ["English"], "lastupdated": "2015-09-02 00:20:35.367000000", "metacritic": 52, "plot": "Three friends begin a dangerous three-way relationship that spirals out of control, leading to dire consequences that haunt them ten years later.", "poster": "https://m.media-amazon.com/images/M/MV5BMjExMjIxMjI3Ml5BMl5BanBnXkFtZTYwMjkxNjk5._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1058486400000, "runtime": 91, "title": "XX/XY", "tomatoes": {"consensus": "The characters are both unsympathetic and uninteresting.", "critic": {"meter": 44, "numReviews": 62, "rating": 5.3}, "dvd": 1059436800000, "fresh": 27, "lastUpdated": 1440093862000, "production": "IFC Films", "rotten": 35, "viewer": {"meter": 44, "numReviews": 3204, "rating": 3}}, "type": "movie", "writers": ["Austin Chick"], "year": 2002}