{"_id": "573a13c5f29313caabd6f720", "awards": {"nominations": 2, "text": "1 win & 2 nominations.", "wins": 1}, "cast": ["Cècile De France", "Sandrine Blancke", "Chris Lomme", "Marie Kremer"], "countries": ["Belgium", "France"], "directors": ["Stijn Coninx"], "fullplot": "Soeur Sourire is a moving story based on the life of a fascinating historic figure, Jeannine, a young Belgian girl who joined the convent and became a star in 1961 when she composed and sang the hit Dominique, nique, nique... The tragedy experienced by this young woman, who adopted the stage name Soeur Sourire, has everything to do with love. Jeannine Deckers desperately tries to give others the love she never received from her hard-hearted mother. She becomes attached to Annie, but when the latter tries to get closer, she runs. She dreams of moving away to far places, to Africa. When the situation at home becomes unbearable, she feels that joining a convent is the only way out. Life in the convent is hard for the young, passionate woman, but also gives her moments of joy she had never had before. She composes Dominique and is used by the church in an attempt to rejuvenate its waning image. The song becomes a hit all over the world.", "genres": ["Biography", "Drama", "Music"], "imdb": {"id": 1381112, "rating": 6.5, "votes": 568}, "languages": ["French"], "lastupdated": "2015-08-21 00:35:30.610000000", "num_mflix_comments": 1, "plot": "A biography of the Belgian nun Jeannine Deckers, who became a popular singer in the early 1960s and struggled with the contradiction between the church and her true self.", "poster": "https://m.media-amazon.com/images/M/MV5BMjIyODgyNTY5MV5BMl5BanBnXkFtZTcwMDI3OTc1Mw@@._V1_SY1000_SX677_AL_.jpg", "released": 1240963200000, "runtime": 120, "title": "Sister Smile", "tomatoes": {"lastUpdated": 1421010288000, "viewer": {"numReviews": 0, "rating": 0}}, "type": "movie", "writers": ["Stijn Coninx (screenplay)", "Ariane Fert (screenplay)", "Chris Vander Stappen (screenplay)"], "year": 2009}