{"_id": "573a1396f29313caabce4106", "awards": {"nominations": 2, "text": "1 win & 2 nominations.", "wins": 1}, "cast": ["Richard Harris", "Judith Anderson", "Jean Gascon", "Manu Tupou"], "countries": ["USA"], "directors": ["Elliot Silverstein"], "fullplot": "During the early 1800s, English Lord John Morgan is hunting in the Dakotas but he is captured by a group of Sioux warriors. Morgan's guides are killed but he is spared by Sioux chief Yellow Hand who marvels at Morgan's blond hair.Brought to Yellow Hand's tribal village, Morgan has to endure physical abuse and mockery at the hands of women and children who consider Morgan to be a wild horse.Restrained by a rope around his neck, Morgan is given as a gift to an old squaw, Buffalo Cow Head, to be her slave and help her with daily chores.In the village, Morgan meets Running Deer, the beautiful young sister of chief Yellow Hand.Morgan witnesses the traditional courtship process when Running Deer is asked in marriage by a tribe member who presents Yellow Hand with gifts in return for his sister's hand in marriage.Morgan starts to fall in love with her.Also in the village is half-breed, Batise, whose mother was Sioux and father was French.Batise becomes Morgan's friend and interpreter.Batise advises Morgan against escaping citing his own escape attempt when he was re-captured and hamstrung by the savage Sioux.Despite these warnings, Morgan tries to escape several times but he is re-captured.He decides to bid his time for another escape opportunity.When a rival Shoshone war party approaches the Sioux village, Morgan kills two of the Shoshone scouts, winning the respect of his Sioux captors.Instead of escaping, Morgan plans to learn the ways of the Sioux, become a warrior and gain his place among them.But this would require much more than killing a few Shoshone scouts.Lord John Morgan's true ordeal is just beginning.", "genres": ["Adventure", "Drama", "Western"], "imdb": {"id": 66049, "rating": 6.9, "votes": 6140}, "languages": ["English", "Sioux", "French"], "lastupdated": "2015-08-19 00:18:33.453000000", "num_mflix_comments": 1, "plot": "In 1825 an English aristocrat is captured by Indians. He lives with them and begins to understand/accept their lifestyles. Eventually he is accepted as part of the tribe and becomes their leader.", "poster": "https://m.media-amazon.com/images/M/MV5BMGNmOTA4NjUtNTY5Ny00Nzk1LTkyNTEtMWFhYmE5NzZiOTJmL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMjI4MjA5MzA@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 10368000000, "runtime": 114, "title": "A Man Called Horse", "tomatoes": {"critic": {"meter": 86, "numReviews": 14, "rating": 6.9}, "dvd": 1051574400000, "fresh": 12, "lastUpdated": 1440961359000, "production": "National General Pictures", "rotten": 2, "viewer": {"meter": 60, "numReviews": 9650, "rating": 3.3}}, "type": "movie", "writers": ["Jack DeWitt (screenplay)", "Dorothy M. Johnson (story)"], "year": 1970}