{"_id": "573a1394f29313caabce0951", "awards": {"nominations": 1, "text": "1 win & 1 nomination.", "wins": 1}, "cast": ["Kerwin Mathews", "Kathryn Grant", "Richard Eyer", "Torin Thatcher"], "countries": ["USA"], "directors": ["Nathan Juran"], "fullplot": "While sailing with Princess Parisa to Baghdad to their wedding, Sinbad finds the Colossa Island and anchors his vessel to get supplies for the starving crew. Sinbad and his men help the magician Sokurah to escape from a Cyclops that attacks them, and Sokurah uses a magic lamp with a boy jinni to help them; however, their boat sinks and he loses the lamp. Sokurah offers a small fortune to Sinbad to return to Colossa, but he does not accept and heads to Baghdad. The citizens and the Caliph of Baghdad are celebrating the peace with Chandra, and they offer a feast to the Sultan of Chandra. Sakurah requests a ship and crew to return to Colossa but the Caliph refuses to jeopardize his countrymen. However, the treacherous magician shrinks the princess and when the desperate Sinbad seeks him out, he tells that he needs to return to Colossa to get the ingredient necessary for the magic potion. But Sinbad has only his friend Harufa to travel with him, and he decides to enlist a doubtful crew in the prison of Baghdad, in the beginning of his dangerous voyage to Colossa to save the princess and avoid the eminent war between Chandra and Baghdad.", "genres": ["Family", "Fantasy", "Action"], "imdb": {"id": 51337, "rating": 7.2, "votes": 7648}, "languages": ["English"], "lastupdated": "2015-08-18 00:13:30.407000000", "num_mflix_comments": 1, "plot": "When a princess is shrunken by an evil wizard, Sinbad must undertake a quest to an island of monsters to cure her and prevent a war.", "poster": "https://m.media-amazon.com/images/M/MV5BMjA0MzUzMjQ5MF5BMl5BanBnXkFtZTgwMDAxNzYzNTE@._V1._CR53,81,1259,1903_SX178_AL_.jpg", "rated": "APPROVED", "released": -347932800000, "runtime": 88, "title": "The 7th Voyage of Sinbad", "tomatoes": {"critic": {"meter": 100, "numReviews": 14, "rating": 7.6}, "dvd": 973555200000, "fresh": 14, "lastUpdated": 1440443533000, "production": "Sony Pictures Home Entertainment", "rotten": 0, "viewer": {"meter": 77, "numReviews": 8631, "rating": 3.5}}, "type": "movie", "writers": ["Ken Kolb"], "year": 1958}