{"_id": "573a139ff29313caabd006d9", "awards": {"nominations": 8, "text": "11 wins & 8 nominations.", "wins": 11}, "cast": ["Philippe Torreton", "Maria Pitarresi", "Nadia Kaci", "Vèronique Ataly"], "countries": ["France"], "directors": ["Bertrand Tavernier"], "fullplot": "Daniel is schoolmaster of a kindergarten in a small French town. The local economy, which depended entirely on coal production, has been mired in a depression ever since the mines were closed. When their parents fall into utter discouragement or even poverty because of prolonged unemployment, the children suffer the consequences. Daniel is confronted daily with difficult situations and he feels responsible to deal with them although they are outside the scope of his responsibilities. This is a frustrating task: politicians are concerned with tightening their budgets, bureaucrats in the intricate web of French social and educational services with their prerogatives, utility companies with getting their bills paid; teachers, social workers, and policemen are overwhelmed. Daniel's relations with his parents, but also with Valeria, his fiancèe, and her son are not entirely smooth either. He nevertheless soldiers on with the staff of the kindergarten, all doing their best to educate the children of a severely disrupted society.", "genres": ["Drama"], "imdb": {"id": 186730, "rating": 7.5, "votes": 1997}, "languages": ["French"], "lastupdated": "2015-09-02 00:36:04.820000000", "metacritic": 78, "num_mflix_comments": 1, "plot": "Daniel is schoolmaster of a kindergarten in a small French town. The local economy, which depended entirely on coal production, has been mired in a depression ever since the mines were ...", "poster": "https://m.media-amazon.com/images/M/MV5BNmZhZWFhYTYtNDQ3ZC00ZDIwLTk2ZDMtNTk5NjU1NjBkOGRkXkEyXkFqcGdeQXVyMTA0MjU0Ng@@._V1_SY1000_SX677_AL_.jpg", "released": 921196800000, "runtime": 117, "title": "It All Starts Today", "tomatoes": {"critic": {"meter": 81, "numReviews": 16, "rating": 7.2}, "dvd": 1038268800000, "fresh": 13, "lastUpdated": 1442079659000, "production": "EnterTech Releasing", "rotten": 3, "viewer": {"meter": 80, "numReviews": 607, "rating": 3.6}}, "type": "movie", "writers": ["Dominique Sampiero", "Bertrand Tavernier", "Tiffany Tavernier"], "year": 1999}