{"_id": "573a13d9f29313caabda9c5e", "awards": {"nominations": 4, "text": "2 wins & 4 nominations.", "wins": 2}, "cast": ["Rick Roberts", "Sook-Yin Lee", "Zachary Bennett", "Joel Keller"], "countries": ["Canada"], "directors": ["Jeff Woolnough"], "fullplot": "NDP Leader Jack Layton was fluently bilingual, glib, sometimes flashy, full of energy and always media-friendly. He loved to entertain and uplift his co-workers with a strum on his guitar and spirit in his voice (which wasn't particularly good but he sang with gusto). Growing up in a political family, Layton was a left-wing Toronto city councillor for 17 years and spent a year as head of the Federation of Canadian Municipalities. He became leader of the federal New Democratic Party in 2003. In his first election as leader the NDP won 20 seats and in the 2008 election the NDP was up to 37 seats. Jack was a happily married man, with wife Olivia Chow who stood by his side, and together they were a political dynamo couple very much in love to the end. Things changed late in the 2011 federal election when a surge in polls in Quebec held and the NDP won 103 seats, 59 of them in Quebec. The NDP became the Official Opposition for the first time in history. Going into the 2011 federal election, Layton had been dealing with prostate cancer for a year, and had surgery on his hip a few weeks before the campaign. In July 2011, Jack Layton faced a bigger challenge. He announced that he had been diagnosed with a new form of cancer, and would step down as NDP Leader temporarily to get treatment, hoping to resume his job in September. Jack Layton died on Monday, August 22, 2011, at his home in Toronto. Before he died, he wrote an inspirational letter to all Canadians.", "genres": ["Biography", "Drama"], "imdb": {"id": 2253566, "rating": 6.8, "votes": 97}, "languages": ["English"], "lastupdated": "2015-08-18 01:01:01", "num_mflix_comments": 1, "plot": "The life story of Jack Layton, the leader of Canada's New Democratic Party who passed away in 2011 only months after leading his party to a historic victory.", "poster": "https://m.media-amazon.com/images/M/MV5BMTk4ODQ2NDU1NV5BMl5BanBnXkFtZTcwNjE3MTcxOQ@@._V1_SY1000_SX677_AL_.jpg", "released": 1362873600000, "runtime": 89, "title": "Jack", "tomatoes": {"lastUpdated": 1440267957000, "viewer": {"numReviews": 1, "rating": 0}}, "type": "movie", "writers": ["Shelley Eriksen (story)", "Andrew Wreggitt (story)", "Andrew Wreggitt (teleplay)"], "year": 2013}