{"_id": "573a13ccf29313caabd83194", "awards": {"nominations": 6, "text": "6 wins & 6 nominations.", "wins": 6}, "cast": ["Khomotso Manyaka", "Keaobaka Makanyane", "Harriet Lenabe", "Lerato Mvelase"], "countries": ["South Africa", "Germany"], "directors": ["Oliver Schmitz"], "fullplot": "In the dusty small town of Elandsdoorn, a South African township not far from Johannesburg, life is simple and serene. A prevailing sense of deep pride tightly bonds together the entire community - but beware to those who step out of line ... 12-year-old Chanda is a hardworking promising young student with a bright future, but her life changes dramatically when her baby sister unexpectedly dies. Heartbroken, Chanda's mother, Lillian, in turn becomes severely ill. Her stepfather drowns himself in alcohol, leaving the young girl to take care of her two smaller siblings. Meanwhile, the formerly friendly neighbors become increasingly distant and gossip spreads. \"Auntie\" Tafa does what she can to help by getting Lillian to leave town, but not even \"Auntie\" is immune to the cloud of fear filtering across Elandsdoorn. Suspecting that the community's irrational ostracism has to do with her mother's illness and the death of her baby sister, Chanda demands answers but is met with stubborn silence. Unwilling to bear the weight of secrecy any longer, Chanda sets out to face a deeply engrained, unspoken taboo ...", "genres": ["Drama"], "imdb": {"id": 1646111, "rating": 7.1, "votes": 1047}, "languages": ["Southern Sotho"], "lastupdated": "2015-08-26 00:10:10.993000000", "metacritic": 65, "plot": "A touching mother-daughter relationship that reflects the modern South Africa.", "poster": "https://m.media-amazon.com/images/M/MV5BMjI5ODk3MzgzMl5BMl5BanBnXkFtZTcwMjMxMTYyNQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1305158400000, "runtime": 100, "title": "Life, Above All", "type": "movie", "writers": ["Dennis Foon (screenplay)", "Oliver Schmitz", "Allan Stratton (novel)"], "year": 2010}