{"_id": "573a13b4f29313caabd3fff9", "awards": {"nominations": 1, "text": "14 wins & 1 nomination.", "wins": 14}, "cast": ["Karthi", "Priyamani", "Saravanan", "Ponvannan"], "countries": ["India"], "directors": ["Ameer Sultan"], "fullplot": "The story is set in a rural area around Madurai, in the village called Parithiyur. Paruthiveeran (Karthi) is a country brash, He is often arrested for petty crimes. His one ambition in life is to gain enough notoriety to be on TV news and to be thrown into Madras Jail. He often bullies Paruthiyur villagers for money, women and fun. He lives with his doting uncle Chevvaazhai (Saravanan) who pampers and accompanies him in every misbehavior to keep him happy. His cousin Muththazhagu (Priyamani) is the daughter of a caste fanatic who is a prominent person in the village's council. Muththazhagu loves him more than her life, but he remains unmoved and keeps her at bay. As a kid, Paruthiveeran saved her from drowning in a well. And she promises to marry him and be by his side forever. She starts loving him passionately against her parents' will. In order to delay her marriage with anybody else, she fails herself in school to be in the same grade/class. At times he is violent too. When he understands her true love for him and decides to marry her, the feud between the two families comes in the way. Determined as he is to possess her, he warns her against marrying someone of her parents' choice. He even threatens to cut her into pieces. Undeterred by his threats, her parents press ahead with the preparations for her marriage with a man of their choice. Since Muththazhagu is not able to convince her parents, she runs away from home wanting to elope with Paruthiveeran. However, she gets kidnapped and brutally raped, when she is found by Paruthiveeran. Muththazhagu beseeches Paruthiveeran, to cut her into pieces, as she is anyway dying and does not want anybody to find her. Paruthiveeran, on her request hence chops her corpse into pieces, and is walking away, when he is found by Muththazhagu's father and other relatives. Assuming him to be her kidnapper and Killer, they beat him to death. Thus ends the story of Paruthiveeran and Muththazhagu.", "genres": ["Drama", "Romance"], "imdb": {"id": 458050, "rating": 8.2, "votes": 1194}, "languages": ["Tamil"], "lastupdated": "2015-07-07 08:33:41.363000000", "num_mflix_comments": 1, "plot": "The story is set in a rural area around Madurai, in the village called Parithiyur. Paruthiveeran (Karthi) is a country brash, He is often arrested for petty crimes. His one ambition in life...", "poster": "https://m.media-amazon.com/images/M/MV5BNjA5NWZmOGMtZjYzZi00YWY5LThiMDctYzU2MjVjZTg0MzAzXkEyXkFqcGdeQXVyODE0NjUxNzY@._V1_SY1000_SX677_AL_.jpg", "released": 1172188800000, "runtime": 162, "title": "Paruthi Veeran", "tomatoes": {"lastUpdated": 1439665288000, "production": "Greenline Studios", "viewer": {"meter": 91, "numReviews": 234, "rating": 4.1}, "website": "http://www.paruthiveeran.com/"}, "type": "movie", "writers": ["Ameer Sultan (dialogue)", "Ameer Sultan (screenplay)", "Ameer Sultan (story)"], "year": 2007}