{"_id": "573a1395f29313caabce294a", "awards": {"nominations": 13, "text": "Won 2 Oscars. Another 3 wins & 13 nominations.", "wins": 5}, "cast": ["Vivien Leigh", "Simone Signoret", "Josè Ferrer", "Lee Marvin"], "countries": ["USA"], "directors": ["Stanley Kramer"], "fullplot": "1933: An ocean liner belonging to a second-rate German company is making a twenty-six day voyage from Veracruz, Mexico to Bremerhaven, Germany. Along the way it will stop in Cuba to pick up a large group of Spanish farm laborers who are being shipped home and who will be housed like cattle in steerage. There it will also pick up La Condesa, a Spanish countess. It will stop in Tenerife, where the farm workers will disembark and where La Condesa will be sent to a German-run prison for her \"traitorous\" activities in Cuba. This voyage will be the last of three for the ship's doctor, Willi Schumann, who has a serious heart ailment and who thought he could find some meaning to his life through this job. Willi and La Condesa fall in love, with the ship's Captain Thiele, who is Willi's closest friend on board, believing the drug-addicted La Condesa is only using him to get her fixes. Willi and La Condesa have to figure out if there is a future for them after the voyage, as Willi's life also includes a wife and sons back in Bremerhaven. Among the other motley crew of passengers are: Mary Treadwell, a middle-aged American divorcèe who is trying to recapture her youth; Tenny, a middle-aged American ex-baseball player who laments never having made it big in the game; David and Jenny, a young American couple who say they are in love but who have to overcome their fundamental differences in social standing and life outlooks; Rieber, a middle-aged German Nazi sympathizer who is traveling with a young woman companion and who lords his beliefs over the other German passengers, who in turn are either so self-absorbed with their own lives and/or just don't care to notice what is happening in Germany with the Nazis; and Lowenthal and Glocken, a German Jew and a German dwarf respectively, who are \"paired\" as the outsiders among those in first class. Their encounters, plus those with a rambunctious pair of children, two German teenagers who are coming into their sexual being but are having problems overcoming issues they face, and a troupe of gypsy entertainers whose women are pimped out by their leader, lead to an interesting voyage.", "genres": ["Drama", "Romance", "War"], "imdb": {"id": 59712, "rating": 7.2, "votes": 3543}, "languages": ["English", "German", "Spanish"], "lastupdated": "2015-09-03 00:33:28.617000000", "num_mflix_comments": 1, "plot": "1933: An ocean liner belonging to a second-rate German company is making a twenty-six day voyage from Veracruz, Mexico to Bremerhaven, Germany. Along the way it will stop in Cuba to pick up...", "poster": "https://m.media-amazon.com/images/M/MV5BZDc5ODNmYzAtM2I2NS00ZTEwLWIwMTQtMTM0NWIwODk0NmM4XkEyXkFqcGdeQXVyMTAwMzUyOTc@._V1_SY1000_SX677_AL_.jpg", "released": -134179200000, "runtime": 149, "title": "Ship of Fools", "tomatoes": {"critic": {"meter": 81, "numReviews": 16, "rating": 6.8}, "dvd": 1070323200000, "fresh": 13, "lastUpdated": 1441912465000, "production": "Columbia Pictures", "rotten": 3, "viewer": {"meter": 80, "numReviews": 1124, "rating": 3.7}}, "type": "movie", "writers": ["Katherine Anne Porter (novel)", "Abby Mann (screenplay)"], "year": 1965}