{"_id": "573a13e3f29313caabdc019f", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Alexie Gilmore", "Bryce Johnson", "Laura Montagna", "Bucky Sinister"], "countries": ["USA"], "directors": ["Bobcat Goldthwait"], "fullplot": "Jim and his girlfriend Kelly are visiting the infamous Willow Creek, the alleged home of the original Bigfoot legend - the tale of huge ape like creatures that roam the forests of North America. It was there that in 1967, the legendary beast was captured on film and has terrified and mystified generations since. Keen to explore more than 50 years of truth, folklore, misidentifications and hoaxes, Kelly goes along for the ride to keep Jim happy, whilst he is determined to prove the story is real by capturing the beast on camera. Deep in the dark and silent woods, isolated and hours from human contact, neither Kelly or Jim are prepared for what is hidden between the trees, and what happens when the cameras start rolling...", "genres": ["Adventure", "Horror", "Mystery"], "imdb": {"id": 2885364, "rating": 5.1, "votes": 5463}, "languages": ["English"], "lastupdated": "2015-09-14 10:39:10.833000000", "metacritic": 62, "num_mflix_comments": 2, "plot": "From celebrated Director Bobcat Goldthwait comes this edge of your seat horror that will make you think twice before going into the woods.", "poster": "https://m.media-amazon.com/images/M/MV5BMTg5MjMzNDczM15BMl5BanBnXkFtZTgwMjMwMjM5MTE@._V1_SY1000_SX677_AL_.jpg", "rated": "UNRATED", "released": 1398988800000, "runtime": 77, "title": "Willow Creek", "tomatoes": {"consensus": "Writer-director Bobcat Goldthwait's first foray into horror doesn't break any new ground, but it does wring fresh terror from a well-worn genre formula -- and offers a few nasty laughs in the bargain.", "critic": {"meter": 86, "numReviews": 50, "rating": 6.5}, "dvd": 1410220800000, "fresh": 43, "lastUpdated": 1442425520000, "production": "MPI Media Group", "rotten": 7, "viewer": {"meter": 34, "numReviews": 7081, "rating": 2.7}}, "type": "movie", "writers": ["Bobcat Goldthwait"], "year": 2013}