{"_id": "573a13a5f29313caabd137e9", "awards": {"nominations": 4, "text": "4 nominations.", "wins": 0}, "cast": ["Jet Li", "Carla Gugino", "Delroy Lindo", "Jason Statham"], "countries": ["USA"], "directors": ["James Wong"], "fullplot": "There is not one universe, but there are many, which is a multiverse. Supposing you are just one person, there are many other versions of you in the other universes, there are ways to travel, but only a police agency,MVA, can travel only for police procedures. Gabriel Yulaw is a former MVA agent, who killed another version of himself in self-defense. It made the other versions of him stronger. When Yulaw found out about this, he became power-hungry killing the 122 other versions for two years. After killing Lawless and getting captured by his former partner Roedecker and a new MVA agent Funsch, Yulaw managed to escape the prison and is trying to kill his last target, Gabe Law who is a police officer. He is also at Yulaw's strength. Roedecker and Funsch now have to arrest Yulaw before he can kill Gabe. There is a possibility that the universe could die or make Yulaw invincible. After encountering Yulaw for the first time, Gabe thought that it was his split personality, but it wasn't. Will Gabe be able to confront Yulaw before or after Yulaw ruins his life?", "genres": ["Action", "Sci-Fi", "Thriller"], "imdb": {"id": 267804, "rating": 5.9, "votes": 74132}, "languages": ["English"], "lastupdated": "2015-09-06 00:09:51.227000000", "metacritic": 25, "num_mflix_comments": 2, "plot": "A sheriff's deputy fights an alternate universe version of himself who grows stronger with each alternate self he kills.", "poster": "https://m.media-amazon.com/images/M/MV5BNzY4YmUzMDAtMDYyZS00MTBmLWEzZDAtOGY3MDE2YjJkMGUxL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1004659200000, "runtime": 87, "title": "The One", "tomatoes": {"boxOffice": "$43.9M", "consensus": "The One plays out more like a video game than a movie and borrows freely from other, better sci-fi actioners like the The Matrix. Also, Jet Li's martial arts abilities are buried under the editing and special effects.", "critic": {"meter": 14, "numReviews": 85, "rating": 3.9}, "dvd": 1015286400000, "fresh": 12, "lastUpdated": 1442083535000, "production": "Columbia Pictures", "rotten": 73, "viewer": {"meter": 52, "numReviews": 100474, "rating": 3.1}, "website": "http://www.spe.sony.com/movies/theone"}, "type": "movie", "writers": ["Glen Morgan", "James Wong"], "year": 2001}