{"_id": "573a13a3f29313caabd0e229", "awards": {"nominations": 6, "text": "1 win & 6 nominations.", "wins": 1}, "cast": ["Haley Joel Osment", "Willem Dafoe", "Liam Hess", "Richard Banel"], "countries": ["USA", "Poland"], "directors": ["Yurek Bogayevicz"], "fullplot": "Polish 12 year-young city Jew Romek gets a crash-course in Catholicsim from his daddy ('stay hanging by your arms till your prayers are perfect') so he can be sent away and escape deportation (Auschwitz?) hiding in the country where the clergy found a host, Gniecio's simple peasant family, posing as their city relative. Gniecio's eldest son Vladek proves rather tyrannical but no brighter then gullible junior Tollo, who takes a role play in catechism class to 'become' a Last Supper character, in his case Jesus, to the extreme, even training for a crucifixion from a tree. Neighbor Batylin and his wife are executed by the Nazis when their illegally kept pig is found. Kluba plays a dirty trick when Gniecio tries to sell his in the city; his son is as problematic for the boys, who meanwhile play involving a single girl-playmate, Maria, who takes Romek in when he's stupidly thrown out by his widowed host by mistake. The horror of war itself suddenly shows its ugly head again, big time and in weird ways with unforeseen consequences...", "genres": ["Drama", "Crime", "War"], "imdb": {"id": 245090, "rating": 7, "votes": 2924}, "languages": ["English"], "lastupdated": "2015-08-08 00:58:46.600000000", "num_mflix_comments": 1, "plot": "A 12-year-old Jewish boy hides with a family of Catholic peasant farmers to escape the Nazis.", "poster": "https://m.media-amazon.com/images/M/MV5BMTgyNDA2MDY2Ml5BMl5BanBnXkFtZTcwODE1MzMzMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1002844800000, "runtime": 95, "title": "Edges of the Lord", "tomatoes": {"dvd": 1104796800000, "lastUpdated": 1442086189000, "production": "Miramax", "viewer": {"meter": 72, "numReviews": 1611, "rating": 3.6}}, "type": "movie", "writers": ["Yurek Bogayevicz"], "year": 2001}