{"_id": "573a13d8f29313caabda5164", "awards": {"nominations": 2, "text": "2 wins & 2 nominations.", "wins": 2}, "cast": ["Myung-min Kim", "Jung-Hee Moon", "Dong-wan Kim", "Ha-nui Lee"], "countries": ["South Korea"], "directors": ["Jeong-woo Park"], "fullplot": "Jae-hyuk is an ordinary man in his 40s. He works as a medical supplies salesman and is hassled by doctors all day. His brother Jae-pil is a detective that is not all that interested in public safety and spends most of his time moaning about the stock market. The discovery of a series of floating, gruesomely skeletal bodies around the country sparks hysteria. The police commissioner is disturbed to see CCTV footage of people jumping into water as if they were possessed, and drowning themselves. Time passes and hundreds of similar cases are reported, leaving officials stumped as to the cause of the deaths. The government declares a national emergency. Jae-pil joins the massive investigation and meets the mayor of a small town who claims he witnessed several men in work uniforms dumping infected dogs into the streams and realizes that there is a conspiracy behind the outbreak. Meanwhile, Jae-hyuk's wife and children are showing the same symptoms as the victims, leading to a frantic search for medicine. Through Jae-pil he learns of a warehouse containing a potential cure in thousands and thousands of doses and heads there with no idea of what he's heading into.", "genres": ["Drama", "Thriller"], "imdb": {"id": 2173024, "rating": 6.3, "votes": 992}, "languages": ["Korean"], "lastupdated": "2015-08-03 00:22:05.740000000", "num_mflix_comments": 1, "plot": "Jae-hyuk is an ordinary man in his 40s. He works as a medical supplies salesman and is hassled by doctors all day. His brother Jae-pil is a detective that is not all that interested in ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTUyMDEzMjk3NF5BMl5BanBnXkFtZTgwMDU0MTAzMjE@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 1343347200000, "runtime": 109, "title": "Deranged", "tomatoes": {"critic": {"meter": 60, "numReviews": 5, "rating": 4.9}, "fresh": 3, "lastUpdated": 1440269774000, "production": "CJ Entertainment", "rotten": 2, "viewer": {"meter": 53, "numReviews": 158, "rating": 3.3}, "website": "http://www.derangedmovie2012.com"}, "type": "movie", "writers": ["Jeong-woo Park"], "year": 2012}