{"_id": "573a13bdf29313caabd5846d", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Mary Helen Ayres", "Julia Barnett", "Sylvie Blaustein", "Louann Brizendine"], "countries": ["USA"], "directors": ["Abby Epstein"], "fullplot": "Birth: it's a miracle. A rite of passage. A natural part of life. But more than anything, birth is a business. Compelled to find answers after a disappointing birth experience with her first child, actress Ricki Lake recruits filmmaker Abby Epstein to explore the maternity care system in America. Focusing on New York City, the film reveals that there is much to distrust behind hospital doors and follows several couples who decide to give birth on their own terms. There is an unexpected turn when director Epstein not only discovers she is pregnant, but finds the life of her child on the line. Should most births should be viewed as a natural life process, or should every delivery be treated as a potential medical emergency?", "genres": ["Documentary"], "imdb": {"id": 995061, "rating": 7.4, "votes": 1086}, "languages": ["English"], "lastupdated": "2015-07-31 00:10:55.160000000", "metacritic": 68, "num_mflix_comments": 4, "plot": "Birth: it's a miracle. A rite of passage. A natural part of life. But more than anything, birth is a business. Compelled to find answers after a disappointing birth experience with her ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTA5MzQ1MDcxODZeQTJeQWpwZ15BbWU4MDU3MjQzNjEy._V1_SY1000_SX677_AL_.jpg", "released": 1199836800000, "runtime": 87, "title": "The Business of Being Born", "tomatoes": {"consensus": "Epstein's argument in favor of home birthing is certainly biased -- but its biases are so transparent, and so impassioned, that they work in the film's favor.", "critic": {"meter": 81, "numReviews": 26, "rating": 6.7}, "dvd": 1210032000000, "fresh": 21, "lastUpdated": 1437329492000, "production": "International Film Circuit", "rotten": 5, "viewer": {"meter": 86, "numReviews": 7557, "rating": 3.9}, "website": "http://www.thebusinessofbeingborn.com/"}, "type": "movie", "year": 2008}