{"_id": "573a139af29313caabcf124d", "awards": {"nominations": 38, "text": "Nominated for 1 Oscar. Another 18 wins & 38 nominations.", "wins": 19}, "cast": ["Ewan McGregor", "Natalie Portman", "Hayden Christensen", "Ian McDiarmid"], "countries": ["USA"], "directors": ["George Lucas"], "fullplot": "Three years after the onset of the Clone Wars; the noble Jedi Knights are spread out across the galaxy leading a massive clone army in the war against the Separatists. After Chancellor Palpatine is kidnapped, Jedi Master Obi-Wan Kenobi and his former Padawan, Anakin Skywalker, are dispatched to eliminate the evil General Grievous. Meanwhile, Anakin's friendship with the Chancellor arouses suspicion in the Jedi Order, and dangerous to the Jedi Knight himself. When the sinister Sith Lord, Darth Sidious, unveils a plot to take over the galaxy, the fate of Anakin, the Jedi order, and the entire galaxy is at stake. Upon his return, Anakin Skywalker's wife Padme Amidala is pregnant, but he is having visions of her dying in childbirth. Anakin Skywalker ultimately turns his back on the Jedi, thus completing his journey to the dark side and his transformation into Darth Vader. Obi-Wan Kenobi must face his former apprentice in a ferocious lightsaber duel on the fiery world of Mustafar.", "genres": ["Action", "Adventure", "Fantasy"], "imdb": {"id": 121766, "rating": 7.7, "votes": 440441}, "languages": ["English"], "lastupdated": "2015-09-07 00:05:05.403000000", "metacritic": 68, "num_mflix_comments": 424, "plot": "As the Clone Wars near an end, the Sith Lord Darth Sidious steps out of the shadows, at which time Anakin succumbs to his emotions, becoming Darth Vader and putting his relationships with Obi-Wan and Padme at risk.", "poster": "https://m.media-amazon.com/images/M/MV5BNTc4MTc3NTQ5OF5BMl5BanBnXkFtZTcwOTg0NjI4NA@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1116460800000, "runtime": 140, "title": "Star Wars: Episode III - Revenge of the Sith", "tomatoes": {"boxOffice": "$380.2M", "consensus": "This sixth and final installment of George Lucas' epic space opera will please die-hard fanatics and non-believers alike -- largely due to awesome digital effects and the sheer power of the mythology.", "critic": {"meter": 80, "numReviews": 253, "rating": 7.2}, "dvd": 1130803200000, "fresh": 202, "lastUpdated": 1442077442000, "production": "20th Century Fox", "rotten": 51, "viewer": {"meter": 65, "numReviews": 33671923, "rating": 3.1}, "website": "http://www.starwars.com/"}, "type": "movie", "writers": ["George Lucas"], "year": 2005}