{"_id": "573a13b5f29313caabd451f2", "awards": {"nominations": 14, "text": "Nominated for 1 BAFTA Film Award. Another 14 wins & 14 nominations.", "wins": 15}, "cast": ["Thomas Turgoose", "Stephen Graham", "Jo Hartley", "Andrew Shim"], "countries": ["UK"], "directors": ["Shane Meadows"], "fullplot": "This is England: Mods, New Romantics, and Skinheads are the major youth sub-cultures of this very English summer of 1983 and young 12-year-old Shaun is left wandering aimlessly alone and lost during the start of his school holidays, until his chance meeting with Woody and his fun and friendly Skinhead pack. Finding a new lease of life; girls, parties, Ben Sherman shirts, Doc Martin boots and shaven hairstyles young Shaun is welcomed, life during this summer holiday has got a whole lot better. That is until Combo arrives on the scene bitter, dangerous, racist, militant and psychotic life for young Shaun has just approached his first major crossroads. This is England is a look back at the early eighties of British working-class life through the eyes of young Shaun and his new gang, and dealing with the bitterness of outside influences such as racism and xenophobia, of mass unemployment and the fall out of the Falkland's War; Thatcher's Britain: Did we ever have it so good? When you see Shaun, ask Him.", "genres": ["Crime", "Drama"], "imdb": {"id": 480025, "rating": 7.7, "votes": 93015}, "languages": ["English"], "lastupdated": "2015-08-21 00:35:45.813000000", "metacritic": 86, "plot": "A story about a troubled boy growing up in England, set in 1983. He comes across a few skinheads on his way home from school, after a fight. They become his new best friends even like family. Based on experiences of director Shane Meadows.", "poster": "https://m.media-amazon.com/images/M/MV5BMmE3OWZhZDYtOTBjMi00NDIwLTg1NWMtMjg0NjJmZWM4MjliL2ltYWdlXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "UNRATED", "released": 1177632000000, "runtime": 101, "title": "This Is England", "tomatoes": {"boxOffice": "$95.8k", "consensus": "A moving coming-of-age tale that captures the despair among England's working-class youth in the 1980s.", "critic": {"meter": 93, "numReviews": 89, "rating": 7.7}, "dvd": 1194912000000, "fresh": 83, "lastUpdated": 1439750684000, "production": "IFC First Take", "rotten": 6, "viewer": {"meter": 90, "numReviews": 54168, "rating": 4.1}, "website": "http://thisisenglandmovie.co.uk"}, "type": "movie", "writers": ["Shane Meadows"], "year": 2006}