{"_id": "573a13d7f29313caabda1552", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Gary Hudson", "Jules Willcox", "Paul Francis", "Pancho Demmings"], "countries": ["USA"], "directors": ["Chris Tasara"], "fullplot": "Kyle and Sarah are starting a life together in a renovated house in Hollywood Hills, on the same property where the original house burned-down a decade earlier with its owner vanished. Despite certain rumors about the property, the couple decides to acquire the home of their dreams. But they quickly encounter bizarre occurrences around the house. And when one of their friends disappears and the forensics expert assigned to the case is found murdered, they realize they're being targeted in a twisted cat-and-mouse game. Enter Detective Brills, a hard-boiled homicide detective who's been trying to solve the riddle of the house ever since the fire. He's more than determined to help the couple to find out what's really going on around the estate. But he too cannot stop the murderous rampage that begins to claim the couple's friends and associates, one by one. After finding human remains in the crawl space, Kyle and Sarah slowly learn about the unspeakable events that took place and realize the culprit is closer to them than they can ever imagine.", "genres": ["Mystery", "Thriller"], "imdb": {"id": 2106383, "rating": 7.7, "votes": 610}, "languages": ["English"], "lastupdated": "2015-08-20 00:41:33.220000000", "num_mflix_comments": 1, "plot": "Kyle and Sarah are starting a life together in a renovated house in Hollywood Hills, on the same property where the original house burned-down a decade earlier with its owner vanished. ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTYyOTgyMjI4N15BMl5BanBnXkFtZTcwOTM3NjE5OA@@._V1_SY1000_SX677_AL_.jpg", "released": 1368662400000, "runtime": 83, "title": "Deadline", "tomatoes": {"lastUpdated": 1433098825000, "viewer": {"numReviews": 0, "rating": 0}, "website": "http://funkjazzkafe.com/diary-of-a-decade-movie/"}, "type": "movie", "writers": ["Chris Tasara"], "year": 2011}