{"_id": "573a13dcf29313caabdb0d5f", "awards": {"nominations": 2, "text": "2 nominations.", "wins": 0}, "cast": ["Patrick Wilson", "Liv Tyler", "Marisa Coughlan", "Matt Bomer"], "countries": ["USA"], "directors": ["Jack Plotnick"], "fullplot": "Space Station 76 is a refueling satellite near an alternate-reality Earth, circa 1976. Jessica arrives to serve as the station's new first mate. While she narrates a piece about how she likes the predictability of asteroids, some placidly drifting asteroids are shown colliding in chain-reaction fashion. While at first the station appears normal and the people friendly, Jessica soon discovers that the people on board have issues due to the isolation and stress of being cooped up with one another in a relatively small space far from Earth. This is in addition the usual problems people struggle with, such as infidelity, loneliness, depression, and drug abuse. She tries to make friends and fit in, but, unable to connect meaningfully with anyone, she becomes lonely. She's baffled and disillusioned by the stiff and irritable Captain Glenn, who harbors secrets of his own. She finds herself drawn to Ted, a lonely, married crewman, and his 7 year-old daughter, Sunshine. Ted yearns to reconnect with his unhappy, medicated wife, Misty, but she's too far gone to respond and is driving him away. His daughter Sunshine contends with her unhappy, mentally ill mother and her own isolation issues. Events finally come to a head at a Christmas party when a rapidly unhinging Misty decides everyone needs to play the \"Truth Game.\" Just when it seems like everything's falling apart, a celestial event shakes everyone to their core, reminding them what their real priorities in life should be.", "genres": ["Comedy", "Drama", "Sci-Fi"], "imdb": {"id": 2369317, "rating": 4.9, "votes": 5085}, "languages": ["English"], "lastupdated": "2015-09-05 00:30:59.393000000", "metacritic": 49, "plot": "A 1970s version of the future, where personalities and asteroids collide.", "poster": "https://m.media-amazon.com/images/M/MV5BMTcxNzkzNzg1N15BMl5BanBnXkFtZTgwMjIwMDgyMjE@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1394236800000, "runtime": 93, "title": "Space Station 76", "tomatoes": {"critic": {"meter": 67, "numReviews": 24, "rating": 5.9}, "dvd": 1412035200000, "fresh": 16, "lastUpdated": 1441990827000, "production": "Sony Pictures", "rotten": 8, "viewer": {"meter": 30, "numReviews": 2632, "rating": 2.6}, "website": "http://www.spacestation76.com/"}, "type": "movie", "writers": ["Jennifer Elise Cox (screenplay)", "Sam Pancake (screenplay)", "Jack Plotnick (screenplay)", "Kali Rocha (screenplay)", "Michael Stoyanov (screenplay)"], "year": 2014}