{"_id": "573a13b2f29313caabd39754", "awards": {"nominations": 1, "text": "1 win & 1 nomination.", "wins": 1}, "cast": ["Emmanuelle Bèart", "Karin Viard", "Marie Gillain", "Guillaume Canet"], "countries": ["France", "Italy", "Belgium", "Japan"], "directors": ["Danis Tanovic"], "fullplot": "In Paris, a family is victim of a tragic incident, when the patriarch is accused by his wife of pedophilia. Years later, the three sisters have independent dysfunctional lives and never see each other. The middle sister Sophie finds that her beloved husband and photographer Pierre is unfaithful and is having an affair with Julie and he leaves her. When the lover discovers that Pierre has two children, she ends the affair. The youngest, Anne, is student of Sorbonne and has a crush and gets pregnant of her professor Frèdèric, who is married and father of her best friend. The oldest sister, Cèline, is a lonely woman that periodically travels by train to visit her handicapped dumb mother Marie that is trapped in a wheelchair in an asylum for elders. When the stranger Sèbastien contacts Cèline, she believes he is a shy admirer; however, after an awkward encounter, he reveals secrets from the past that will affect the relationship among the sisters.", "genres": ["Drama"], "imdb": {"id": 430224, "rating": 6.9, "votes": 2056}, "languages": ["French"], "lastupdated": "2015-08-18 01:11:36.593000000", "num_mflix_comments": 2, "plot": "Three sisters share a connection to a violent incident from their childhood reunite to for the chance to come to terms with their past.", "poster": "https://m.media-amazon.com/images/M/MV5BMTAyNjIzODA0MTNeQTJeQWpwZ15BbWU3MDExMzI1MzE@._V1_SY1000_SX677_AL_.jpg", "released": 1132099200000, "runtime": 102, "title": "Hell", "tomatoes": {"critic": {"meter": 67, "numReviews": 9, "rating": 5.8}, "fresh": 6, "lastUpdated": 1438022708000, "rotten": 3, "viewer": {"numReviews": 1055, "rating": 3.5}}, "type": "movie", "writers": ["Krzysztof Kieslowski (scenario)", "Krzysztof Piesiewicz"], "year": 2005}