{"_id": "573a13dff29313caabdb900e", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Lenny Cooke"], "countries": ["USA"], "directors": ["Ben Safdie", "Joshua Safdie"], "fullplot": "Professional sports is known as a true meritocracy, a field in which the cream really does rise to the top, as there's simply too much money at stake to operate in any other fashion. In uncommon instances, however, inefficiencies can occur and gifted players may fall through the cracks. Such is the story of Lenny Cooke. In 2001, Cooke was the number-one ranked high school basketball player in America, with future NBA greats LeBron James and Carmelo Anthony listed beneath him. Yet after declaring himself eligible for the 2002 NBA draft, Cooke, shockingly, ended up going undrafted, and became a journeyman playing in little-known leagues across the world. Today he lives in southern Virginia, a should-have-been-great who simply did not quite make it. The first documentary feature from American independent film scene fixtures Josh & Benny Safdie (Daddy Longlegs, The Pleasure of Being Robbed), LENNY COOKE explores the fascinating question of how, exactly, Cooke's seemingly assured future could go so awry.", "genres": ["Documentary", "Biography", "Drama"], "imdb": {"id": 2606924, "rating": 6.5, "votes": 188}, "languages": ["English"], "lastupdated": "2015-09-05 00:33:00.393000000", "metacritic": 70, "plot": "Professional sports is known as a true meritocracy, a field in which the cream really does rise to the top, as there's simply too much money at stake to operate in any other fashion. In ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTY5MzEyNzk4Nl5BMl5BanBnXkFtZTgwMzQ0ODQ3MDE@._V1_SY1000_SX677_AL_.jpg", "released": 1386288000000, "runtime": 88, "title": "Lenny Cooke", "tomatoes": {"critic": {"meter": 80, "numReviews": 20, "rating": 7.4}, "fresh": 16, "lastUpdated": 1440440404000, "production": "Shop Korn Productions", "rotten": 4, "viewer": {"meter": 71, "numReviews": 191, "rating": 3.8}, "website": "http://www.lennycookemovie.com/"}, "type": "movie", "year": 2013}