{"_id": "573a1399f29313caabcee6f5", "awards": {"nominations": 0, "text": "6 wins.", "wins": 6}, "cast": ["Madhuri Dixit", "Salman Khan", "Mohnish Bahl", "Renuka Shahane"], "countries": ["India"], "directors": ["Sooraj R. Barjatya"], "fullplot": "It tells the story of two lovers, Prem (Salman Khan) and Nisha (Madhuri Dixit). Their older siblings, Rajesh and Pooja get married. After Pooja has her baby, the elders decide to get Prem married with a girl like Pooja. Prem and Nisha slowly fall in love with each other. Prem tells his sister-in-law, Nisha's older sister, Pooja, that he loves Nisha.Pooja binds the two with her blessings and a necklace. Before Pooja can tell anyone the good news, she falls down the stairs, and dies. Everyone feels they lost their life after Pooja dies, because she had a magic touch that even the dog, Tuffy, notices. Rajesh finds life hard without Pooja, and he finds it especially hard to raise their son. The parents decide to get Rajesh married to Nisha so that he won't feel so lonely, and his son will get a mother. Nisha unknowingly accepts because she thinks that she is going to marry Prem. When she finds out she is marrying Rajesh, the two lovers decide to sacrifice their love for Rejesh's happiness. The servant that Pooja treated like a brother prays to God to stop the wedding and have Prem and Nisha get married. The dog decides to do something and takes the necklace Pooja gave to Nisha to wear to her wedding with Prem. Nisha writes a note saying that she is giving Pooja's bind back to Prem. The dog takes the necklace and note and instead of giving it to Prem, he gives to Rajesh. Rajesh finds out that Nisha and Prem love each other, and steps aside so that his younger brother can marry Nisha. They live happily ever after.", "genres": ["Comedy", "Drama", "Musical"], "imdb": {"id": 110076, "rating": 7.7, "votes": 9343}, "languages": ["Hindi", "Urdu"], "lastupdated": "2015-09-01 00:17:59.490000000", "num_mflix_comments": 2, "plot": "It tells the story of two lovers, Prem (Salman Khan) and Nisha (Madhuri Dixit). Their older siblings, Rajesh and Pooja get married. After Pooja has her baby, the elders decide to get Prem ...", "poster": "https://m.media-amazon.com/images/M/MV5BZjc0ODAwMmItMmQwMy00MmRmLThjOGYtZGEwYjQ2ZjcyYzA3XkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY1000_SX677_AL_.jpg", "released": 776044800000, "runtime": 206, "title": "Hum Aapke Hain Koun...!", "tomatoes": {"dvd": 1080604800000, "lastUpdated": 1441310476000, "production": "Rajshri Media", "viewer": {"meter": 90, "numReviews": 6853, "rating": 4.2}}, "type": "movie", "writers": ["Sooraj R. Barjatya (dialogue)", "Sooraj R. Barjatya (screenplay)"], "year": 1994}