{"_id": "573a13bdf29313caabd5a2c0", "awards": {"nominations": 4, "text": "2 wins & 4 nominations.", "wins": 2}, "cast": ["Gerard Butler", "Tom Wilkinson", "Thandie Newton", "Mark Strong"], "countries": ["UK", "USA", "France"], "directors": ["Guy Ritchie"], "fullplot": "Lenny Cole, a London mob boss, puts the bite on all local real estate transactions. For substantial fees, he's helping Uri Omovich, a Russian developer. As a sign of good faith, Omovich loans Cole a valuable painting, promptly stolen off Cole's wall. While Cole's men, led by the dependable Archie, look for the canvas, three local petty criminals, the Wild Bunch, steal money from the Russian using inside information from his accountant, the lovely Stella. Meanwhile, a local drug-addled rocker, Johnny Quid, is reported drowned, and his connection to Cole is the key to unraveling the deceits and double crosses of life in the underworld.", "genres": ["Action", "Crime", "Thriller"], "imdb": {"id": 1032755, "rating": 7.3, "votes": 179861}, "languages": ["English", "Russian"], "lastupdated": "2015-09-04 00:33:01.680000000", "metacritic": 53, "num_mflix_comments": 1, "plot": "In London, a real-estate scam puts millions of pounds up for grabs, attracting some of the city's scrappiest tough guys and its more established underworld types, all of whom are looking to get rich quick. While the city's seasoned criminals vie for the cash, an unexpected player -- a drugged out rock 'n' roller presumed to be dead but very much alive -- has a multi-million dollar prize fall into...", "poster": "https://m.media-amazon.com/images/M/MV5BMTQ0NTk5Mzk2OV5BMl5BanBnXkFtZTcwMDE3NTE4MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1225411200000, "runtime": 114, "title": "RocknRolla", "tomatoes": {"boxOffice": "$5.7M", "consensus": "Mixed reviews for Guy Ritchie's return to his London-based cockney wideboy gangster movie roots, but most agree, it's a step in the right direction following two major turkeys.", "critic": {"meter": 59, "numReviews": 145, "rating": 6}, "dvd": 1233014400000, "fresh": 85, "lastUpdated": 1442342677000, "production": "Warner Bros. Pictures/Dark Castle", "rotten": 60, "viewer": {"meter": 71, "numReviews": 55994, "rating": 3.6}, "website": "http://rocknrolla.warnerbros.com/"}, "type": "movie", "writers": ["Guy Ritchie"], "year": 2008}