{"_id": "573a13b7f29313caabd4a8bd", "awards": {"nominations": 0, "text": "3 wins.", "wins": 3}, "cast": ["Hannu-Pekka Bjèrkman", "Otto Gustavsson", "Jonas Rinne", "Kari Vèènènen"], "countries": ["Finland"], "directors": ["Juha Wuolijoki"], "fullplot": "Hundreds of years ago in Lapland, a little boy named Nikolas loses his family in an accident. The villagers decide to look after the orphaned boy together. Once a year - at Christmas - Nikolas moves to a new home. To show his gratitude, Nikolas decides to make toys for the children of the families as good-bye presents. Over the years, Nikolas's former adoptive families become many, and soon almost every house has presents on its doorstep on Christmas morning. At thirteen, Nikolas is sent to live and work with Iisakki, a grumpy old carpenter, who forbids Nikolas to continue making presents for Christmas. Gradually, however, Nikolas wins Iisakki's trust. Together they begin to look after the Christmas traditional that Nikolas has begun. When the aged Iisakki has to leave Nikolas and move away, the tradition of Christmas presents is once again at risk. Thankfully, Nikolas comes up with a solution that brings children joy every Christmas, even continuing to today.", "genres": ["Drama", "Family", "Fantasy"], "imdb": {"id": 772176, "rating": 6.9, "votes": 2052}, "languages": ["Finnish"], "lastupdated": "2015-08-24 00:01:39.070000000", "num_mflix_comments": 2, "plot": "The touching story of how Santa Claus came to be Santa.", "poster": "https://m.media-amazon.com/images/M/MV5BOWMyZGZhOTktN2JhOS00MTk3LTk1ZmUtZWJjZjQ5NjEyMjFmXkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 1195171200000, "runtime": 83, "title": "Christmas Story", "tomatoes": {"dvd": 1257206400000, "lastUpdated": 1441134601000, "viewer": {"meter": 58, "numReviews": 2146, "rating": 3.5}}, "type": "movie", "writers": ["Marko Leino (screenplay)", "Marko Leino (story)", "Aku Louhimies (story)", "Juha Wuolijoki (story)"], "year": 2007}