{"_id": "573a1399f29313caabcec861", "awards": {"nominations": 2, "text": "2 wins & 2 nominations.", "wins": 2}, "cast": ["Robert De Niro", "Annette Bening", "George Wendt", "Patricia Wettig"], "countries": ["USA"], "directors": ["Irwin Winkler"], "fullplot": "David Merrill (Robert De Niro), a fictitious 1950s Hollywood director, returns from filming abroad in France to find that his loyalty has been called into question by the House Committee on Un-American Activities and he is unable to work until cleared. Before being called, his highest priority had been his work to the extent of leaving his wife (Annette Bening) and son (Luke Edwards) alone for months at a time. He initially refuses to implicate others or himself in a private meeting with Roy Cohn and a studio lawyer. This decision initially to stick to his principles first leaves him unable to work in his profession, even with films and producers he never would have worked with before. Harassment by the FBI leaves him unable to work on Broadway, with advertising agencies, or even in a small film repair shop. Finally, having fallen so far, and tempted with a new offer to direct a film from his old studio (if he testifies), he agrees to go before the Committee, initially planning to name his friends. But when confronted with the cruel and tyrannical behavior of the House Committee on Un-American Activities, he realizes that there is a higher priority in his life there is standing up for what is right. And in doing so, he inspires friends and family to do the same.", "genres": ["Drama"], "imdb": {"id": 101984, "rating": 6.5, "votes": 5785}, "languages": ["English"], "lastupdated": "2015-08-16 00:56:03.680000000", "num_mflix_comments": 2, "plot": "David Merrill (Robert De Niro), a fictitious 1950s Hollywood director, returns from filming abroad in France to find that his loyalty has been called into question by the House Committee on...", "poster": "https://m.media-amazon.com/images/M/MV5BM2RlN2UxYTAtMzk1Yi00NDdmLWI4NTAtY2Y5MDZmMDA1ZDRhXkEyXkFqcGdeQXVyNjUwNzk3NDc@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 668995200000, "runtime": 105, "title": "Guilty by Suspicion", "tomatoes": {"critic": {"meter": 65, "numReviews": 17, "rating": 6.1}, "dvd": 1086048000000, "fresh": 11, "lastUpdated": 1442260293000, "production": "Warner Home Video", "rotten": 6, "viewer": {"meter": 55, "numReviews": 3436, "rating": 3.2}}, "type": "movie", "writers": ["Irwin Winkler"], "year": 1991}