{"_id": "573a139ef29313caabcfe69c", "awards": {"nominations": 25, "text": "Nominated for 4 Golden Globes. Another 15 wins & 25 nominations.", "wins": 19}, "cast": ["Leelee Sobieski", "Chad Willett", "Jacqueline Bisset", "Powers Boothe"], "countries": ["Canada"], "fullplot": "Joan of Arc is born in 1412 in the village of Domrèmy in the war zone of Northern France. During her youth she often witnesses the horrors of war, but her spirit is kept high by the legend of the Maiden of Lorraine. This says that a young maiden one day will unite the divided country and lead the people to freedom. 11 years old she starts hearing voices from Saint Catherine and Archangel Michael. Through them she is commissioned by God to go to Prince Charles in Chinon, to convince him to become the King of France and drive the English occupants away. Charles thinks that Joan could be the catalyst that animates his disheartened troops. He commissions her to lead the army together with captain La Hire. After their victory at Orlèans Joan participates in the coronation of Charles in Reims. Bishop Cauchon accuses her of heresy, and is relocated to Northern France, where he associates with the English occupants. Joan breaks Charles treaty with Burgundy by attacking Paris. Her troops are defeated, and Charles betrays her by letting the Burgundians capture her. They hand her over to their English allies, who put her on a trial led by bishop Cauchon. The court sentences her to be burned at the stake as a heretic.", "genres": ["Adventure", "Biography", "Drama"], "imdb": {"id": 178145, "rating": 6.7, "votes": 4856}, "languages": ["English"], "lastupdated": "2015-09-12 00:02:15.620000000", "num_mflix_comments": 1, "plot": "Joan of Arc is born in 1412 in the village of Domrèmy in the war zone of Northern France. During her youth she often witnesses the horrors of war, but her spirit is kept high by the legend ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTM2MTUzOTg4OF5BMl5BanBnXkFtZTcwODY1NjIyMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "UNRATED", "released": 926812800000, "runtime": 180, "title": "Joan of Arc", "tomatoes": {"critic": {"meter": 11, "numReviews": 9, "rating": 4}, "dvd": 982627200000, "fresh": 1, "lastUpdated": 1442266937000, "production": "Artisan Entertainment", "rotten": 8, "viewer": {"meter": 57, "numReviews": 37552, "rating": 3}}, "type": "movie", "year": 1999}