{"_id": "573a13dcf29313caabdb0df0", "awards": {"nominations": 15, "text": "7 wins & 15 nominations.", "wins": 7}, "cast": ["Mahmoud Asfa", "Ruba Blal", "Saleh Bakri", "Anas Algaralleh"], "countries": ["Palestine", "Jordan", "Greece", "United Arab Emirates"], "directors": ["Annemarie Jacir"], "fullplot": "1967. The world is alive with change: brimming with reawakened energy, new styles, music and an infectious sense of hope. In Jordan, a different kind of change is underway as tens of thousands of refugees pour across the border from Palestine. Having been separated from his father in the chaos of war, Tarek, 11, and his mother Ghaydaa, are amongst this latest wave of refugees. Placed in \"temporary\" refugee camps made up of tents and prefab houses until they would be able to return, they wait, like the generation before them who arrived in 1948. With difficulties adjusting to life in Harir camp and a longing to be reunited with his father, Tarek searches a way out, and discovers a new hope emerging with the times. Eventually his free spirit and curious nature lead him to a group of people on a journey that will change their lives. When I Saw You is the story of people affected by the times around them, in search of something more in their lives. A journey full of adventure, love, humor, and the desire to be free. A story of the human spirit that knows no borders.", "genres": ["Drama"], "imdb": {"id": 2369543, "rating": 6.4, "votes": 343}, "languages": ["Arabic", "English"], "lastupdated": "2015-08-21 00:26:23.203000000", "metacritic": 72, "num_mflix_comments": 1, "plot": "1967. The world is alive with change: brimming with reawakened energy, new styles, music and an infectious sense of hope. In Jordan, a different kind of change is underway as tens of ...", "poster": "https://m.media-amazon.com/images/M/MV5BMjAyMzM3MTEyM15BMl5BanBnXkFtZTgwMTY0MzgxMDE@._V1_SY1000_SX677_AL_.jpg", "released": 1389744000000, "runtime": 98, "title": "When I Saw You", "tomatoes": {"critic": {"meter": 100, "numReviews": 9, "rating": 7.2}, "dvd": 1408320000000, "fresh": 9, "lastUpdated": 1441992887000, "production": "Philistine Films", "rotten": 0, "viewer": {"meter": 74, "numReviews": 93, "rating": 3.8}}, "type": "movie", "writers": ["Annemarie Jacir (screenplay)"], "year": 2012}