{"_id": "573a1395f29313caabce1a5f", "awards": {"nominations": 7, "text": "Nominated for 1 Oscar. Another 1 win & 7 nominations.", "wins": 2}, "cast": ["Robert Ryan", "Peter Ustinov", "Melvyn Douglas", "Paul Rogers"], "countries": ["UK"], "directors": ["Peter Ustinov"], "fullplot": "H.M.S. Avenger is headed into battle against the French fleet during the Napoleonic Wars, and the dark shadow of two recent mutinies in the English fleet concern Captain Vere. He relies on his cruel and often sadistic Master-at-Arms John Claggert to maintain what he believes to be tenuous order and discipline aboard the ship. When a new seaman, Billy Budd, is pressed into service from a passing merchantman, his innocent, happy-go-lucky attitude quickly endears him to both his messmates as well as the ship's officers. However, his charismatic naivete seems to bother Claggert, whose perverse depravity makes him resent Billy's good-natured purity, especially after the teenager's promotion to fore-top captain. The mean-spirited Claggert unfairly plots to put him on report and ultimately perjures himself when he accuses Billy of conspiring to mutiny.", "genres": ["Adventure", "Drama", "History"], "imdb": {"id": 55796, "rating": 7.8, "votes": 2751}, "languages": ["English"], "lastupdated": "2015-08-22 00:36:16.233000000", "plot": "Billy is an innocent, naive seaman in the British Navy in 1797. When the ship's sadistic master-at-arms is murdered, Billy is accused and tried.", "poster": "https://m.media-amazon.com/images/M/MV5BNzFiZDMyZjEtZTM1Zi00ZGM2LWEyNDYtYzFmY2E0ZGUyNTZiL2ltYWdlXkEyXkFqcGdeQXVyNjQzNDI3NzY@._V1_SY1000_SX677_AL_.jpg", "rated": "APPROVED", "released": -225244800000, "runtime": 123, "title": "Billy Budd", "tomatoes": {"critic": {"meter": 100, "numReviews": 7, "rating": 7.3}, "dvd": 1173139200000, "fresh": 7, "lastUpdated": 1441044157000, "production": "Allied Artists Pictures", "rotten": 0, "viewer": {"meter": 87, "numReviews": 429, "rating": 4}}, "type": "movie", "writers": ["Louis O. Coxe (based upon the play: \"Billy Budd\")", "Robert H. Chapman (based upon the play: \"Billy Budd\")", "Herman Melville (from the novel: \"Billy Budd Foretopman\")", "Peter Ustinov (screenplay)", "DeWitt Bodeen (screenplay)"], "year": 1962}