{"_id": "573a13daf29313caabdab9e6", "awards": {"nominations": 4, "text": "2 wins & 4 nominations.", "wins": 2}, "cast": ["Steven Strait", "Gina Rodriguez", "Ana Ortiz", "Taylor Gildersleeve"], "countries": ["USA"], "directors": ["Nicole Gomez Fisher"], "fullplot": "As SLEEPING WITH THE FISHES opens, it's safe to say Alexis Rodriguez Fish (Gina Rodriguez) has seen better days. The recent death of her cheating husband has left her both broke and broken-hearted. Trying to climb out of debt, Alexis has been reduced to juggling humiliating odd end jobs including a walking meatball hero and phone sex operator. Unhappy with the direction she is headed, Alexis struggles to find her way as the life she once knew, unfortunately no longer exists. When she receives an unexpected call from her quirky, comic-book obsessed older sister, Kayla (Ana Ortiz), to come home for a distant aunt's funeral-Alexis realizes her life might just get worse before it gets any better. Dreading the notion of going home, Alexis fears admitting to her family, especially her well-intentioned but overbearing mother, that her life is \"un desastre.\" (a disaster) Once home, Alexis is immediately confronted by her mother (Priscilla Lopez) about her life and the choices she's made since her husband's death. Suddenly re-immersed in her Latin and Jewish roots, Alexis feels like a fish out of water. With family tension quickly growing, Kayla tries to get Alexis back into her former career as a party planner with a job helping coordinate a superhero-themed Bat Mitzvah. Not exactly the answer to her prayers, Alexis is hesitant to take on the project. But with encouraging words from her father (Tibor Feldman), she ultimately gives in-a decision which leads to a promising new romance with Dominic (Steven Strait). With love on the horizon and a new found understanding for her dysfunctional family, Alexis is finally able to let go of her past and begin defining her own future. A slice-of-life, SLEEPING WITH THE FISHES features an incredible Latino cast of established and rising talent who come together to tell a relatable and comically poignant story.", "genres": ["Comedy"], "imdb": {"id": 2286988, "rating": 6, "votes": 123}, "languages": ["English"], "lastupdated": "2015-08-26 00:10:24.120000000", "num_mflix_comments": 5, "plot": "A woman's journey of self-discovery and the dynamics of her zany family.", "poster": "https://m.media-amazon.com/images/M/MV5BMjE5NjM5NjUxNF5BMl5BanBnXkFtZTgwNTc0NDMzMjE@._V1_SY1000_SX677_AL_.jpg", "released": 1376092800000, "title": "Sleeping with the Fishes", "tomatoes": {"dvd": 1412640000000, "lastUpdated": 1440097160000, "production": "Breaking Glass Pictures", "viewer": {"meter": 0, "numReviews": 15, "rating": 2.7}, "website": "http://www.fishesthemovie.com/"}, "type": "movie", "writers": ["Nicole Gomez Fisher"], "year": 2013}