{"_id": "573a13d0f29313caabd8d412", "awards": {"nominations": 5, "text": "4 wins & 5 nominations.", "wins": 4}, "cast": ["Tristan Halilaj", "Refet Abazi", "Zana Hasaj", "Erjon Mani"], "countries": ["USA", "Albania", "Denmark", "Italy"], "directors": ["Joshua Marston"], "fullplot": "This film's center is a family in Albania. The main characters are Rudina, the oldest daughter, and Nik, the oldest son. Both have a pretty normal life. Rudina is an A-student in high-school and Nik very popular. He just fell in love with one of his fellow students. Their father earns the families income with a little bread delivery service. For that he uses a short cut through the neighbours ground, but the neighbour doesn't necessarily like that. But the ground had actually belonged to Rudina's and Nik's family once. One day the conflict escalates and the neighbour gets killed by Rudina's and Nik's father and their uncle. Because only their uncle gets caught by the police and their father is able to hide, the old law of blood feud is against the family. They cannot leave their house. Only the women of the family are allowed to leave the house. So Rudina has to quit school and continue the bread delivery service of the father, so the family can survive. The situation is tense as there seems to be no solution to the conflict.", "genres": ["Drama"], "imdb": {"id": 1787127, "rating": 6.9, "votes": 1444}, "languages": ["Albanian"], "lastupdated": "2015-09-11 00:06:53.170000000", "metacritic": 73, "num_mflix_comments": 4, "plot": "An Albanian family is torn apart by a murder, resulting in a blood feud that finds Nik becoming the prime target and his sister, Rudina, forced to leave school in order to take over the family business", "poster": "https://m.media-amazon.com/images/M/MV5BMTQxMDcxNjU5NV5BMl5BanBnXkFtZTcwNDI5MjgyNw@@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 1316217600000, "runtime": 109, "title": "The Forgiveness of Blood", "tomatoes": {"boxOffice": "$0.1M", "critic": {"meter": 84, "numReviews": 64, "rating": 7.2}, "dvd": 1350345600000, "fresh": 54, "lastUpdated": 1439406868000, "production": "IFC Films", "rotten": 10, "viewer": {"meter": 73, "numReviews": 1577, "rating": 3.7}, "website": "http://www.ifcfilms.com/films/the-forgiveness-of-blood"}, "type": "movie", "writers": ["Joshua Marston", "Andamion Murataj"], "year": 2011}