{"_id": "573a13abf29313caabd23fba", "awards": {"nominations": 18, "text": "Nominated for 1 Golden Globe. Another 8 wins & 18 nominations.", "wins": 9}, "cast": ["Antonio Banderas", "Eion Bailey", "Alan Arkin", "Jim Broadbent"], "countries": ["USA"], "directors": ["Bruce Beresford"], "fullplot": "Mexican revolutionary Pancho Villa (Antonio Banderas) finds himself without adequate funding to finance his war against the military-run government. He also finds himself at odds with the Americans because of the Hearst media empire's press campaign against him. To counter both of these, he sends emissaries to movie producers to convince them to pay to film his progress and the actual battles. Producer D.W. Griffith (Colm Feore) becomes interested and sends Frank Thayer (Eion Bailey) with a film crew to develop film reels. Thayer becomes horrified and fascinated by the bandit. He finds an enigmatic individual that is both ghoulishly brutal and charmingly captivating. The resulting film became the first feature length movie, introducing scores of Americans to the true horrors of war that they had never personally seen. Thayer sold the studios on making the film despite their concerns that no one would sit through a movie longer than 1 hour by convincing them that they could raise the price of movies to ten cents, doubling the going price at that time.", "genres": ["Biography", "Drama", "History"], "imdb": {"id": 337824, "rating": 6.6, "votes": 2567}, "languages": ["English"], "lastupdated": "2015-09-02 00:23:31.803000000", "num_mflix_comments": 1, "plot": "Hollywood makes a deal with Mexican revolutionary Pancho Villa to film his war and recreate his life.", "poster": "https://m.media-amazon.com/images/M/MV5BMjM1NTMwMjI2Nl5BMl5BanBnXkFtZTgwMTAwNzgwMzE@._V1_SY1000_SX677_AL_.jpg", "released": 1062892800000, "runtime": 112, "title": "And Starring Pancho Villa as Himself", "tomatoes": {"dvd": 1135641600000, "lastUpdated": 1441220471000, "production": "HBO Video", "viewer": {"meter": 50, "numReviews": 847, "rating": 3.3}}, "type": "movie", "writers": ["Larry Gelbart"], "year": 2003}