{"_id": "573a13bdf29313caabd5acf4", "awards": {"nominations": 0, "text": "2 wins.", "wins": 2}, "cast": ["Adrian Paul", "Dale Girard", "Mikey Wiseman", "John S. Rushton"], "countries": ["USA"], "directors": ["Richard Clabaugh"], "fullplot": "Are government surveillance cameras intended to keep us safe actually killing people? Is it a plot by the government to suppress the opposition, or have our terrorist enemies secretly gained control of our security system and are now using it against us? Following another major terrorist attack the US instigates an intense government surveillance program in which every camera in the country is linked into a single, all-seeing network called the ODIN system (for Optical Defense Intelligence Network). The system includes millions of mobile, robotic surveillance cameras known as \"Eyeborgs,\" which watch everyone for suspicious behavior, all in the name of security, law enforcement and keeping America safe. An agent for the Department of Homeland Security grows suspicious of the system after a series of odd murders in which the physical evidence doesn't match up to what the video records show. Now he must work outside the system to find out who is really controlling the Eyeborgs. With the help of a broadcast journalist and a purple haired Punk Rocker who turns out to be the President's nephew, he must stop a plot to assassinate the President during the final debate of the election.", "genres": ["Action", "Crime", "Sci-Fi"], "imdb": {"id": 1043844, "rating": 4.9, "votes": 1897}, "languages": ["English"], "lastupdated": "2015-09-10 17:19:10.920000000", "plot": "A federal agent investigates when inconsistencies turn up in the photographic evidence of several murders recorded by mobile robotic cameras.", "poster": "https://m.media-amazon.com/images/M/MV5BMTY1NDk3NTU5NF5BMl5BanBnXkFtZTcwMzIxODk2MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1278374400000, "runtime": 102, "title": "Eyeborgs", "tomatoes": {"dvd": 1249948800000, "lastUpdated": 1435262419000, "production": "Entertainment One", "viewer": {"meter": 88, "numReviews": 124, "rating": 4.2}, "website": "http://www.fiercelight.org/"}, "type": "movie", "writers": ["Fran Clabaugh", "Richard Clabaugh"], "year": 2009}