{"_id": "573a1396f29313caabce4ed3", "awards": {"nominations": 0, "text": "Nominated for 1 BAFTA Film Award. Another 3 wins.", "wins": 4}, "cast": ["Martin Sheen", "Sissy Spacek", "Warren Oates", "Ramon Bieri"], "countries": ["USA"], "directors": ["Terrence Malick"], "fullplot": "It's the late 1950s. Mid-twenty-something Kit is a restless and unfocused young man with a James Dean vibe and swagger which he has heard mentioned about him more than once. Fifteen year old Holly has a somewhat cold relationship with her sign painter father, if only because she is the primary reminder of his wife, who died of pneumonia when Holly was a child. The two meet when Holly and her father move from Texas to the small town where Kit lives, Fort Dupree, South Dakota. They slowly fall in love, something about which she cannot tell her father because of their age difference and Kit coming from the wrong side of the tracks. When he tries to take Holly away with him, Kit, on an impulse, shoots her father dead. After letting the initial emotions of the situation settle down, Holly decides voluntarily to go with Kit, they trying to make it look like they committed suicide in a house fire. But they soon learn that their plan did not work, there being a bounty on their heads. As such, Kit continues his murderous ways in order to protect the life he wants to eke out with Holly. She, on the other hand, wants to support Kit, especially as he begins to feel more and more trapped, but she may only be able to endure what looks increasingly to be a battle they cannot win as a couple. Through it all, they openly and privately muse about their philosophies on their life considering their current circumstance.", "genres": ["Crime", "Drama"], "imdb": {"id": 69762, "rating": 7.9, "votes": 42455}, "languages": ["English", "Spanish"], "lastupdated": "2015-08-18 00:13:05.093000000", "metacritic": 90, "num_mflix_comments": 2, "plot": "An impressionable teen girl from a dead-end town and her older greaser boyfriend go on a killing spree in the South Dakota badlands.", "poster": "https://m.media-amazon.com/images/M/MV5BMDcxNjhiOTEtMzQ0YS00OTBhLTkxM2QtN2UyZDMzNzIzNWFlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 126576000000, "runtime": 94, "title": "Badlands", "tomatoes": {"consensus": "Terrence Malick's debut is a masterful slice of American cinema, rife with the visual poetry and measured performances that would characterize his work.", "critic": {"meter": 98, "numReviews": 50, "rating": 8.9}, "dvd": 925171200000, "fresh": 49, "lastUpdated": 1442083203000, "production": "Warner Bros. Pictures", "rotten": 1, "viewer": {"meter": 91, "numReviews": 24817, "rating": 4.1}}, "type": "movie", "writers": ["Terrence Malick"], "year": 1973}