{"_id": "573a13b6f29313caabd45baa", "awards": {"nominations": 0, "text": "3 wins.", "wins": 3}, "cast": ["James Garner", "Bill Cobbs", "Lee Meriwether", "George Lee"], "countries": ["USA"], "directors": ["Michael O. Sajbel"], "fullplot": "Jason thought his inheritance was going to be the gift of money and lots of it. Was he ever in for a big surprise. Based on the best-selling book \"The Ultimate Gift\" by Jim Stovall, the story sends trust fund baby Jason Stevens on an improbable journey of discovery, having to answer the ultimate question: \"What is the relationship between wealth and happiness?\" Jason had a very simple relationship with his impossibly wealthy Grandfather, Howard \"Red\" Stevens. He hated him. No heart-to-heart talks, no warm fuzzies, just cold hard cash. So of course he figured that when Red died, the whole \"reading of the will\" thing would be another simple cash transaction, that his Grandfather's money would allow him to continue living in the lifestyle to which he had become accustomed. But what Red left him was anything but simple. Red instead devised a plan for Jason to experience a crash course on life. Twelve tasks, which Red calls \"gifts,\" each challenging Jason in an improbable way, the accumulation of which would change him forever.", "genres": ["Drama", "Family", "Romance"], "imdb": {"id": 482629, "rating": 7.4, "votes": 13217}, "languages": ["English", "Spanish"], "lastupdated": "2015-09-17 03:17:29.950000000", "metacritic": 49, "plot": "A deceased billionaire leaves his spoiled adult grandson a series of odd tasks to perform in order to receive \"the ultimate gift,\" with the resentful grandson having no idea what that might be.", "poster": "https://m.media-amazon.com/images/M/MV5BYjQxZjMyOGItZDgxZS00NzkwLThjNjgtM2Q3YjdjZTQzNGZjXkEyXkFqcGdeQXVyMTMxMTY0OTQ@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 1173398400000, "runtime": 114, "title": "The Ultimate Gift", "tomatoes": {"boxOffice": "$3.2M", "consensus": "Though The Ultimate Gift avoids religious speechifying like other Fox Faith films, it's dramatically inert with flat direction.", "critic": {"meter": 32, "numReviews": 59, "rating": 5.1}, "dvd": 1174176000000, "fresh": 19, "lastUpdated": 1440352865000, "production": "Fox Faith", "rotten": 40, "viewer": {"meter": 85, "numReviews": 39919, "rating": 4}, "website": "http://www.theultimategift.com/"}, "type": "movie", "writers": ["Cheryl McKay (screenplay)", "Jim Stovall (book)"], "year": 2006}