{"_id": "573a1399f29313caabcee57b", "awards": {"nominations": 11, "text": "10 wins & 11 nominations.", "wins": 10}, "cast": ["Brigitte Lin", "Leslie Cheung", "Maggie Cheung", "Tony Chiu Wai Leung"], "countries": ["Hong Kong", "Taiwan"], "directors": ["Kar Wai Wong"], "fullplot": "Ou-yang Feng lives in the middle of a desert, where he acts as a middle man to various swordsmen in ancient China. One of those swordsmen is Huang Yao-shi, who has found some magic wine that causes one to forget the past. At another time, Huang met Mu-rong Yin and under the influence of drink, promised to marry Mu-rong's sister Mu-rong Yang. Huang jilts her, and Mu-rong Yin hires Ou-yang to kill Huang. But then Mu-rong Yang hires Ou-yang to protect Huang. This is awkward, because Mu-rong Yang and Mu-rong Yin are in reality the same person. Other unrelated plot lines careen about. Among them is Ou-yang's continuing efforts to destroy a band of horse thieves. Oy-yang recruits another swordsman, a man who is going blind and wants to get home to see his wife before his sight goes completely. The swordsman is killed. Ou-yang then meets another swordsman who doesn't like wearing shoes. Oy-yang sends this man after the horse thieves, with better results. We then find out what a man must give up to follow the martial path.", "genres": ["Action", "Drama"], "imdb": {"id": 109688, "rating": 7.2, "votes": 9459}, "languages": ["Mandarin", "Cantonese"], "lastupdated": "2015-09-02 00:14:27.693000000", "metacritic": 69, "num_mflix_comments": 1, "plot": "A broken-hearted hit man moves to the desert where he finds skilled swordsmen to carry out his contract killings.", "poster": "https://m.media-amazon.com/images/M/MV5BOTM2NTJkMDMtMmUxOS00NjRlLTljN2ItMDIwZmEwMjg4YjFlXkEyXkFqcGdeQXVyNzMzMjU5NDY@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 779760000000, "runtime": 100, "title": "Ashes of Time", "tomatoes": {"consensus": "Wong Kar Wai's redux, with a few slight changes from his 1994 classic, is a feast for the eyes, if a little difficult to follow.", "critic": {"meter": 80, "numReviews": 85, "rating": 6.8}, "dvd": 1236038400000, "fresh": 68, "lastUpdated": 1442270180000, "production": "Sony Pictures Classics", "rotten": 17, "viewer": {"meter": 75, "numReviews": 11147, "rating": 3.7}, "website": "http://www.sonyclassics.com/ashesoftimeredux/"}, "type": "movie", "writers": ["Louis Cha (novel)", "Kar Wai Wong (screenplay)"], "year": 1994}