{"_id": "573a1398f29313caabcebd0d", "awards": {"nominations": 0, "text": "4 wins.", "wins": 4}, "cast": ["Revathy", "Raghuvaran", "Prabhu", "Saranya Ponvannan"], "countries": ["India"], "directors": ["Mani Ratnam"], "fullplot": "Chitra, her husband, Shekar, and two children, Arjun and Anu live in a rural area in India. When Chitra is expecting her third child, she is taken on a stormy night to a hospital where she is informed that her child, a girl, has been stillborn. Shortly thereafter the family re-locates to a flat in the city where Shekar works as an Architect at a construction site. Two years later, Chitra starts suspecting Shekar of having an extra-marital affair. When confronted, Shekar is at first elusive, then finally admits that Chitra did give birth to a brain-damaged child, who he left at the care of the hospital. Chitra brings the child home, much to the chagrin of Arjun and Anu, and other neighborhood kids. To make matters more complicated, Shekar witnesses the murder of a Police Inspector, and comes forward to testify, knowing fully well that the killer as well as the Police Department would like to close this file as a suicide. Watch what happens when things snow-ball out of control as Shekar faces off with his neighbors, who want him evicted because of Anjali, and the killer - who wants him to withdraw his testimony.", "genres": ["Family", "Drama"], "imdb": {"id": 99043, "rating": 8, "votes": 1306}, "languages": ["Tamil", "Hindi", "Telugu"], "lastupdated": "2015-08-25 00:39:17.883000000", "num_mflix_comments": 3, "plot": "Chitra, her husband, Shekar, and two children, Arjun and Anu live in a rural area in India. When Chitra is expecting her third child, she is taken on a stormy night to a hospital where she ...", "runtime": 150, "title": "Anjali", "tomatoes": {"critic": {"meter": 15, "numReviews": 27, "rating": 3.8}, "dvd": 919123200000, "fresh": 4, "lastUpdated": 1440525737000, "production": "Paramount Home Video", "rotten": 23, "viewer": {"meter": 35, "numReviews": 59251, "rating": 2.9}}, "type": "movie", "writers": ["Mani Ratnam (screenplay)", "Mani Ratnam (story)", "Javed Siddiqui (dialogue)"], "year": 1990}