{"_id": "573a139af29313caabcf0059", "awards": {"nominations": 9, "text": "7 wins & 9 nominations.", "wins": 7}, "cast": ["Molly Parker", "Peter Outerbridge", "Jay Brazeau", "Natasha Morley"], "countries": ["Canada"], "directors": ["Lynne Stopkewich"], "fullplot": "Sandra Larson has always been fascinated by the entire sensory experience surrounding death: its touch, smell and look. As a child, she would search out dead animals and perform ritualistic burials. As a young woman, Sandra gets a job at Wallis Funeral Home, first as a general assistant, then progressing to study to become an embalmer. At the funeral home, she begins to take her fascination with death to the next level by becoming a necrophiliac. But she also begins her first ever relationship with Matt, a medical student, with who she is totally open about her necrophilia. He finds this aspect of her compelling. He becomes all consumed with her as she is consumed with dead people. The questions become how far he will take this fascination with her to understand fully what is going through her emotional being, how far she will allow him to go, and how far can her feelings for him extend as a live being.", "genres": ["Drama"], "imdb": {"id": 116783, "rating": 6.5, "votes": 2990}, "languages": ["English"], "lastupdated": "2015-09-02 00:23:07.850000000", "num_mflix_comments": 1, "plot": "Over the years, a child's romantic ideals about death blossom into necrophilia, the study of embalming and the most profound relationship of her life.", "poster": "https://m.media-amazon.com/images/M/MV5BYThkOGZmODgtNDZkOS00ZGM2LWI5MWQtNzQ0MzAzM2FkNTM2XkEyXkFqcGdeQXVyMDAyMTY3Nw@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 860716800000, "runtime": 78, "title": "Kissed", "tomatoes": {"critic": {"meter": 70, "numReviews": 20, "rating": 6.8}, "dvd": 1124755200000, "fresh": 14, "lastUpdated": 1432753805000, "rotten": 6, "viewer": {"meter": 67, "numReviews": 3538, "rating": 3.5}}, "type": "movie", "writers": ["Angus Fraser (screenplay)", "Lynne Stopkewich (screenplay)", "Barbara Gowdy (based upon an original story \"We So Seldom Look on Love\" by)"], "year": 1996}