{"_id": "573a13b4f29313caabd40fdb", "awards": {"nominations": 2, "text": "1 win & 2 nominations.", "wins": 1}, "cast": ["Luke Benward", "Hallie Kate Eisenberg", "Adam Hicks", "Austin Rogers"], "countries": ["USA"], "directors": ["Bob Dolman"], "fullplot": "The Forrester family - father Mitch Forrester, mother Helen Forrester, their pre-teen son Billy Forrester and their pre-school son Woody Forrester - have just moved to a new town where Mitch is starting a new job. Both Mitch and Billy are worried about fitting into their new environment. It's worse for Billy as Woody, who is not worried about the move, is at that stage in his life where everything is simple and easy. Billy's first day in the fifth grade at his new school does not go well when he gets into an altercation with the class bullies, led by Joe Guire. The altercation involves worms and Billy stating that he eats worms all the time, which leads to all the bullies calling him \"Wormboy\". As such, Joe bets Billy that he can't eat ten worms (without vomiting), the bet to take place this upcoming Saturday, with the last worm to be consumed by 7pm. Despite having a notoriously weak stomach, Billy takes him up on the bet. As the bet starts, the only classmate on Billy's side is Erika Tansy, a girl with a mind of her own. All the other boys follow Joe if only out of fear, especially as legend has it that the ring that Joe wears contains poison which will lead to a slow death if injected. The boys get into one misadventure after another as they try to find different places and increasingly disgusting ways to cook the worms before Billy consumes them. But by the end of the day, they all learn that there is strength in numbers in dealing with fear.", "genres": ["Comedy", "Family"], "imdb": {"id": 462346, "rating": 5.4, "votes": 3835}, "languages": ["English"], "lastupdated": "2015-08-10 01:03:28.330000000", "metacritic": 56, "plot": "During the first day of his new school year, a fifth grade boy squares off against a bully and winds up accepting a dare that could change the balance of power within the class.", "poster": "https://m.media-amazon.com/images/M/MV5BMTc0MzgwNjcyOV5BMl5BanBnXkFtZTcwNjE3ODQzMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 1156464000000, "runtime": 98, "title": "How to Eat Fried Worms", "tomatoes": {"boxOffice": "$13.0M", "consensus": "This Fear Factor for kids is good-natured and tasty enough.", "critic": {"meter": 59, "numReviews": 73, "rating": 6}, "dvd": 1165276800000, "fresh": 43, "lastUpdated": 1439146089000, "production": "New Line Cinema", "rotten": 30, "viewer": {"meter": 47, "numReviews": 48403, "rating": 3}, "website": "http://www.friedwormsmovie.com/"}, "type": "movie", "writers": ["Bob Dolman (screenplay)", "Thomas Rockwell (novel)"], "year": 2006}