{"_id": "573a13adf29313caabd2b170", "awards": {"nominations": 2, "text": "2 nominations.", "wins": 0}, "cast": ["Aaran Thomas", "Gaspard Ulliel", "Li Gong", "Helena-Lia Tachovskè"], "countries": ["UK", "Czech Republic", "France", "Italy"], "directors": ["Peter Webber"], "fullplot": "Mischa and Hannibal, baby brother and sister, are inseparable; it is their love for each other that ties their bond. Their companionship is forever binding, until, with their family, while hiding from the Nazi war machine a twisted set of circumstance sets the pace for a most vicious attack on the future of one Hannibal Lecter for the sworn vengeance for the brutal killing of his baby sister. Years later, we find Hannibal, the teenager, setting up in Paris, and living with his aunt Lady Murasaki Shikibu and studying at medical school here he finds his forte. Still searching for his sister's murderers, still bitter and still ever hopeful of satisfying his desire for retribution. This chance arrives, and soon we are to learn that for a pound of flesh lost a pound of flesh must be repaid. This is the horrific tale of justice and honor, a young man's growing pains that will have the guilty paying with more than just flesh and bone. This is the up and rising tale of the young Hannibal, prey you do not meet him, for meat you shall be to him. Taste his wroth.", "genres": ["Crime", "Drama", "Thriller"], "imdb": {"id": 367959, "rating": 6.2, "votes": 80460}, "languages": ["English", "German", "Russian"], "lastupdated": "2015-09-04 00:14:22.727000000", "metacritic": 35, "num_mflix_comments": 1, "plot": "After the death of his parents during World War II, young Hannibal Lecter moves in with his beautiful aunt and begins plotting revenge on the barbarians responsible for his sister's death.", "poster": "https://m.media-amazon.com/images/M/MV5BMTIzMTA0NTM4NF5BMl5BanBnXkFtZTcwNjY3ODM0MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1170979200000, "runtime": 121, "title": "Hannibal Rising", "type": "movie", "writers": ["Thomas Harris (screenplay)", "Thomas Harris (novel)"], "year": 2007}