{"_id": "573a1395f29313caabce299c", "awards": {"nominations": 12, "text": "Won 5 Oscars. Another 13 wins & 12 nominations.", "wins": 18}, "cast": ["Julie Andrews", "Christopher Plummer", "Eleanor Parker", "Richard Haydn"], "countries": ["USA"], "directors": ["Robert Wise"], "fullplot": "In 1930's Austria, a young woman named Maria is failing miserably in her attempts to become a nun. When the Navy captain Georg Von Trapp writes to the convent asking for a governess that can handle his seven mischievous children, Maria is given the job. The Captain's wife is dead, and he is often away, and runs the household as strictly as he does the ships he sails on. The children are unhappy and resentful of the governesses that their father keeps hiring, and have managed to run each of them off one by one. When Maria arrives, she is initially met with the same hostility, but her kindness, understanding, and sense of fun soon draws them to her and brings some much-needed joy into all their lives -- including the Captain's. Eventually he and Maria find themselves falling in love, even though Georg is already engaged to a Baroness and Maria is still a postulant. The romance makes them both start questioning the decisions they have made. Their personal conflicts soon become overshadowed, however, by world events. Austria is about to come under the control of Germany, and the Captain may soon find himself drafted into the German navy and forced to fight against his own country.", "genres": ["Biography", "Drama", "Family"], "imdb": {"id": 59742, "rating": 8, "votes": 134605}, "languages": ["English", "German"], "lastupdated": "2015-09-10 17:05:17.847000000", "num_mflix_comments": 1, "plot": "A woman leaves an Austrian convent to become a governess to the children of a Naval officer widower.", "poster": "https://m.media-amazon.com/images/M/MV5BODIxNjhkYjEtYzUyMi00YTNjLWE1YjktNjAyY2I2MWNkNmNmL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "G", "released": -150249600000, "runtime": 174, "title": "The Sound of Music", "tomatoes": {"consensus": "Unapologetically sweet and maybe even a little corny, The Sound of Music will win over all but the most cynical filmgoers with its classic songs and irresistible warmth.", "critic": {"meter": 85, "numReviews": 55, "rating": 7.9}, "dvd": 966816000000, "fresh": 47, "lastUpdated": 1442336701000, "production": "20th Century-Fox", "rotten": 8, "viewer": {"meter": 91, "numReviews": 604697, "rating": 3.6}, "website": "http://www.foxhome.com/soundofmusicdvd/index_frames.html"}, "type": "movie", "writers": ["George Hurdalek (with the partial use of ideas by)", "Howard Lindsay (from the stage musical book by)", "Russel Crouse (from the stage musical book by)", "Ernest Lehman (screenplay)"], "year": 1965}