{"_id": "573a13b3f29313caabd3bb3f", "awards": {"nominations": 5, "text": "3 wins & 5 nominations.", "wins": 3}, "cast": ["Issei Ogata", "Robert Dawson", "Kaori Momoi", "Shirè Sano"], "countries": ["Russia", "Italy", "Switzerland", "France"], "directors": ["Aleksandr Sokurov"], "fullplot": "As Japan nears defeat at the end of World War II, Emperor Hirohito starts his day in a bunker underneath the Imperial Palace in Tokyo. A servant reads to him a list of activities for the day, including a meeting with his ministers, marine biology research, and writing his son. Hirohito muses about the impact on such schedules when the Americans arrive but is told that as long as there is a solitary Japanese person living, the Americans will not reach The Emperor. Hirohito replies that he at times feels like he himself will be the last Japanese person left alive. The servant reminds him that he is a deity, not a person, but Hirohito points out that he has a body just like any other man. He later reflects on the causes of the war when dictating observations about a hermit crab, and then about the peace to come when composing a letter to his son. Soon enough General Douglas MacArthur's personal car is sent to bring him through the ruins of Tokyo for a meeting with the supreme commander of the victorious occupying forces. Underlying all the conversation that follows is the question of Hirohito's future, either as Emperor or a war criminal. The two very different men strangely bond after sharing dinner and Havana cigars, and Hirohito leaves, renounces his divine nature, and is re-united with his family in the palace to face a new life to help re-build his war-ravaged country as a constitutional monarch.", "genres": ["Drama", "History"], "imdb": {"id": 439817, "rating": 7.4, "votes": 2041}, "languages": ["Japanese", "English"], "lastupdated": "2015-07-31 00:01:29.223000000", "metacritic": 85, "num_mflix_comments": 1, "plot": "Third part in Aleksandr Sokurov's quadrilogy of Power, following Moloch (1999) and Taurus (2001), focuses on Japanese Emperor Hirohito and Japan's defeat in World War II when he is finally confronted by General Douglas MacArthur who offers him to accept a diplomatic defeat for survival.", "poster": "https://m.media-amazon.com/images/M/MV5BMTM0OTczMDEzOV5BMl5BanBnXkFtZTcwNzQwMTMzMw@@._V1_SY1000_SX677_AL_.jpg", "released": 1132272000000, "runtime": 110, "title": "The Sun", "tomatoes": {"boxOffice": "$46.4k", "consensus": "Certainly not for the impatient, Aleksandr Sokurov's deliberately paced look at Hirohito in the waning days of World War II is both enlightening and admirable in its restraint.", "critic": {"meter": 92, "numReviews": 36, "rating": 8}, "dvd": 1275350400000, "fresh": 33, "lastUpdated": 1439836525000, "production": "Lorber Films", "rotten": 3, "viewer": {"meter": 78, "numReviews": 984, "rating": 3.7}}, "type": "movie", "writers": ["Yuriy Arabov", "Jeremy Noble"], "year": 2005}