{"_id": "573a13daf29313caabdab417", "awards": {"nominations": 2, "text": "1 win & 2 nominations.", "wins": 1}, "cast": ["Mina Tander", "Laura de Boer", "Lina Kèhlert", "Mia Kasalo"], "countries": ["Germany"], "directors": ["Alex Schmidt"], "fullplot": "During their childhood Hanna and Clarissa were the best of friends. They spent every vacation together with their parents in an old summer house on a small island. Shortly after Hanna's 9th birthday they suddenly lost touch until an unexpected reunion 25 years later. Hanna is now married, has a seven-year-old daughter and is the chief resident physician at a hospital, which is where she meets her old friend who is delivered to the ER after overdosing on sleeping pills. The two women pick up their friendship where they left off and spontaneously decide to spend a few days on the island, just like in the old days. With Hanna's daughter Lea in tow they return to the place where they spent their childhood. When Hanna learns that a playmate of hers from the island's village, disappeared as a child and was never seen or heard from again, she begins to search the past. Something horrible must have happened on the island back then. But the closer Hanna gets to the dark secret, the tighter the noose around the women becomes, the greater the menace. The truth that comes to light is much more terrible and horrific than Hanna ever could have imagined.", "genres": ["Drama", "Mystery", "Thriller"], "imdb": {"id": 2278988, "rating": 5.8, "votes": 422}, "languages": ["German"], "lastupdated": "2015-08-29 00:58:50.453000000", "plot": "During a vacation on an island, two best friends from childhood are haunted by the ghosts of their past.", "poster": "https://m.media-amazon.com/images/M/MV5BNzg1MDk4MDc4NV5BMl5BanBnXkFtZTgwNjYzNjAzMTE@._V1_SY1000_SX677_AL_.jpg", "released": 1355961600000, "runtime": 96, "title": "Forgotten", "tomatoes": {"lastUpdated": 1438023039000, "viewer": {"numReviews": 14, "rating": 3.2}}, "type": "movie", "writers": ["Alex Schmidt", "Valentin Mereutza"], "year": 2012}