{"_id": "573a1397f29313caabce8413", "awards": {"nominations": 28, "text": "Won 4 Oscars. Another 50 wins & 28 nominations.", "wins": 54}, "cast": ["Dee Wallace", "Henry Thomas", "Peter Coyote", "Robert MacNaughton"], "countries": ["USA"], "directors": ["Steven Spielberg"], "fullplot": "While visiting the Earth at Night, a group of alien botanists is discovered and disturbed by an approaching human task force. Because of the more than hasty take-off, one of the visitors is left behind. The little alien finds himself all alone on a very strange planet. Fortunately, the extra-terrestrial soon finds a friend and emotional companion in 10-year-old Elliot, a lonely boy whose parents have separated. While E.T. slowly gets acquainted with Elliot's older brother Michael, his sister Gertie and the customs of Earth, members of the task force work day and night to track down the whereabouts of Earth's first visitor from outer space. The wish to go home again is strong in E.T., and after being able to communicate with Elliot and the others, E.T. starts building an improvised device to send a message home for his people to come and pick him up. But before long, E.T. gets seriously sick, and because of his special connection to Elliot, the young boy suffers, too. The situation gets critical when the task force finally intervenes. By then, all help may already be too late, and there's no alien spaceship in sight.", "genres": ["Family", "Sci-Fi"], "imdb": {"id": 83866, "rating": 7.9, "votes": 259190}, "languages": ["English"], "lastupdated": "2015-09-10 17:09:55.417000000", "metacritic": 94, "num_mflix_comments": 400, "plot": "A troubled child summons the courage to help a friendly alien escape Earth and return to his home-world.", "poster": "https://m.media-amazon.com/images/M/MV5BMTQ2ODFlMDAtNzdhOC00ZDYzLWE3YTMtNDU4ZGFmZmJmYTczXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 392601600000, "runtime": 115, "title": "E.T. the Extra-Terrestrial", "tomatoes": {"consensus": "Playing as both an exciting sci-fi adventure and a remarkable portrait of childhood, Steven Spielberg's touching tale of a homesick alien remains a piece of movie magic for young and old.", "critic": {"meter": 98, "numReviews": 111, "rating": 9.2}, "dvd": 1035244800000, "fresh": 109, "lastUpdated": 1442251562000, "production": "Universal Pictures", "rotten": 2, "viewer": {"meter": 71, "numReviews": 32310136, "rating": 3.5}, "website": "http://www.et20.com/"}, "type": "movie", "writers": ["Melissa Mathison"], "year": 1982}