{"_id": "573a13b2f29313caabd392d6", "awards": {"nominations": 18, "text": "3 wins & 18 nominations.", "wins": 3}, "cast": ["Leon Lai", "Donnie Yen", "Honglei Sun", "Charlie Yeung"], "countries": ["Hong Kong", "China", "South Korea"], "directors": ["Hark Tsui"], "fullplot": "In the early 1600's, the Manchurians have taken over sovereignty of China and established the Ching Dynasty. While many nationalist revolts still brew within the martial artists' community, the newly set-up government immediately imposes a Martial Arts Ban, forbidding the practice of martial arts altogether in order to gain control and order. Wind Fire (Sun Hong-Lei), a surrendered military official from the previous dynasty, sees this as an opportunity to make a fortune for himself by helping to execute the new law. Greedy, cruel, and immoral, Wind Fire ravages the North-western China, and his next goal is to attack the final frontier, Martial Village. Fu Qingzhu, a retired executioner from the previous dynasty, feels the need to put a stop to this brutality and sets out to save Bowei Fortress. He brings Wu Yuanyin and Han Zhiban from the village with him to Mount Heaven to seek help from Master Shadow-Glow, a hermit who is a master of swords and leads a group of disciples of great swordsmanship. Master Shadow-Glow agrees to help, and orders four of his best disciples to go. Together with Chu Zhaonan, Yang Yunchong, Mulong, and Xin Longzi, the SEVEN SWORDS is formed and their heroic journey begins. As they lead the entire village to the road of a safer place, they begin to encounter mysterious confusion. Food and water is poisoned, and trails of escape are marked with signs leading the enemy to them. They soon realize that there is an undercover spy, and the SEVEN SWORDS must identify him/her before Wind Fire's army gets to them. Between this narrow gap of life and death, the situation is further complicated by the blossoms of love.", "genres": ["Action", "Adventure", "Fantasy"], "imdb": {"id": 429078, "rating": 6.2, "votes": 7742}, "languages": ["Mandarin", "Korean", "Cantonese"], "lastupdated": "2015-08-16 00:36:23.837000000", "plot": "Seven warriors come together to protect a village from a diabolical General.", "poster": "https://m.media-amazon.com/images/M/MV5BM2Y0MDM3YWItYTUxMi00MGM3LThkNmYtNWRlM2ZhYTRmMDg0XkEyXkFqcGdeQXVyMjMxMDM2NjY@._V1_SY1000_SX677_AL_.jpg", "released": 1122595200000, "runtime": 153, "title": "Seven Swords", "tomatoes": {"critic": {"meter": 25, "numReviews": 16, "rating": 4.8}, "dvd": 1168905600000, "fresh": 4, "lastUpdated": 1441134940000, "production": "Mandarin Films", "rotten": 12, "viewer": {"meter": 55, "numReviews": 7920, "rating": 3.4}, "website": "http://www.sevenswordsthefilm.com/"}, "type": "movie", "writers": ["Chi-Sing Cheung", "Tin Nam Chun", "Yusheng Liang (novel)", "Hark Tsui"], "year": 2005}