{"_id": "573a139cf29313caabcf5742", "awards": {"nominations": 2, "text": "2 nominations.", "wins": 0}, "cast": ["Diego Abatantuono", "Silvio Orlando", "Valentina Cervi", "Flavio Insinna"], "countries": ["Italy"], "directors": ["Davide Ferrario"], "fullplot": "A bungling bank robber, an uncooperative hostage with a secret, a gay policeman and a situation which rapidly goes from bad to worse are the ingredients to this very funny and unpredictable caper flick. Sad sack Domenico is an unemployed man who decides to rob a Turin bank and then to travel north to Switzerland with his loot. But things don't work out that way: For the heist is messy and he ends up with the tall, patrician Tommaso as his hostage. Tommaso, a businessman who is on the verge of bankruptcy, quickly takes over and convinces convincing Domenico to, instead, head south, get help from a friend of Tommaso and sail off to Egypt. But the plan soon unravels, as Domenico discovers that the friend, Orfeo, is actually Tommaso's lover and a policeman to boot. The odd couple is now the odd triangle and when Tommaso's grown-up daughter decides to come along as well, the likelihood of poor Domenico getting out of the country becomes more and more complicated.", "genres": ["Comedy"], "imdb": {"id": 140046, "rating": 6.3, "votes": 171}, "languages": ["Italian"], "lastupdated": "2015-07-03 00:06:55.597000000", "plot": "A bungling bank robber, an uncooperative hostage with a secret, a gay policeman and a situation which rapidly goes from bad to worse are the ingredients to this very funny and unpredictable...", "poster": "https://m.media-amazon.com/images/M/MV5BMTUxMTE2MTAwMV5BMl5BanBnXkFtZTcwNDI5NTAwMQ@@._V1_SY1000_SX677_AL_.jpg", "released": 889747200000, "runtime": 90, "title": "Children of Hannibal", "tomatoes": {"dvd": 1069113600000, "lastUpdated": 1442083424000, "production": "TLA Releasing", "viewer": {"meter": 29, "numReviews": 112, "rating": 2.9}}, "type": "movie", "writers": ["Davide Ferrario (story)", "Diego Abatantuono (story)", "Sergio Rubini (story)", "Davide Ferrario (screenplay)", "Diego Abatantuono (screenplay)"], "year": 1998}