{"_id": "573a13cdf29313caabd852f8", "awards": {"nominations": 25, "text": "24 wins & 25 nominations.", "wins": 24}, "cast": ["Tanika Lonesborough", "Nioka Brennan", "Lynette Narkle", "Kylie Belling"], "countries": ["Australia"], "directors": ["Wayne Blair"], "fullplot": "1968 was the year that changed the world. And for four young Aboriginal sisters from a remote mission this is the year that would change their lives forever. Around the globe, there was protest and revolution in the streets. Indigenous Australians finally secured the right to vote. There were drugs and the shock of a brutal assassination. And there was Vietnam. The sisters, Cynthia, Gail, Julie and Kay are discovered by Dave, a talent scout with a kind heart, very little rhythm but a great knowledge of soul music. Billed as Australia's answer to 'The Supremes', Dave secures the sisters their first true gig, and flies them to Vietnam to sing for the American troops. Based on a true story, THE SAPPHIRES is a triumphant celebration of youthful emotion, family and music.", "genres": ["Biography", "Comedy", "Drama"], "imdb": {"id": 1673697, "rating": 7, "votes": 9715}, "languages": ["English"], "lastupdated": "2015-09-10 17:52:16.693000000", "metacritic": 67, "plot": "It's 1968, and four young, talented Australian Aboriginal girls learn about love, friendship and war when their all-girl group The Sapphires entertain the US troops in Vietnam.", "poster": "https://m.media-amazon.com/images/M/MV5BMTQyNTk5MDk1OF5BMl5BanBnXkFtZTcwNjgyODYxOQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1344470400000, "runtime": 103, "title": "The Sapphires", "tomatoes": {"boxOffice": "$2.4M", "consensus": "While it's plenty predictable and sentimental, The Sapphires also has an irresistible feel-good vibe, winning music and charming performances to spare.", "critic": {"meter": 91, "numReviews": 131, "rating": 6.9}, "dvd": 1375747200000, "fresh": 119, "lastUpdated": 1442167847000, "production": "The Weinstein Company", "rotten": 12, "viewer": {"meter": 76, "numReviews": 13054, "rating": 3.8}, "website": "http://thesapphiresmovie.com/"}, "type": "movie", "writers": ["Tony Briggs (adapted from the stage play by)", "Tony Briggs", "Keith Thompson"], "year": 2012}