{"_id": "573a13b9f29313caabd4e360", "awards": {"nominations": 5, "text": "4 wins & 5 nominations.", "wins": 4}, "cast": ["Yuriy Chursin", "Vitaliy Khaev", "Aleksandr Ilin", "Marat Basharov"], "countries": ["Russia"], "directors": ["Kirill Serebrennikov"], "fullplot": "PLAYING THE VICTIM is a dark comedy made as a modern-day adaptation of Shakespeare's Hamlet. Valya, a young student is earning money by representing victims of the crimes during various police investigation. After the criminal has been seized a special group headed by a police captain has to reconstruct the crime scene. The process itself is quite comic and senseless: the criminals are defined already, and everyone knows, that they will be prosecuted. However the regulations still require a special team to imitate the crime once again in the same surroundings. The criminal should fictionally kill the victim (represented by Valya) one more time to confirm their guilt. Valya is drowning in his absurd life going from one terrible crime scene to another. Suddenly he has a vision: his deceased father comes to him in his sleep and tells the scary truth- he was poisoned by his own wife and her lover, who is now Valya's uncle... After this, the whole system of values of Valya's world collapses. He will become himself the criminal who will have to confess while somebody else represents his victims.", "genres": ["Comedy"], "imdb": {"id": 820096, "rating": 7.4, "votes": 1004}, "languages": ["Russian"], "lastupdated": "2015-06-26 00:54:13.157000000", "num_mflix_comments": 2, "plot": "A young man drops out of university and goes to the police. He's done nothing wrong he just wants a job. A particular job. Playing the victim in murder reconstructions. Maybe by getting close to death he can manage to cheat on his own.", "released": 1149724800000, "runtime": 95, "title": "Playing the Victim", "tomatoes": {"dvd": 1180396800000, "lastUpdated": 1442511808000, "viewer": {"meter": 48, "numReviews": 733, "rating": 3.2}}, "type": "movie", "writers": ["Oleg Presnyakov", "Vladimir Presnyakov"], "year": 2006}