{"_id": "573a139cf29313caabcf7976", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Vin Diesel", "Joey Dedio", "T.K. Kirkland", "Mike Epps"], "countries": ["USA"], "directors": ["Vin Diesel"], "fullplot": "A macho cruiser comes of age. Frustrated by the repetitious grind of one night stands and aimless hustling, study drug dealer Rick is looking for meaning and intimacy in his life. Like his testosterone-tweaked buddies, Rick is a \"stray\" # lacking a traditional family structure and wrestling subconsciously with the psychological bruises inflicted by his father's absence. Shielding any vulnerability under the toughened cloak of detachment, Rich has administered his life with deliberate effort to avoid reliance on anyone or anything. But things are about to change. When Rick meets Heather, a corn-fed walking talking \"girl next door,\" he suddenly perceives a new avenue and an opportunity for an open, committed relationship. Though the chemistry between the couple is immediately charged, Rick's street cheek and volatile aggression flare, threatening to extinguish their relationship before it begins. Trying to assimilate into Heather's world, Rick takes heat from his perpetually adolescent cohorts who's ambitions are restricted to riding fast, toking slow, and ditching hard. However, like his childhood, alter ego, Ferdinand the Bull, Rick is only a fighter by training and ripe for the transition to a softer, sweeter sensibility.", "genres": ["Drama"], "imdb": {"id": 149171, "rating": 5.9, "votes": 1198}, "languages": ["English"], "lastupdated": "2015-08-10 01:00:46.957000000", "num_mflix_comments": 3, "plot": "A macho cruiser comes of age. Frustrated by the repetitious grind of one night stands and aimless hustling, study drug dealer Rick is looking for meaning and intimacy in his life. Like his ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTQ1OTMyMzE3MV5BMl5BanBnXkFtZTcwOTM5NjQyMg@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 853545600000, "runtime": 105, "title": "Strays", "tomatoes": {"dvd": 1200355200000, "lastUpdated": 1440439215000, "production": "First Look Studios", "viewer": {"meter": 45, "numReviews": 1736, "rating": 3.2}, "website": "http://www.oneracefilms.com/index2.html"}, "type": "movie", "writers": ["Vin Diesel"], "year": 1997}