{"_id": "573a13b1f29313caabd3612c", "awards": {"nominations": 4, "text": "4 nominations.", "wins": 0}, "cast": ["Laurent Lucas", "Charlotte Gainsbourg", "Charlotte Rampling", "Andrè Dussollier"], "countries": ["France"], "directors": ["Dominik Moll"], "fullplot": "The automation engineer Alain Getty and his beloved wife Bènèdicte have just moved to the suburb of Bel-Air. Alain has developed the prototype of a flying web-cam for Pollock S.A., a high-tech company. After a successful presentation of his project to their clients, Alain invites his boss Richard Pollock and his wife Alice for dinner at his home. The couple arrives late, and Alice is extremely rude, insulting her husband and the young couple, and forcing Richard to leave the house earlier. During the night, Alain finds a rare Scandinavian lemming stuck in the siphon of the sink in the kitchen. On the next night, Alice unsuccessfully tries to seduce Alain after-hours in the laboratory of the company. On the next afternoon, she visits Bènèdicte to apologize her behavior and cynically tells her sexual harassment to her husband. Then she locks herself in a room and commits suicide. On the next days, Bènèdicte changes her behavior and relationship with Alain, seeming to be possessed by Alice.", "genres": ["Drama", "Mystery", "Thriller"], "imdb": {"id": 415932, "rating": 6.7, "votes": 4253}, "languages": ["French"], "lastupdated": "2015-08-22 01:07:20.843000000", "metacritic": 65, "num_mflix_comments": 5, "plot": "The wife of a young engineer's boss dies.", "poster": "https://m.media-amazon.com/images/M/MV5BMjIwMTk4MDY4OF5BMl5BanBnXkFtZTcwNjY4OTI0Mg@@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 1115769600000, "runtime": 129, "title": "Lemming", "tomatoes": {"consensus": "A creepy psychological thriller, with superb performances and natural tension flowing from every frame, Lemming is a worthy successor to Dominik Moll's With A Friend Like Harry.", "critic": {"meter": 71, "numReviews": 48, "rating": 6.7}, "dvd": 1155600000000, "fresh": 34, "lastUpdated": 1440528585000, "production": "Celluloid Dreams", "rotten": 14, "viewer": {"meter": 62, "numReviews": 7234, "rating": 3.2}, "website": "http://www.diaphana.fr/fiche.php?pkfilms=131"}, "type": "movie", "writers": ["Gilles Marchand", "Dominik Moll"], "year": 2005}