{"_id": "573a13b0f29313caabd33908", "awards": {"nominations": 2, "text": "1 win & 2 nominations.", "wins": 1}, "cast": ["Ajay Devgn", "Aishwarya Rai Bachchan", "Annu Kapoor", "Mouli Ganguly"], "countries": ["India"], "directors": ["Rituparno Ghosh"], "fullplot": "An unemployed Manoj (alias Manu) is told by his mother that they need some money for his sister's forthcoming marriage, and he sets out to find some. For this purpose, he visits his former Calcutta-based girlfriend, Neerj alias Neeru, whom he was to marry, but who preferred to marry someone wealthier, in Calcutta. He rings the doorbell, and the door is answered by Neerja herself, and he is invited inside. They talk and update each other on their lives. Neerja puts on Manoj's raincoat, so she could go out and buy something to cook for him. She warns him not to open the door nor let anyone in. After Neerja leaves a man knocks on the door, and requests entry into the house to use the toilet. Manoj opens the door and lets the male use the facilities. When this male finishes his business, he refuses to leave, and sits and talks with Manoj. It is during this conversation that Manoj finds out the stark truth behind Neerja, her husband, and their married life.", "genres": ["Drama", "Romance"], "imdb": {"id": 405266, "rating": 7.5, "votes": 2463}, "languages": ["Hindi"], "lastupdated": "2015-08-22 01:17:21.687000000", "num_mflix_comments": 2, "plot": "All he wanted was to see her just once. Manu was from a village in the backwoods. Neeru was the girl next door, his lost love.", "poster": "https://m.media-amazon.com/images/M/MV5BOTFmZTFjMmEtYTA5MC00NGY0LTgyZTUtZTM1ZWE2NzM0ZmE2XkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY1000_SX677_AL_.jpg", "released": 1103846400000, "runtime": 117, "title": "Raincoat", "tomatoes": {"dvd": 1115683200000, "lastUpdated": 1442257696000, "viewer": {"meter": 79, "numReviews": 2758, "rating": 3.6}, "website": "http://www.raincoatthefilm.com"}, "type": "movie", "writers": ["Rituparno Ghosh (original dialogue)", "O. Henry (adapted from the story \"Gift of Magi\")"], "year": 2004}