{"_id": "573a139af29313caabcf0987", "awards": {"nominations": 2, "text": "4 wins & 2 nominations.", "wins": 4}, "cast": ["Jacob Sewell", "Nick Sutton", "Lara Tosh", "Jacob Reynolds"], "countries": ["USA"], "directors": ["Harmony Korine"], "fullplot": "Constructing this film through random scenes, director Harmony Korine abruptly jettisoned any sort of narrative plot, so here we go: Solomon and Tummler are two bored teenage boys who live in Xenia, Ohio. A few years ago, a tornado swept through it, destroying more than half the town and killing the same amount, including Solomon's father. The film, from there, chronicles the anti-social adventures these two boys have. These include sniffing glue, killing cats, having sex, riding dirtbikes, listening to black metal, and meeting a cavalcade of quirky, bizarre, and scary people. These include a man who pimps his mentally ill wife to our anti-heroes, three sisters who play with their cat and practice becoming strippers, a black midget fending off the sexual advances of a troubled man (played by the director Harmony Korine), a 12-year-old gay transvestite who is also a cat killer, Solomon's mother who seems to be the only glimpse of sanity, two foul-mouthed six-year olds, and most importantly, a nymphlike skateboarder who walks around town wearing pink rabbit ears.", "genres": ["Drama"], "imdb": {"id": 119237, "rating": 6.6, "votes": 22457}, "languages": ["English"], "lastupdated": "2015-09-16 11:04:50.180000000", "metacritic": 19, "num_mflix_comments": 1, "plot": "Lonely residents of a tornado-stricken Ohio town wander the deserted landscape trying to fulfill their boring, nihilistic lives.", "poster": "https://m.media-amazon.com/images/M/MV5BMTQ1NjE4NTU4N15BMl5BanBnXkFtZTgwODkwMDg3NjE@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 880329600000, "runtime": 89, "title": "Gummo", "tomatoes": {"critic": {"meter": 33, "numReviews": 36, "rating": 4.6}, "dvd": 985046400000, "fresh": 12, "lastUpdated": 1441131264000, "production": "Fine Line Features", "rotten": 24, "viewer": {"meter": 73, "numReviews": 21863, "rating": 3.6}}, "type": "movie", "writers": ["Harmony Korine"], "year": 1997}