{"_id": "573a13bff29313caabd60629", "awards": {"nominations": 4, "text": "2 wins & 4 nominations.", "wins": 2}, "cast": ["Akshay Kumar", "Katrina Kaif", "Om Puri", "Kiron Kher"], "countries": ["Australia", "India"], "directors": ["Anees Bazmee"], "fullplot": "Happy Singh lives in a small village in Punjab. He is always compassionate and helpful, but often ends up causing more damage so much so that the Village Panchayat gets together to reprimand him. When the community gets news that one of their residents, Lakhanpal Singh, is an underworld don in Australia, they decide to delegate someone to counsel him. The villagers chose Happy, so that they can get rid of him. Happy's ticket and other costs are paid for, and the Panchayat even asks a reluctant Rangeela to accompany him. Due to a mix-up, both end up in Egypt, leading to romance in Happy's life when he meets with Sonia, a Criminologist, who would prefer to have criminals killed than reform them. Both friends do find their way to Australia, where they locate Lakhanpal, who humiliates them and asks them to leave. Both befriend a boutique owner and live in her house. When rival goons attack Lakhanpal, Happy rescues him, and gets him hospitalized. Lakhanpal does recover, but is paralyzed. His goons comically misunderstand that he wants Happy to be Don, and he undergoes a transformation and moves in to live a wealthy lifestyle in Lakhanpal's mansion. When the boutique owner's daughter returns home along with her fiancè, Punit, Happy plans a charade to make her believe that the mansion belongs to her. Happy's life will soon be turned upside down when the daughter turns out to be none other than Sonia herself. Being aware of Sonia's dislike for criminals, he will have no option but to plan a lavish wedding for her, while rival gangsters, and even some of Lakhanpal's goons, plan to get rid of him.", "genres": ["Action", "Comedy", "Crime"], "imdb": {"id": 1146325, "rating": 5.4, "votes": 7439}, "languages": ["Hindi", "Panjabi"], "lastupdated": "2015-08-16 00:33:17.133000000", "plot": "A comic caper about Happy Singh, a Punjabi villager who goes through a series of misadventures and eventually becomes the Kinng of the Australian underworld.", "poster": "https://m.media-amazon.com/images/M/MV5BMTkyNTM4Mzc5NV5BMl5BanBnXkFtZTcwNjgxMjMyMg@@._V1_SY1000_SX677_AL_.jpg", "released": 1218153600000, "runtime": 135, "title": "Singh Is Kinng", "tomatoes": {"lastUpdated": 1439145083000, "production": "Siren Studios", "viewer": {"meter": 0, "numReviews": 74, "rating": 3.5}, "website": "http://www.sugarbabiesfilm.com/cgi-local/welcome.cgi"}, "type": "movie", "writers": ["Anees Bazmee (writer & dialogue)", "Vipul Binjola (dialogue)", "Suresh Nair", "Rishi Virmani (dialogue)"], "year": 2008}