{"_id": "573a13dbf29313caabdae625", "awards": {"nominations": 43, "text": "21 wins & 43 nominations.", "wins": 21}, "cast": ["Masaharu Fukuyama", "Machiko Ono", "Yèko Maki", "Rirè Furankè"], "countries": ["Japan"], "directors": ["Hirokazu Koreeda"], "fullplot": "Would you choose your natural son, or the son you believed was yours after spending 6 years together? Kore-eda Hirokazu, the globally acclaimed director of \"Nobody Knows\", \"Still Walking\" and \"I Wish\", returns to the big screen with another family - a family thrown into torment after a phone call from the hospital where the son was born... Ryota has earned everything he has by his hard work, and believes nothing can stop him from pursuing his perfect life as a winner. Then one day, he and his wife, Midori, get an unexpected phone call from the hospital. Their 6-year-old son, Keita, is not 'their' son - the hospital gave them the wrong baby. Ryota is forced to make a life-changing decision, to choose between 'nature' and 'nurture.' Seeing Midori's devotion to Keita even after learning his origin, and communicating with the rough yet caring family that has raised his natural son for the last six years, Ryota also starts to question himself: has he really been a 'father' all these years...", "genres": ["Drama"], "imdb": {"id": 2331143, "rating": 7.8, "votes": 9755}, "languages": ["Japanese"], "lastupdated": "2015-08-18 00:06:15.657000000", "metacritic": 73, "num_mflix_comments": 2, "plot": "Ryota Nonomiya is a successful businessman driven by money. When he learns that his biological son was switched with another child after birth, he must make a life-changing decision and choose his true son or the boy he raised as his own.", "poster": "https://m.media-amazon.com/images/M/MV5BMTU5MzgzODkwNV5BMl5BanBnXkFtZTgwNDUwNjg3MDE@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 1380326400000, "runtime": 121, "title": "Like Father, Like Son", "tomatoes": {"boxOffice": "$0.3M", "consensus": "Sensitively written, smartly directed, and powerfully performed, Like Father, Like Son uses familiar-seeming elements to tell a thought-provoking story.", "critic": {"meter": 87, "numReviews": 90, "rating": 7.6}, "dvd": 1404172800000, "fresh": 78, "lastUpdated": 1441906317000, "production": "IFC Films", "rotten": 12, "viewer": {"meter": 88, "numReviews": 7346, "rating": 4}, "website": "http://www.sundanceselects.com/films/like-father-like-son"}, "type": "movie", "writers": ["Hirokazu Koreeda (screenplay)"], "year": 2013}