{"_id": "573a13b9f29313caabd4f8e6", "awards": {"nominations": 12, "text": "6 wins & 12 nominations.", "wins": 6}, "cast": ["Gerard Kearns", "Matthew McNulty", "Naomi Bentley", "Elliot Cowan"], "countries": ["UK"], "directors": ["Marc Munden"], "fullplot": "GULLIVER and TATE - nickname 'Treacle' - are two ordinary 18 year-olds serving in the British Army in Iraq. Their platoon is struggling to maintain the uneasy peace of 2003. When their popular company captain, GODBER, is killed on patrol by a roadside bomb, morale in the platoon hits rock bottom. Acting on orders they round up several suspects from house-to-house searches. That night feelings at the camp are running high and as the chain of command is weakened and events spiral out of control. The lads end their tour of duty and return to England full of stories but also shaken by their experiences. Iraq comes back to haunt them when Gulliver's jilted girlfriend, Shelley, decides to get her own back on him by giving photos of the events in Iraq to the British police. The story hits the press, and Gulliver and Treacle, now the most reviled men in Britain, face court martial. The army claims the two are 'rotten apples' acting alone. Guilt-ridden and abandoned, the pressure is too much for a traumatized Treacle. Gulliver, however, is determined to remain loyal to 'his army'. Only when he is truly alone does he have to decide if he must keep his secrets or explosively have his day in court, and tell the truth about the events of that fateful night.", "genres": ["Drama", "War"], "imdb": {"id": 837800, "rating": 6.5, "votes": 1244}, "languages": ["English"], "lastupdated": "2015-07-27 00:02:52.980000000", "plot": "Uses detailed research and explosive new testimonies by soldiers who have served in Iraq to tell an emotional fictional story of two young men very much out of their depth.", "poster": "https://m.media-amazon.com/images/M/MV5BMjIxNjY0MDA2Nl5BMl5BanBnXkFtZTgwMDQzMTA2MDE@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1227571200000, "runtime": 87, "title": "The Mark of Cain", "tomatoes": {"dvd": 1227571200000, "lastUpdated": 1441130730000, "production": "Revolver Entertainment", "viewer": {"meter": 62, "numReviews": 656, "rating": 3.5}, "website": "http://www.revolvergroup.com/us/dvd-bluray/view/the_mark_of_cain"}, "type": "movie", "writers": ["Tony Marchant"], "year": 2007}