{"_id": "573a13a5f29313caabd13d46", "awards": {"nominations": 10, "text": "4 wins & 10 nominations.", "wins": 4}, "cast": ["Chartchai Ngamsan", "Suwinit Panjamawat", "Stella Malucchi", "Supakorn Kitsuwon"], "countries": ["Thailand"], "directors": ["Wisit Sasanatieng"], "fullplot": "In the countryside of Thailand, a gang of outlaws makes the region unsafe. Among them is the handsome gun hero Dum, who became unwillingly involved in the bandit life. Handsome Dum made a promise to his upper-crust lover Rumpoey: despite the class difference, they will get married. When the moment of reunion arrives, Dum gets involved in a fire fight and cannot possibly reach Rumpoey in time. She is desperate: her father has married her off to a policeman. The taciturn Dum, called the 'Black Tiger' by his co-conspirators, has however not forgotten Rumpoey. He does everything in his power to reach her, but fate gets in the way: his gang leader suspects him of treachery and his blood brother turns into his greatest enemy. Will the two lovers ever meet up? This urgent question propels the melodrama forward, supported by exciting music, spectacular shootouts and heroic duels.", "genres": ["Action", "Comedy", "Romance"], "imdb": {"id": 269217, "rating": 7, "votes": 2303}, "languages": ["Thai"], "lastupdated": "2015-07-13 00:08:56.947000000", "metacritic": 69, "num_mflix_comments": 1, "plot": "With its loud acting style, exuberant sets and stunning shots in pastel colours, this Thai cult film is as much a parody as an homage to the Western and the romantic tearjerker.", "poster": "https://m.media-amazon.com/images/M/MV5BMjAzMjIzNzU3NF5BMl5BanBnXkFtZTcwOTQxNDMzMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "UNRATED", "released": 997315200000, "runtime": 110, "title": "Tears of the Black Tiger", "tomatoes": {"consensus": "With a vibrant pastel color scheme and stylized action sequences, Tears of the Black Tiger is a bizarre, yet thoroughly entertaining Thai western.", "critic": {"meter": 74, "numReviews": 62, "rating": 6.5}, "dvd": 1177372800000, "fresh": 46, "lastUpdated": 1438023440000, "production": "Magnolia Pictures", "rotten": 16, "viewer": {"meter": 75, "numReviews": 2992, "rating": 3.7}, "website": "http://www.fahtalaijone.com"}, "type": "movie", "writers": ["Wisit Sasanatieng"], "year": 2000}