{"_id": "573a1398f29313caabce9f50", "awards": {"nominations": 3, "text": "3 wins & 3 nominations.", "wins": 3}, "cast": ["Jeffrey Combs", "Barbara Crampton", "Ted Sorel", "Ken Foree"], "countries": ["USA"], "directors": ["Stuart Gordon"], "fullplot": "Dr. Edward Pretorius and his assistant, the physician Crawford Tillinghast, have developed the Resonator, a machine to stimulate the sixth sense through the pineal gland. When Crawford activates the apparatus, he sees creatures flying in the air and he summons Dr. Pretorius. The experiment goes out of control and Dr. Pretorius refuses to turn off the Resonator. Meanwhile their neighbor calls the police, and when the police officers arrive, they see Crawford trying to escape from his house and Dr. Pretorius beheaded. Crawford is sent to a mental institution under the supervision of the sadistic Dr. Bloch. However, the prominent psychiatrist Dr. Katherine McMichaels requests the custody of Crawford and Detective Bubba Brownlee that is investigating the case stays with them. Katherine goes with Crawford and Bubba to see the Resonator and turns the machine on. Dr. Pretorius returns in a mutant shape and attacks them, in the beginning of a gore night with weird life forms.", "genres": ["Comedy", "Horror", "Sci-Fi"], "imdb": {"id": 91083, "rating": 6.8, "votes": 13384}, "languages": ["English"], "lastupdated": "2015-09-15 05:37:35.970000000", "num_mflix_comments": 3, "plot": "A group of scientists have developed the Resonator, a machine which allows whoever is within range to see beyond normal perceptible reality. But when the experiment succeeds, they are immediately attacked by terrible life forms.", "poster": "https://m.media-amazon.com/images/M/MV5BYjc3ZjQ4YWQtNGFlOS00YmZiLTllZDctYTM3MDNmMTY4N2VjXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 530496000000, "runtime": 86, "title": "From Beyond", "type": "movie", "writers": ["H.P. Lovecraft (short story)", "Brian Yuzna (adaptation)", "Dennis Paoli (adaptation)", "Stuart Gordon (adaptation)", "Dennis Paoli (screenplay)"], "year": 1986}