{"_id": "573a13c3f29313caabd68e42", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["David Duchovny", "Demi Moore", "Amber Heard", "Benjamin Hollingsworth"], "countries": ["USA"], "directors": ["Derrick Borte"], "fullplot": "\"The Joneses\", a social commentary on our consumerist society. Perfect couple Steve and Kate Jones, and their gorgeous teen-aged children Jenn and Mick, are the envy of their posh, suburban neighborhood filled with McMansions and all the trappings of the upper middle class. Kate is the ultimate trend setter - beautiful, sexy, dressed head-to-toe in designer labels. Steve is the admired successful businessman who has it all: a gorgeous wife, big house and an endless supply of high-tech toys. Jenn and Mick rule their new school as they embody all that is hip and trendy - cool clothes, fast cars and the latest gadgets. But as the neighbors try to keep up with the Joneses, none are prepared for the truth about this all- too perfect family.", "genres": ["Comedy", "Drama"], "imdb": {"id": 1285309, "rating": 6.5, "votes": 31362}, "languages": ["English"], "lastupdated": "2015-08-18 01:01:13.767000000", "metacritic": 55, "plot": "A seemingly perfect family moves into a suburban neighborhood, but when it comes to the truth as to why they're living there, they don't exactly come clean with their neighbors.", "poster": "https://m.media-amazon.com/images/M/MV5BMTUyNzkzNTIyOV5BMl5BanBnXkFtZTcwOTUxMDEyMw@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1271980800000, "runtime": 96, "title": "The Joneses", "tomatoes": {"boxOffice": "$1.0M", "consensus": "It doesn't pursue its subversive premise as far as it should, but The Joneses benefits from its timely satire of consumer culture -- as well as a pair of strong performances from David Duchovny and Demi Moore.", "critic": {"meter": 62, "numReviews": 122, "rating": 6.2}, "dvd": 1281398400000, "fresh": 76, "lastUpdated": 1442423289000, "production": "Roadside Attractions", "rotten": 46, "viewer": {"meter": 46, "numReviews": 20583, "rating": 3.2}, "website": "http://www.thejonesesmovie.com/"}, "type": "movie", "writers": ["Randy T. Dinzler (story)", "Derrick Borte"], "year": 2009}