{"_id": "573a13b1f29313caabd36808", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Christopher Denham", "Sean Young", "Larry Fessenden", "Daniel Manche"], "countries": ["USA"], "directors": ["Andrew van den Houten"], "fullplot": "25-year-old Alex Borden is handsome, charming, and intelligent. In fact, he may be too smart for his own good as his life is swiftly becoming a living hell. Alex's nightmare begins when he meets Harry, a mysterious artist and chess-master. Alex becomes alarmed when his intellect mysteriously begins to grow, and so do the horrors that invade his nightmares, and soon his waking hours. Long-suppressed memories surface and Alex must face the terrors of his violent past, a vanished older brother, a father who abandoned both his sons, and a mother who was viciously murdered. The visions intensify and he begins to experience intense headaches that ultimately cause him to blackout. But it is only the beginning of Alex's calamity. Friends and neighbors are disappearing, and people are whispering rumors of a serial killer. Menaced from all sides by the forces of evil, Alex must overcome his past and contain his own deadly urges so he can hopefully discover what demons, both real and imagined, are stalking him.", "genres": ["Horror", "Mystery", "Sci-Fi"], "imdb": {"id": 417745, "rating": 4.7, "votes": 1568}, "languages": ["English"], "lastupdated": "2015-09-17 04:52:17.170000000", "plot": "25-year-old Alex Borden is handsome, charming, and intelligent. In fact, he may be too smart for his own good as his life is swiftly becoming a living hell. Alex's nightmare begins when he ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTkzMTQwOTQ0NV5BMl5BanBnXkFtZTcwODU2MDUzMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1127001600000, "runtime": 89, "title": "Headspace", "tomatoes": {"critic": {"meter": 50, "numReviews": 8, "rating": 5.3}, "dvd": 1158019200000, "fresh": 4, "lastUpdated": 1442511159000, "production": "Freestyle Releasing", "rotten": 4, "viewer": {"meter": 20, "numReviews": 1210, "rating": 2.6}, "website": "http://www.headspacethemovie.com"}, "type": "movie", "writers": ["Troy McCombs (story)", "Steve Klausner (screenplay)", "William M. Miller (screenplay)"], "year": 2005}