{"_id": "573a13b3f29313caabd3b3ae", "awards": {"nominations": 10, "text": "4 wins & 10 nominations.", "wins": 4}, "cast": ["Sanaa Lathan", "Fuzzy Fantabulous", "Katharine Towne", "Stanley DeSantis"], "countries": ["USA"], "directors": ["Sanaa Hamri"], "fullplot": "Kenya McQueen is a successful African-American CPA, working her way to the top of the corporate ladder -- but her life has become all work and no play. Urged on by her friends to try something new and to let go of her dream of the \"ideal black man,\" she accepts a blind date with an architectural landscaper named Brian, only to cut the date short upon first sight, because Brian is white. The two meet again at a party, and Kenya hires Brian to landscape her new home. Over time, they hit it off, but Kenya's reservations about the acceptance their romance will find among her friends and family threatens everything. An intelligent romantic comedy that chooses to deal with issues of race and perception in a straight-forward way, from a point of view not often seen: that of a successful, upper-class black woman.", "genres": ["Comedy", "Drama", "Romance"], "imdb": {"id": 437777, "rating": 6.8, "votes": 10018}, "languages": ["English", "Spanish"], "lastupdated": "2015-08-22 00:21:40.327000000", "metacritic": 64, "num_mflix_comments": 1, "plot": "Kenya McQueen, an accountant finds love in the most unexpected place when she agrees to go on a blind date with Brian Kelly, a sexy and free-spirited landscaper.", "poster": "https://m.media-amazon.com/images/M/MV5BMzMzNzU0NzQ1NF5BMl5BanBnXkFtZTcwNTMzOTEzMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1138924800000, "runtime": 99, "title": "Something New", "tomatoes": {"boxOffice": "$11.4M", "consensus": "Something New tackles serious questions about race and interracial relationships with genuine appeal and an alluring romance that develops as naturally as the plot.", "critic": {"meter": 61, "numReviews": 106, "rating": 6.1}, "dvd": 1147737600000, "fresh": 65, "lastUpdated": 1441045033000, "production": "Focus Features", "rotten": 41, "viewer": {"meter": 73, "numReviews": 101112, "rating": 3.1}, "website": "http://www.somethingnewmovie.net/sn-splash.html"}, "type": "movie", "writers": ["Kriss Turner"], "year": 2006}