{"_id": "573a13d4f29313caabd9828c", "awards": {"nominations": 18, "text": "15 wins & 18 nominations.", "wins": 15}, "cast": ["Vidya Balan", "Emraan Hashmi", "Tusshar Kapoor", "Naseeruddin Shah"], "countries": ["India"], "directors": ["Milan Luthria"], "fullplot": "Rebellious and uninhibited Reshma lives an impoverished lifestyle with her mother, Ratnamma, in 1980s South India. She is an ardent fan of film actor, Suryakant, and her one ambition in life is to meet and act with him. She runs away to Madras, and like, hundreds of young women, lines up outside Jupiter Studios to try and get noticed. With her plain, next-door-girl looks, she gets ignored but as fate could have it she is given a chance to play a minor role after she manages to sneak into the studios. The role exploits her as a sex symbol, driving males to the cinema houses to absorb her movements and beauty. Virtually overnight she, now renamed Silk, becomes a sensation, and together with the aging superstar, Suryakant, the one she had always fantasized about, she sizzles the silver screen with her sex appeal. Suryakant's brother, Ramakant, an author, is smitten by her - so much so that he would like her to opt out of movies altogether, so that he could marry her. But the rebellious woman that she is, jeopardizes her chance of impressing his parents - by challenging the upcoming siren, Shakila, to a competition. And it is this move that will bring about even more changes in her life.", "genres": ["Biography", "Comedy", "Drama"], "imdb": {"id": 1954206, "rating": 6.7, "votes": 5730}, "languages": ["Hindi", "Tamil", "English"], "lastupdated": "2015-08-19 00:21:18.657000000", "num_mflix_comments": 1, "plot": "The love story between an actress and a director. Inspired by the life of the late south Indian actress Silk Smitha.", "poster": "https://m.media-amazon.com/images/M/MV5BNDI0OTlhYmEtNzQ3MS00OTI0LTk4NWUtN2YxNTgyYmY0YmNhXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY1000_SX677_AL_.jpg", "released": 1322784000000, "runtime": 144, "title": "The Dirty Picture", "tomatoes": {"lastUpdated": 1441136156000, "viewer": {"meter": 58, "numReviews": 901, "rating": 3.3}}, "type": "movie", "writers": ["Rajat Arora", "Aditi Mediratta (associate writer)"], "year": 2011}