{"_id": "573a139af29313caabcf04cc", "awards": {"nominations": 2, "text": "1 win & 2 nominations.", "wins": 1}, "cast": ["Imogen Stubbs", "Steven Mackintosh", "Nicholas Farrell", "Sidney Livingstone"], "countries": ["UK", "Ireland", "USA"], "directors": ["Trevor Nunn"], "fullplot": "Brother and sister Viola and Sebastian, who are not only very close but look a great deal alike, are in a shipwreck, and both think the other dead. When she lands in a foreign country, Viola dresses as her brother and adopts the name Cesario, becoming a trusted friend and confidante to the Count Orsino. Orsino is madly in love with the lady Olivia, who is in mourning due to her brother's recent death, which she uses as an excuse to avoid seeing the count, whom she does not love. He sends Cesario to do his wooing, and Olivia falls in love with the disguised maiden. Things get more complicated in this bittersweet Shakespeare comedy when a moronic nobleman, Sir Andrew Aguecheek, and a self-important servant, Malvolio, get caught up in the schemes of Olivia's uncle, the obese, alcoholic Sir Toby, who leads each to believe Olivia loves him. As well, Sebastian surfaces in the area, and of course there is Feste, the wise fool, around to keep everything in perspective and to marvel, like we the audience, at the amazing things happening all around.", "genres": ["Comedy", "Drama", "Romance"], "imdb": {"id": 117991, "rating": 7.3, "votes": 4670}, "languages": ["English"], "lastupdated": "2015-08-27 00:09:26.743000000", "num_mflix_comments": 2, "plot": "Shakespeare's comedy of gender confusion, in which a girl disguises herself as a man to be near the count she adores, only to be pursued by the woman he loves.", "poster": "https://m.media-amazon.com/images/M/MV5BM2UxYTEwZWUtZTNkMC00NGU1LWE1MTctZmM0ZTdlOGRjODk5XkEyXkFqcGdeQXVyMTMxMTY0OTQ@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 846201600000, "runtime": 134, "title": "Twelfth Night or What You Will", "tomatoes": {"consensus": "Director Trevor Nunn makes some questionable choices, but his stellar cast -- which includes Helena Bonham-Carter, Ben Kingsley, and Nigel Hawthorne -- more than rises to the material.", "critic": {"meter": 74, "numReviews": 31, "rating": 6.8}, "dvd": 1125360000000, "fresh": 23, "lastUpdated": 1442260521000, "production": "New Line Home Entertainment", "rotten": 8, "viewer": {"meter": 80, "numReviews": 7750, "rating": 3.7}}, "type": "movie", "writers": ["William Shakespeare (by)", "Trevor Nunn (screenplay)"], "year": 1996}