{"_id": "573a1397f29313caabce71e4", "awards": {"nominations": 5, "text": "Nominated for 1 Oscar. Another 1 win & 5 nominations.", "wins": 2}, "cast": ["Lee Remick", "Robin Ellis", "Wesley Addy", "Tim Choate"], "countries": ["UK"], "directors": ["James Ivory"], "fullplot": "It's the mid-nineteenth century. Adult siblings Felix Young and Eugenia Munster were born and raised in Europe and have a somewhat bohemian lifestyle reflective of their travels throughout Europe. Felix, who has little money, is interested in painting and the arts. Eugenia is a baroness by marriage. They decide to travel to New England to meet their maternal uncle and their three cousins, the Wentworths, for the first time, the Wentworths who live just outside of Boston. The Wentworths are highly puritanical, the uncle in particular who looks to a neighbor, Mr. Brand, to provide a moral compass to his three children, especially the shy Gertrude, who Mr. Brand wants to marry. The Wentworths are somewhat suspicious as to the reason for their relatives' visit, but nonetheless the uncle puts them up in a neighboring house on their property. While Felix enjoys the company of his cousins - especially Gertrude - Eugenia is a bit more standoffish and cognizant of the real reason for their trip to the United States. For Eugenia, another of their uncle's cousins, a Mr. Robert Acton, may just fit the bill related to her goal, which concerns her current marriage and financial security.", "genres": ["Drama", "Romance"], "imdb": {"id": 79123, "rating": 6.4, "votes": 602}, "languages": ["English", "French", "German"], "lastupdated": "2015-09-17 04:47:12.993000000", "num_mflix_comments": 1, "plot": "It's the mid-nineteenth century. Adult siblings Felix Young and Eugenia Munster were born and raised in Europe and have a somewhat bohemian lifestyle reflective of their travels throughout ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTQ2ODE5NzQ2OF5BMl5BanBnXkFtZTcwMzExOTk4Mg@@._V1_SY1000_SX677_AL_.jpg", "released": 308188800000, "runtime": 90, "title": "The Europeans", "tomatoes": {"critic": {"meter": 70, "numReviews": 10, "rating": 6}, "dvd": 1061251200000, "fresh": 7, "lastUpdated": 1437851114000, "production": "Criterion Collection", "rotten": 3, "viewer": {"meter": 36, "numReviews": 664, "rating": 3}}, "type": "movie", "writers": ["Henry James (novel)", "Ruth Prawer Jhabvala (screenplay)"], "year": 1979}