{"_id": "573a13a5f29313caabd1392e", "awards": {"nominations": 75, "text": "Won 1 Oscar. Another 62 wins & 75 nominations.", "wins": 63}, "cast": ["Nicolas Cage", "Tilda Swinton", "Meryl Streep", "Chris Cooper"], "countries": ["USA"], "directors": ["Spike Jonze"], "fullplot": "While his latest movie Being John Malkovich (1999) is in production, screenwriter Charlie Kaufman is hired by Valerie Thomas to adapt Susan Orlean's non-fiction book \"The Orchid Thief\" for the screen. Thomas bought the movie rights before Orlean wrote the book, when it was only an article in The New Yorker. The book details the story of rare orchid hunter John Laroche, whose passion for orchids and horticulture made Orlean discover passion and beauty for the first time in her life. Charlie wants to be faithful to the book in his adaptation, but despite Laroche himself being an interesting character in his own right, Charlie is having difficulty finding enough material in Laroche to fill a movie, while equally not having enough to say cinematically about the beauty of orchids. At the same time, Charlie is going through other issues in his life. His insecurity as a person doesn't allow him to act upon his feelings for Amelia Kavan, who is interested in him as a man. And Charlie's twin brother, pretentious Donald Kaufman, has moved into his house with a goal of also becoming a screenwriter. Despite not admiring Donald as a screenwriter, Charlie asks for his advice. Together, they feel that there is some interesting subtext in the book on which Orlean herself can only elaborate, if only Charlie has the nerve to talk to her. If she can't or won't elaborate, they may have to find out the meaning of that subtext on their own.", "genres": ["Comedy", "Drama"], "imdb": {"id": 268126, "rating": 7.7, "votes": 133924}, "languages": ["English", "Latin"], "lastupdated": "2015-09-05 00:02:10.423000000", "metacritic": 83, "num_mflix_comments": 1, "plot": "A lovelorn screenwriter becomes desperate as he tries and fails to adapt The Orchid Thief by Susan Orlean for the screen.", "poster": "https://m.media-amazon.com/images/M/MV5BZjIwZWU0ZDItNzBlNS00MDIwLWFlZjctZTJjODdjZWYxNzczL2ltYWdlXkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1045180800000, "runtime": 114, "title": "Adaptation.", "tomatoes": {"boxOffice": "$22.2M", "consensus": "Dizzyingly original, the loopy, multi-layered Adaptation is both funny and thought-provoking.", "critic": {"meter": 91, "numReviews": 198, "rating": 8.2}, "dvd": 1053388800000, "fresh": 180, "lastUpdated": 1442512113000, "production": "Columbia Pictures", "rotten": 18, "viewer": {"meter": 85, "numReviews": 187034, "rating": 3.6}, "website": "http://www.sonypictures.com/movies/adaptation"}, "type": "movie", "writers": ["Susan Orlean (book)", "Charlie Kaufman (screenplay)", "Donald Kaufman (screenplay)"], "year": 2002}