{"_id": "573a13cdf29313caabd85ad4", "awards": {"nominations": 14, "text": "11 wins & 14 nominations.", "wins": 11}, "cast": ["Ja'Meya Jackson", "Kelby Johnson", "Lona Johnson", "Bob Johnson"], "countries": ["USA"], "directors": ["Lee Hirsch"], "fullplot": "This year, over 13 million American kids will be bullied at school, online, on the bus, at home, through their cell phones and on the streets of their towns, making it the most common form of violence young people in this country experience. BULLY is the first feature documentary film to show how we've all been affected by bullying, whether we've been victims, perpetrators or stood silent witness. The world we inhabit as adults begins on the playground. BULLY opens on the first day of school. For the more than 13 million kids who'll be bullied this year in the United States, it's a day filled with more anxiety and foreboding than excitement. As the sun rises and school busses across the country overflow with backpacks, brass instruments and the rambunctious sounds of raging hormones, this is a ride into the unknown. For a lot of kids, the only thing that's certain is that this year, like every other, bullying will be a big part of whatever meets them at their school's front doors. Every school in the U.S. is grappling with bullying-each day more than 160,000 kids across the country are absent because they're afraid of being bullied-but for many districts it's just one more problem that gets swept under the rug. BULLY is a character-driven film. At its heart are those with the most at stake and whose stories each represent a different facet of this crisis. From the first day of school through the last, BULLY will intimately explore the lives of a few of the many courageous people bullying will touch this year.", "genres": ["Documentary"], "imdb": {"id": 1682181, "rating": 7.4, "votes": 8398}, "languages": ["English"], "lastupdated": "2015-08-26 00:20:30.057000000", "metacritic": 74, "plot": "A documentary on peer-to-peer bullying in schools across America.", "poster": "https://m.media-amazon.com/images/M/MV5BNjk1MjYzNzUxOF5BMl5BanBnXkFtZTcwOTQyODU2Nw@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1335484800000, "runtime": 98, "title": "Bully", "tomatoes": {"boxOffice": "$44.7M", "consensus": "Hard-hitting and gracefully filmed, Bully powerfully delivers an essential message to an audience that may not be able to see it.", "critic": {"meter": 84, "numReviews": 128, "rating": 7.1}, "dvd": 1360627200000, "fresh": 108, "lastUpdated": 1442251207000, "production": "The Weinstein Co.", "rotten": 20, "viewer": {"meter": 78, "numReviews": 42045, "rating": 3.9}, "website": "http://thebullyproject.com"}, "type": "movie", "writers": ["Cynthia Lowen", "Lee Hirsch"], "year": 2011}