{"_id": "573a13a0f29313caabd05f66", "awards": {"nominations": 0, "text": "Nominated for 1 Primetime Emmy. Another 1 win.", "wins": 2}, "cast": ["Glenn Close", "Cameron Diaz", "Calista Flockhart", "Kathy Baker"], "countries": ["USA"], "directors": ["Rodrigo Garcèa"], "fullplot": "Five loosely intertwined stories of the emotional issues facing individual middle-aged Angelenas are presented. In \"This Is Dr. Keener\", physician Elaine Keener is spending the day taking care of her invalid mother at home on the nurse's day off. Elaine, a scientist, seeks confirmation on what may be a turning point issue in her life by an unconventional means, namely a tarot card reading. Although the news Elaine receives through the reading is a largely accurate assessment of her current life, it is the news about that crossroads issue that takes her somewhat aback. In \"Fantasies About Rebecca\", thirty-nine year old Rebecca Waynon is outwardly in control of her life, from her job as a bank manager to her personal long term relationship with older Robert. A homeless woman named Nancy who hangs around outside the bank seems to have a clearer picture of what is truly happening with Rebecca than Rebecca herself, as is witnessed by Rebecca's ultimate reaction to an action in dealing with a personal issue. In \"Someone for Rose\", divorced mother Rose's life is focused on making sure her fifteen year old son Jay is turning into a respectable young man. Between that and her new work as a writer of children's books, Rose doesn't seem to have time to look for love, which changes when Albert, a dwarf, moves in across the street. In \"Goodnight Lilly, Goodnight Christine\", lesbian couple Christine and Lilly discuss their relationship - past, present and future - as they deal with Lilly's terminal illness. And in \"Love Waits For Kathy\", police detective Kathy Faber lives with her blind sister Carol Faber. Although Carol has an active life - social and professional, the former which includes dates - and is more than capable of managing on her own as she is highly perceptive, Kathy, under the surface, treats Carol with kid gloves to make sure she's all right in dealing with life considering her physical disability. As such, Kathy has let her personal life largely slip by her. But is it too late for Kathy?", "genres": ["Drama", "Romance"], "imdb": {"id": 210358, "rating": 6.6, "votes": 5621}, "languages": ["English"], "lastupdated": "2015-09-01 00:55:51.490000000", "num_mflix_comments": 1, "plot": "Five loosely intertwined stories of the emotional issues facing individual middle-aged Angelenas are presented. In \"This Is Dr. Keener\", physician Elaine Keener is spending the day taking ...", "poster": "https://m.media-amazon.com/images/M/MV5BMjEwNjE4OTE4N15BMl5BanBnXkFtZTcwMzEzNjAyMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 970617600000, "runtime": 109, "title": "Things You Can Tell Just by Looking at Her", "tomatoes": {"critic": {"meter": 74, "numReviews": 19, "rating": 6.5}, "dvd": 1009324800000, "fresh": 14, "lastUpdated": 1442080359000, "production": "United Artists Films", "rotten": 5, "viewer": {"meter": 64, "numReviews": 4711, "rating": 3.3}, "website": "http://www.mgm.com/thingsyoucantell"}, "type": "movie", "writers": ["Rodrigo Garcèa"], "year": 2000}