{"_id": "573a13bcf29313caabd57cab", "awards": {"nominations": 3, "text": "3 nominations.", "wins": 0}, "cast": ["Abhishek Bachchan", "Rani Mukerji", "Konkona Sen Sharma", "Jaya Bhaduri"], "countries": ["India"], "directors": ["Pradeep Sarkar"], "fullplot": "Based in Varanasi, Shivshankar Sahay lives a poor lifestyle along with his wife, Savitri, and two daughters, Vibhavari and Subhavari. The family struggles and at times is even unable to pay the electricity charges. They attempt in vain to rent their heritage yet dilapidated home to a filmmaker. When Shivshankar's elder brother, Rajshankar, files a petition a court to take over the house, he has a stroke and is hospitalized. Vibhavari tells the family that she has managed to obtain a job in Mumbai and re-locates. She then regularly sends money and is not only able to improve their lifestyle but also has Subhavari obtain a Masters Degree. Subhavari completes her education and also re-locates to Mumbai, where she is reunited with her sister. Subhavari then meets with Vivaan and both fall in love with other. Vibhavari gets to meet Vivaan and approves of him, while Subhavari is introduced to Vivaan's grandmother. A marriage is then planned in Varanasi, and it is only at the 11th hour that Subhavari will find out that her sister will not only not be attending her marriage but will never be able to return to her home ever again.", "genres": ["Drama"], "imdb": {"id": 985636, "rating": 5.3, "votes": 1699}, "languages": ["Hindi", "Bhojpuri"], "lastupdated": "2015-09-12 00:39:51.823000000", "num_mflix_comments": 1, "plot": "A woman sacrifices her own happiness and reputation to financially support her family by working as a call girl.", "poster": "https://m.media-amazon.com/images/M/MV5BZDcyZjAyNWUtZmI1OC00YWNlLWExNWQtNTEwYjk0MGZjOGQ0XkEyXkFqcGdeQXVyNTkzNDQ4ODc@._V1_SY1000_SX677_AL_.jpg", "released": 1192147200000, "runtime": 122, "title": "Laaga Chunari Mein Daag: Journey of a Woman", "tomatoes": {"boxOffice": "$0.6M", "dvd": 1197936000000, "lastUpdated": 1441995283000, "production": "Yash Raj Films", "viewer": {"meter": 58, "numReviews": 3677, "rating": 3.4}, "website": "http://www.YashRajFilms.com/"}, "type": "movie", "writers": ["Pradeep Sarkar"], "year": 2007}