{"_id": "573a13def29313caabdb67b9", "awards": {"nominations": 0, "text": "2 wins.", "wins": 2}, "cast": ["Steve Mouzakis", "Leon Cain", "Joss McWilliam", "Matthew Scully"], "countries": ["Australia"], "directors": ["Dru Brown"], "fullplot": "STEVEN RAY was never quite normal. But when the love of his life ANNIE is killed in a hit-and-run incident at a city cross walk, his violent and bizarre behavior becomes uncontrollable. One night, as Steven plots his next murder, a body drops from the sky and lands on his cab. Enter PERCIVAL, who's unsuccessful attempt at jumping off a building not only interferes with Steven's plans, but the chance encounter also introduces the two into each other's sad and lonely lives. Percival believes he's cursed after miraculously surviving each suicide attempt and concludes fate brought he and Steven together. So he hires Steven to assist him in suicide. Steven does not believe in fate and thinks Percival is desperate and delusional. But he accepts the offer. Easy money. After Percival continues to miraculously survive each attempt on his life, Steven starts to believe. He tries to help Percival figure out ways to break the curse. And in the process, they form an unlikely friendship through the common bond of tragedy.", "genres": ["Drama"], "imdb": {"id": 2517300, "rating": 6.2, "votes": 551}, "languages": ["English"], "lastupdated": "2015-08-30 00:24:13.070000000", "metacritic": 51, "plot": "A suicidal man hires a demented killer to assist him in suicide, but for some reason, miraculously survives each attempt on his life.", "poster": "https://m.media-amazon.com/images/M/MV5BMTAyODUyMTc4MDleQTJeQWpwZ15BbWU4MDI0OTQ3MDYx._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1436486400000, "runtime": 98, "title": "The Suicide Theory", "tomatoes": {"boxOffice": "$5.2k", "critic": {"meter": 76, "numReviews": 17, "rating": 6.1}, "fresh": 13, "lastUpdated": 1441993938000, "production": "Freestyle Releasing", "rotten": 4, "viewer": {"meter": 72, "numReviews": 223, "rating": 3.8}, "website": "http://www.facebook.com/TheSuicideTheoryFilm"}, "type": "movie", "writers": ["Michael J. Kospiah"], "year": 2014}