{"_id": "573a1395f29313caabce3116", "awards": {"nominations": 0, "text": "Nominated for 1 Golden Globe. Another 2 wins.", "wins": 3}, "cast": ["Michael Caine", "Jane Fonda", "John Phillip Law", "Diahann Carroll"], "countries": ["USA"], "directors": ["Otto Preminger"], "fullplot": "Following the Second World War, a northern cannery combine negotiates for the purchase of a large tract of uncultivated Georgia farmland. The major portion of the land is owned by Julie Ann Warren and has already been optioned by her unscrupulous, draft dodging husband, Henry. Now the combine must also obtain two smaller plots - one owned by Henry's cousin Rad McDowell, a combat veteran with a wife and family; the other by Reeve Scott, a young black man whose mother had been Julie's childhood Mammy. But neither Rad nor Reeve is interested in selling and they form an unprecedented black and white partnership to improve their land. Although infuriated by the turn of events, Henry remains determined to push through the big land deal. And when Reeve's mother Rose dies, Henry tries to persuade his wife to charge Reeve with illegal ownership of his property, confident the the bigoted Judge Purcell will rule against a Negro.", "genres": ["Drama"], "imdb": {"id": 61796, "rating": 5.6, "votes": 673}, "languages": ["English"], "lastupdated": "2015-08-17 00:20:45.283000000", "plot": "Following the Second World War, a northern cannery combine negotiates for the purchase of a large tract of uncultivated Georgia farmland. The major portion of the land is owned by Julie Ann...", "poster": "https://m.media-amazon.com/images/M/MV5BN2YxNmVkY2MtZGNkOS00N2QyLTg4MDUtYzNjYjg5NDUwYmVkXkEyXkFqcGdeQXVyMTMxMTY0OTQ@._V1_SY1000_SX677_AL_.jpg", "rated": "APPROVED", "released": -91324800000, "runtime": 146, "title": "Hurry Sundown", "tomatoes": {"critic": {"meter": 29, "numReviews": 7, "rating": 3.8}, "dvd": 1367971200000, "fresh": 2, "lastUpdated": 1440614149000, "rotten": 5, "viewer": {"meter": 29, "numReviews": 133, "rating": 2.9}}, "type": "movie", "writers": ["Horton Foote", "Bert Gilden (novel)", "Katya Gilden (novel)", "Thomas C. Ryan"], "year": 1967}