{"_id": "573a13b2f29313caabd3aaec", "awards": {"nominations": 2, "text": "2 wins & 2 nominations.", "wins": 2}, "cast": ["Vatsal Seth", "Ayesha Takia", "Ajay Devgn", "Farida Jalal"], "countries": ["India"], "directors": ["Abbas Alibhai Burmawalla", "Mastan Alibhai Burmawalla"], "fullplot": "Devesh (Ajay Devgan) was Raj's father who was a futuristic car designer. He owned an old car, which was passed down to him from his father and he hoped to pass it on to his son, Raj. After many hours designing, he shows his design to a car company owned by four men (Pankaj Dheer, Sadashiv Amrapurkar, Shakti Kapoor and Mukesh Tiwari), little did he know that they would turn around and patent the design and take credit for it. In an attempt to get justice, Devesh reports the incident to the police and later finds out the hard way that the police officer was part of the deception. After Devesh confronts the men, they fight and Devesh is knocked out and left unconscious. The men decide to place him in his car and dump the car in the nearby lake. Devesh drowns to death leaving behind his mother and his young son. A few years pass by and Raj has grown up and enters college. Raj is a simple looking, geeky guy who is made fun of because of the way he looks. He meets Priya (Ayesha Takia) who has just returned from London and together they form a relationship. One day while passing by Raj sees his father's old car in a scrap yard. He buys the car and transforms it into \"Tarzan\", a futuristic looking car that he builds in memory of his father. The car has a life of its' own and soon becomes a killing machine, taking revenge on the men who killed Devesh. The suspicion falls on Raj and he becomes the prime suspect. While visiting Raj's home, Priya's father sees a photo of Devesh and Raj and realizes who Raj is. Priya's father is one of the men who killed Raj's father. He forbids Priya from seeing Raj and decides to send her back to London. The climax of the movie is where you learn that Devesh's spirit controls the car and he cannot move on to the after world unless he gets revenge and his family learns the truth about his death. After he accomplishes both tasks, his soul is free and he moves on. Raj and Priya unite and all ends well.", "genres": ["Musical", "Action", "Drama"], "imdb": {"id": 435437, "rating": 4.2, "votes": 1282}, "languages": ["Hindi"], "lastupdated": "2015-09-03 00:34:12.460000000", "num_mflix_comments": 1, "plot": "Devesh (Ajay Devgan) was Raj's father who was a futuristic car designer. He owned an old car, which was passed down to him from his father and he hoped to pass it on to his son, Raj. After ...", "released": 1091750400000, "runtime": 163, "title": "Taarzan: The Wonder Car", "tomatoes": {"dvd": 1099094400000, "lastUpdated": 1441222156000, "viewer": {"meter": 16, "numReviews": 154, "rating": 2.9}}, "type": "movie", "writers": ["Lalit Mahajan (story)", "Lalit Mahajan"], "year": 2004}