{"_id": "573a13a8f29313caabd1e463", "awards": {"nominations": 16, "text": "9 wins & 16 nominations.", "wins": 9}, "cast": ["Martin Compston", "William Ruane", "Annmarie Fulton", "Michelle Abercromby"], "countries": ["UK", "Germany", "Spain"], "directors": ["Ken Loach"], "fullplot": "Liam is a young, restless teen struggling to realize his dream in the gritty and dismal streets of Greenock, where unemployment is rampant and little hope is available to the city's youth. He is waiting for the release of his mother, Jean, from prison where she is completing a prison term for a crime that her boyfriend actually committed. Her boyfriend, Stan, is a crude and obnoxious drug pusher is partnered by Liam's equally rough and foul-mouthed, mean-spirited grandfather. Liam is determined to rescue his mother from both of them, which means creating a safe haven beyond their reach. But first he's got to raise the cash--no small feat for a young man It's not long before Liam and his pals' crazy schemes lead them into all sorts of trouble. Finding himself dangerously out of his depth, Liam knows he should walk away. Only this time, he just can't let go.", "genres": ["Crime", "Drama"], "imdb": {"id": 313670, "rating": 7.5, "votes": 9903}, "languages": ["English"], "lastupdated": "2015-08-26 00:44:25.620000000", "metacritic": 86, "plot": "Determined to have a normal family life once his mother gets out of prison, a Scottish teenager from a tough background sets out to raise the money for a home.", "poster": "https://m.media-amazon.com/images/M/MV5BMjg5MjQ3NjQ5OV5BMl5BanBnXkFtZTYwNDkxNjk5._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1033689600000, "runtime": 106, "title": "Sweet Sixteen", "tomatoes": {"boxOffice": "$0.2M", "consensus": "A bleak, but heartbreaking coming-of-age tale that resonates with truth.", "critic": {"meter": 97, "numReviews": 87, "rating": 7.9}, "dvd": 1065484800000, "fresh": 84, "lastUpdated": 1441994745000, "production": "Lions Gate Films", "rotten": 3, "viewer": {"meter": 87, "numReviews": 7826, "rating": 3.9}, "website": "http://www.sweetsixteenmovie.com"}, "type": "movie", "writers": ["Paul Laverty (screenplay)"], "year": 2002}