{"_id": "573a1395f29313caabce1e99", "awards": {"nominations": 10, "text": "Nominated for 3 Oscars. Another 7 nominations.", "wins": 0}, "cast": ["Gregory Peck", "Tony Curtis", "Angie Dickinson", "Eddie Albert"], "countries": ["USA"], "directors": ["David Miller"], "fullplot": "In 1944, Capt. Josiah J. Newman is the doctor in charge of Ward 7, the neuropsychiatric ward, at an Army Air Corps hospital in Arizona. The hospital is under-resourced and Newman scrounges what he needs with the help of his inventive staff, especially Cpl. Jake Leibowitz. The military in general is only just coming to accept psychiatric disorders as legitimate and Newman generally has 6 weeks to cure them or send them on to another facility. There are many patients in the ward and his latest include Colonel Norville Bliss who has dissociated from his past; Capt. Paul Winston who is nearly catatonic after spending 13 months hiding in a cellar behind enemy lines; and 20 year-old Cpl. Jim Tompkins who is severely traumatized after his aircraft was shot down. Others come and go, including Italian prisoners of war, but Newman and team all realize that their success means the men will return to their units and combat.", "genres": ["Comedy", "Drama", "War"], "imdb": {"id": 56903, "rating": 7, "votes": 1552}, "languages": ["English", "Italian"], "lastupdated": "2015-08-09 00:47:05.523000000", "plot": "In 1944, Capt. Josiah J. Newman is the doctor in charge of Ward 7, the neuropsychiatric ward, at an Army Air Corps hospital in Arizona. The hospital is under-resourced and Newman scrounges ...", "poster": "https://m.media-amazon.com/images/M/MV5BOTkxMTQ1OGYtMzA1Ni00YzZhLWFmYTUtMDE5YWZlZmM5NTU2XkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_SY1000_SX677_AL_.jpg", "released": -189993600000, "runtime": 126, "title": "Captain Newman, M.D.", "tomatoes": {"dvd": 1225756800000, "lastUpdated": 1438369999000, "production": "MCA Universal Home Video", "viewer": {"meter": 64, "numReviews": 351, "rating": 3.7}}, "type": "movie", "writers": ["Richard L. Breen (screenplay)", "Phoebe Ephron (screenplay)", "Henry Ephron (screenplay)", "Leo Rosten (novel)"], "year": 1963}