{"_id": "573a1397f29313caabce7f44", "awards": {"nominations": 0, "text": "3 wins.", "wins": 3}, "cast": ["Maria Chwalibèg", "Boguslaw Linda", "Pawel Witczak", "Danuta Balicka-Satanowska"], "countries": ["Poland"], "directors": ["Agnieszka Holland"], "fullplot": "A story of a middle-aged woman, Irena, living alone on the outskirts of Wroclaw with her 8-year old son. They live in a drab apartment. She is a mail carrier and her son is her only pride and joy. She hardly communicates with anybody else in a humanly open and natural way. She also cares for a sick relative. One day when delivering a monthly pension to a crippled young miner Jacek, she faints at his doorsteps. Even though she is determined to live alone after divorcing her drunken first husband, she also knows that her boy needs a male figure to correct his bad habits. She also needs a man badly. The love affair between Jacek and Irena begins however their first physical encounter shatters them both. Irena has a lot of problems: her son makes a lot of trouble at school, and at work her supervisor wants to take her route and give it to somebody else. Finally, the sick relative dies, and she is hit with the funeral bill instead with the expected inheritance. She steals pensioners' money she should be delivering. Tells Jacek that she indeed has received inheritance, places her son in a boaring institution and buys a used car for a trip to West Berlin, opting to immigrate. Now the accident happens...", "genres": ["Drama"], "imdb": {"id": 82625, "rating": 7.3, "votes": 226}, "languages": ["Polish"], "lastupdated": "2015-08-17 00:24:07.767000000", "plot": "A story of a middle-aged woman, Irena, living alone on the outskirts of Wroclaw with her 8-year old son. They live in a drab apartment. She is a mail carrier and her son is her only pride ...", "released": 559958400000, "runtime": 92, "title": "Kobieta samotna", "tomatoes": {"lastUpdated": 1439662939000, "viewer": {"meter": 79, "numReviews": 54, "rating": 4.1}}, "type": "movie", "writers": ["Agnieszka Holland", "Maciej Karpinski"], "year": 1981}