{"_id": "573a13a3f29313caabd0e3f5", "awards": {"nominations": 33, "text": "Nominated for 1 Oscar. Another 42 wins & 33 nominations.", "wins": 43}, "cast": ["Daniel Gimènez Cacho", "Ana Lèpez Mercado", "Diego Luna", "Gael Garcèa Bernal"], "countries": ["Mexico"], "directors": ["Alfonso Cuarèn"], "fullplot": "In Mexico City, late teen friends Tenoch Iturbide and Julio Zapata are feeling restless as their respective girlfriends are traveling together through Europe before they all begin the next phase of their lives at college. At a lavish family wedding, Tenoch and Julio meet Luisa Cortès, the twenty-something wife of Tenoch's cousin Jano, the two who have just moved to Mexico from Spain. Tenoch and Julio try to impress the beautiful Luisa by telling her that they will be taking a trip to the most beautiful secluded beach in Mexico called la Boca del Cielo (translated to Heaven's Mouth), the trip and the beach which in reality don't exist. When Luisa learns of Jano's latest marital indiscretion straight from the horse's mouth, she takes Tenoch and Julio's offer to go along on this road trip, meaning that Tenoch and Julio have to pull together quickly a road trip to a non-existent beach. They decide to head toward one suggested by their friend Saba, who seems a little confused himself of this beach's location. On the road trip, which ends up not being totally harmonious, the three go on a trip of discovery. For Luisa, she has to figure out what to do with her immediate future based on the news from Jano and a secret she is keeping. And Tenoch and Julio have to figure out what their friendship really means as they grow up.", "genres": ["Adventure", "Comedy", "Drama"], "imdb": {"id": 245574, "rating": 7.7, "votes": 85750}, "languages": ["Spanish"], "lastupdated": "2015-08-31 00:18:45.200000000", "metacritic": 88, "num_mflix_comments": 2, "plot": "In Mexico, two teenage boys and an attractive older woman embark on a road trip and learn a thing or two about life, friendship, sex, and each other.", "poster": "https://m.media-amazon.com/images/M/MV5BNDhjMzc3ZTgtY2Y4MC00Y2U3LWFiMDctZGM3MmM4N2YzNDQ5XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1019779200000, "runtime": 106, "title": "Y Tu Mamè Tambièn", "tomatoes": {"boxOffice": "$13.6M", "consensus": "A road movie that's not only sexy, but intelligent as well.", "critic": {"meter": 92, "numReviews": 130, "rating": 8.1}, "dvd": 1185148800000, "fresh": 119, "lastUpdated": 1440357309000, "production": "IFC Films", "rotten": 11, "viewer": {"meter": 88, "numReviews": 68403, "rating": 3.9}, "website": "http://www.ytumamatambien.com"}, "type": "movie", "writers": ["Alfonso Cuarèn", "Carlos Cuarèn"], "year": 2001}