{"_id": "573a13a8f29313caabd1db3e", "awards": {"nominations": 9, "text": "3 wins & 9 nominations.", "wins": 3}, "cast": ["Sigourney Weaver", "Jon Voight", "Tim Blake Nelson", "Shia LaBeouf"], "countries": ["USA"], "directors": ["Andrew Davis"], "fullplot": "\"But if you forget to come back for Madame Zeroni, you and your family will be cursed for always and eternity.\" Those were the exact words spoken to young Elya Yelnats the day he forgot to repay Madame Zeroni. From then on his family was cursed with bad luck. One hundred years later Stanley Yelnats IV is accused of stealing a pair of cleats from a major league baseball player and sent to Camp Green Lake (a dry lake bed in the middle of the desert). It never rains at Camp Green Lake, it hasn't for one hundred years. The secretive and mysterious Warden has each inmate spend every day digging one hole to \"build character.\" But when an artifact from the famous \"Kissin' Kate\" Barlow is found in a hole, the Warden forces the boys to work double time leading Stanley to deduce they're digging because the Warden is looking for something. But what? And how is the mystery of Camp Green Lake connected to Stanley's family curse?", "genres": ["Adventure", "Comedy", "Drama"], "imdb": {"id": 311289, "rating": 7.1, "votes": 52873}, "languages": ["English"], "lastupdated": "2015-09-07 01:03:13.387000000", "metacritic": 71, "num_mflix_comments": 2, "plot": "A wrongfully convicted boy is sent to a brutal desert detention camp where he joins the job of digging holes for some mysterious reason.", "poster": "https://m.media-amazon.com/images/M/MV5BMTg0MTU5ODkwM15BMl5BanBnXkFtZTYwMzgxNzY3._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 1050624000000, "runtime": 117, "title": "Holes", "tomatoes": {"boxOffice": "$67.3M", "consensus": "Faithful to its literary source, this is imaginative, intelligent family entertainment.", "critic": {"meter": 77, "numReviews": 133, "rating": 7}, "dvd": 1064275200000, "fresh": 103, "lastUpdated": 1442166390000, "production": "Buena Vista Pictures", "rotten": 30, "viewer": {"meter": 76, "numReviews": 210629, "rating": 3.3}, "website": "http://disney.go.com/disneypictures/holes/index.html"}, "type": "movie", "writers": ["Louis Sachar (novel)", "Louis Sachar (screenplay)"], "year": 2003}