{"_id": "573a13a1f29313caabd07f23", "awards": {"nominations": 6, "text": "4 wins & 6 nominations.", "wins": 4}, "cast": ["Nicolas Cage", "Tèa Leoni", "Don Cheadle", "Jeremy Piven"], "countries": ["USA"], "directors": ["Brett Ratner"], "fullplot": "A modern-day Frank Capra story. Jack Campbell, a successful and talented businessman, is happily living his single life. He has everything, or so he thinks. One day he wakes up in a new life where he didn't leave his college girlfriend for a London trip. He's married to Kate, lives in Jersey and has two kids. He, of course, desperately wants his life back for which he has worked 13 years for. He's president of P. K. Lassiter Investment House and not a tire salesman at Big Ed's. He drives a Ferrari and not a mini-van that never starts. And most importantly he doesn't wake up in the morning with kids jumping on the bed. After a bad start, day by day he's more confident in his new life and starts to see what he's been missing. Turns out money's good to have but that's not everything.", "genres": ["Comedy", "Drama", "Fantasy"], "imdb": {"id": 218967, "rating": 6.7, "votes": 81482}, "languages": ["English", "Italian"], "lastupdated": "2015-09-15 04:11:48.707000000", "metacritic": 42, "plot": "A fast-lane investment broker, offered the opportunity to see how the other half lives, wakes up to find that his sports car and girlfriend have become a mini-van and wife.", "poster": "https://m.media-amazon.com/images/M/MV5BYzYzMTQ4NDYtNWRkZi00NTYxLThlZDItMzI1MmU1MmU5ZWQ3XkEyXkFqcGdeQXVyNDA5Mjg5MjA@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 977443200000, "runtime": 125, "title": "The Family Man", "tomatoes": {"boxOffice": "$73.7M", "consensus": "Despite good performances by Cage and especially by Leoni, The Family Man is too predictable and derivative to add anything new to the Christmas genre. Also, it sinks under its sentimentality.", "critic": {"meter": 53, "numReviews": 128, "rating": 5.5}, "dvd": 995328000000, "fresh": 68, "lastUpdated": 1439921565000, "production": "Universal Pictures", "rotten": 60, "viewer": {"meter": 67, "numReviews": 194151, "rating": 3.1}, "website": "http://www.family-man.com"}, "type": "movie", "writers": ["David Diamond", "David Weissman"], "year": 2000}