{"_id": "573a13a7f29313caabd1ac5a", "awards": {"nominations": 4, "text": "2 wins & 4 nominations.", "wins": 2}, "cast": ["Greg Kinnear", "Willem Dafoe", "Rita Wilson", "Maria Bello"], "countries": ["USA"], "directors": ["Paul Schrader"], "fullplot": "In 1965, Bob Crane, who had achieved some earlier success as a television supporting actor, was working as a successful morning radio DJ at KNX Los Angeles. Despite enjoying his work, photography (especially of the female form) and drumming, Crane wanted to be a movie star. So it was with some reluctance that he accepted the title starring role in a new television sitcom called Hogan's Heroes (1965), a WWII POW comedy. To his surprise, the show became a hit and catapulted him to television stardom. The fame resulting from the show led to excesses and a meeting with home video salesman and technician John Carpenter, with who he would form a friendship based on their mutual interests, namely excessive sex (for Crane, purely heterosexual sex) and capturing nude females on celluloid. His fame allowed Crane to have as much sex as he wanted, which was incongruent to his somewhat wholesome television friendly image, and the way he portrayed himself to almost everyone except Carpenter and his extramarital sex partners. His sex addiction was somewhat known but ignored by his high school sweetheart/first wife Anne Crane nèe Terzian, but well known by his second wife, Patti Olson, better known as Sigrid Valdis, his Hogan's Heroes co-star. Especially after the end of Hogan's Heroes in 1971, this incongruence and his friendship with Carpenter, with who he would have a continuing love/hate relationship, would contribute to both his professional and personal downfall.", "genres": ["Biography", "Crime", "Drama"], "imdb": {"id": 298744, "rating": 6.6, "votes": 11116}, "languages": ["English"], "lastupdated": "2015-09-11 00:17:36.060000000", "metacritic": 66, "plot": "A story about \"Hogan's Heroes\" star Bob Crane and his friendship with John Carpenter.", "poster": "https://m.media-amazon.com/images/M/MV5BMTMyMjYwMjEwOV5BMl5BanBnXkFtZTYwMDQ4MzI3._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1036108800000, "runtime": 105, "title": "Auto Focus", "tomatoes": {"boxOffice": "$1.8M", "consensus": "Kinnear and Dafoe help make this downward spiral of one man's life a compelling watch.", "critic": {"meter": 72, "numReviews": 158, "rating": 6.7}, "dvd": 1047945600000, "fresh": 114, "lastUpdated": 1441910223000, "production": "Sony Pictures Classics", "rotten": 44, "viewer": {"meter": 60, "numReviews": 5910, "rating": 3.2}, "website": "http://www.sonyclassics.com/autofocus"}, "type": "movie", "writers": ["Robert Graysmith (book)", "Michael Gerbosi"], "year": 2002}