{"_id": "573a13e5f29313caabdc3dfd", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Lacey Chabert", "Warren Christie", "Matthew Kevin Anderson", "Logan Williams"], "countries": ["USA"], "directors": ["Anne Wheeler"], "fullplot": "After cancer claims Matt Kell's life on Christmas Day 2005, his widow, Gina and two young boys are left to cope with the pain of his loss while their close church community gathers around them for support. Wanting to be close to her kids, Gina starts to volunteer at their elementary school and meets the Spehn children, Jack, Danny and Charlotte. In a gut-wrenching coincidence, just weeks after Matt's death, the Spehn's mom, Cathy, also suddenly succumbs to cancer, leaving her distraught husband, Michael, to care for their three kids on his own. Sensing the hopelessness in Michael she so recently saw in herself, Gina reaches out to Michael and his kids and the two families begin to forge an unlikely friendship and close bond. Over the year that follows, their lives become intertwined as they learn to lean on each other during the at-times insurmountable obstacles, tears and adversity and begin to heal with laughter, compassion and faith. As Gina and Michael realize their newfound friendship is so much more, they struggle against some surprising resistance from their families and community to unite their two grieving families as one and eventually learn to open their hearts to love again.", "genres": ["Drama"], "imdb": {"id": 3004852, "rating": 6.8, "votes": 376}, "languages": ["English"], "lastupdated": "2015-08-20 00:27:58.923000000", "plot": "After cancer claims Matt Kell's life on Christmas Day 2005, his widow, Gina and two young boys are left to cope with the pain of his loss while their close church community gathers around ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTQ0NDYxNzM4OV5BMl5BanBnXkFtZTgwNDQ2NTU5MjE@._V1_SY1000_SX677_AL_.jpg", "rated": "TV-14", "released": 1401494400000, "runtime": 120, "title": "The Color of Rain", "tomatoes": {"lastUpdated": 1441994276000, "production": "Lighthouse Pictures, LLC", "viewer": {"numReviews": 1, "rating": 5}}, "type": "movie", "writers": ["Gina Kell (book)", "Nancey Silvers (screenplay)", "Nancey Silvers", "Michael Spehn (book)"], "year": 2014}