{"_id": "573a13c2f29313caabd66b08", "awards": {"nominations": 1, "text": "7 wins & 1 nomination.", "wins": 7}, "cast": ["Rirè Furankè", "Tae Kimura", "Masaaki Akahori", "Tamae Andè"], "countries": ["Japan"], "directors": ["Ryosuke Hashiguchi"], "fullplot": "In 1993 Kanao and Shoko are a Tokyo couple awaiting the arrival of their first child. Although both have studied art, Kanao works as a shoe repairman which doesn't stretch his rather laid-back style and Shoko works in a small publishing firm. Their home life is marked by some clashes between her attempts at regimentation, including scheduling their sex life on a calendar, and his flirting with other women. Kanao is offered work as a courtroom sketch artist and becomes a witness to the most sensational murder trials of Japan through the next 8 years. He must cope with the ugliness and breakdown in civility he encounters. Shoko also re-discovers her artistic side as she confronts the dark side of life when struggling with depression over the loss of a child and the dysfunctional aspects of the lives of her mother and brother.", "genres": ["Drama"], "imdb": {"id": 1245489, "rating": 7.7, "votes": 492}, "languages": ["Japanese"], "lastupdated": "2015-08-12 00:14:09.393000000", "num_mflix_comments": 3, "plot": "In 1993 Kanao and Shoko are a Tokyo couple awaiting the arrival of their first child. Although both have studied art, Kanao works as a shoe repairman which doesn't stretch his rather ...", "poster": "https://m.media-amazon.com/images/M/MV5BY2U0NTk1ZmQtMWNmMS00NjE1LWEzNzMtNmE2ZDk5MTc5MDI0XkEyXkFqcGdeQXVyMzY2MDk0MTk@._V1_SY1000_SX677_AL_.jpg", "released": 1212796800000, "runtime": 140, "title": "All Around Us", "tomatoes": {"boxOffice": "$101.5M", "consensus": "Energetic, self-deprecating performances and enough guffaw-inducing humor make up for the flaws in This Is the End loosely written script.", "critic": {"meter": 83, "numReviews": 209, "rating": 7.1}, "dvd": 1380585600000, "fresh": 174, "lastUpdated": 1440094438000, "production": "Sony Pictures", "rotten": 35, "viewer": {"meter": 71, "numReviews": 179085, "rating": 3.7}, "website": "http://www.thisistheend.com"}, "type": "movie", "writers": ["Ryosuke Hashiguchi (based upon the novel)", "Ryosuke Hashiguchi (screenplay)"], "year": 2008}