{"_id": "573a13a4f29313caabd0f521", "awards": {"nominations": 2, "text": "5 wins & 2 nominations.", "wins": 5}, "cast": ["Golab Adineh", "Mohammad Reza Forutan", "Baran Kosari", "Ebrahim Sheibani"], "countries": ["Iran"], "directors": ["Rakhshan Bani-Etemad"], "fullplot": "Tuba works daily at a grueling textile factory in Iran, returning home every night to deal with the rest of her problematic family, which includes: a pregnant daughter whose husband beats her regularly; a teenage son, who's been getting into trouble due to his burgeoning career in radical politics; and an older son who goes to great lengths--such as attempting to sell the family's meager house--in order to get an engineering job in Japan as a means of getting out of Iran. Unfortunately the 'friend' to whom he gave his money as an advance for his trip took off with the money, and the son finds himself without money, without a career, and with a debt towards a lot of people. To solve his problems he wants to deliver a package of heroin, but loses it, and has to flee. The film ends dramatically with a direct call from the mother to the camera crew asking what life has given them after all the sacrifices they have done, mirroring the opening scene.", "genres": ["Drama"], "imdb": {"id": 250125, "rating": 7.5, "votes": 961}, "languages": ["Persian"], "lastupdated": "2015-05-16 01:15:09.137000000", "metacritic": 77, "plot": "Tuba works daily at a grueling textile factory in Iran, returning home every night to deal with the rest of her problematic family, which includes: a pregnant daughter whose husband beats ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTk1Mzg1NjUyN15BMl5BanBnXkFtZTYwNDc0NTk5._V1_SY1000_SX677_AL_.jpg", "released": 1116979200000, "runtime": 92, "title": "Under the City's Skin", "tomatoes": {"critic": {"meter": 87, "numReviews": 30, "rating": 7}, "dvd": 1079395200000, "fresh": 26, "lastUpdated": 1437850997000, "production": "Magnolia Pictures", "rotten": 4, "viewer": {"meter": 81, "numReviews": 698, "rating": 3.6}, "website": "http://www.magpictures.com/distribution/moreinfo.php?1skin"}, "type": "movie", "writers": ["Rakhshan Bani-Etemad", "Farid Mostafavi"], "year": 2001}