{"_id": "573a13b4f29313caabd3f45e", "awards": {"nominations": 2, "text": "2 wins & 2 nominations.", "wins": 2}, "cast": ["Amanda Bynes", "Channing Tatum", "Laura Ramsey", "Vinnie Jones"], "countries": ["USA", "Canada"], "directors": ["Andy Fickman"], "fullplot": "Here's the thing! Viola's soccer team at Cornwall gets cut. She wants to join the boys team, but they do not allow girls. So she thinks \"If you can't join them, beat them\". So she does! She disguises herself as her twin brother Sebastian, and goes out for the rival school, Illyria, boys' soccer team and makes it. Unfortunately, she didn't plan falling in love with her roommate Duke. But Duke has his eyes on Olivia. What makes matters worse is that Olivia starts to fall for Sebastian because he/she has a sensitive side. If things couldn't get more problematic, the real Sebastian (who was in London working on his music) comes home early. He arrives on campus and has no clue that he was replaced by his twin sister.", "genres": ["Comedy", "Romance"], "imdb": {"id": 454945, "rating": 6.4, "votes": 104959}, "languages": ["English"], "lastupdated": "2015-08-27 00:02:01.870000000", "metacritic": 45, "num_mflix_comments": 1, "plot": "When her brother decides to ditch for a couple weeks in London, Viola heads over to his elite boarding school, disguises herself as him, and proceeds to fall for one of her soccer teammates. Little does she realize she's not the only one with romantic troubles, as she, as he, gets in the middle of a series of intermingled love affairs.", "poster": "https://m.media-amazon.com/images/M/MV5BNTE0NDk1YzAtNTUwZC00NmViLWI3YjgtY2ZjYWI2YjYzZjkyXkEyXkFqcGdeQXVyMTkzODUwNzk@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1142553600000, "runtime": 105, "title": "She's the Man", "tomatoes": {"dvd": 1181606400000, "lastUpdated": 1442083913000, "viewer": {"meter": 50, "numReviews": 329, "rating": 3.3}}, "type": "movie", "writers": ["Ewan Leslie (screenplay)", "Karen McCullah (screenplay)", "Kirsten Smith (screenplay)", "Ewan Leslie (story)"], "year": 2006}