{"_id": "573a13d8f29313caabda5ee2", "awards": {"nominations": 4, "text": "14 wins & 4 nominations.", "wins": 14}, "cast": ["Luminita Gheorghiu", "Bogdan Dumitrache", "Natasa Raab", "Ilinca Goia"], "countries": ["Romania"], "directors": ["Calin Peter Netzer"], "fullplot": "Seeing a way to reassert control over her adult son's life when he faces manslaughter charges, an affluent Romanian woman sets out on a campaign of emotional and social manipulation to keep him out of prison, navigating the waters of power, corruption and influence. Child's Pose is based on the sense of loss of parents who have to send their children away-physically and psychologically. The parent-child relationship is re-assessed through a son in his 30s that wants to escape from his mother, who in turn wants to keep her adult son by her side. The mother's character is quite familiar, but this film is unique in that the director delicately portrays how the controlling mother wants to deny that her son is destined to leave her by following the characters' emotional flows and gazing at their twisted desires. Luminita Gheorghiu turns in an extraordinary performance in playing a mother struggling to \"save\" her son. Heading to the conclusion, the film shows that the unhealthy mother-son relationship is not that simple when it comes to matters of humane duty.", "genres": ["Drama"], "imdb": {"id": 2187115, "rating": 7.5, "votes": 5456}, "languages": ["Romanian"], "lastupdated": "2015-09-14 08:05:58.500000000", "metacritic": 77, "plot": "Seeing a way to reassert control over her adult son's life when he faces manslaughter charges, an affluent Romanian woman sets out on a campaign of emotional and social manipulation to keep...", "poster": "https://m.media-amazon.com/images/M/MV5BMTgxMzIwNzEyMV5BMl5BanBnXkFtZTgwOTEzNzI5MDE@._V1_SY1000_SX677_AL_.jpg", "released": 1362700800000, "runtime": 112, "title": "Child's Pose", "tomatoes": {"boxOffice": "$94.9k", "consensus": "It isn't necessarily an easy watch, but thanks to Netzer's interesting direction and a riveting performance from Gheorghiu, Child's Pose is rewarding.", "critic": {"meter": 93, "numReviews": 74, "rating": 7.6}, "fresh": 69, "lastUpdated": 1440354817000, "production": "Zeitgeist Films", "rotten": 5, "viewer": {"meter": 76, "numReviews": 1795, "rating": 3.7}, "website": "http://www.zeitgeistfilms.com/film.php?directoryname=childspose&mode=downloads"}, "type": "movie", "writers": ["Razvan Radulescu (screenplay)", "Calin Peter Netzer (screenplay)"], "year": 2013}