{"_id": "573a1395f29313caabce10da", "awards": {"nominations": 1, "text": "3 wins & 1 nomination.", "wins": 3}, "cast": ["Richard Egan", "Dorothy McGuire", "Sandra Dee", "Arthur Kennedy"], "countries": ["USA"], "directors": ["Delmer Daves"], "fullplot": "The Hunter family has long owned a mansion on Pine Island, a summer resort located off the Maine coast. Bart Hunter's now deceased father was able to open the mansion for free when Bart was younger, but current owner Bart, a drunkard and weak man, must now live there year round for financial survival with his wife Sylvia and their late teen-aged son Johnny, the family who are barely able to eke out a living with the mansion now as a year-round inn which is in an extreme state of disrepair. Bart and Sylvia are in a quietly unhappy marriage due largely to Bart's drinking. The Buffalo-based Jorgensons - husband Ken Jorgenson, his wife Helen Jorgenson and their late teen-aged daughter Molly Jorgenson - have rented rooms at the inn for the summer, while Ken looks for a summer house on the island. Ken lived on the island twenty years ago, he actually a working class lifeguard for Bart's father at that time. Ken is now a self-made millionaire as a research scientist, who had never been back to the island until now. Ken and Helen too are in an unsatisfying marriage, Helen, a shrew and prude, who seems to hate and mistrust anything and everything, including her husband and daughter. Helen only seems concerned with public perception that their lives are perfect. Upon first meeting, Johnny and Molly fall in love. Meanwhile, Ken and Sylvia rekindle a romance from twenty years earlier, they uncertain if Bart knew at the time of their relationship, which did not last because of the differences in their social background. The two romances have a rocky road to potential happiness. Helen does not trust either Johnny or Molly to be morally proper. Ken and Sylvia know that their respective spouses will never consent to divorce, and if they do will do whatever they can so that they will never get to see their children again. And despite knowing that their respective parents are unhappy in their marriages, Johnny and Molly do not approve of a liaison between his mother and her father. Regardless, Ken and Sylvia want to provide their children with as much love and guidance as possible, including encouraging them to follow their hearts while not getting into trouble, a message which may not be heard if only because of Johnny and Molly believing that what they are doing is disgusting, and because of Johnny and Molly's own raging hormones.", "genres": ["Drama", "Romance"], "imdb": {"id": 53320, "rating": 7, "votes": 1976}, "languages": ["English"], "lastupdated": "2015-07-25 00:29:54.430000000", "num_mflix_comments": 3, "plot": "A self-made businessman rekindles a romance with a former flame while their two teenage children begin a romance of their own with drastic consequences for both couples.", "poster": "https://m.media-amazon.com/images/M/MV5BYmFlODFlNjMtZjY0Zi00Y2M1LTgyYmQtNDllM2RmMDkyNzNiXkEyXkFqcGdeQXVyMzk3NTUwOQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "APPROVED", "released": -319420800000, "runtime": 130, "title": "A Summer Place", "tomatoes": {"critic": {"meter": 83, "numReviews": 6, "rating": 6}, "dvd": 1170720000000, "fresh": 5, "lastUpdated": 1439144970000, "production": "Warner Home Video", "rotten": 1, "viewer": {"meter": 73, "numReviews": 1015, "rating": 3.8}}, "type": "movie", "writers": ["Sloan Wilson (novel)", "Delmer Daves"], "year": 1959}