{"_id": "573a1394f29313caabce00e0", "awards": {"nominations": 6, "text": "Nominated for 4 Oscars. Another 2 nominations.", "wins": 0}, "cast": ["Tyrone Power", "Kim Novak", "Victoria Shaw", "James Whitmore"], "countries": ["USA"], "directors": ["George Sidney"], "fullplot": "In the late 20's, the talkative newly graduated in pharmacy and aspirant piano player Eddy Duchin comes from Boston to New York expecting to play with the orchestra of Leo Reisman at fancy New York's Central Park Casino. However he had misunderstood the invitation of the maestro and while leaving the place, he meets the wealthy socialite Marjorie Oelrichs that asks Leo Reisman to give a chance to Eddy. He plays in the intermission and becomes a successful piano showman. Two years later, Marjorie and Eddy get married and in the Christmas, Marjorie has a baby, Peter, but she dies after the delivery. Eddy rejects Peter blaming him for the death of Marjorie and only five years later he meets his son. With the World War II, Eddy Duchin breaks up his band and enlists to fight in the war. With the end of the war, Eddy returns to New York with the intention of getting closer to Peter but he sees the boy connected to his friend Chiquita. When Eddy discovers that he has a terminal disease, he proposes Chiquita and they get married.", "genres": ["Biography", "Drama", "Music"], "imdb": {"id": 49170, "rating": 7, "votes": 1141}, "languages": ["English"], "lastupdated": "2015-08-10 00:04:38.067000000", "plot": "The life story of the famous pianist and band-leader of the 1930s and 1940s.", "poster": "https://m.media-amazon.com/images/M/MV5BNWRlMDExMzQtZThkNy00ZjJlLTkzZTQtYjJiODM5NWY1NmY1XkEyXkFqcGdeQXVyNjE5MjUyOTM@._V1_SY1000_SX677_AL_.jpg", "rated": "APPROVED", "released": -426988800000, "runtime": 123, "title": "The Eddy Duchin Story", "tomatoes": {"dvd": 1026777600000, "lastUpdated": 1440614036000, "production": "Sony Pictures Home Entertainment", "viewer": {"meter": 55, "numReviews": 750, "rating": 3.4}}, "type": "movie", "writers": ["Samuel A. Taylor (screenplay)", "Leo Katcher (story)"], "year": 1956}