{"_id": "573a13b4f29313caabd41b60", "awards": {"nominations": 0, "text": "2 wins.", "wins": 2}, "cast": ["Daniel Radcliffe", "Lee Cormie", "Christian Byers", "James Fraser"], "countries": ["Australia"], "directors": ["Rod Hardy"], "fullplot": "An adult nicknamed Misty is narrating a story about one summer in his life when he was an adolescent in the late 1960s. He was living in a Catholic orphanage in the Australian outback. His best mates were the \"December boys\" - Maps, Spark and Spit - the four of them so named because they were the boys in the orphanage born in the month of December. With a recent windfall, the orphanage decided to give each of the boys a group vacation for each of their birthdays, the December boys the first to go. Their vacation was to Lady Star Cove on the Australian coast, to stay at the home of Mrs. and Mrs. McAnsh - Bandy and \"Skipper\". Their relatively carefree Christmas vacation took a turn primarily from three events: learning the reason the McAnshes hosted the boys specifically at this time; Maps, the oldest in his mid-teens, exploring his sexuality with a girl named Lucy, who was also visiting Lady Star Cove for the summer; and Misty secretly learning that a young couple in the cove, Fearless and Teresa, were thinking about adopting one of them, the couple who were unable to conceive a child of their own. Beyond the dreams of especially the younger three to be adopted by a loving family, Fearless had the extra wow factor of being a stunt motorcyclist as his profession. Misty, the youngest, tried the hardest to be the one chosen, even initially keeping the fact of Fearless and Teresa thinking about adopting one of them from the other three. Misty concludes his story with the reason why he is telling it at this stage in his life.", "genres": ["Drama", "Romance"], "imdb": {"id": 465436, "rating": 6.6, "votes": 9933}, "languages": ["English", "French"], "lastupdated": "2015-09-15 03:22:11.170000000", "metacritic": 56, "plot": "One summer, four orphans boys who have grown to be the closest of friends find themselves competing for the attention of the same family.", "poster": "https://m.media-amazon.com/images/M/MV5BMTkwMzg4NTg0Ml5BMl5BanBnXkFtZTcwMjg3OTA1MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1190246400000, "runtime": 105, "title": "December Boys", "tomatoes": {"consensus": "December Boys' location and settings are invitingly gorgeous, but the coming-of-age drama that takes place on them is uneventful and far too sentimental.", "critic": {"meter": 41, "numReviews": 69, "rating": 5}, "dvd": 1197331200000, "fresh": 28, "lastUpdated": 1439835064000, "production": "Warner Independent Pictures", "rotten": 41, "viewer": {"meter": 52, "numReviews": 22696, "rating": 3.3}, "website": "http://wip.warnerbros.com/decemberboys/"}, "type": "movie", "writers": ["Ronald Kinnoch (story)", "Michael Noonan (novel)", "Marc Rosenberg (screenplay)"], "year": 2007}