{"_id": "573a139bf29313caabcf519d", "awards": {"nominations": 3, "text": "3 nominations.", "wins": 0}, "cast": ["George Clooney", "Catherine Zeta-Jones", "Geoffrey Rush", "Cedric the Entertainer"], "countries": ["USA"], "directors": ["Joel Coen", "Ethan Coen"], "fullplot": "Miles Massey, a prominent Los Angeles divorce attorney has everything--and in some cases, two of everything. Despite his impressive client list, a formidable win record, the respect of his peers and an ironclad contract (the Massey pre-nup) named after him, he's reached a crossroads in his life. Sated on success, boredom has set in and he's looking for new challenges. All that changes when Miles meets his match in the devastating Marylin Rexroth. Marylin is the soon-to-be ex-wife of his client Rex Rexroth, a wealthy real estate developer and habitual philanderer. With the help of hard charging private investigator Gus Petch, she has Rex nailed and is looking forward to the financial independence a successful divorce will bring. But thanks to Miles' considerable skills, she ends up with nothing. Not to be outdone, Marylin schemes to get even and as part of her plan, quickly marries oil tycoon Howard Doyle. Miles and his unflappable associate, Wrigley, unwittingly dig themselves in deeper and deeper as they go head-to-head with Marylin. Underhanded tactics, deceptions and an undeniable attraction escalate as Marylin and Miles square off in this classic battle of the sexes.", "genres": ["Comedy", "Crime", "Romance"], "imdb": {"id": 138524, "rating": 6.3, "votes": 71524}, "languages": ["English", "French"], "lastupdated": "2015-09-06 00:10:13.760000000", "metacritic": 71, "plot": "A revenge-seeking gold digger marries a womanizing Beverly Hills lawyer with the intention of making a killing in the divorce.", "poster": "https://m.media-amazon.com/images/M/MV5BMTU2OTc5Mjc0N15BMl5BanBnXkFtZTYwMDYyMjg3._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1065744000000, "runtime": 100, "title": "Intolerable Cruelty", "tomatoes": {"boxOffice": "$35.1M", "consensus": "Though more mainstream than other Coen films, there are still funny oddball touches, and Clooney and Zeta-Jones sizzle like old-time movie stars.", "critic": {"meter": 75, "numReviews": 180, "rating": 6.8}, "dvd": 1076371200000, "fresh": 135, "lastUpdated": 1442343012000, "production": "Universal Pictures", "rotten": 45, "viewer": {"meter": 47, "numReviews": 66091, "rating": 2.9}, "website": "http://www.intolerablecruelty.com/"}, "type": "movie", "writers": ["Robert Ramsey (story)", "Matthew Stone (story)", "John Romano (story)", "Robert Ramsey (screenplay)", "Matthew Stone (screenplay)", "Ethan Coen (screenplay)", "Joel Coen (screenplay)"], "year": 2003}