{"_id": "573a13c8f29313caabd7677b", "awards": {"nominations": 12, "text": "3 wins & 12 nominations.", "wins": 3}, "cast": ["Robert Pattinson", "Sarah Gadon", "Paul Giamatti", "Kevin Durand"], "countries": ["Canada", "France", "Portugal", "Italy"], "directors": ["David Cronenberg"], "fullplot": "On the spur of the moment, twenty-eight year old Manhattan self-made multi-billionaire Eric Packer decides he wants to get a haircut from his regular and longtime barber across town, a difficult journey today if only because of the traffic gridlock from three high profile but vastly different events taking place in the borough, including a wandering anarchist protest, they who largely use dead rats as their symbol of protest. Through his trek, Eric, most taking place in his stretch limousine, meets with several business associates - some with as esoteric job titles as Head of Theory - and personal acquaintances, including his several week bride, Elise, a wealthy woman in her own right with who he still has a somewhat distant relationship if only because they don't really know each other. The start of Eric's day ends much differently than the end as his personal fortune largely hinges on external forces in relation to a speculative currency transaction, and as he learns that someone is trying to kill him, who and for what reason he does not know.", "genres": ["Drama", "Thriller"], "imdb": {"id": 1480656, "rating": 5, "votes": 35670}, "languages": ["English"], "lastupdated": "2015-09-11 00:03:28.093000000", "metacritic": 58, "plot": "Riding across Manhattan in a stretch limo in order to get a haircut, a 28-year-old billionaire asset manager's day devolves into an odyssey with a cast of characters that start to tear his world apart.", "poster": "https://m.media-amazon.com/images/M/MV5BMTY1NjI0MDYyNV5BMl5BanBnXkFtZTcwNDIzMDEyOA@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1337904000000, "runtime": 109, "title": "Cosmopolis", "tomatoes": {"boxOffice": "$0.7M", "consensus": "Though some may find it cold and didactic, Cosmopolis benefits from David Cronenberg's precise direction, resulting in a psychologically complex adaptation of Don DeLillo's novel.", "critic": {"meter": 64, "numReviews": 165, "rating": 6}, "dvd": 1356998400000, "fresh": 106, "lastUpdated": 1440094036000, "production": "Entertainment One", "rotten": 59, "viewer": {"meter": 31, "numReviews": 37368, "rating": 2.5}, "website": "http://cosmopolis-movie.com/"}, "type": "movie", "writers": ["David Cronenberg (screenplay)", "Don DeLillo (novel)"], "year": 2012}