{"_id": "573a1395f29313caabce211c", "awards": {"nominations": 2, "text": "2 nominations.", "wins": 0}, "cast": ["James Stewart", "Sandra Dee", "Audrey Meadows", "Robert Morley"], "countries": ["USA"], "directors": ["Henry Koster"], "fullplot": "Frank Michaelson, well respected President of the Pacific Pallisades Board of Education, is appearing in front of a Board hearing addressing the issue of the widespread public outcry asking for either his dismissal or resignation because of a series of salacious front page newspaper stories, complete with photographs, on his recent goings-on. In addressing these unsubstantiated charges, Frank attributes all the incidents on his eldest daughter, Mollie Michaelson, now just shy of her twentieth birthday, no longer being the sweet child he had always pictured her as, but now rather a desirable young woman. Frank and his wife Anne first noticed Mollie blossoming into such when she went away to college, first to Hawthorne, a girls' college in New England, and then to a prestigious art school in Paris. In Frank noticing Mollie becoming a desirable woman and her leaving home happening at the same time, Frank admits that he had troubles letting go of Mollie and thus he did whatever he felt he needed to to protect her, even if she didn't really want or need that help. His problems were compounded by his encounters with a slightly off kilter Englishman he met in Paris, and many, including some paparazzi, believing that he is American actor James Stewart.", "genres": ["Comedy"], "imdb": {"id": 57556, "rating": 6.4, "votes": 866}, "languages": ["English", "French"], "lastupdated": "2015-09-05 00:43:14.790000000", "plot": "A father's attempts to protect his college-age daughter from trouble backfire, and he finds himself in the middle of scandal after scandal.", "poster": "https://m.media-amazon.com/images/M/MV5BYjhjYjVkODYtZjIyNS00MWZlLTk4MDItZjkzZGQxNjNiNzc2XkEyXkFqcGdeQXVyNjE5MjUyOTM@._V1_SY1000_SX677_AL_.jpg", "rated": "APPROVED", "released": -193622400000, "runtime": 98, "title": "Take Her, She's Mine", "tomatoes": {"lastUpdated": 1440008081000, "viewer": {"meter": 67, "numReviews": 860, "rating": 3.5}}, "type": "movie", "writers": ["Phoebe Ephron (play)", "Henry Ephron (play)", "Nunnally Johnson (screenplay)"], "year": 1963}