{"_id": "573a13c6f29313caabd73034", "awards": {"nominations": 4, "text": "4 nominations.", "wins": 0}, "cast": ["Yvan Attal", "Anne Consigny", "Andrè Marcon", "Franèoise Fabian"], "countries": ["France", "Belgium"], "directors": ["Lucas Belvaux"], "fullplot": "Stanislaff Graff, a rich industrialist with a wife and a lover, is kidnapped brutally from his limousine on the eve of his visit to China as part of the entourage of the French president. The kidnappers demand a fifty million euro ransom. In order to prove they are serious, they cut off one of his fingers. What follows is a terrifying sparring match between kidnappers, police and the board of the company of which Graff is the director. The main question for the board: is a human life worth more than fifty million euros? Will they be able to get that amount of money together in time anyway? While they decide this he degenerates physically and mentally in imprisonment. In the meantime, the press dredges up the businessman's past with revelations that are especially painful for his wife.", "genres": ["Drama"], "imdb": {"id": 1430110, "rating": 6.7, "votes": 1623}, "languages": ["French"], "lastupdated": "2015-08-26 00:55:38.807000000", "metacritic": 71, "num_mflix_comments": 2, "plot": "A rich industrialist is brutally kidnapped. While he physically and mentally degenerates in imprisonment, the kidnappers, police and the board of the company of which he is director negotiate about the ransom of 50 million euro.", "poster": "https://m.media-amazon.com/images/M/MV5BMTQ2MzEzMzYyMF5BMl5BanBnXkFtZTcwMDAyMjc4NQ@@._V1_SY1000_SX677_AL_.jpg", "released": 1258502400000, "runtime": 125, "title": "Rapt", "tomatoes": {"boxOffice": "$45.7k", "critic": {"meter": 97, "numReviews": 31, "rating": 7.6}, "dvd": 1323129600000, "fresh": 30, "lastUpdated": 1441305271000, "production": "Lorber Films", "rotten": 1, "viewer": {"meter": 67, "numReviews": 921, "rating": 3.4}, "website": "http://www.rapt-lefilm.com/"}, "type": "movie", "writers": ["Lucas Belvaux"], "year": 2009}