{"_id": "573a13bcf29313caabd56f73", "awards": {"nominations": 4, "text": "Nominated for 1 Oscar. Another 2 wins & 4 nominations.", "wins": 3}, "cast": ["Sharon D. Allen", "Beau Bridges", "Colby Buzzell", "Richard Currey"], "countries": ["USA"], "directors": ["Richard Robbins"], "fullplot": "A unique documentary about troops' experiences in Iraq and Afghanistan, based on writings by soldiers, Marines, and air men. Some writings were published in the New Yorker in summer 2006. A larger assortment was published as a book by Random House last September. The film drew upon the submissions by soldiers for the book. It's a remarkable portrait of troops at war - the complexities, doubts, and fears - written with honesty. The 81-minute version of the film (which will be in theatres) includes 11 pieces of writing, with different visual strategies, along with interviews with the writers, and with more established American writers who are also veterans. In the latter group are Tim O'Brien, Yusef Komunyakaa, Tobias Wolff, Joe Haldeman, James Salter, Anthony Swofford, Richard Currey, and Paul Fussell. The visual approaches range from poet Brian Turner reading directly to camera, to archival footage, to an animated \"graphic novel,\" to a still photo sequence shot by photographer Antonin Kratochvil. It's rooted in a program by the NEA that created a series of writing workshops at military bases. After those workshops, the writers submitted pieces for consideration in the book, edited by Andy Carroll. From those writings were selected 11 for inclusion in the film. There is also a 53-minute version of this film which will be airing on PBS as part of the series \"America at a Crossroads\" in April, 2007. Both of these are different from the other film 'Operation Homecoming\" from 2007, directed by Lawrence Bridges. That piece was produced by the NEA as a documentary about their writing workshops.", "genres": ["Documentary"], "imdb": {"id": 970184, "rating": 7.2, "votes": 376}, "languages": ["English"], "lastupdated": "2015-08-26 00:10:11.713000000", "num_mflix_comments": 1, "plot": "A unique documentary about troops' experiences in Iraq and Afghanistan, based on writings by soldiers, Marines, and air men. Some writings were published in the New Yorker in summer 2006. A...", "poster": "https://m.media-amazon.com/images/M/MV5BMjE4NzY2NTY5MF5BMl5BanBnXkFtZTcwMjQ5Mjc1MQ@@._V1_SY1000_SX677_AL_.jpg", "released": 1170979200000, "runtime": 81, "title": "Operation Homecoming: Writing the Wartime Experience", "tomatoes": {"lastUpdated": 1432752410000, "viewer": {"numReviews": 5, "rating": 4.5}}, "type": "movie", "writers": ["Colby Buzzell (story)", "Edward Parker Gyokeres (story)", "Sangjoon Han (story)", "Ed Hrivnak (story)", "Jack Lewis (story)", "John McCary (story)", "Denis Prior (story)", "Michael Strobl (story)", "Brian Turner (poems)"], "year": 2007}