{"_id": "573a1399f29313caabcec3d3", "awards": {"nominations": 2, "text": "2 nominations.", "wins": 0}, "cast": ["Adrienne Barbeau", "Ramy Zada", "Bingo O'Malley", "Jeff Howell"], "countries": ["Italy", "USA"], "directors": ["Dario Argento", "George A. Romero"], "fullplot": "\"The Facts in the Case of Mr. Valdemar\": The gold-digger Jessica Valdemar and her lover Dr. Robert Hoffman plot a scheme to take the money of her old and terminal husband Ernest Valdemar. Robert has hypnotized Valdemar to give his money to Jessica. Out of the blue, Valdemar dies while hypnotized and is stranded between the world of the living and the dead. Robert finds the experience fascinating and Valdemar asks him to take him out of the trance since other spirits are stalking him. However Jessica shots the corpse of Valdemar twice expecting to finish his contact with the world of the living. But soon she learns that Valdemar had been already possessed by evil forces. \"The Black Cat\": In Pennsylvania, the tabloid photographer Roderick Usher that explores gruesome crime scenes where Detective Legrand is investigating. Rod has been living for four years with his girlfriend Annabel, who is a violinist. When she brings a stray black cat home, Rod immediately hates the animal. Soon Rod takes photos torturing the cat for his book and the cat vanishes. When Annabel sees the photos of the cat in a bookstore, she concludes that Rod killed her cat and she decides to leave him. Meanwhile Rod finds a stray cat in a bar identical to the one he killed and the owner Eleonora gives the animal to him. Annabel is leaving the house but she overhears the cat and returns to her room. Rod kills her and builds a wall to hide her body behind a bookshelf and prepares a solid alibi. But his fate is doomed by the black cat.", "genres": ["Horror", "Romance"], "imdb": {"id": 100827, "rating": 6.1, "votes": 3923}, "languages": ["English"], "lastupdated": "2015-08-23 00:55:37.530000000", "plot": "Two horror tales based on short stories by Edgar Allan Poe directed by two famous horror directors, George A. Romero and Dario Argento.", "poster": "https://m.media-amazon.com/images/M/MV5BYzIyY2I5ODgtN2Y0NS00YmVlLWJjMzItNzk1ZTVlMGZmY2VjXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 688348800000, "runtime": 120, "title": "Two Evil Eyes", "tomatoes": {"critic": {"meter": 50, "numReviews": 10, "rating": 5.2}, "dvd": 1055289600000, "fresh": 5, "lastUpdated": 1441995245000, "production": "Media Home Entertainment", "rotten": 5, "viewer": {"meter": 36, "numReviews": 4230, "rating": 3.1}}, "type": "movie", "writers": ["Dario Argento (segment)", "Franco Ferrini (segment)", "Edgar Allan Poe (stories)", "George A. Romero (segment)"], "year": 1990}