{"_id": "573a1395f29313caabce1b78", "awards": {"nominations": 5, "text": "Won 3 Oscars. Another 7 wins & 5 nominations.", "wins": 10}, "cast": ["Carroll Baker", "Lee J. Cobb", "Henry Fonda", "Carolyn Jones"], "countries": ["USA"], "directors": ["John Ford", "Henry Hathaway", "George Marshall", "Richard Thorpe"], "fullplot": "Sprawling epic which follows the Prescotts, an emigrant family through four generations, from the Erie Canal in the 1830's to their settled home in the West a half a century later. On the way they encounter river pirates, and escape with the help of fur trapper Linus Rawlings, who subsequently marries one of their daughters, Eve. The parents are drowned on a foundering raft, and the other daughter Lilith becomes a riverboat singer and catches the eye of a genteel adventurer Cleve Van Valen. They cross the plains together in a wagon train and make and lose a fortune in California; meanwhile Linus has turned farmer and, comes the Civil War, joins the Union Army and is killed at the Battle of Shiloh. One of his sons Zeb also joins the army and stays after the war as a cavalry officer and is sent to Colorado to help guard the pioneering railroad against the Indians, whose land they are crossing. By this time Lilith is the elderly lady of the family, having survived long enough to see the dream of settlement realized, but not, mercifully, the aerial shots of the Los Angeles freeway traffic with which the film ends.", "genres": ["Western"], "imdb": {"id": 56085, "rating": 7.1, "votes": 13259}, "languages": ["English", "Arapaho"], "lastupdated": "2015-08-21 00:04:49.673000000", "num_mflix_comments": 1, "plot": "A family saga covering several decades of Westward expansion in the nineteenth century--including the Gold Rush, the Civil War, and the building of the railroads.", "poster": "https://m.media-amazon.com/images/M/MV5BNTk2NDk1NjY0MV5BMl5BanBnXkFtZTgwMzkzNTcxMTE@._V1_SY1000_SX677_AL_.jpg", "rated": "APPROVED", "released": -216604800000, "runtime": 164, "title": "How the West Was Won", "tomatoes": {"critic": {"meter": 100, "numReviews": 15, "rating": 7.2}, "dvd": 1159574400000, "fresh": 15, "lastUpdated": 1442083856000, "production": "Warner Home Video", "rotten": 0, "viewer": {"meter": 74, "numReviews": 9556, "rating": 3.6}}, "type": "movie", "writers": ["James R. Webb"], "year": 1962}