{"_id": "573a13b0f29313caabd34d2a", "awards": {"nominations": 0, "text": "2 wins.", "wins": 2}, "cast": ["David Ingram", "Perry Mucci", "Mackenzie Lush", "Daniel Baldwin"], "countries": ["Canada"], "directors": ["Blake Van de Graaf"], "fullplot": "Mild-mannered computer consultant Norman Neale has two great loves in this cruel world: Comic books and his office's effervescent main receptionist, Andrea Hicks. Norman spends his days dreaming of Andrea from the isolation of his cubicle and his nights dreaming of fighting crime from the solitude of his apartment. Then one fateful day Norman discovers that a fellow co-worker, Victor Ventura, a swaggering, pretty-boy salesman, has slight telekinetic abilities beyond his understanding. After discussing his mind-blowing discovery with his only friend Chuck, a know-it-all comic book store owner, Norman comes to the outlandish conclusion that he should train Victor to become a real-life superhero by helping him refine and expand his extraordinary ability. Norman envisions an exciting new future for himself battling the city's criminal elements as Victor's faithful sidekick. But as Victor grows in power Norman is faced with the heartbreaking realization that not all people with extraordinary abilities are meant to be heroes.", "genres": ["Fantasy", "Sci-Fi"], "imdb": {"id": 410603, "rating": 5.6, "votes": 341}, "languages": ["English"], "lastupdated": "2015-05-21 00:56:30.500000000", "plot": "Mild-mannered computer consultant Norman Neale has two great loves in this cruel world: Comic books and his office's effervescent main receptionist, Andrea Hicks. Norman spends his days ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTg1NjQ3NjEwNV5BMl5BanBnXkFtZTcwMDUzMzgzMQ@@._V1_SY1000_SX677_AL_.jpg", "released": 1144195200000, "runtime": 87, "title": "Sidekick", "tomatoes": {"critic": {"meter": 100, "numReviews": 14, "rating": 7.2}, "dvd": 1213056000000, "fresh": 14, "lastUpdated": 1438974350000, "production": "Victory Man", "rotten": 0, "viewer": {"meter": 36, "numReviews": 304, "rating": 2.8}, "website": "http://www.sidekickmovie.com"}, "type": "movie", "writers": ["Michael Sparaga"], "year": 2005}