{"_id": "573a13adf29313caabd2becf", "awards": {"nominations": 6, "text": "6 wins & 6 nominations.", "wins": 6}, "cast": ["Nicolai Cleve Broch", "Aksel Hennie", "Anders Baasmo Christiansen", "Pia Tjelta"], "countries": ["Norway"], "directors": ["Morten Tyldum"], "fullplot": "Kristoffer is a billboard hanger, 24 years old and carefree. When his girlfriend Elisabeth dumps him for the boss of her trend bureau, his life falls into pieces. He feels like a loser. By coincidence some of Kristoffer's video diaries end up with the producer of the popular talk show \"Karsten Tonight\" in TV2. A few weeks later Kristoffer's life has become TV entertainment. People love the sequences from his commune at Tèyen: Kristoffer's half-twisted view of his surroundings, his crazy best friend Geir, not to mention the weird web designer Stig Inge, who hasn't set foot outside the Tèyen shopping center for two years. Kristoffer's future again looks bright, everyone likes him, but revealing your life on national television comes with a price tag. As Kristoffer's future in the TV business looks brighter and brighter, his friends start suffering. Geir's big secret is revealed, and Stig Inge's personal problems are much more serious than Kristoffer first thought. It will cost him a great deal to win his friends back. Kristoffer knows what he wants, but does he have enough guts to follow his heart?", "genres": ["Comedy", "Drama", "Romance"], "imdb": {"id": 371589, "rating": 6.9, "votes": 3647}, "languages": ["Norwegian"], "lastupdated": "2015-09-04 00:18:11.147000000", "plot": "Kristoffer is a billboard hanger, 24 years old and carefree. When his girlfriend Elisabeth dumps him for the boss of her trend bureau, his life falls into pieces. He feels like a loser. By ...", "poster": "https://m.media-amazon.com/images/M/MV5BMjAzMjIzMzkxOV5BMl5BanBnXkFtZTcwMDkzMjA0MQ@@._V1_SY1000_SX677_AL_.jpg", "released": 1062115200000, "runtime": 100, "title": "Buddy", "type": "movie", "writers": ["Lars Gudmestad", "Tom Gulbrandsen (script consultant)"], "year": 2003}