{"_id": "573a139af29313caabcf0f45", "awards": {"nominations": 1, "text": "2 wins & 1 nomination.", "wins": 2}, "cast": ["James Caan", "Jacob Tierney", "Colm Meaney", "Moira Deady"], "countries": ["Ireland", "Canada"], "directors": ["Paul Quinn"], "fullplot": "Widowed Kieran Johnson is a lonely, middle-aged, Chicago-based high school history teacher who feels disconnected to his life. He decides to take a trip to his mother's small old hometown of Kilronan, County Galway, Ireland after he discovers an old photograph of her, she who now cannot speak due to a stroke, with a man he has never seen. He suspects this man may be his biological father. On the urging of his sister, Kieran takes his teen-aged nephew Jack on the trip. In Kilronan, Mrs. Kearney, the innkeeper's mother and a bit of a gypsy woman who has lived in the area for the better part of her life, tells Kieran and Jack about life in the town in 1939 when a high-spirited Fiona Flynn, Kieran's mother, started seeing a peat farmer named Kieran O'Day. Kieran O'Day grew up a \"poorhouse bastard\", and as such he was always shy and considered an outsider amongst the townsfolk. Because of his standing in the community and the differences in their ages (she being only seventeen, he in his thirties), Fiona and Kieran's relationship was looked down upon by those considered the upstanding in town, including Fiona's widowed mother, Mary Flynn, and those associated with the church. Mrs. Kearney slowly tells the entire story of Kieran and Fiona's relationship, the tragedy that prevented their love for not being enough to endure the scrutiny, the stories of the \"curses\" that befell the Flynn family, and the truth behind the person Kieran Johnson knew as his father.", "genres": ["Romance", "Drama"], "imdb": {"id": 120865, "rating": 7.1, "votes": 1492}, "languages": ["English"], "lastupdated": "2015-08-01 00:07:50.687000000", "num_mflix_comments": 2, "plot": "Widowed Kieran Johnson is a lonely, middle-aged, Chicago-based high school history teacher who feels disconnected to his life. He decides to take a trip to his mother's small old hometown ...", "poster": "https://m.media-amazon.com/images/M/MV5BNzEyNjQ3MDY0NV5BMl5BanBnXkFtZTcwODgxMDIyMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 926035200000, "runtime": 119, "title": "This Is My Father", "tomatoes": {"critic": {"meter": 75, "numReviews": 28, "rating": 6.7}, "dvd": 939081600000, "fresh": 21, "lastUpdated": 1441135709000, "production": "Sony Pictures Classics", "rotten": 7, "viewer": {"meter": 82, "numReviews": 1375, "rating": 3.8}}, "type": "movie", "writers": ["Paul Quinn"], "year": 1998}