{"_id": "573a1397f29313caabce8225", "awards": {"nominations": 2, "text": "Nominated for 1 Golden Globe. Another 1 nomination.", "wins": 0}, "cast": ["George Hamilton", "Lauren Hutton", "Brenda Vaccaro", "Ron Leibman"], "countries": ["USA"], "directors": ["Peter Medak"], "fullplot": "Mexico, 1840s. When the new Spanish Governor begins to grind the peasants under his heel, wealthy landowner Don Diego Vega follows in his late father's footsteps and becomes Zorro, the masked man in black with a sword who rights wrongs and becomes a folk hero to the people of Mexico. When Vega sprains his ankle and cannot figure out how to continue his campaign against the corrupt Captain Esteban, luck stays with Vega when his long-lost twin brother Ramon, who was sent off by their father to the British Royal Navy to make a \"man\" of him, whom is also flamboyantly gay, and now known as Lt. Bunny Wigglesworth, appears for a visit. 'Bunny' agrees to temporarily take his brother's place as Zorro, but wishes to make some changes. Bunny becomes 'the Gay Blade' in which his new suits are lemon, plum, and scarlet colored, and Bunny insists on using a whip. Bunny also becomes the liaison between Don Vega and the liberal American activist/feminist Charlotte a long-time critic of Captain Esteban's policies, and who has a crush on her masked hero.", "genres": ["Action", "Adventure", "Comedy"], "imdb": {"id": 83366, "rating": 6, "votes": 3118}, "languages": ["English"], "lastupdated": "2015-08-13 01:04:41.707000000", "plot": "Mexico, 1840s. When the new Spanish Governor begins to grind the peasants under his heel, wealthy landowner Don Diego Vega follows in his late father's footsteps and becomes Zorro, the ...", "poster": "https://m.media-amazon.com/images/M/MV5BN2IxYmI3OGUtNmM5NS00YTAzLWJhM2MtNTkxM2Y0MjA4OWVlXkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 364176000000, "runtime": 93, "title": "Zorro: The Gay Blade", "tomatoes": {"critic": {"meter": 43, "numReviews": 14, "rating": 4.8}, "dvd": 994723200000, "fresh": 6, "lastUpdated": 1441993508000, "production": "Anchor Bay Entertainment", "rotten": 8, "viewer": {"meter": 71, "numReviews": 8089, "rating": 3.2}}, "type": "movie", "writers": ["Hal Dresner (screen story)", "Greg Alt (screen story)", "Don Moriarty (screen story)", "Bob Randall (screen story)", "Johnston McCulley (based upon a character created by)", "Hal Dresner (screenplay)"], "year": 1981}