{"_id": "573a13c2f29313caabd687c9", "awards": {"nominations": 27, "text": "Won 1 Golden Globe. Another 30 wins & 27 nominations.", "wins": 31}, "cast": ["Claire Danes", "Julia Ormond", "David Strathairn", "Catherine O'Hara"], "countries": ["USA"], "directors": ["Mick Jackson"], "fullplot": "Biopic of Temple Grandin, an autistic woman who overcame the limitations imposed on her by her condition to become a Ph.D. and expert in the field of animal husbandry. She developed an interest in cattle early in life while spending time at her Aunt and Uncle's ranch. She did not speak until age four and had difficulty right through high school, mostly in dealing with people. Her mother was very supportive as were some of her teachers. She is noted for creating her 'hug box', widely recognized today as a way of relieving stress in autistic children, and her humane design for the treatment of cattle in processing plants, which have been the subject of several books and won an award from PETA. Today, she is a professor at Colorado State University and well-known speaker on autism and animal handling.", "genres": ["Biography", "Drama"], "imdb": {"id": 1278469, "rating": 8.4, "votes": 17765}, "languages": ["English"], "lastupdated": "2015-08-20 01:08:38.173000000", "num_mflix_comments": 1, "plot": "A biopic of Temple Grandin, an autistic woman who has become one of the top scientists in the humane livestock handling industry.", "poster": "https://m.media-amazon.com/images/M/MV5BMjQwOTQ4NDk5OF5BMl5BanBnXkFtZTcwNzM0Mjk3Mw@@._V1_SY1000_SX677_AL_.jpg", "rated": "TV-PG", "released": 1265414400000, "runtime": 107, "title": "Temple Grandin", "tomatoes": {"critic": {"meter": 100, "numReviews": 6, "rating": 8.5}, "dvd": 1282003200000, "fresh": 6, "lastUpdated": 1439839534000, "rotten": 0, "viewer": {"meter": 95, "numReviews": 4707, "rating": 4.4}}, "type": "movie", "writers": ["Temple Grandin (based on the book: \"Emergence\")", "Margaret Scariano (based on the book: \"Emergence\")", "Temple Grandin (based on the book: \"Thinking in Pictures\")", "Christopher Monger (screenplay)", "Merritt Johnson (screenplay)"], "year": 2010}