{"_id": "573a13abf29313caabd25ed4", "awards": {"nominations": 3, "text": "28 wins & 3 nominations.", "wins": 28}, "cast": ["Muzaffer èzdemir", "Emin Toprak", "Zuhal Gencer", "Nazan Kesal"], "countries": ["Turkey"], "directors": ["Nuri Bilge Ceylan"], "fullplot": "Mahmut, a 40 year old independent photographer, is a \"village boy made good\" at least professionally in the big city - Istanbul in this case. After his wife leaves him, he falls into an existential crisis. Then comes his cousin Yusuf, who left his native village after a local factory closed down, effectively unemploying over half the local men. He looks to Istanbul for salvation: a job on board a ship sailing abroad, at once exciting and crucial to supporting his family in the desperately poor village. The distance between the two men is apparent at once, and becomes increasingly pronounced. Whereas Mahmut is adusted to big city life and suffers from many of its neuroses, Yusuf is a lonely, excentric country worker with annoying nervous and hygienic habits, and a sick mother back home he must somehow support. This intimate drama was filmed in the director's apartment in Istanbul, using all his furniture, appliances, rooms, car and so on as the film's props. The actor playing Yusuf is actually the director's real-life cousin, and the actor playing Mahmut is an actual friend, a non-professional actor.", "genres": ["Drama"], "imdb": {"id": 346094, "rating": 7.7, "votes": 11758}, "languages": ["Turkish"], "lastupdated": "2015-08-16 01:16:08.357000000", "metacritic": 84, "plot": "After his wife leaves him, a photographer has an existential crisis and tries to cope with his cousin's visit.", "poster": "https://m.media-amazon.com/images/M/MV5BMTMxOTM2Nzg1MF5BMl5BanBnXkFtZTcwNDMyODcyMQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 1040342400000, "runtime": 110, "title": "Distant", "tomatoes": {"consensus": "Hauntingly beautiful, Distant communicates volumes with its almost pervasive silence.", "critic": {"meter": 88, "numReviews": 43, "rating": 7.8}, "dvd": 1111449600000, "fresh": 38, "lastUpdated": 1439145982000, "production": "New Yorker", "rotten": 5, "viewer": {"meter": 82, "numReviews": 5352, "rating": 3.9}}, "type": "movie", "writers": ["Nuri Bilge Ceylan (scenario)", "Cemil Kavukèu (additional writing)"], "year": 2002}