{"_id": "573a13bbf29313caabd53a7f", "awards": {"nominations": 0, "text": "2 wins.", "wins": 2}, "cast": ["Jay Baruchel", "Sergio Di Zio", "Nigel Bennett", "Thomas Gibson"], "countries": ["Canada"], "directors": ["Chaz Thorne"], "fullplot": "Oliver is destined for an uneventful life until the day he and his brother Jackie breeze into town to attend the funeral of their estranged father. To everyone's bewilderment, Oliver inherits his father's estate-a funeral home. Oliver learns from the handyman Henry that the home is on the verge of bankruptcy. That night, his life gets increasingly complicated when he takes a drunken drive with the bewitching mortician Roberta and collides with a hiker. Roberta cleverly disguises the fatality as an accident, providing Oliver with his first paying customer and launching the duo on a merciless killing spree that evolves from accidental to intentional. As they scramble to stay out of jail and keep the funeral home in business, the body count rises steeply and their victims expire in increasingly bizarre and brutal \"accidents\". Trying to remain one step ahead of the local law (Roberta's father, Chief of Police Knickle, and her boyfriend, Constable Richmond), Oliver is torn between the affections of Roberta and his young, alluring stepmother, Luanne. With his business and love life blossoming, Oliver gains confidence-until he finds he has dug a grave for himself too deep to escape.", "genres": ["Comedy", "Drama"], "imdb": {"id": 906326, "rating": 6.1, "votes": 1644}, "languages": ["English"], "lastupdated": "2015-08-22 01:05:41.797000000", "plot": "A young man inherits a nearly bankrupt funeral home from his estranged father. He falls in love with the alluring young mortician, only to find out she's offing people to keep the place in business!", "poster": "https://m.media-amazon.com/images/M/MV5BMTUxNTUwMzY0NF5BMl5BanBnXkFtZTcwMDgzNTI1MQ@@._V1_SY1000_SX677_AL_.jpg", "released": 1216944000000, "runtime": 94, "title": "Just Buried", "tomatoes": {"critic": {"meter": 33, "numReviews": 9, "rating": 4.7}, "dvd": 1233014400000, "fresh": 3, "lastUpdated": 1442509751000, "production": "Liberation Entertainment", "rotten": 6, "viewer": {"meter": 36, "numReviews": 1085, "rating": 2.9}, "website": "http://www.justburiedthemovie.com"}, "type": "movie", "writers": ["Chaz Thorne (screenplay)"], "year": 2007}