{"_id": "573a13d7f29313caabda207a", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Ed Stoppard", "Henry Goodman", "Paul McGann", "Asa Briggs"], "countries": ["UK"], "directors": ["Clare Beavan", "Nic Stacey"], "fullplot": "The highs and lows of Alan Turing's life, tracking his extraordinary accomplishments, his government persecution through to his tragic death in 1954. In the last 18 months of his short life, Turing visited a psychiatrist, Dr. Franz Greenbaum, who tried to help him. Each therapy session in this drama documentary is based on real events. The conversations between Turing and Greenbaum explore the pivotal moments in his controversial life and examine the pressures that may have contributed to his early death. The film also includes the testimony of people who actually knew and remember Turing. Plus, this film features interviews with contemporary experts from the world of technology and high science including Apple co-founder Steve Wozniak. These contributors bring Turing's exciting impact up to the present day, explaining why, in many ways, modern technology has only just begun to explore the potential of Turing's ideas.", "genres": ["Drama"], "imdb": {"id": 2119396, "rating": 7, "votes": 692}, "languages": ["English"], "lastupdated": "2015-09-02 00:48:30.537000000", "num_mflix_comments": 1, "plot": "The highs and lows of Alan Turing's life, tracking his extraordinary accomplishments, his government persecution through to his tragic death in 1954. In the last 18 months of his short life...", "poster": "https://m.media-amazon.com/images/M/MV5BMTM4NzkzOTQxMF5BMl5BanBnXkFtZTcwNTQ1MjY1OA@@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 1321833600000, "runtime": 62, "title": "Codebreaker", "tomatoes": {"dvd": 1394409600000, "lastUpdated": 1440354632000, "production": "TODpix", "viewer": {"meter": 79, "numReviews": 252, "rating": 3.8}, "website": "http://www.todpix.com/codebreaker"}, "type": "movie", "writers": ["Craig Warner (dramatic reconstructions written by)"], "year": 2011}