{"_id": "573a13acf29313caabd26d29", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Ila Arun", "Pankaj Berry", "Nicolas Chagrin", "Nalini Chatterjee"], "countries": ["India"], "directors": ["Shyam Benegal"], "fullplot": "Born in a prominent Bengali family, Subhas had dedicated much of his younger years by being actively involved in ridding the British from India. For this purpose he joined hands with stalwarts such as Jawaharlal Nehru and Mohandas Gandhi, but expressed his frustration, especially with Gandhi's slow and painstaking way of trying to win over the enemy with love. It is for this reason, he decided to separate from the Congress Party. The British became weary of him, placed him under arrest, but when he started a hunger strike unto death, they let him go, but kept him under surveillance. Subhas eluded the police, under the guise of Pathan Mohammad Ziauddin, crossed the Indian border in Afghanistan so that he could enter Russia and form an Indian Army to oust the British. His efforts failed, he ended up as Italian Orlando Mashtar, with an office in Germany. He did manage to convince the Nazis, despite of Hitler's views in \"Main Kempf\" that he preferred India to remain colonized under the British. Nevertheless he was permitted recruit Indian-born British soldiers prisoners of war, and this is how the movement began. He secretly married his German Secretary, Emily Sanken, and did earn the ire of the Germans, who wanted to keep their race pure (Caucasian). His efforts to take his army to India through Russia and Afghanistan were in vain as Adolf Hitler declared war on Russia. Leaving his German-based army, Subhas journeyed to Singapore via a submarine, from there he entered into an agreement with the Japanese. And it was with the help of the Japanese that he marched an army of approximately 8000 troops, both men and women, against the might of the British. It was here that he was informed that he had become the father of Anita. Then, fate again played a cruel hand, when America entered the war, atom-bombed Hiroshima and Nagasaki, forcing Japan to surrender unconditionally. At this point, Subhas had two alternatives: to carry on fighting against the British and their new allies, Australia and America, or just disband his army.", "genres": ["Biography", "Drama", "History"], "imdb": {"id": 349878, "rating": 7.3, "votes": 524}, "languages": ["Hindi"], "lastupdated": "2015-08-07 00:17:34.163000000", "plot": "The film, which is about the last five years of the Indian leader Subhas Chandra Bose's life, also includes his life's story in flashback sequences. However, it does not cover the controversy surrounding Bose's death.", "released": 1115942400000, "runtime": 208, "title": "Netaji Subhas Chandra Bose: The Forgotten Hero", "tomatoes": {"lastUpdated": 1438889732000, "viewer": {"meter": 94, "numReviews": 174, "rating": 3.8}}, "type": "movie", "writers": ["Atul Tiwari", "Shama Zaidi"], "year": 2005}