{"_id": "573a1391f29313caabcd7f19", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Zasu Pitts", "Gibson Gowland", "Jean Hersholt", "Dale Fuller"], "countries": ["USA"], "directors": ["Erich von Stroheim"], "fullplot": "John McTeague was a simple slow man who became a dentist after working at the Big Dipper Gold Mine. He is now being hunted in Death Valley by his ex-best friend Marcus and the law. His lot was cast the day that he meet his future wife Trina in his office. She was with Marcus and she bought a lottery ticket. Well Mac fell for her and Marcus stepped aside. When Mac and Trina married, she won the Lottery for $5000 and became obsessive about the money in gold. Marcus is steamed as he stepped aside and now she is rich so he has the law shut down Mac as he has no official schooling for his dentistry. Trina fearful that they will take her gold away sells everything and takes all Mac earns when he is working. She adds to her stash of gold as they both live as paupers. When Mac has no job and no money, he leaves and Trina moves. Driven to desperation at being poor and hungry he finds Trina and demands the gold.", "genres": ["Drama", "Thriller"], "imdb": {"id": 15881, "rating": 7.9, "votes": 6649}, "languages": ["English"], "lastupdated": "2015-09-05 00:00:55.113000000", "plot": "The sudden fortune won from a lottery fans such destructive greed that it ruins the lives of the three people involved.", "poster": "https://m.media-amazon.com/images/M/MV5BYWU0OWJmZmEtODZlMi00MmJjLWEwYWItNDg3OGNkM2Q0MTgzXkEyXkFqcGdeQXVyODU2MDg1NzU@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": -1417910400000, "runtime": 140, "title": "Greed", "tomatoes": {"critic": {"meter": 100, "numReviews": 17, "rating": 9.3}, "fresh": 17, "lastUpdated": 1442262110000, "production": "Warner Home Video", "rotten": 0, "viewer": {"meter": 90, "numReviews": 2435, "rating": 4.3}}, "type": "movie", "writers": ["June Mathis (screen adaptation and scenario)", "Erich von Stroheim (screen adaptation and scenario)", "Frank Norris (from the American classic \"McTeague\" by)"], "year": 1924}