{"_id": "573a13d2f29313caabd90999", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Chaske Spencer", "David Morse", "Gary Farmer", "Julia Jones"], "countries": ["USA"], "directors": ["Alex Smith", "Andrew J. Smith"], "fullplot": "Virgil First Raise wakes with a shiner and a hangover in a roadside ditch on the stark but beautiful plains of Montana. As he rises to face the day he sees a vision of his father lying dead at his feet. Impossible-- his father froze to death in a snowdrift years earlier. Virgil returns home to find that his wife, Agnes, has left him. Worse, she's taken his electric razor and his beloved rifle. Virgil sets out to find her-- beginning a hi-line odyssey of inebriated encounters, sexual skirmishes, and improbable cloak-and-dagger intrigues with the mysterious 'Airplane Man'. Virgil's quest also brings him face-to-face with childhood memories and visions of his beloved, lost brother Mose-- some glorious, some tragic. Only when Virgil seeks the counsel of an old, blind man named Yellow Calf, does he grasp the truth of his origins and begin to thaw the ice in his veins.", "imdb": {"id": 1829057, "rating": 6.2, "votes": 117}, "languages": ["English"], "lastupdated": "2015-07-30 00:26:13.037000000", "metacritic": 52, "num_mflix_comments": 4, "plot": "Virgil First Raise wakes with a shiner and a hangover in a roadside ditch on the stark but beautiful plains of Montana. As he rises to face the day he sees a vision of his father lying dead...", "poster": "https://m.media-amazon.com/images/M/MV5BMTUwODQyNjY3Nl5BMl5BanBnXkFtZTgwODA2MDY4MjE@._V1_SY1000_SX677_AL_.jpg", "released": 1408492800000, "runtime": 105, "title": "Winter in the Blood", "tomatoes": {"critic": {"meter": 64, "numReviews": 11, "rating": 6.1}, "fresh": 7, "lastUpdated": 1435947540000, "production": "Kino Lorber", "rotten": 4, "viewer": {"meter": 81, "numReviews": 93, "rating": 3.8}, "website": "http://winterinthebloodfilm.com/"}, "type": "movie", "writers": ["Alex Smith", "Andrew J. Smith", "Ken White"], "year": 2013}