{"_id": "573a1397f29313caabce865f", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Armin Jordan", "Wolfgang Schène", "Martin Sperr", "Hans Tschammer"], "countries": ["France", "West Germany"], "directors": ["Hans-Jèrgen Syberberg"], "fullplot": "Richard Wagner's last opera has remained controversial since its first performance for its unique, and, for some, unsavory blending of religious and erotic themes and imagery. Based on one of the medieval epic romances of King Arthur and the search for the holy grail (the chalice touched by the lips of Christ at the last supper), it recounts over three long acts how a \"wild child\" unwittingly invades the sacred precincts of the grail, fulfilling a prophecy that only such a one can save the grail's protectors from a curse fallen upon them. Interpreters of the work have found everything from mystical revelation to proto-fascist propaganda in it. Hans-Jurgen Syberberg's production doesn't avoid either aspect, but tries synthesize them by seeking their roots in the divided soul of Wagner himself. The action unfolds on a craggy landscape which turns out to be a gigantic enlargement of the composer's death mask, among deliberately tatty theatrical devices: puppets, scale models, magic-lantern projections. The eponymous hero is sung by the specified tenor voice (Reiner Goldberg) but mimed on screen by a male and a female performer alternately, reflecting what the director takes to be the creator's own sexual conflicts. Syberberg's pacing, dictated by the majestic pace of Wagner's score, is slow, but enlivened by constant subtle shifts in point of view, and memorable performances by actress Edith Clever as the villainess/heroine Kundry (sung by Yvonne Minton), orchestra conductor Armin Jordan as the remorseful knight Amfortas (sung by Wolfgang Schoene), and Robert Lloyd (the faithful retainer Gurnemanz).", "genres": ["Drama", "Music"], "imdb": {"id": 84476, "rating": 7.6, "votes": 194}, "languages": ["German"], "lastupdated": "2015-09-02 00:16:21.287000000", "plot": "Richard Wagner's last opera has remained controversial since its first performance for its unique, and, for some, unsavory blending of religious and erotic themes and imagery. Based on one ...", "poster": "https://m.media-amazon.com/images/M/MV5BMjAwNjEwNzU0OF5BMl5BanBnXkFtZTYwNzgzOTg4._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 389059200000, "runtime": 255, "title": "Parsifal", "tomatoes": {"dvd": 1110844800000, "lastUpdated": 1432751485000, "viewer": {"meter": 94, "numReviews": 327, "rating": 3.7}}, "type": "movie", "writers": ["Richard Wagner (libretto)"], "year": 1982}