{"_id": "573a13c0f29313caabd62219", "awards": {"nominations": 78, "text": "Nominated for 3 Oscars. Another 41 wins & 78 nominations.", "wins": 44}, "cast": ["Carey Mulligan", "Olivia Williams", "Alfred Molina", "Cara Seymour"], "countries": ["UK", "USA"], "directors": ["Lone Scherfig"], "fullplot": "In the early 1960's, sixteen year old Jenny Mellor lives with her parents in the London suburb of Twickenham. On her father's wishes, everything that Jenny does is in the sole pursuit of being accepted into Oxford, as he wants her to have a better life than he. Jenny is bright, pretty, hard working but also naturally gifted. The only problems her father may perceive in her life is her issue with learning Latin, and her dating a boy named Graham, who is nice but socially awkward. Jenny's life changes after she meets David Goldman, a man over twice her age. David goes out of his way to show Jenny and her family that his interest in her is not improper and that he wants solely to expose her to cultural activities which she enjoys. Jenny quickly gets accustomed to the life to which David and his constant companions, Danny and Helen, have shown her, and Jenny and David's relationship does move into becoming a romantic one. However, Jenny slowly learns more about David, and by association Danny and Helen, and specifically how they make their money. Jenny has to decide if what she learns about them and leading such a life is worth forgoing her plans of higher eduction at Oxford.", "genres": ["Drama"], "imdb": {"id": 1174732, "rating": 7.3, "votes": 106224}, "languages": ["English", "French"], "lastupdated": "2015-09-15 03:03:26.373000000", "metacritic": 85, "num_mflix_comments": 1, "plot": "A coming-of-age story about a teenage girl in 1960s suburban London, and how her life changes with the arrival of a playboy nearly twice her age.", "poster": "https://m.media-amazon.com/images/M/MV5BMTg4NjgzOTc0MF5BMl5BanBnXkFtZTcwOTc2OTE3Mg@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1265328000000, "runtime": 100, "title": "An Education", "tomatoes": {"boxOffice": "$12.5M", "consensus": "Though the latter part of the film may not appeal to all, An Education is a charming coming-of-age tale powered by the strength of relative newcomer Carey Mulligan's standout performance.", "critic": {"meter": 94, "numReviews": 179, "rating": 7.9}, "dvd": 1269907200000, "fresh": 169, "lastUpdated": 1439835287000, "production": "Sony Classics", "rotten": 10, "viewer": {"meter": 80, "numReviews": 53948, "rating": 3.8}, "website": "http://www.sonyclassics.com/aneducation/"}, "type": "movie", "writers": ["Lynn Barber (memoir)", "Nick Hornby (screenplay)"], "year": 2009}