{"_id": "573a13a0f29313caabd04b3a", "awards": {"nominations": 7, "text": "2 wins & 7 nominations.", "wins": 2}, "cast": ["Kirsten Dunst", "Eliza Dushku", "Jesse Bradford", "Gabrielle Union"], "countries": ["USA"], "directors": ["Peyton Reed"], "fullplot": "The Toro cheerleading squad from Rancho Carne High School in San Diego has got spirit, spunk, sass and a killer routine that's sure to land them the national championship trophy for the sixth year in a row. But for newly-elected team captain Torrance, the Toros' road to total cheer glory takes a shady turn when she discovers that their perfectly-choreographed routines were in fact stolen from the Clovers, a hip-hop squad from East Compton, by the Toro's former captain. While the Toros scramble to come up with a new routine, the Clovers, led by squad captain Isis have their own problems - coming up with enough money to cover their travel expenses to the championships. With time running out and the pressure mounting, both captains drive their squads to the point of exhaustion: Torrance, hell bent on saving the Toros' reputation, and Isis more determined than ever to see that the Clovers finally get the recognition that they deserve. But only one team can bring home the title, so may the best moves win.", "genres": ["Comedy", "Sport"], "imdb": {"id": 204946, "rating": 5.9, "votes": 65163}, "languages": ["English"], "lastupdated": "2015-08-28 00:04:30.597000000", "metacritic": 52, "num_mflix_comments": 375, "plot": "A champion high school cheerleading squad discovers its previous captain stole all their best routines from an inner-city school and must scramble to compete at this year's championships.", "poster": "https://m.media-amazon.com/images/M/MV5BNjhiMjk1YWYtMjgyYy00YTFhLTk0NTMtN2Q5MDZjMWEyYWI1XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 967161600000, "runtime": 98, "title": "Bring It On", "tomatoes": {"boxOffice": "$67.9M", "consensus": "Despite the formulaic, fluffy storyline, this movie is surprisingly fun to watch, mostly due to its high energy and how it humorously spoofs cheerleading instead of taking itself too seriously.", "critic": {"meter": 63, "numReviews": 117, "rating": 5.9}, "dvd": 982022400000, "fresh": 74, "lastUpdated": 1442341871000, "production": "Universal Pictures", "rotten": 43, "viewer": {"meter": 66, "numReviews": 766905, "rating": 3.1}, "website": "http://www.bringitonmovie.com"}, "type": "movie", "writers": ["Jessica Bendinger"], "year": 2000}