{"_id": "573a13bdf29313caabd59b5b", "awards": {"nominations": 3, "text": "2 wins & 3 nominations.", "wins": 2}, "cast": ["Briana Evigan", "Robert Hoffman", "Adam G. Sevani", "Cassie Ventura"], "countries": ["USA"], "directors": ["Jon M. Chu"], "fullplot": "Following the death of her parents, teen-aged Andie West is living with her mother's best friend, Sarah. Andie, who doesn't care about school, is trying to figure out where she fits in in life. The only thing she loves is dancing with her street crew, the 410, led by Tuck. The 410 are the most notorious of the street crews in Baltimore and are wanted by the police for their acts of vandalism and public mischief. Sarah threatens to send Andie to live with relatives in Texas unless she cleans up her act, which includes ending her association with the 410 and trying harder at school. Andie's neighborhood friend, Tyler Gage, convinces Andie to audition for entry into the Maryland School of the Arts (MSA), an institution which ended up turning his life around for the better. Andie passes the audition but isn't sure she fits in there. The school's director, Blake Collins, isn't sure she fits in there either. Blake is a brilliant dancer but looks for conformity to his way. After learning that Andie's absences from rehearsals are due to her new association with MSA, Tuck kicks her out of the 410. Chase Collins, a dance student at MSA, convinces Andie to start her own street dance crew using all the dance misfits from MSA i.e. those that don't conform to Blake's way of thinking. Chase feels like he's one of those misfits being Blake's brother and living in his shadow. This new association brings up a few conflicts within Andie, as her new dance crew tries to gain respect on the streets, especially among her old and judgmental friends, and as she and the crew try to hide the fact of what they're doing from Blake, who ultimately threatens expulsion from the school of anyone participating in the illegal street competitions.", "genres": ["Drama", "Music", "Musical"], "imdb": {"id": 1023481, "rating": 6.2, "votes": 62623}, "languages": ["English", "Russian"], "lastupdated": "2015-09-05 00:30:11.520000000", "metacritic": 50, "num_mflix_comments": 3, "plot": "Romantic sparks occur between two dance students from different backgrounds at the Maryland School of the Arts.", "poster": "https://m.media-amazon.com/images/M/MV5BMTc0NzYxOTgxOF5BMl5BanBnXkFtZTcwMTgxMjc1MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1202947200000, "runtime": 98, "title": "Step Up 2: The Streets", "tomatoes": {"boxOffice": "$58.0M", "consensus": "There's a kinetic appeal to the handsome cast and their smooth moves, but everything else about Step Up 2 the Streets is been there, danced that.", "critic": {"meter": 27, "numReviews": 62, "rating": 4.9}, "dvd": 1216080000000, "fresh": 17, "lastUpdated": 1442266795000, "production": "Touchstone Pictures", "rotten": 45, "viewer": {"meter": 76, "numReviews": 190637, "rating": 3.9}, "website": "http://www.myspace.com/stepupmovie"}, "type": "movie", "writers": ["Toni Ann Johnson", "Karen Barna", "Duane Adler (characters)"], "year": 2008}