{"_id": "573a1399f29313caabcedcf2", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Richard Dreyfuss", "Mercedes Ruehl", "Irene Worth", "Brad Stoll"], "countries": ["USA"], "directors": ["Martha Coolidge"], "fullplot": "In 1942 in the Bronx, Evelyn Kurnitz has just passed away following a lengthy illness. Her husband, Eddie Kurnitz, needs to take a job as a traveling salesman to pay off the medical bills incurred, and decides to ask his stern and straight talking mother, from who he is slightly estranged, if his two early-teen sons, Jay and Arty (who their Grandma call by their full given names, Yakob and Arthur), can live with her and their Aunt Bella Kurnitz in Yonkers. She reluctantly agrees after a threat by Bella. Despite their Grandma owning and operating a candy store, Jay and Arty don't like their new living situation as they're afraid of their Grandma, and find it difficult to relate to their crazy Aunt Bella, whose slow mental state is manifested by perpetual excitability and a short attention span, which outwardly comes across as a childlike demeanor. Into their collective lives returns one of Eddie and Bella's other siblings, Louie Kurnitz, a henchman for some gangsters. He is hiding out from Hollywood Harry, who wants what Louie stole and is hiding in his small black bag. Jay and Arty's mission becomes how to make money fast so that they can help their father and move back in together, that money which may entail stealing the $15,000 their Grandma has hidden somewhere. Bella's mission is to find a way to tell the family that she wants to get married to Johnny, her equally slow movie theater usher boyfriend, the two who could also use $5,000 of her mother's money to open their dream restaurant. And Louie's mission is to survive the next couple of days.", "genres": ["Comedy", "Drama"], "imdb": {"id": 107443, "rating": 6.7, "votes": 2005}, "languages": ["English"], "lastupdated": "2015-08-15 00:43:02.817000000", "plot": "In the summer of 1942 two young boys are sent to stay with their stern grandmother Kurnitz and their childlike aunt Bella in Yonkers, New York.", "poster": "https://m.media-amazon.com/images/M/MV5BMjgwMzU3YzMtYmYxNy00MGE0LTg5NjctZjczMmI3YWE4YzU5XkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 737337600000, "runtime": 114, "title": "Lost in Yonkers", "tomatoes": {"critic": {"meter": 71, "numReviews": 17, "rating": 5.9}, "dvd": 1023753600000, "fresh": 12, "lastUpdated": 1439577759000, "production": "Sony Pictures Home Entertainment", "rotten": 5, "viewer": {"meter": 79, "numReviews": 2484, "rating": 3.4}}, "type": "movie", "writers": ["Neil Simon (play)", "Neil Simon (screenplay)"], "year": 1993}