{"_id": "573a1396f29313caabce5811", "awards": {"nominations": 3, "text": "Nominated for 1 BAFTA Film Award. Another 2 nominations.", "wins": 0}, "cast": ["Walter Matthau", "Robert Shaw", "Martin Balsam", "Hector Elizondo"], "countries": ["USA"], "directors": ["Joseph Sargent"], "fullplot": "Four seemingly-unrelated men board subway train Pelham 1:23 at successive stations. Mr. Blue, Mr. Green, Mr. Grey and Mr. Brown are heavily armed and overpower the motorman and novice conductor to take control of the train. Between stations they separate the front car from the remainder of the train, setting passengers in the back cars and the motorman free. The four demand $1 million ransom within exactly one hour for the remaining eighteen hostages, including the conductor. If their demands are not met in time or their directions are not followed precisely, they will begin to shoot hostages dead, one every minute the money is late. Wisecracking Lt. Zach Garber of the transit police ends up being the primary communicator between the hijackers and the authorities, which includes transit operations, his own police force, the NYPD, and the unpopular and currently flu ridden mayor who will make the ultimate decision of whether to pay the ransom. Unknown to Garber, what may be working on their side is the disparate nature of the four hijackers, including methodical and unbending Blue, trigger happy Grey, and also under the weather Green, who may pass out before the caper has concluded. What Garber does know is that there is a plain clothes NYPD officer among the eighteen hostages. What Garber has to try and figure out is how the four hijackers can possibly get away, as they are in a tunnel and have to remain with the train since it has a dead-man mechanism which requires a motorman at the controls at all times.", "genres": ["Action", "Crime", "Thriller"], "imdb": {"id": 72251, "rating": 7.7, "votes": 18556}, "languages": ["English", "Spanish"], "lastupdated": "2015-08-29 00:55:06.670000000", "metacritic": 68, "num_mflix_comments": 1, "plot": "In New York, armed men hijack a subway car and demand a ransom for the passengers. Even if it's paid, how could they get away?", "poster": "https://m.media-amazon.com/images/M/MV5BMjE1NDY0NDk3Ml5BMl5BanBnXkFtZTcwMTAzMTM3NA@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 153619200000, "runtime": 104, "title": "The Taking of Pelham One Two Three", "tomatoes": {"critic": {"meter": 100, "numReviews": 32, "rating": 8.2}, "dvd": 989884800000, "fresh": 32, "lastUpdated": 1441991351000, "production": "United Artists", "rotten": 0, "viewer": {"meter": 88, "numReviews": 9146, "rating": 3.9}}, "type": "movie", "writers": ["John Godey (novel)", "Peter Stone (screenplay)"], "year": 1974}