{"_id": "573a13bdf29313caabd59acd", "awards": {"nominations": 3, "text": "5 wins & 3 nominations.", "wins": 5}, "cast": ["Travis Aaron Wade", "Tina Huang", "Howard Johnson Jr.", "Trevor Bullock"], "countries": ["USA"], "directors": ["James Isaac"], "fullplot": "When John takes his San Francisco friends to his deceased uncle's remote ranch to hunt wild pigs, it seems like a typical guys weekend with guns - despite the presence of John's sexy girlfriend Brooks. But as John and his crew trek deeper into the forest, they begin tracking the awful truth about his uncle's demise and the legend of The Ripper -- a murderous three-thousand-pound black boar! Their pursuit leads them through fields of marijuana and into the muddy landscape of Big Wallow, involving high-powered weaponry, the violent and unpredictable Tibbs Brothers, massacred emus, a machete-toting Hippie Stranger, vengeful rednecks, and throat-slitting Cult Girls who grow dope by day and worship a Giant Killer Pig by night. By the time the pig hunt is done, no one is innocent - or unscathed. Not for the faint of heart, PIG HUNT is a darkly comic horror film that combines the best of DELIVERANCE, JAWS, and DINER, but remains uniquely Nor-Cal in its tone and scope. It is cinematic punkabilly - fresh, shocking, unforgettable!", "genres": ["Action", "Horror", "Thriller"], "imdb": {"id": 1022883, "rating": 4.8, "votes": 2101}, "languages": ["English"], "lastupdated": "2015-08-17 01:13:29.843000000", "plot": "When John takes his San Francisco friends to his deceased uncle's remote ranch to hunt wild pigs, it seems like a typical guys weekend with guns - despite the presence of John's sexy ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTMzOTcxOTIzN15BMl5BanBnXkFtZTcwNzE0Njg1Mw@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1217462400000, "runtime": 99, "title": "Pig Hunt", "tomatoes": {"dvd": 1285632000000, "lastUpdated": 1441133072000, "production": "Phase 4 Films", "viewer": {"meter": 24, "numReviews": 559, "rating": 2.5}, "website": "http://www.pighuntmovie.com"}, "type": "movie", "writers": ["Robert Mailer Anderson", "Zack Anderson"], "year": 2008}