{"_id": "573a13a8f29313caabd1c8bb", "awards": {"nominations": 2, "text": "7 wins & 2 nominations.", "wins": 7}, "cast": ["Supakorn Kitsuwon", "Siriyakorn Pukkavesh", "Black Phomtong", "Somlek Sakdikul"], "countries": ["Thailand"], "directors": ["Pen-Ek Ratanaruang"], "fullplot": "Phaen is a suburban young man with a great love for music. He never misses a chance to show off his voice at temple fairs in his village. It is at one of the fairs that he meets and falls in love with Sadao. On their wedding day, Phaen gives Sadao a transistor radio that the new family loves, and it also gives Phaen many a daydream of becoming a famous singer himself. Soon, Sadao is pregnant and it is hard for Phaen to leave home, but he has to enter military service. While there, he enters a singing contest, and winds up first runner-up. So he decides to leave the service and heads for Bangkok to follow his dream. He spends two years in a band that never goes anywhere, and eventually is forced to work in a sugarcane plantation. But a fight causes him to lose his job. As things go from bad to worse, he recalls his transistor radio with fondness, for it evokes in his mind much better and more peaceful times, when dreams were still possible.", "genres": ["Comedy", "Drama", "Musical"], "imdb": {"id": 306359, "rating": 7.3, "votes": 668}, "languages": ["Thai"], "lastupdated": "2015-07-07 02:56:04.970000000", "num_mflix_comments": 2, "plot": "Phaen is a suburban young man with a great love for music. He never misses a chance to show off his voice at temple fairs in his village. It is at one of the fairs that he meets and falls ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTQ4MjY0ODU0MF5BMl5BanBnXkFtZTgwOTc5NjEwNjE@._V1_SY1000_SX677_AL_.jpg", "released": 1038355200000, "runtime": 90, "title": "Transistor Love Story", "tomatoes": {"lastUpdated": 1439403707000, "viewer": {"meter": 89, "numReviews": 423, "rating": 4}}, "type": "movie", "writers": ["Pen-Ek Ratanaruang (screenplay)", "Wat Wanlayangkoon (novel)"], "year": 2001}