{"_id": "573a13e7f29313caabdc8c6e", "awards": {"nominations": 15, "text": "Nominated for 1 Golden Globe. Another 8 wins & 15 nominations.", "wins": 9}, "cast": ["Ben Schnetzer", "Abram Rooney", "Jim McManus", "George MacKay"], "countries": ["UK", "France"], "directors": ["Matthew Warchus"], "fullplot": "In 1984 20 year old closet gay Joe hesitantly arrives in London from Bromley for his first Gay Pride march and is taken under the collective wing of a group of gay men and Lesbian Steph, who meet at flamboyant Jonathan and his Welsh partner Gethin's Soho bookshop. Not only are gays being threatened by Thatcher but the miners are on strike in response to her pit closures and Northern Irish activist Mark Ashton believes gays and miners should show solidarity. Almost by accident a mini-bus full of gays find themselves in the Welsh village of Onllwyn in the Dulais valley and through their sincere fund raising and Jonathan's nifty disco moves persuade most of the community that they are on the same side. When a bigot tries to sabotage the partnership with a tabloid smear Mark turns it back on her with a hugely successful benefit concert to which most of the villagers, now thoroughly in tune with their gay friends, turn up. The miners are defeated and return to work but at the Pride march the following year a vast contingent of miners show up to repay their comrades with their show of support.", "genres": ["Biography", "Comedy", "Drama"], "imdb": {"id": 3169706, "rating": 7.8, "votes": 26145}, "languages": ["English", "Welsh"], "lastupdated": "2015-08-17 00:01:53.937000000", "metacritic": 79, "num_mflix_comments": 2, "plot": "U.K. gay activists work to help miners during their lengthy strike of the National Union of Mineworkers in the summer of 1984.", "poster": "https://m.media-amazon.com/images/M/MV5BMTU2OTcyOTE3MF5BMl5BanBnXkFtZTgwNTg5Mjc1MjE@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1410480000000, "runtime": 119, "title": "Pride", "type": "movie", "writers": ["Stephen Beresford"], "year": 2014}