{"_id": "573a13d9f29313caabda99b4", "awards": {"nominations": 0, "text": "2 wins.", "wins": 2}, "cast": ["Orlando Bloom", "Forest Whitaker", "Conrad Kemp", "Inge Beckmann"], "countries": ["France", "South Africa"], "directors": ["Jèrème Salle"], "fullplot": "As a child, Ali Neuman narrowly escaped being murdered by Inkhata, a militant political party at war with Nelson Mandela's African National Congress. Only he and his mother survived the carnage of those years. But as with many survivors, the psychological scars remain. Today, Ali is chief of the homicide branch of the South African police in Cape Town. One of his staff is Brian Epkeen, a free-wheeling white officer whose family was originally involved in the establishment of apartheid but who works well with Neuman. Together they have to deal with crime that inevitably exists in sprawling areas of un- and under- employed people, crime exacerbated by gangs, both local and from other parts of Africa. Their job gets even more difficult when the corpses of two young women are found. A new evil has been introduced in the city and a new drug has been introduced to its residents, including both murder victims. At the chaotic crossroads where brutality and modernization collide, the echoes of apartheid still resound in the shadows of a society struggling toward reconciliation.", "genres": ["Crime", "Drama", "Thriller"], "imdb": {"id": 2249221, "rating": 6.7, "votes": 10238}, "languages": ["English", "Afrikaans"], "lastupdated": "2015-09-16 10:54:04.040000000", "num_mflix_comments": 3, "plot": "Policemen Ali Sokhela and Brian Epkeen investigate the brutal murder of a young white woman, apparently provoked by the availability of a new illegal drug and somehow connected to the disappearance of black street children.", "poster": "https://m.media-amazon.com/images/M/MV5BMjA0NjE1OTI0M15BMl5BanBnXkFtZTgwMDkyNTM3MDE@._V1_SY1000_SX677_AL_.jpg", "released": 1386115200000, "runtime": 110, "title": "Zulu", "tomatoes": {"lastUpdated": 1442422939000, "viewer": {"numReviews": 539, "rating": 3.4}}, "type": "movie", "writers": ["Caryl Ferey (book)", "Julien Rappeneau", "Jèrème Salle"], "year": 2013}