{"_id": "573a13b5f29313caabd43452", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Steven Kaplan", "William H. Macy", "Cheryl Hines", "Alia Shawkat"], "countries": ["USA"], "directors": ["Brian Hecker"], "fullplot": "Danny Stein is a high-school senior and class vice president; he's in charge of the prom, along with Camille, his best friend for years. Everyone including Camille and her parents assumes that Danny will ask her to the prom, but he wants something less platonic and more romantic - more memorable. His choices include the sophomore cheerleader he drives to school, a friend of a friend, and a quiet Chinese girl in his classes. With his parents' help (they're going through a divorce), he gets the tickets, rents a tux, reserves a limo, and, over his mother's objections, gets a room at the prom-site hotel. This, everyone believes, is the way to establish memories. Will anything work out?", "genres": ["Comedy"], "imdb": {"id": 472050, "rating": 5.7, "votes": 3760}, "languages": ["English"], "lastupdated": "2015-08-24 00:10:16.447000000", "metacritic": 57, "num_mflix_comments": 2, "plot": "While Danny's father and mother independently search for love, Danny is on his own desperate quest to find a prom date. Danny's search becomes progressively more pathetic once he and his family learn that Bart, the school's biggest dweeb, not only secured a date for the prom, but got a hotel room as well.", "poster": "https://m.media-amazon.com/images/M/MV5BMTg3MDA1NDEwMV5BMl5BanBnXkFtZTcwOTU4MzIzMg@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1209081600000, "runtime": 80, "title": "Bart Got a Room", "tomatoes": {"consensus": "Just enough sweetness and good performances lighten up the high school-set tensions, creating a family-appropriate teen comedy.", "critic": {"meter": 70, "numReviews": 37, "rating": 6.3}, "dvd": 1248739200000, "fresh": 26, "lastUpdated": 1440613731000, "production": "Anchor Bay Entertainment", "rotten": 11, "viewer": {"meter": 56, "numReviews": 2328, "rating": 3.3}}, "type": "movie", "writers": ["Brian Hecker"], "year": 2008}