{"_id": "573a13c2f29313caabd666d2", "awards": {"nominations": 3, "text": "1 win & 3 nominations.", "wins": 1}, "cast": ["Danny McBride", "James Franco", "Rasmus Hardiker", "Natalie Portman"], "countries": ["USA"], "directors": ["David Gordon Green"], "fullplot": "Throughout history, tales of chivalry have burnished the legends of brave, handsome knights who rescue fair damsels, slay dragons and conquer evil. But behind many a hero is a good-for-nothing younger brother trying just to stay out of the way of those dragons, evil and trouble in general. As two princes on a daring mission to save their land, they must rescue the heir apparent's fiancèe before their kingdom is destroyed. Thadeous (McBride) has spent his life watching his perfect older brother Fabious (Franco) embark upon valiant journeys and win the hearts of his people. Tired of being passed over for adventure, adoration and the throne, he's settled for a life of wizard's weed, hard booze and easy maidens. But when Fabious' bride-to-be, Belladonna (Zooey Deschanel), gets kidnapped by the evil wizard Leezar (Justin Theroux), the king gives his deadbeat son an ultimatum: Man up and help rescue her or get cut off. Half-assedly embarking upon his first quest, Thadeous joins Fabious to trek across the perilous outlands and free the princess. Joined by Isabel (Natalie Portman)-an elusive warrior with a dangerous agenda of her own-the brothers must vanquish horrific creatures and traitorous knights before they can reach Belladonna. If Thadeous can find his inner hero, he can help his brother prevent the destruction of his land. Stay a slacker, and not only does he die a coward, he gets front row seats to the dawn of an all-new Dark Ages.", "genres": ["Adventure", "Comedy", "Fantasy"], "imdb": {"id": 1240982, "rating": 5.6, "votes": 81488}, "languages": ["English"], "lastupdated": "2015-09-04 00:20:00.117000000", "metacritic": 31, "plot": "When Prince Fabious's bride is kidnapped, he goes on a quest to rescue her... accompanied by his lazy useless brother Thadeous.", "poster": "https://m.media-amazon.com/images/M/MV5BMTY2MDgwODIyMV5BMl5BanBnXkFtZTcwODc1NDQ0NA@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1302220800000, "runtime": 102, "title": "Your Highness", "tomatoes": {"boxOffice": "$21.6M", "consensus": "Big budgets and costumes in service of scatalogical jokes may seem funny on paper, but in execution this is a highly monotonous romp that registers only occasional laughs.", "critic": {"meter": 27, "numReviews": 171, "rating": 4.2}, "dvd": 1312848000000, "fresh": 47, "lastUpdated": 1442258288000, "production": "Universal Pictures", "rotten": 124, "viewer": {"meter": 34, "numReviews": 53785, "rating": 2.7}, "website": "http://www.yourhighnessmovie.net/"}, "type": "movie", "writers": ["Danny McBride", "Ben Best"], "year": 2011}