{"_id": "573a1395f29313caabce301e", "awards": {"nominations": 1, "text": "1 nomination.", "wins": 0}, "cast": ["Mari Tèrècsik", "Jèzsef Madaras", "Zoltèn Latinovits", "Andrea Drahota"], "countries": ["Hungary"], "directors": ["Miklès Jancsè"], "fullplot": "Miklès Jancsè's Silence and Cry is set during a turbulent era of disquiet, fear, persecution and terror, which permeates every corner of post-WWI Hungarian society. In 1919, after just a few months of communist rule the Hungarian Republic of Councils falls victim to a nationalist counter-revolution. Admiral Horthy, leader of the nationalist far right movement, becomes the self-proclaimed regent of Hungary, and assumes power as the legal Head of State. Soldiers of the short-lived Hungarian Red Army are now on the run from relentless secret policemen and patrol units of the nationalist Royal Gendarme. If caught, ex-Red Army soldiers are executed without mercy or proper trial. Istvèn Cserzi, a former soldier of the Red Army has fled to the Great Hungarian Plains and has taken refuge on a farm, which is run by two sympathetic women. Due to the generosity of these women and a former childhood pal, who is now a commandant of the local Royal Gendarme outfit, Istvèn is safely hidden from the ever-prying eyes of the secret policemen, who relentlessly roam the countryside searching for ex-Red Army men and their sympathisers. However, upon discovering that the women are secretly poisoning the mother-in-law and the husband, the legal owners of the farm, Istvèn must make the most difficult decision of his life. As a personal war is waging within his own consciousness over morality and self-preservation, Istvèn must decide whether to remain silent about the women's devious secret and preserve his own life, or to report their heinous crime to the Royal Gendarme, which would also mean certain death for him.", "imdb": {"id": 61536, "rating": 7.2, "votes": 311}, "languages": ["Hungarian"], "lastupdated": "2014-10-15 00:09:59.840000000", "num_mflix_comments": 2, "plot": "Miklès Jancsè's Silence and Cry is set during a turbulent era of disquiet, fear, persecution and terror, which permeates every corner of post-WWI Hungarian society. In 1919, after just a ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTE5Mzg0YjYtNjA4OC00NDI1LThkMTAtYTRiZjdhYTY1NzRhXkEyXkFqcGdeQXVyMzIwNDY4NDI@._V1_SY1000_SX677_AL_.jpg", "runtime": 73, "title": "Silence and Cry", "tomatoes": {"lastUpdated": 1441996809000, "viewer": {"numReviews": 52, "rating": 3.8}}, "type": "movie", "writers": ["Gyula Hernèdi", "Miklès Jancsè"], "year": 1968}