{"_id": "573a13a4f29313caabd0f8d1", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Bruce Willis", "Colin Farrell", "Terrence Howard", "Cole Hauser"], "countries": ["USA"], "directors": ["Gregory Hoblit"], "fullplot": "Fourth-generation Army Col. William McNamara is imprisoned in a brutal German POW camp. Still, as the senior-ranking American officer, he commands his fellow inmates, keeping a sense of honor alive in a place where honor is easy to destroy, all under the dangerous eye of the Luftwafe vetran Col. Wilhelm Visser. Never giving up the fight to win the war, McNamara is silently planning, waiting for his moment to strike back at the enemy. A murder in the camp gives him the chance to set a risky plan in motion. With a court martial to keep Visser and the Germans distracted, McNamara orchestrates a cunning scheme to escape and destroy a nearby munitions plant, enlisting the unwitting help of young Lt. Tommy Hart. Together with his men, McNamara uses a hero's resolve to carry out his mission, ultimately forced to weigh the value of his life against the good of his country.", "genres": ["Drama", "War"], "imdb": {"id": 251114, "rating": 6.3, "votes": 41398}, "languages": ["English", "German"], "lastupdated": "2015-09-10 17:40:24.403000000", "metacritic": 49, "num_mflix_comments": 3, "plot": "A law student becomes a lieutenant during World War II, is captured and asked to defend a black prisoner of war falsely accused of murder.", "poster": "https://m.media-amazon.com/images/M/MV5BMTYzMDg5ODQ1OF5BMl5BanBnXkFtZTYwMjc2Nzc5._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1013731200000, "runtime": 125, "title": "Hart's War", "tomatoes": {"boxOffice": "$19.0M", "consensus": "Well-made and solidly acted, Hart's War is modestly compelling. However, the movie suffers from having too many subplots.", "critic": {"meter": 60, "numReviews": 121, "rating": 6}, "dvd": 1026172800000, "fresh": 72, "lastUpdated": 1442433830000, "production": "MGM/UA", "rotten": 49, "viewer": {"meter": 48, "numReviews": 43683, "rating": 3}, "website": "http://www.mgm.com/hartswar"}, "type": "movie", "writers": ["John Katzenbach (novel)", "Billy Ray (screenplay)", "Terry George (screenplay)"], "year": 2002}