{"_id": "573a13a5f29313caabd137a5", "awards": {"nominations": 4, "text": "Won 1 Primetime Emmy. Another 5 wins & 4 nominations.", "wins": 6}, "cast": ["Stockard Channing", "Shane Meier", "Wendy Crewson", "Kristen Thomson"], "countries": ["Canada", "USA"], "directors": ["Roger Spottiswoode"], "fullplot": "In 1998, a young gay man by the name of Matthew Shepard was robbed, viciously beaten and left tied to a fence to die. Although he was soon found by the police and hospitalized, he soon expired. This film recounts the events after the conviction of the two men responsible for this hate motivated murder. Matthew's parents, though satisfied by the conviction, are finding the sentencing phase of the trial more difficult. The parents initially want to request the death penalty for their son's murderers, but the mother, Judy, starts to reconsider. As they struggle with their decision, they decide to reexamine the life of their son and rediscover his personality, his struggle to accept his homosexual sexual orientation as a natural part of his being and above all, his generous humanity to others. All of this leads the parents to appeal to the court the way their son would have wanted, not out of vengeance but to represent best of what their son was and the tragedy of his loss.", "genres": ["Drama"], "imdb": {"id": 267736, "rating": 7.6, "votes": 1041}, "languages": ["English"], "lastupdated": "2015-05-23 00:06:14.487000000", "num_mflix_comments": 2, "plot": "Based on the true story of openly gay college student Matthew Shepard, killed in an act of senseless violence and cruelty, that attracted national attention.", "poster": "https://m.media-amazon.com/images/M/MV5BMjM0MjkzMzgyNV5BMl5BanBnXkFtZTgwNjk4NTMwNTE@._V1_SY1000_SX677_AL_.jpg", "rated": "TV-14", "released": 1149379200000, "runtime": 88, "title": "The Matthew Shepard Story", "tomatoes": {"dvd": 1275350400000, "lastUpdated": 1439145802000, "production": "Echo Bridge Entertainment", "viewer": {"meter": 78, "numReviews": 953, "rating": 3.9}}, "type": "movie", "writers": ["John Wierick", "Jacob Krueger"], "year": 2002}