{"_id": "573a13d1f29313caabd8f90c", "awards": {"nominations": 17, "text": "4 wins & 17 nominations.", "wins": 4}, "cast": ["Ryan Gosling", "Craig Van Hook", "Eva Mendes", "Olga Merediz"], "countries": ["USA"], "directors": ["Derek Cianfrance"], "fullplot": "A mysterious and mythical motorcycle racer, Luke, (Ryan Gosling) drives out of a traveling carnival globe of death and whizzes through the backstreets of Schenectady, New York, desperately trying to connect with a former lover, Romina, (Eva Mendes) who recently and secretly gave birth to the stunt rider's son. In an attempt to provide for his new family, Luke quits the carnival life and commits a series of bank robberies aided by his superior riding ability. The stakes rise as Luke is put on a collision course with an ambitious police officer, Avery Cross, (Bradley Cooper) looking to quickly move up the ranks in a police department riddled with corruption. The sweeping drama unfolds over fifteen years as the sins of the past haunt the present days lives of two high school boys wrestling with the legacy they've inherited. The only refuge is found in the place beyond the pines.", "genres": ["Crime", "Drama", "Thriller"], "imdb": {"id": 1817273, "rating": 7.3, "votes": 170989}, "languages": ["English", "Spanish"], "lastupdated": "2015-09-07 00:29:17.697000000", "metacritic": 68, "plot": "A motorcycle stunt rider turns to robbing banks as a way to provide for his lover and their newborn child, a decision that puts him on a collision course with an ambitious rookie cop navigating a department ruled by a corrupt detective.", "poster": "https://m.media-amazon.com/images/M/MV5BMjc1OTEwNjU4N15BMl5BanBnXkFtZTcwNzUzNDIwOQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1366329600000, "runtime": 140, "title": "The Place Beyond the Pines", "tomatoes": {"boxOffice": "$21.4M", "consensus": "Ambitious to a fault, The Place Beyond the Pines finds writer/director Derek Cianfrance reaching for -- and often grasping -- thorny themes of family, fatherhood, and fate.", "critic": {"meter": 80, "numReviews": 197, "rating": 7.3}, "dvd": 1374537600000, "fresh": 157, "lastUpdated": 1442163622000, "production": "Focus Features", "rotten": 40, "viewer": {"meter": 75, "numReviews": 70957, "rating": 3.8}, "website": "http://focusfeatures.com/the_place_beyond_the_pines"}, "type": "movie", "writers": ["Derek Cianfrance (story)", "Ben Coccio (story)", "Derek Cianfrance (screenplay)", "Ben Coccio (screenplay)", "Darius Marder (screenplay)"], "year": 2012}