{"_id": "573a1398f29313caabce8e2d", "awards": {"nominations": 1, "text": "1 win & 1 nomination.", "wins": 1}, "cast": ["Vic Moeremans", "Rene Van Sambeek", "Marc Peeters", "Dirk Celis"], "countries": ["Belgium"], "directors": ["Jan Gruyaert"], "fullplot": "In a part of Flanders where flax is the main crop, farmer Vermeulen rules his estate like an 'old school' patriarch, stern and authoritarian, nobody else's word is ever taken seriously, just scolded fools, he rather risks being wrong then considering any advice. His marriage is based on a grim understanding: the wife Barbele accepts his heartless manner with everyone, even their studious, smart, healthy, studly son and heir Louis, but his two silly sisters are spoiled with a pointless fancy nunnery boarding school education fit for the upper classes. Farm-life is hard enough, laboring without machines or reliable weather, but this year the stubborn master made it even worse by picking the riskier, badly drained field and sowing later then his neighbors, even when luck turns he'll fetch a lower price for it. Poor practically perfect Louis is granted neither praise, respect nor any pleasure, however hard and well he slaves, obedient like the hired farmhands although well-read. Even being seen innocently frolicking with the milkmaid Honorine 'Schellebelle' earns him not just another public scolding -everbody is used to those all the time-, father, who has an absurd paranoia ma secretly plots with Louis to 'push him aside', decides it's time to marry the 'boy' off, telling ma to find him a 'suitable' bride without even telling their son, and scrapes together their life savings to buy a retiring neighbor's estate for the still non-existing couple. While pa is off to the auction, Louis takes it on himself to order finishing the urgent harvesting, but when the old tyrant sees this unauthorized initiative, already celebrating in the customary way, his abominably unforgiving arrogance drives him to commit an utterly unforgivable crime...", "genres": ["Drama"], "imdb": {"id": 86553, "rating": 6.3, "votes": 136}, "languages": ["Dutch"], "lastupdated": "2015-08-19 00:29:06.983000000", "num_mflix_comments": 2, "plot": "In a part of Flanders where flax is the main crop, farmer Vermeulen rules his estate like an 'old school' patriarch, stern and authoritarian, nobody else's word is ever taken seriously, ...", "poster": "https://m.media-amazon.com/images/M/MV5BOTI0Njc1NDc1NF5BMl5BanBnXkFtZTcwODIyNDMzMQ@@._V1_SY1000_SX677_AL_.jpg", "released": 493430400000, "runtime": 90, "title": "De vlaschaard", "type": "movie", "writers": ["Jan Gruyaert", "Stijn Streuvels (novel)"], "year": 1985}