{"_id": "573a13aef29313caabd2c372", "awards": {"nominations": 21, "text": "Nominated for 2 Oscars. Another 12 wins & 21 nominations.", "wins": 14}, "cast": ["Gèrard Jugnot", "Franèois Berlèand", "Kad Merad", "Jean-Paul Bonnaire"], "countries": ["France", "Switzerland", "Germany"], "directors": ["Christophe Barratier"], "fullplot": "Fond de l'Etang is a boarding school for troubled boys located in the French countryside. In the mid-twentieth century, it is run by the principal M. Rachin, an egotistical disciplinarian whose official unofficial mantra for the school is \"action - reaction\", meaning that there will be severe consequences for any boy out of line. This approach does not seem to be working as the boys as a collective are an unruly bunch. In turn, the teachers don't teach, but are always watching out for the next subversive act from the boys. January 15, 1949 marks the arrival to the school of the new supervisor, M. Clèment Mathieu, a middle-aged man who is grasping at finding his place in life after a series of failed endeavors. Although he does find the boys an unruly lot, Mathieu does not believe in the \"action - reaction\" policy, and as such, butts heads with Rachin while secretly undermining the policy. Slowly, Mathieu's approach of trying to match the discipline to the crime does have a positive effect on a handful of students. With the reluctant approval of Rachin, Mathieu begins a grander experiment of trying to transform the overall atmosphere within the school, core within the experiment being to start a choir among his students. This move is a difficult one for him as a failed musician, as well as for the initially reluctant students. During this process, Mathieu focuses on two different students for two different reasons. Pèpinot, a younger boy, seems to lack guidance and focus, and who always says he is waiting for Saturday when his father will pick him up, he who never does. And Pierre Morhange, an older student, is the anachronism: introverted, but prone to outbursts of individual subversiveness - the devil with the face of an angel as the other teachers describe him. Behind the reason for his subversiveness, which Mathieu slowly learns, Morhange hides a love of music and a true talent in it. Beyond overcoming the obvious obstacles of Rachin and the students' skepticism and Rachin's egotism, Mathieu has another challenge in newly arrived Pascal Mondain, a truly troubled older boy with pathological tendencies whose presence alone may wreak havoc throughout the school, and not just with Mathieu's project. Over fifty years later, Morhange and Pèpinot, who have not seen each other since that time and who did not spend that much time together while at school, are reading through Mathieu's memoirs from his time at the school, which unmasks the reason why the two are privy to the memoir and the effect he had on their lives.", "genres": ["Drama", "Music"], "imdb": {"id": 372824, "rating": 7.9, "votes": 40678}, "languages": ["French"], "lastupdated": "2015-09-11 00:31:05.283000000", "metacritic": 56, "num_mflix_comments": 2, "plot": "The new teacher at a severely administered boys' boarding school works to positively affect the students' lives through music.", "poster": "https://m.media-amazon.com/images/M/MV5BMTg3OTQwOTk3OF5BMl5BanBnXkFtZTYwMzA3OTg2._V1_SY1000_SX677_AL_.jpg", "rated": "PG-13", "released": 1079481600000, "runtime": 97, "title": "The Chorus", "type": "movie", "writers": ["Georges Chaperot", "Renè Wheeler", "Renè Wheeler", "Noèl-Noèl", "Christophe Barratier (screen story)", "Christophe Barratier (screenplay)", "Philippe Lopes-Curval (screenplay)"], "year": 2004}