{"_id": "573a13b9f29313caabd4df8f", "awards": {"nominations": 2, "text": "1 win & 2 nominations.", "wins": 1}, "cast": ["Ido Port", "Alfred Molina", "Gilya Stern", "Rami Heuberger"], "countries": ["Israel", "USA"], "directors": ["Lynn Roth"], "fullplot": "Based on the novel \"Panther in the Basement\" by the world-renowned author, Amos Oz, the movie takes place in Palestine in 1947, just a few months before Israel becomes a state. Proffy Liebowitz, a militant yet sensitive eleven year old wants nothing more than for the occupying British to get the hell out of his land. Proffy and his two friends spend most of their time plotting ways to terrorize and/or blow up the British until one evening, while he's out after curfew, Proffy is seized by Sergeant Dunlop, a British officer. Instead of arresting him, he deposits him back home,but what ensues in the weeks to come is a friendship between these two foes. Proffy looks to Dunlop as a father figure as his own father is cold and remote. Dunlop, lonely and poetic, loves the spirited boy and they find lots to talk about in their meetings which Proffy must keep a secret from his friends and family. When Proffy's friends follow him one day and see that he has been visiting the detested enemy, they report him to the town officials and Proffy is brought to \"trial\" for being a traitor. He is eventually found innocent but these experiences shape him for life;especially the shock that he could have such genuine affection for the enemy.", "genres": ["Drama"], "imdb": {"id": 818170, "rating": 7, "votes": 644}, "languages": ["Hebrew", "English"], "lastupdated": "2015-08-22 00:48:41.530000000", "metacritic": 47, "plot": "Based on the novel \"Panther in the Basement\" by the world-renowned author, Amos Oz, the movie takes place in Palestine in 1947, just a few months before Israel becomes a state. Proffy ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTkyMTkwMTAwOV5BMl5BanBnXkFtZTcwODM0Nzc4Mg@@._V1_SY1000_SX677_AL_.jpg", "released": 1238630400000, "runtime": 88, "title": "The Little Traitor", "tomatoes": {"boxOffice": "$0.4M", "critic": {"meter": 39, "numReviews": 23, "rating": 5.2}, "fresh": 9, "lastUpdated": 1441134607000, "production": "Westchester Films", "rotten": 14, "viewer": {"meter": 71, "numReviews": 1593, "rating": 3.6}, "website": "http://www.thelittletraitormovie.com/"}, "type": "movie", "writers": ["Lynn Roth (screenplay)", "Amos Oz (novel)"], "year": 2007}