{"_id": "573a1394f29313caabcdec01", "awards": {"nominations": 0, "text": "Nominated for 2 BAFTA Film Awards. Another 4 wins.", "wins": 6}, "cast": ["Emma Gramatica", "Francesco Golisano", "Paolo Stoppa", "Guglielmo Barnabè"], "countries": ["Italy"], "directors": ["Vittorio De Sica"], "fullplot": "An old woman finds a baby among the cauliflowers in her garden. She takes care of the orphan, and calls him Totè. When she dies, he is sent to an orphanage, which he leaves as a teenager. When Totè goes out in the world, he expects everyone to be open-hearted as himself, but it isn't so. Without belongings and a place to live, he soon turns up among other homeless people, living scattered in boxes and cement pipes on a vast, barren field outside Milano. With his energy and enthusiasm Totè quickly engages the outcasts in transforming the place into a small shanty town. The eccentric misfits are turned into a warm-hearted community. But among them is an egoist, a traitor. When squirts of oil suddenly springs up from the ground, he sneaks away and informs the wealthy Mr. Mobbi about it, who buys the land and tries to get rid of the outcasts. At this crucial moment, the spirit of Totè's dead mother appears, and gives him a magic dove. With its magic power he fulfills all wishes of the poor, and holds off the evil forces of Mr. Mobbi through amazing tricks. But two other spirits from heaven try to get hold of the dove, causing problems for Totè and his friends.", "genres": ["Comedy", "Drama", "Fantasy"], "imdb": {"id": 43809, "rating": 7.8, "votes": 3778}, "languages": ["Italian", "English"], "lastupdated": "2015-09-05 00:33:18.630000000", "num_mflix_comments": 2, "plot": "An old woman finds a baby among the cauliflowers in her garden. She takes care of the orphan, and calls him Totè. When she dies, he is sent to an orphanage, which he leaves as a teenager. ...", "poster": "https://m.media-amazon.com/images/M/MV5BNjQxYjIwZmEtMTMzZi00MDlhLWEzODItZWVjZTc3YzMyNmFhXkEyXkFqcGdeQXVyNDE5MTU2MDE@._V1_SY1000_SX677_AL_.jpg", "released": -569376000000, "runtime": 100, "title": "Miracle in Milan", "tomatoes": {"critic": {"meter": 100, "numReviews": 5, "rating": 8.2}, "dvd": 657936000000, "fresh": 5, "lastUpdated": 1438282418000, "rotten": 0, "viewer": {"meter": 90, "numReviews": 1076, "rating": 4.1}}, "type": "movie", "writers": ["Cesare Zavattini (novel)", "Cesare Zavattini (screenplay)", "Vittorio De Sica (screenplay)", "Suso Cecchi D'Amico (screenplay)", "Mario Chiari (screenplay)", "Adolfo Franci (screenplay)"], "year": 1951}