{"_id": "573a13b9f29313caabd4e183", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["The Dalai Lama", "Tenzin Bagdro", "Bob Dole", "Richard Gere"], "countries": ["USA"], "directors": ["Rick Ray"], "fullplot": "How do you reconcile a commitment to non-violence when faced with violence? Why do the poor often seem happier than the rich? Must a society lose its traditions in order to move into the future? These are some of the questions posed to His Holiness the Dalai Lama by filmmaker and explorer Rick Ray. Ray examines some of the fundamental questions of our time by weaving together observations from his own journeys throughout India and the Middle East, and the wisdom of an extraordinary spiritual leader. This is his story, as told and filmed by Rick Ray during a private visit to his monastery in Dharamsala, India over the course of several months. Also included is rare historical footage as well as footage supplied by individuals who at great personal risk, filmed with hidden cameras within Tibet. Part biography, part philosophy, part adventure and part politics, \"10 Questions for The Dalai Lama\" conveys more than history and more than answers - it opens a window into the heart of an inspiring man. If you had only one hour, what would you ask?", "genres": ["Documentary"], "imdb": {"id": 819354, "rating": 7.5, "votes": 596}, "languages": ["English"], "lastupdated": "2015-08-19 00:20:57.423000000", "num_mflix_comments": 1, "plot": "How do you reconcile a commitment to non-violence when faced with violence? Why do the poor often seem happier than the rich? Must a society lose its traditions in order to move into the ...", "poster": "https://m.media-amazon.com/images/M/MV5BMTMwMDYyMTE1OV5BMl5BanBnXkFtZTcwMzkzMzM1MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "UNRATED", "released": 1146441600000, "runtime": 85, "title": "10 Questions for the Dalai Lama", "tomatoes": {"dvd": 1156809600000, "lastUpdated": 1421117289000, "viewer": {"meter": 57, "numReviews": 92, "rating": 3}}, "type": "movie", "writers": ["Rick Ray"], "year": 2006}