{"_id": "573a13a7f29313caabd1addf", "awards": {"nominations": 11, "text": "14 wins & 11 nominations.", "wins": 14}, "cast": ["Campbell Scott", "Jesse Eisenberg", "Isabella Rossellini", "Elizabeth Berkley"], "countries": ["USA"], "directors": ["Dylan Kidd"], "fullplot": "Set against the bright lights of Manhattan, a tale which takes a comic, urbane look at the modern male ego at war in the singles scene trenches. Roger Swanson is a hopelessly cynical advertising copywriter with a razor-sharp wit who believes he has mastered the art of manipulating women. But Roger's seemingly foolproof world of smooth talk and casual sex begins to unravel when he is paid a surprise visit by his teenager nephew, Nick. Hoping to settle, once and for all, the issue of his virginity, Nick begs Roger to school him in the art of seducing women. Welcoming the challenge, Roger guides Nick through the city's wild nightlife for an all-night crash course, only to realize that he--the adult--still has something to learn about what women, and men, really want.", "genres": ["Comedy", "Drama"], "imdb": {"id": 299117, "rating": 7, "votes": 14632}, "languages": ["English", "German"], "lastupdated": "2015-09-02 00:18:40.570000000", "metacritic": 75, "plot": "After breaking up with his lover and boss, a smooth-talking man takes his teenaged nephew out on the town in search of sex.", "poster": "https://m.media-amazon.com/images/M/MV5BNzk1MDgyODQzMl5BMl5BanBnXkFtZTYwNTI4MjE3._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1037923200000, "runtime": 106, "title": "Roger Dodger", "tomatoes": {"boxOffice": "$1.2M", "consensus": "The movie could have benefited from a more experienced director, but a great cast and script overcome any first time jitters the director may have had.", "critic": {"meter": 88, "numReviews": 122, "rating": 7.4}, "dvd": 1047945600000, "fresh": 107, "lastUpdated": 1441990963000, "production": "Artisan Entertainment", "rotten": 15, "viewer": {"meter": 76, "numReviews": 8005, "rating": 3.6}}, "type": "movie", "writers": ["Dylan Kidd"], "year": 2002}