{"_id": "573a13adf29313caabd2af91", "awards": {"nominations": 3, "text": "2 wins & 3 nominations.", "wins": 2}, "cast": ["Kamal Haasan", "Madhavan", "Kiran Rathod", "Nasser"], "countries": ["India"], "directors": ["Sundar C."], "fullplot": "Nallasivam (Kamal Haasan) and Anbarasu (Madhavan) are drawn together by the strings of fate after they come into contact at the Bhuvaneshwar airport. Anbarasu is an advertisement director, while Nallasivam is a trade unionist. Fate entwines their travel plans, and they end up travelling to Chennai together. In the course of their journey, Anbarasu, born with a golden spoon, is touched by the realities of the sufferings of a normal human being when he witnesses the dead and the injured during a train accident, and he volunteers to donate his blood, which is of a very rare group, despite his fear of blood. The flashback of Nallasivam is recounted during one of their journeys. Nallasivam is a communist trade unionist, who fights for higher wages for his comrades. By chance, he falls in love with the daughter Bala (Kiran) of a rich industrialist, Bala's father, Padaiyacchi (Nasser). Due to the opposition, they plan to elope and get married, but unfortunately, Nallasivam meets with an accident which disfigures him. He is told by Padaiyacchi that Bala is married, so he pursues his communist agenda, during the course of which he meets Anbarasu. Anbarasu is drawn to Nallasivam in the end, and claims him as his adopted brother, and requests Nallasivam to come to his wedding. At the wedding hall, Nalla discovers the bride to be is none other than his sweetheart, Bala. When Padaiyacchi discovers him at the hall, he is in a panic, and pleads for him to leave. Santhana Bharathy as Padaiyacchi's henchman plays out a sentimental scene in the end. The movie is more of a parallel cinema, with Kamal and Madhavan acting their roles to stellar efficiency. Kiran appears in a very small role, to the disappointment of many.", "genres": ["Adventure", "Comedy", "Drama"], "imdb": {"id": 367495, "rating": 8.9, "votes": 4584}, "languages": ["Tamil", "Hindi"], "lastupdated": "2015-08-01 00:27:12.657000000", "plot": "Nalla Sivam and Anbarasu meet under different circumstances and their lives are changed as they take the journey of their life.", "released": 1042502400000, "runtime": 160, "title": "Love is God", "type": "movie", "writers": ["Kamal Haasan (screenplay)", "Madan (dialogue)"], "year": 2003}