{"_id": "573a13dcf29313caabdb0f92", "awards": {"nominations": 7, "text": "5 wins & 7 nominations.", "wins": 5}, "cast": ["Xun Zhou", "Kun Chen", "Wei Zhao", "Mi Yang"], "countries": ["China"], "directors": ["Wuershan"], "fullplot": "An ancient fox spirit embarks on a diabolical quest to become human after escaping an icy prison, and becomes bound to a disfigured princess who seeks the love of a noble guard as her kingdom crumbles in this lavish supernatural epic. Confined to a frozen cell for centuries, malevolent fox spirit Xiaowei (Xun Zhou) regains her freedom and seeks to preserve her beauty by seducing men and consuming their hearts. Should a man offer her his heart willingly, Xiaowei will become mortal, breaking free of the underworld and experiencing living among the living. Meanwhile, as a dark cloud falls over her kingdom, Princess Jing (Wei Zhao) flees, hiding her deep facial scars under a mask of pure gold while seeking the love of her former protector, who remains haunted by his failure to save her years prior. When destiny brings Xiaowei and Princess Jing together, the battle for the princess' heart begins.", "genres": ["Fantasy", "Mystery", "Romance"], "imdb": {"id": 2371411, "rating": 6.3, "votes": 2185}, "languages": ["Mandarin"], "lastupdated": "2015-08-21 00:24:33.673000000", "metacritic": 57, "num_mflix_comments": 1, "plot": "An ancient fox spirit embarks on a diabolical quest to become human after escaping an icy prison, and becomes bound to a disfigured princess who seeks the love of a noble guard as her ...", "poster": "https://m.media-amazon.com/images/M/MV5BYWM4YzVmZDctNjE1Ny00ZjNhLTkxMTgtZDg5MjE5NDQyMjRjXkEyXkFqcGdeQXVyNTQyODc1OTY@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 1345161600000, "runtime": 131, "title": "Painted Skin: The Resurrection", "tomatoes": {"boxOffice": "$49.8k", "critic": {"meter": 83, "numReviews": 6, "rating": 4.4}, "dvd": 1352764800000, "fresh": 5, "lastUpdated": 1441304848000, "production": "Well Go USA", "rotten": 1, "viewer": {"meter": 58, "numReviews": 577, "rating": 3.4}, "website": "http://wellgousa.com/theatrical/painted-skin-2"}, "type": "movie", "year": 2012}