{"_id": "573a13aff29313caabd3150a", "awards": {"nominations": 2, "text": "2 wins & 2 nominations.", "wins": 2}, "cast": ["Mabel Adams", "Asckt", "Shawn Ashmore", "Caroline Aspirot"], "countries": ["Canada"], "directors": ["Thom Fitzgerald"], "fullplot": "Sister Hilde narrates three separates stories, each directly concerning the AIDS crisis. From a Montrèal based order, Sister Hilde, Sister Mary and Clara, a novice, have just arrived in Africa to work as nurses in a plantation's medical center. They learn that legend there has it that having sex with a virgin will transfer infection out from oneself. Because of this legend, an infant girl is raped. Clara, who also learns the main cause of the virus' spread within the plantation, does whatever she can to ensure that Hallyday, the plantation owner, flexes his economic power to right the wrongs on the plantation. Back in Montrèal, a porn actor named Denys has been cheating on his mandatory monthly HIV tests, using his father's blood to pass as his own. As he believes he has been exposed to the virus, the negative results will allow him to continue working. When he is caught, his mother, Olive, learns the hard way of her son's true HIV status and his occupation, and devises a strategy for his well being. Denys also learns the consequences of his actions. And in China, pregnant Jin Ping works in the black market trade of blood. She buys the blood of the majority of adults in one village, but only of those who qualify. After her visit, those who sold their blood begin to get sick. Tong Sam, a rice farmer who was ill the day of the blood sale and thus could not give, has to figure out why all those around him are getting sick and dying, including members of his own family.", "genres": ["Drama"], "imdb": {"id": 395424, "rating": 6.7, "votes": 1195}, "languages": ["Afrikaans", "Mandarin", "Xhosa", "French", "English"], "lastupdated": "2015-08-20 00:43:20.970000000", "metacritic": 48, "num_mflix_comments": 1, "plot": "A three-paneled look at the worldwide AIDS crisis: in Montreal, a porn actor (Ashmore) schemes to pass his mandatory blood test; a young nun (Sevigny) makes a personal sacrifice for the benefit of a South African village; in rural China, a black market operative (Liu) posing as a goverment-sanctioned blood drawer jeopardizes an entire village's safety.", "poster": "https://m.media-amazon.com/images/M/MV5BMjAzODAyMjc3NV5BMl5BanBnXkFtZTcwMzU0MTA0MQ@@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 1164931200000, "runtime": 127, "title": "3 Needles", "type": "movie", "writers": ["Thom Fitzgerald"], "year": 2005}