{"_id": "573a13a2f29313caabd0bb51", "awards": {"nominations": 2, "text": "6 wins & 2 nominations.", "wins": 6}, "cast": ["Xun Zhou", "Hongshen Jia", "Zhongkai Hua", "Anlian Yao"], "countries": ["Germany", "China", "France"], "directors": ["Ye Lou"], "fullplot": "The river Suzhou that flows through Shanghai is a reservoir of filth, chaos and poverty, but also a meeting place for memories and secrets. Lou Ye, who spent his youth on the banks of the Suzhou, shows the river as a Chinese Styx, in which forgotten stories and mysteries come together. Mardar, a motorcycle courier in his mid-twenties, rides all over the city with all kinds of packages for his clients. He knows every inch and is successful thanks to the fact that he never asks questions. One day he is asked by a shady alcohol smuggler to deliver his sixteen-year-old daughter, Moudan, to her aunt. Mardar and Moudan grow fond of each other. But their tender happiness is disrupted when Moudan thinks that Mardar has kidnapped her for a ransom. She is so disappointed in him that she jumps off the bridge into the Suzhou River. Mardar is now suspected of murder. When a couple of years later he comes out of jail, he meets the dancer Meimei, an alter-ego of Moudan, and becomes fascinated by her.", "genres": ["Drama", "Romance"], "imdb": {"id": 234837, "rating": 7.5, "votes": 2968}, "languages": ["Mandarin"], "lastupdated": "2015-09-02 00:26:03.133000000", "metacritic": 76, "num_mflix_comments": 1, "plot": "The river Suzhou that flows through Shanghai is a reservoir of filth, chaos and poverty, but also a meeting place for memories and secrets. Lou Ye, who spent his youth on the banks of the ...", "poster": "https://m.media-amazon.com/images/M/MV5BODg4NjQ1MzQtNDNhOS00NTNmLTg1ZGItN2EwMDA3NDljOWI5XkEyXkFqcGdeQXVyNzI1NzMxNzM@._V1_SY1000_SX677_AL_.jpg", "released": 971222400000, "runtime": 83, "title": "Suzhou River", "tomatoes": {"critic": {"meter": 90, "numReviews": 30, "rating": 7.4}, "dvd": 1003795200000, "fresh": 27, "lastUpdated": 1430507118000, "production": "Strand Releasing", "rotten": 3, "viewer": {"meter": 83, "numReviews": 2519, "rating": 3.8}}, "type": "movie", "writers": ["Ye Lou (screenplay)"], "year": 2000}