{"_id": "573a1395f29313caabce321b", "awards": {"nominations": 0, "text": "1 win.", "wins": 1}, "cast": ["Peter O'Toole", "Omar Sharif", "Tom Courtenay", "Donald Pleasence"], "countries": ["UK", "France"], "directors": ["Anatole Litvak"], "fullplot": "In 1942, in Warsaw, a Polish prostitute is murdered in a sadistic way. Major Grau, a man from German Intelligence who believes in justice, is in charge of the investigation. An eyewitness saw a German general leaving the building after a scream of the victim. A further investigation shows that three generals do not have any alibi for that night: General Tanz, Maj. Gen. Klus Kahlenberge and General von Seidlitz-Gabler. They three avoid a direct contact with Major Grau and become potential suspects. As far as Major Grau gets close to them, he is promoted and sent to Paris. In 1944, in Paris, this quartet is reunited and Major Grau continues his investigation. Meanwhile, a plan for killing Hitler is plotted by his high command; a romance between Ulrike von Seydlitz-Gabler and Lance Cpl. Kurt Hartmann is happening and Insp. Morand is helping Major Grau in his investigation. The story ends in 1965, in Hamburg, with another similar crime.", "genres": ["Crime", "Drama", "Mystery"], "imdb": {"id": 62038, "rating": 7.4, "votes": 4350}, "languages": ["English", "Italian", "Spanish", "French"], "lastupdated": "2015-08-22 00:17:45.890000000", "num_mflix_comments": 3, "plot": "In 1942, in Warsaw, a Polish prostitute is murdered in a sadistic way. Major Grau, a man from German Intelligence who believes in justice, is in charge of the investigation. An eyewitness ...", "poster": "https://m.media-amazon.com/images/M/MV5BNTA4NzI0OTQ2Ml5BMl5BanBnXkFtZTgwNDc2MjkzMTE@._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": -90028800000, "runtime": 148, "title": "The Night of the Generals", "tomatoes": {"dvd": 1177977600000, "lastUpdated": 1440183443000, "production": "Sony Pictures Entertainment", "viewer": {"meter": 71, "numReviews": 981, "rating": 3.7}}, "type": "movie", "writers": ["Joseph Kessel (adapted for the screen by)", "Paul Dehn (adapted for the screen by)", "Paul Dehn (additional dialogue)", "Hans Hellmut Kirst (novel)", "James Hadley Chase (based on an incident written by)"], "year": 1967}