{"_id": "573a13d8f29313caabda7160", "awards": {"nominations": 4, "text": "1 win & 4 nominations.", "wins": 1}, "cast": ["Fabrice Luchini", "Lambert Wilson", "Maya Sansa", "Camille Japy"], "countries": ["France"], "directors": ["Philippe Le Guay"], "fullplot": "A once great actor, Serge Tanneur (Fabrice Luchini), has retired from the limelight. Too much pressure meant that one day, he simply decided he would act no more. For the past three years, he has lived in solitude on the èle de Rè, spending his time cycling through the windswept landscape. Fellow actor Gauthier Valence (Lambert Wilson), whose career is flying high, is planning a production of Molière's play The Misanthrope and wants to offer Serge the role of Filinte. Gauthier is convinced he will accept, since Serge himself has become a misanthrope, withdrawn from society and raging against the world. It would be wonderful to see him return in that part. But Serge plays hard to get, first of all as he want to play the title role. Instead of committing, he suggests they rehearse together for the week. Things look to be going well, especially when a mysterious Italian divorcee (Maya Sansa) brings a romantic spark into his life. With the play's producer, Gauthier's agent and his lover all arriving on the island at the weekend, the pressure is on Serge to make up his mind. Is he merely toying with Gauthier, or does he really intend to take to the stage once more?", "genres": ["Comedy", "Drama"], "imdb": {"id": 2207050, "rating": 6.6, "votes": 1849}, "languages": ["French", "Italian"], "lastupdated": "2015-09-14 12:55:54.600000000", "metacritic": 61, "num_mflix_comments": 2, "plot": "Two actors. One play. Can the differences between the two egocentric men be put aside for the sake of friendship and theatre?", "poster": "https://m.media-amazon.com/images/M/MV5BMTQ2ODU3MTc2M15BMl5BanBnXkFtZTgwNzQxMzg0MTE@._V1_SY1000_SX677_AL_.jpg", "rated": "NOT RATED", "released": 1358294400000, "runtime": 104, "title": "Bicycling with Molière", "tomatoes": {"boxOffice": "$59.6k", "critic": {"meter": 75, "numReviews": 24, "rating": 6.3}, "fresh": 18, "lastUpdated": 1442346685000, "production": "Strand Releasing", "rotten": 6, "viewer": {"meter": 56, "numReviews": 342, "rating": 3.4}, "website": "http://www.strandreleasing.com/films/film_details.asp?BusinessUnitID={BFD06A96-7612-4F21-AEC0-3452C34902C4}&ProjectID={3BF90AF2-4947-E311-BBA7-D4AE527C3B65}"}, "type": "movie", "writers": ["Fabrice Luchini (from an original idea by)", "Philippe Le Guay (from an original idea by)", "Philippe Le Guay (scenario", " adaptation and dialogue)", "Emmanuel Carrère (collaboration)"], "year": 2013}