{"_id": "573a13b7f29313caabd4a7d0", "awards": {"nominations": 0, "text": "2 wins.", "wins": 2}, "cast": ["John Abraham", "Arshad Warsi", "Salman Shahid", "Hanif Hum Ghum"], "countries": ["India"], "directors": ["Kabir Khan"], "fullplot": "The attention of the world is focused, after the terrorist attacks in U.S.A. of 11Sep01, on Afghanistan - a country that has been torn by war for the last 23 years, and has had no media coverage for the last 6, mainly due to it being occupied by the Pakistan-sponsored Taliban, with Pakistani military personnel themselves involved amongst the Taliban. But when the U.S. and it's coalition forces target Osama Bin Laden, Pakistan issues an official denial that there are no more Pakistani military personnel in Afghanistan. This results in a influx of journalist and media from all around the world. Amongst this background a loyal soldier, Subedar Major Jan Mohammed of the Pakistan Border Regiment, estranged from his daughter, Zorya, who detested the Taliban, is now on his way back to the Pakistani border, and in order to do this he has taken four hostages: Jessica Beckham of Reuters; Jai Kapoor and Suhel Khan - two Indian journalists; and their Afghan guide, Khyber. Together he herds them towards the border in an all terrain vehicle labeled 'Kabul Express', but before that he must hide his identity from vigilante groups of the Northern Alliance Mujhaideen, Afghani backlash against the Taliban, as well as the Hazara militants and thieves who use donkeys as road blocks. The question remains will Pakistani officials lower their guard and welcome him back or will he be fated to live and perhaps perish in Afghanistan?", "genres": ["Action", "Comedy", "Drama"], "imdb": {"id": 770214, "rating": 6.9, "votes": 2273}, "languages": ["Hindi", "Dari", "English", "Urdu"], "lastupdated": "2015-08-29 00:28:36.327000000", "num_mflix_comments": 2, "plot": "The attention of the world is focused, after the terrorist attacks in U.S.A. of 11Sep01, on Afghanistan - a country that has been torn by war for the last 23 years, and has had no media ...", "released": 1166140800000, "runtime": 105, "title": "Kabul Express", "tomatoes": {"dvd": 1173139200000, "lastUpdated": 1440699010000, "production": "Yash Raj Films", "viewer": {"meter": 62, "numReviews": 4182, "rating": 3.5}}, "type": "movie", "writers": ["Kabir Khan", "Sandeep Srivastava (additional dialogue)"], "year": 2006}