{"_id": "573a13baf29313caabd508b0", "awards": {"nominations": 4, "text": "1 win & 4 nominations.", "wins": 1}, "cast": ["Andrè Benjamin", "Jennifer Carpenter", "Isaach De Bankolè", "Woody Harrelson"], "countries": ["Canada", "USA", "Germany"], "directors": ["Stuart Townsend"], "fullplot": "In late November 1999, masses are descending upon Seattle for the World Trade Organization (WTO) Conference, the first ever held on American soil. Beyond the several delegates, career protesters are also coming to Seattle, they who believe the non-elected organization only exists to support corporate interests at the expense of the poor, working class and the environment among other things. Before the conference, the lead known protesters vow that their demonstrations will be peaceful, while Seattle Mayor Jim Tobin promises that if that be the case that no arrests will be made and no aggressive action, such as the use of tear gas, will be issued. On day one of the conference, tensions on both sides escalate the confrontation between police and protesters, with many innocent people caught in the crossfire. As such, what was promised ends up not happening during the remainder of the conference, where many on both sides work not for the greater good of their side, but rather for their own personal interests because of their experience on day one. These battles outside the official conference are not the only ones happening in Seattle, as many of the conference delegates, such as Doctors Without Borders and those from some of the poorer nations, try to get across the point of many of the protesters - albeit in a more diplomatic method - while seemingly ignored by those in the upper echelon of the organization.", "genres": ["Action", "Drama"], "imdb": {"id": 850253, "rating": 6.7, "votes": 12314}, "languages": ["English"], "lastupdated": "2015-08-22 00:31:40.500000000", "metacritic": 54, "num_mflix_comments": 1, "plot": "Activists arrive in Seattle, Washington en masse to protest a meeting of the World Trade Organization. Riots and chaos ensue as demonstrators successfully stop the WTO meetings.", "poster": "https://m.media-amazon.com/images/M/MV5BMjIxMzE1NzcxM15BMl5BanBnXkFtZTgwMDcyNDM2MTI@._V1_SY1000_SX677_AL_.jpg", "rated": "R", "released": 1210118400000, "runtime": 98, "title": "Battle in Seattle", "tomatoes": {"consensus": "Well intentioned and passionate, this docu-drama about the 1999 WTO protests is heavier on politics than character development.", "critic": {"meter": 54, "numReviews": 61, "rating": 5.7}, "dvd": 1236643200000, "fresh": 33, "lastUpdated": 1440960240000, "production": "Redwood Palms Pictures", "rotten": 28, "viewer": {"meter": 65, "numReviews": 9641, "rating": 3.5}, "website": "http://www.battleinseattlemovie.com/"}, "type": "movie", "writers": ["Stuart Townsend"], "year": 2007}