{"_id": "573a13c5f29313caabd6f44e", "awards": {"nominations": 12, "text": "Nominated for 1 Oscar. Another 17 wins & 12 nominations.", "wins": 18}, "cast": ["Christos Stergioglou", "Michele Valley", "Angeliki Papoulia", "Hristos Passalis"], "countries": ["Greece"], "directors": ["Yorgos Lanthimos"], "fullplot": "Three teenagers are confined to an isolated country estate that could very well be on another planet. The trio spend their days listening to endless homemade tapes that teach them a whole new vocabulary. Any word that comes from beyond their family abode is instantly assigned a new meaning. Hence 'the sea' refers to a large armchair and 'zombies' are little yellow flowers. Having invented a brother whom they claim to have ostracized for his disobedience, the èber-controlling parents terrorize their offspring into submission. The father is the only family member who can leave the manicured lawns of their self-inflicted exile, earning their keep by managing a nearby factory, while the only outsider allowed on the premises is his colleague Christina, who is paid to relieve the son of his male urges. Tired of these dutiful acts of carnality, Christina disturbs the domestic balance.", "genres": ["Drama"], "imdb": {"id": 1379182, "rating": 7.2, "votes": 36148}, "languages": ["Greek"], "lastupdated": "2015-09-16 00:43:52.340000000", "metacritic": 73, "num_mflix_comments": 2, "plot": "Three teenagers live isolated, without leaving their house, because their over-protective parents say they can only leave when their dogtooth falls out.", "poster": "https://m.media-amazon.com/images/M/MV5BMjIyOTkyMDE5N15BMl5BanBnXkFtZTcwNjIwNzQwMw@@._V1_SY1000_SX677_AL_.jpg", "rated": "UNRATED", "released": 1257897600000, "runtime": 94, "title": "Dogtooth", "tomatoes": {"boxOffice": "$0.1M", "consensus": "It'll be too disturbing -- and meandering -- for some, but Dogtooth is as disturbing and startlingly original as modern filmmaking gets.", "critic": {"meter": 92, "numReviews": 62, "rating": 7.7}, "dvd": 1295913600000, "fresh": 57, "lastUpdated": 1441993460000, "production": "Kino International", "rotten": 5, "viewer": {"meter": 75, "numReviews": 8707, "rating": 3.7}, "website": "http://www.dogtooth.gr/"}, "type": "movie", "writers": ["Efthymis Filippou", "Yorgos Lanthimos"], "year": 2009}