{"_id": "573a13a8f29313caabd1ca7c", "awards": {"nominations": 3, "text": "2 wins & 3 nominations.", "wins": 2}, "cast": ["Hilary Duff", "Adam Lamberg", "Hallie Todd", "Robert Carradine"], "countries": ["USA"], "directors": ["Jim Fall"], "fullplot": "Teen queen Lizzie McGuire grows up a bit and hits the big screen in this comedy drama, based on the popular Disney Network series. Lizzie McGuire and her best friends Kate, Gordo, and Ethan have just graduated from middle school, and to celebrate, they're taking part in a class trip to Rome, Italy. Eager to celebrate their new maturity as high school students, Lizzie and her pals hope to live it up in one of Europe's most fabled cities, but fate has something more spectacular in store for Lizzie. Lizzie discovers that she bears a striking resemblance to Isabella, an Italian teen-pop idol famous for her duets with heart-throb Paolo -- so much so that when Paolo and Isabella have a falling out, he asks Lizzie to take Isabella's place for an upcoming concert. Lizzie, however, isn't sure she feels comfortable stepping into the spotlight, and is even less sure about the way she feels about Paolo, who makes no secret of his infatuation with her. Things don't get any simpler for Lizzie when her family gets wind of her newfound fame, and catch the next flight to Italy.", "genres": ["Adventure", "Comedy", "Family"], "imdb": {"id": 306841, "rating": 5.3, "votes": 24953}, "languages": ["English", "Italian"], "lastupdated": "2015-09-13 00:00:30.247000000", "metacritic": 56, "num_mflix_comments": 1, "plot": "Lizzie McGuire has graduated from middle school and takes a trip to Rome, Italy with her class. And what was supposed to be only a normal trip, becomes a teenager's dream come true.", "poster": "https://m.media-amazon.com/images/M/MV5BMTMzNDg1NDc0NF5BMl5BanBnXkFtZTYwOTY2OTU3._V1_SY1000_SX677_AL_.jpg", "rated": "PG", "released": 1051833600000, "runtime": 94, "title": "The Lizzie McGuire Movie", "tomatoes": {"boxOffice": "$42.7M", "consensus": "Harmless piece of fluff that ought to satisfy fans of the TV show.", "critic": {"meter": 40, "numReviews": 97, "rating": 5.4}, "dvd": 1060646400000, "fresh": 39, "lastUpdated": 1440009672000, "production": "Walt Disney Pictures", "rotten": 58, "viewer": {"meter": 48, "numReviews": 393003, "rating": 2.7}, "website": "http://disney.go.com/disneypictures/lizzie/index.html?CMP=IL16072"}, "type": "movie", "writers": ["Susan Estelle Jansen", "Ed Decter", "John J. Strauss", "Terri Minsky (characters)"], "year": 2003}